[
    {
        "title": "PM Modi congratulates Tarique Rahman on BNP’s decisive win in Bangladesh elections",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nPublished - February 13, 2026 09:18 am IST\nFile photo of Prime Minister Narendra Modi.\n                                          | Photo Credit: PTI\nPrime Minister Narendra Modi on Friday (February 13, 2026) congratulated Bangladesh National Party (BNP) chairperson Tarique Rahman on leading the party to a decisive victory in the Parliamentary elections Bangladesh.\nIn a X post, Mr. Modi said “I convey my warm congratulations to Mr. Tarique Rahman on leading BNP to a decisive victory in the Parliamentary elections in Bangladesh.”\nBangladesh election results LIVE\nI convey my warm congratulations to Mr. Tarique Rahman on leading BNP to a decisive victory in the Parliamentary elections in Bangladesh. This victory shows the trust of the people of Bangladesh in your leadership.India will continue to stand in support of a democratic,…\nMr. Modi added “This victory shows the trust of the people of Bangladesh in your leadership.”\nThe Prime Minister reiterated “India will continue to stand in support of a democratic, progressive and inclusive Bangladesh. I look forward to working with you to strengthen our multifaceted relations and advance our common development goals.”\nEarlier, the Bangladesh Nationalist Party (BNP) led by Tarique Rahman claimed election victory, a top party official told AFP, after the first polls since a deadly 2024 uprising.\nPublished - February 13, 2026 09:18 am IST\nIndia-Bangladesh\n                    \n                            /                      \n                        \n                        national elections\n                    \n                            /                      \n                        \n                        Narendra Modi\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/bangladesh-elections-pm-modi-congratulates-bnp-tarique-rahman/article70626988.ece",
        "date": "Fri, 13 Feb 2026 09:18:04 +0530",
        "fetched_at": "2026-02-13 04:02:45.445659"
    },
    {
        "title": "T.N. CM Stalin’s surprise bonanza for women: ₹5,000 credited in bank accounts of 1.31 crore women today",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nUpdated  - February 13, 2026 09:19 am IST - CHENNAI\nFile photo of DMK president and Tamil Nadu Chief Minister M.K. Stalin.\n                                          | Photo Credit: The Hindu\nTamil Nadu Chief Minister M.K. Stalin on Friday (February 13, 2026) gave a huge surprise bonanza for women crediting a sum of ₹5,000 each into the bank accounts of 1.31 crore beneficiaries of the Kalaignar Magalir Urimai Thogai scheme. While ₹3,000 was for the months of February, March and April (₹1,000 per month), a special summer aid of ₹2,000 has also been credited into their accounts, Mr. Stalin announced.\nIn a social media post, Mr. Stalin also announced that the monthly rights grant under the Kalaignar Magalir Urimai Thogai scheme would be increased from ₹1,000 to ₹2,000 in the Dravidian 2.0 (when the DMK government if re-elected to power in the ensuing Assembly elections.)\nதமிழ்நாட்டு மகளிருக்கு இந்த ஸ்டாலின் தந்த உறுதிமொழிதான் உரிமைத்தொகை. யார் தடை ஏற்படுத்தினாலும் அதிலிருந்து பின்வாங்க மாட்டேன்.தேர்தலைக் காரணம் காட்டி, மூன்று மாதங்களுக்கு உரிமைத்தொகையை முடக்கப் பார்க்கிறார்கள். முந்திக்கொண்டது நமது #DravidianModel அரசு!பிப்ரவரி, மார்ச்,… pic.twitter.com/n7VrMqcrb7\nContending that “some are attempting to prevent the disbursement” of the monthly aid for three months citing the elections, Mr. Stalin said: “But, this Dravidian model government overcame it. This urimai thogai (rights grant) was an assurance made by Stalin to the women of Tamil Nadu. I will not step back whoever brought in obstacles.”\nThe Chief Minister further expressed confidence that his party would win the election with the support of women. In a recorded video clipping, Mr. Stalin sought to explain the credit of ₹5,000 into the bank accounts of the beneficiaries.\nThe Kalaignar Magalir Urimai Thogai was launched in September 2023 and 1.13 crore women were disbursed a sum of ₹1,000 each and the programme was since expanded to cover 1.31 crore women across the State, he said. “This is not just a grant but a recognition of the contributions these women make in the society.”\nThe rights grant helped women look after their day-to-day expenses, family expenses, education expenses of their children, he said. Whileso, a “group in Delhi and another group in Tamil Nadu, who were slaves to the Delhi group”, there was information that a conspiracy was being hatched to stop the disbursement of this grant for three months citing elections, Mr. Stalin said.\n“There is information that a few are attempting to move the court...As someone from your family, I am aware as to what hardships you would undergo if the grant is suspended for three months. I can realise the pain you would undergo if the disbursement is suspended especially during summer,” he said.\n“How will you manage the monthly expenses? Can you get medicines for those in your family? When children are appearing for exams, can you spend for expenses incurred for their education? I have taken an important decision only after thinking through all these,” Mr. Stalin explained.\n“I have issued orders for disbursing a special Magalir Urimai Thogai of ₹5,000, including the monthly grant of ₹1,000 for February, March and April and a special summer aid of ₹2,000 to each of the 1.31 crore women. My request to you all is to be careful is spending this money, since this is for the next three months,” Mr. Stalin said.\nExpressing hope that his party would win in the ensuing Assembly elections, with the support of women Mr. Stalin announced: “In Dravidian model of governance, the urimai thogai would be increased to ₹2,000. This is the assurance given by Muthuvel Karunanidhi Stalin, who keeps his word.”\nReferring to some who may raise doubts as to how the government would afford to implement the increase in the monthly grant, Mr. Stalin said his government has excelled in many fronts, despite the financial crisis. “So, we will win over any obstacles.”\nPublished - February 13, 2026 09:02 am IST\nTamil Nadu\n                    \n                            /                      \n                        \n                        Dravida Munnetra Kazhagam\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/tn-cm-stalins-surprise-bonanza-for-women-5000-credited-in-bank-accounts-of-131-crorewomen-today/article70626937.ece",
        "date": "Fri, 13 Feb 2026 09:19:17 +0530",
        "fetched_at": "2026-02-13 04:02:46.100931"
    },
    {
        "title": "As multilateralism erodes, India must reframe its foreign policy",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nPublished - February 13, 2026 08:30 am IST\nFor representative purposes\n                                          | Photo Credit: Getty Images\nSpeaking in the Rajya Sabha, Prime Minister Narendra Modi formally acknowledged the new world order. The hard part is to formulate a new national identity and approach to international relations.\nIndia’s leadership of the Global South at the United Nations General Assembly was the foundation of its long-standing foreign policy of ‘strategic autonomy’. The global rules agreed in the UN established by former colonial powers led by the U.S. served their interests in the post-colonial world. India’s Oxbridge-educated diplomats had unquestioned leadership in the UN negotiating text on principles and rules, successfully diverting pressure on poor countries. Climate negotiations ending in 1992 were left entirely to India by the Global South.\nHowever, China’s rise around 2010, through the creation of alternative funding, economic and security institutions, impacted the intellectual leadership position of India and also changed the UN irreversibly. China heads four principal UN agencies, and its aid volumes exceed those of the West. The U.S., now unable to manage the UN process, has withdrawn from 31 UN institutions.\nIn 1986, the U.S. launched the Uruguay Round of trade negotiations, leading to the World Trade Organization (WTO) in 1995, where developing countries’ interests became more differentiated, and India struggled to secure its interests. In a more equal world, since 2019, the U.S. has rejected the dispute settlement mechanism of the WTO, making it dysfunctional and reverting to unilateral tariffs. China, in contrast, has diversified its exports away from the U.S. and is now the largest trading partner of 120 countries.\nThe problem India faces is not from the rise of China. While the EU and Canada acknowledge the collapse of the multilateral structures, developing countries are wondering how to revive them. With the potential to become the world’s third-largest economy, India is particularly impacted in the U.S.-dominated world of transactional relationships, even willing to discard NATO.\nFirst, leadership of the Global South gave India outsized influence and now where do you speak for developing countries when international institutions and law have withered away? The U.S. and China are competing for technological dominance, not votes in the UN.\nSecond, ‘strategic autonomy’ applied to the Cold War when India led the Non-Aligned Movement. It lost relevance after the collapse of the Soviet Union in 1991 and gradually became a self-declared identity used to rationalise foreign policy choices. India joined the U.S.-led rejuvenated Quad in 2017 and then chose the Russian S-400 missile system over the U.S. Patriot system in 2018.\nThe reality is that India gravitated towards the Soviet Union after its 1951 veto prevented discussion of Kashmir in the UN Security Council. Russia remains India’s only long-trusted partner giving cutting-edge military technology, which the U.S. is chipping away at testing India’s resolve to remain a third pole in a multipolar world.\nThird, with China’s rise, U.S. analysts began describing India not as strategically autonomous but as a “swing state.” The current U.S. military strategy rejects containment of China.\nThe major scope of international relations, outside of alliances, was within multilateral institutions which has now returned to asymmetric relations. Reciprocity in tariffs is redefined as “America first”, implying others are in a subordinate relationship. Under the India-U.S. Framework Agreement, India has agreed to double imports, largely industrial products, while the U.S. continues an 18% tariff, unilaterally deciding reductions clearly after further concessions. The EU trade agreement eliminated 70% tariff lines with phased reciprocal reductions.\nThe real question for India is why it was targeted by the U.S. tariffs and how to grow in a world marked by flux.\nThe U.S. is determined to prevent the rise of another China and India alone has the potential to overtake the U.S. China exploited multilateral rules to become a fiercely independent global manufacturing power and that opportunity no longer exists. The long-term U.S. policy of keeping India apart from Russia and China has now gained greater force and blunting it will test Indian diplomacy.\nIndia’s comparative advantage lies in its young population; nearly half of Silicon Valley’s workforce traces its roots to India. Building and attracting that talent can develop the capability to become a ‘cyber superpower’, spreading AI across security, manufacturing and services to secure development space.\nTo achieve this, India needs good economic and technological relations with the U.S., Russia, and China, Free Trade Agreements (FTA), and, importantly foreign policy replacing ‘strategic autonomy’ with ‘Viksit Bharat 2047’.\nFirst, taking a leaf from China and the U.S. in the early 1900s, India should bide its time, maintain a low international profile and develop endogenous capabilities, requiring a diplomatic posture to accelerate the Asian Century and a passive role in all other regions.\nSecond, India must prioritise trade diplomacy by diversifying exports away from the U.S., even as vulnerabilities remain in bilateral relationships. Now that India is open to industrial imports, the push for FTAs must continue with Asia, soon to have two-thirds of global wealth, and Africa, the fastest-growing continent.\nThird, India should create new technological, cyber and space relations with Russia, its steadfast and tested partner, now more an Asian than European power. It should also enable China to invest in infrastructure and partner manufacturing, with safeguards, to take advantage of trade opportunities and accelerate growth.\nFourth, India should treat relations with Pakistan as a foreign policy issue rather than a security challenge. A new water-sharing arrangement incorporating the needs of the Kashmir Valley, revival of the Iran-Pakistan-India Peace Pipeline with Pakistan benefiting from transit fees, and even a trade agreement could create economic incentives.\nLastly, as chair of BRICS, India has an opportunity to articulate its new foreign policy by building consensus on repositioning BRICS as an economic cooperation community, not a political multilateral body. Linking official digital currencies to make cross-border trade, repatriation and tourism payments smoother will be a good first step.\n(Mukul Sanwal is a former UN diplomat)\nPublished - February 13, 2026 08:30 am IST\ntrade policy\n                    \n                            /                      \n                        \n                        Text and Context\n                    \n                            /                      \n                        \n                        The Hindu Explains\n                    \n                            /                      \n                        \n                        World\n                    \n                            /                      \n                        \n                        India-United States\n                    \n                            /                      \n                        \n                        China\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/as-multilateralism-erodes-india-must-reframe-its-foreign-policy/article70624458.ece",
        "date": "Thu, 12 Feb 2026 23:24:44 +0530",
        "fetched_at": "2026-02-13 04:02:46.749671"
    },
    {
        "title": "VB-G RAM G: when a policy shift meets rural realities",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nPublished - February 13, 2026 06:38 am IST - VIJAYAWADA\nFinding work under the employment scheme has become an uphill task for residents of Bandarugudem village in Krishna district.  \n                                          | Photo Credit: G.N. Rao\nBandarugudem village in Bapulapadu mandal of Krishna district sits at a distance from the restless churn of urban Andhra Pradesh. Its narrow mud roads are worn dark by years of use, flanked by shallow drains carrying sewage and spewing out a stench that hangs heavily in the humid air.\nElderly and middle-aged women in crumpled cotton saris walk along the lanes separating small, low-roofed houses in uneven rows, their talk punctuating the hum of rural living. Except for the occasional growl of two-wheelers, there is little to signal that the world beyond the village is changing rapidly.\nIt is in these quiet lanes that the debate over the future of rural employment has begun to echo. Sixty-year-old Barre Jayamma stands at the end of a street speaking animatedly with a group of women. “What good is the new scheme when we are unable to utilise the full benefits of the existing one?” she asks, referring to the Union government’s decision to replace the Mahatma Gandhi National Rural Employment Guarantee Act (MGNREGA) with the Viksit Bharat–Guarantee for Rozgar and Ajeevika Mission (Gramin) or VB-G RAM G.\nJayamma and most women around her are unfamiliar with the finer points of the new Act. Their understanding comes from what local officials have told them, that the guaranteed number of workdays has been increased from 100 to 125 and that payment delays are being addressed. For them, the question is not about legislative nuance but about work. MGNREGA’s mandate was simple and legally enforceable - at least 100 days of wage employment in a financial year to every rural household whose adult members were willing to do unskilled manual work. But in practice, the experience varied widely.\n“My cousins in villages like Chavatipalli in Nellore district, Adavinekkalam in Eluru district and even in neighbouring Ampapuram get 100 days of paid employment every year. I have to fight with local officials to find work even for two weeks.”Medabalimi DhanalakshmiJob card holder at Bandarugudem village\nFifty-year-old Medabalimi Dhanalakshmi voices her frustration. “My cousins in villages like Chavatipalli in Nellore district, Adavinekkalam in Eluru district and even in neighbouring Ampapuram get 100 days of paid employment every year. I have to fight with local officials to find work even for two weeks,” she says. Her neighbour, Chintalapudi Aluvelamma (58), got 28 days of work last financial year. “I am healthy and willing to work, but there is no work around this village,” she laments.\nBandarugudem’s problem is structural. It is one of the smaller gram panchayats in the mandal and lacks the kind of community assets that can generate sustained employment under the scheme. The village tank, once a steady source of work through desilting and bund strengthening, has been leased out for fish rearing. That decision has effectively closed off a crucial avenue of wage labour, particularly during lean agricultural seasons. Merugu Rajaratnam (53) sums up the prevailing mood: “The tank which provided us some work is gone now. Most of us need work, but there is not much around.” Peeka Adamma (40) says they had raised the issue in gram sabhas, but to no avail.\nMGNREGS beneficiaries in Bandarugudem village under showing their job cards. \n                                                            | Photo Credit: \n                                G.N. Rao\nField assistant Chelli Prasanna says that distributing limited works among 20 groups of 50 members each is a challenge. In the previous fiscal year, villagers here could only access 30 days of work.\nThe contrast with neighbouring Ampapuram is stark. The roads there are wider and paved, and houses are mostly pucca and arranged in neat rows. The village presents an air of relative prosperity. Ganduboyina Venkateswara Rao (65) tends to four buffaloes in a shed constructed under MGNREGA.\nInside, hay stacks lean against mud-plastered walls, some neatly tied, others scattered across the damp floor. The structure represents an asset, a tangible outcome of the programme’s emphasis on individual beneficiary works.\nDanduboyina Venkateswara Rao of Ampapuram village in Krishna district who got a buffalo shed constructed under MGNREGS. \n                                                            | Photo Credit: \n                                G.N. Rao\n“The scheme allows for individual asset creation, including livestock sheds,” explains field assistant Lalitha. Such works must be included in the labour budget and annual action plan approved by the gram sabha. For Rao, the shed has been transformative. “It is more useful than I imagined,” he says, rearranging bundles of hay.\nSimilarly, Chilakanti Jyothi (34) opted for oil palm cultivation under the scheme and receives monthly maintenance support during the critical growth years. The programme covers pit digging, planting and irrigation structures and also provides for maintenance to ensure sapling survival.\nAmpapuram has 280 job cards divided into seven groups, each with 40–50 members. Beneficiaries have reportedly completed 70–80% of their allotted workdays in the current financial year. Across the 27 villages of Bapulapadu mandal, 9,818 households received work under MGNREGA this year, with ₹10.44 crore spent on wages, says Additional Programme Officer for Bapulapadu mandal S. Ashok Kumar. He says there are no pending payments.\nAt the district level, N.V. Shiva Prasad Yadav, Project Director of the Krishna District Water Management Agency (DWMA), outlines the scale of implementation. In 2024–25, 139,739 households were provided employment, generating 7,580.66 lakh person-days; in 2025–26 (till date), 5,490.37 lakh person-days have been generated. Women accounted for 2,956.87 lakh person-days. Wage expenditure stood at ₹15,406.78 lakh and materials at ₹8,622.18 lakh, with an average wage of ₹280.54. Over 3,900 families completed 100 days of work this year, he says, adding that plantation activities have covered hundreds of acres and kilometres of avenue and canal stretches.\nIt is evident that in parts of Krishna district, MGNREGA has functioned as intended, generating employment and creating assets. Yet disparities between villages such as Bandarugudem and Ampapuram illustrate the unevenness of implementation.\nSmaller panchayats with limited common land face inherent constraints. Officials attempt to bridge the gap by encouraging individual works such as private ponds for water storage. “But many small farmers are reluctant to part with scarce land,” says Ashok Kumar.\nIt is against this backdrop that the Union government’s move to replace MGNREGA with VB-G RAM G has sparked controversy. Opposition parties and civil society groups argue that the change represents not merely a redesign but a structural shift.\nThey contend that MGNREGA’s defining feature was its statutory guarantee, the legal right to demand work. Critics fear that VB-G RAM G could transform rural employment from a demand-driven entitlement into an administratively managed scheme shaped by budget allocations, notifications and technological controls.\nThe Congress has sharply criticised the change. Sonia Gandhi, Chairperson of the Congress Parliamentary Party, described it as an assault on farmers and rural workers. Congress Andhra Pradesh president Y.S. Sharmila has undertaken a protest yatra from Bandlapalli in Anantapur district, where MGNREG scheme was first launched in 2006, underscoring its historical significance.\nBandlapalli itself offers evidence of MGNREGA’s transformative potential. Water harvesting ponds, percolation tanks and trenches have improved groundwater levels. Cement concrete roads built under the programme have enhanced connectivity. Cheemala Peddakka, who received the first job card two decades ago, continues to work.\n“The money helps me take care of my needs,” she says. For her, the scheme’s name is less important than its ability to sustain farm labourers. “It would be painful to see any dilution of the employment generation programme that has helped so many families to improve their financial condition,” she says.\nWomen job card holders engaged in farm work at Bandarugudem village in Krishna district. \n                                                            | Photo Credit: \n                                G.N. Rao\nLibTech India, a research and advocacy organisation focused on transparency and social protection, has examined the implications of the new Act. Its report on the impact of VG-B RAM G on Andhra Pradesh argues that even under MGNREGA, employment averaged 51.6 days per household in the State in 2024–25, with only 11% completing 100 days, suggesting fiscal and administrative rationing despite statutory guarantees.\nVB-G RAM G, it warns, removes the explicit right to demand work and allows selective implementation in notified areas, potentially excluding vulnerable communities like Adivasis. The report also highlights fiscal concerns. Given existing liabilities, the State may struggle to maintain employment levels without rationing, it says.\nThe fears are not unfounded. Chief Minister N. Chandrababu Naidu, in his recent meeting with the Union Home Minister Amit Shah, discussed the financial provisions of VB-G RAM G scheme. Stating that the revised 60:40 Centre-State funding ratio had put additional financial burden on the State and could adversely impact the implementation, he requested alternative financial support.\n“The State government should urgently review the impact of the VB-G RAM G Act on employment security and hold broad consultations, including a dedicated Assembly debate. Based on these discussions, the State should formally urge the Union government to reconsider the framework and retain MGNREGA’s statutory employment guarantee,” says Chakradhar Buddha, senior researcher with LibTech India.\n“The government should review the impact of the VB-G RAM G Act on employment security and hold broad consultations, including an Assembly debate. Based on these discussions, it should urge the Centre to retain MGNREGA’s statutory employment guarantee.”Chakradhar BuddhaSenior researcher with LibTech India\nFor villagers like Jayamma, these policy debates are distant abstractions. Their reality is measured in days of work secured or denied. The divergence between villages shows that implementation capacity, asset availability and administrative priorities shape outcomes as much as legislation does. MGNREGA has built ponds, sheds and roads, it has raised groundwater levels and provided income support. But it has also revealed gaps in planning and resource allocation.\nThe transition to VB-G RAM G raises fundamental questions: Will the new framework strengthen delivery or weaken entitlements? Can it address disparities between villages like Bandarugudem and Ampapuram? And will it preserve the core principle that rural households should have assured access to wage employment in times of need?\nAs Andhra Pradesh navigates this shift, the answer may lie less in rhetoric and more in ensuring that the scheme, whatever its name, remains responsive to the realities of rural workers. For the women standing at the edge of Bandarugudem’s dusty lanes, employment is a matter of survival, dignity and the promise that the State will stand by its poorest citizens.\nPublished - February 13, 2026 06:38 am IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/vb-g-ram-g-when-a-policy-shift-meets-rural-realities/article70624961.ece",
        "date": "Fri, 13 Feb 2026 06:38:20 +0530",
        "fetched_at": "2026-02-13 04:02:47.394562"
    },
    {
        "title": "Southern Railway installs digital display boards but without real time data of arrival of suburban trains",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nPublished - February 13, 2026 05:30 am IST - Chennai\nThe digital display board in Perambur Carriage station . \n                                          | Photo Credit: Special Arrangement\nThe Southern Railway has installed digital display boards at nearly 50 important railway stations in the city as part of passenger amenities project.\nWhile commuters welcome the digital display boards initiative, they point out that these display boards would not be of much use unless they provide real time data on the arrival of suburban trains.\nThe display boards have been installed at several railway stations covering all the four sections of the Chennai Division, including Velachery, Palavanthangal, Chromepet, Pallavaram, Nungambakkam, Villivakkam, Minjur, and Tiruvottiyur.\nDesigned with bright LED displays for high visibility, the boards remain easily readable even during peak hours and under varying light conditions, said a senior railway official.\nWhile these newly installed display boards are supposed to replace the timetable charts by providing accurate information on train arrivals, in reality, they simply display those that were published in the timetable but the actual timing of arrival of the suburban trains varies a lot, rue the commuters.\nEven before the installation of the digital display boards, the Southern Railway has been making announcements of the arrival of suburban trains through the announcement systems in several important railway stations like Guindy, Mambalam, Egmore, Perambur, Avadi, and Tiruvallur.\nT. Ashutosh, a commuter boarding at Chepauk station, said the timings on the digital display boards are the same what has been published and so it is not of any big use to the commuters.\nRailway activists point out that at a time when the digital display boards of the Metrorail trains linked through the GPS installed in the trains exactly predict the arrival of the metro trains in the stations. Similarly, the Metropolitan Transport Corporation (MTC) has successfully conducted the testing of the digital display boards informing the arrival of buses in more than 18 bus stops by installing GPS in the entire fleet of 3,500 buses and linking it with the central server plans to install digital display boards in 600 bus stops of the city.\nAn assistant loco driver of a suburban train said in almost 50% of the electrical multiple unit (EMU) rakes, the GPS facility is available and the next railway stations are announced to the travelling commuters through the digital display boards fixed inside the EMUs.\nPublished - February 13, 2026 05:30 am IST\nTamil Nadu\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/southern-railway-installs-digital-display-boards-but-without-real-time-data-of-arrival-of-suburban-trains/article70595933.ece",
        "date": "Fri, 13 Feb 2026 04:23:36 +0530",
        "fetched_at": "2026-02-13 04:02:48.052046"
    },
    {
        "title": "TVK functionary among 52 persons booked in Vandavasi for obstruction of traffic movement",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nUpdated  - February 13, 2026 07:36 am IST - TIRUVANNAMALAI\nTVK supporters throng at a party rally to welcome their leader to deliver speech. \n                                          | Photo Credit: Lakshmi Narayanan E\nA 32-year-old Tamilaga Vettri Kazhagam (TVK) functionary was among 52 party workers booked by Vandavasi South police in Tiruvannamalai on Thursday (February 12, 2026) for traffic violations, after they tried to honour the functionary with a huge garland using a crane.\nPolice said S. Udayakumar, an organising secretary for Tiruvannamalai West of TVK, is a native of Anakavoor village near Cheyyar town in the district and a real estate dealer. Police said as part of his 32nd birthday celebrations, Udayakumar and the TVK cadre took out a road show in his open car the previous evening on the busy stretch. The roadshow was illegal as they did not get the necessary police permission for it.\nDuring the road show, Udayakumar halted his vehicle near the elevated corridor on the stretch when a group of supporters tried to honour him with a huge garland, using a crane. They also presented him with a sword as part of the celebrations. The incident happened around 7.15 p.m.\nPolice said the action by the TVK cadre affected traffic movement on the stretch. The duty police personnel, including sub-inspectors attached to Vandavasi South police K. Vinayakamurthy and S. Murugan, stopped the celebrations.\nBased on a complaint by K. Srirangan, village administrative officer (VAO), Vandavasi, a case has been registered against 52 persons.  Police also seized the crane that was used to carry the garland for the celebrations. A probe is under way.\nPublished - February 13, 2026 05:15 am IST\nTamil Nadu\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/tvk-functionary-among-52-persons-booked-in-vandavasi-for-obstruction-of-traffic-movement/article70624615.ece",
        "date": "Fri, 13 Feb 2026 07:36:47 +0530",
        "fetched_at": "2026-02-13 04:02:48.706431"
    },
    {
        "title": "Politicians misuse of social media, need to act in such cases: J&K Minister Sakina Itoo",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nPublished - February 13, 2026 04:39 am IST - JAMMU\nJammu and Kashmir Minister Sakina Itoo said the government should hold a meeting of the Department of Information and Public Relations (DIPR) to create a mechanism to act swiftly against such handles on social media. File\n                                          | Photo Credit: PTI\nJammu and Kashmir Minister and National Conference (NC) leader Sakina Itoo on Thursday (February 12, 2026) flagged the issue of misuse of social media platforms by politicians in J&K to tarnish images of opponents and sought a mechanism to act swiftly against such handles at par with fake news peddlers.\n“If there is anyone at the top of the misuse of social media or fake news, it is politicians. They use social media platforms like Facebook to tarnish and malign the opponents. We trace many such videos to the handles of politicians and political parties first. We need to act against them first. Politicians need to control themselves first,” said Ms. Itoo, while speaking during the Zero Hour in the J&K assembly.\nShe said the government should hold a meeting of the Department of Information and Public Relations (DIPR) to create a mechanism to act swiftly against such handles on social media. “Currently, the DIPR does not have a mandate to seek punishment against such handles,” she added.\nIn a rare show of support from the Opposition BJP, legislator R.S. Pathania said the DIPR has issued 28 rebuttals in 2025. “Is there coordination between the DIPR and the J&K Police? There are umpteen channels on Facebook that have damaged the social fabric, democracy and governance. There is a doctored video about me uploaded by a national party. I approached the government and the police but no action was taken. There is a need to have an enforcement mechanism,” Mr. Pathania said.\nHe demanded a dedicated Media Monitoring Cell in the DIPR for real-time tracking of fake news.\nIn a reply to MLA Pathania’s questions, the J&K Government said it has proposed a regulatory framework for new and social media in the draft New Media Policy-2026, “which is currently at the inter-departmental consultation stage for finalisation”.\n“All departments have designated nodal officers to monitor department-specific fake news, who have been provided login IDs to upload rebuttals on a dedicated portal,” the J&K Government said.\nThe legal framework governing social media platforms is primarily anchored in the Information Technology Act, 2000, particularly Section 69A which empowers the blocking of content in the interest of public order and national security, complemented by the IT (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021, the government said.\nPublished - February 13, 2026 04:39 am IST\nJammu and Kashmir\n                    \n                            /                      \n                        \n                        social networking\n                    \n                            /                      \n                        \n                        Jammu and Kashmir National Conference\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/jammu-and-kashmir/politicians-misuse-of-social-media-needto-act-in-such-cases-jk-minister-sakina-itoo/article70625089.ece",
        "date": "Fri, 13 Feb 2026 04:16:15 +0530",
        "fetched_at": "2026-02-13 04:02:50.385609"
    },
    {
        "title": "Minister’s adverse remarks in Rajasthan Assembly on right to health spark controversy",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nUpdated  - February 13, 2026 07:59 am IST - JAIPUR\nGeneral view of the Rajasthan Legislative Assembly during the presentation of the 2026–27 Budget in Jaipur. File\n                                          | Photo Credit: ANI\nRajasthan Health Minister Gajendra Singh Khimsar’s adverse remarks on the Right to Health Act in the State Assembly on Thursday (February 12, 2026) sparked a controversy and led to a ruckus in the House. Health rights groups and veteran Congress leader Ashok Gehlot also condemned the Minister’s statement.\nThe Right to Health Act was legislated in 2023 before the previous Congress government’s term ended, making Rajasthan the first State to give a statutory status to health care as a right. The rules under the Act could not be framed because of the imposition of the model code of conduct ahead of the Assembly election.\nSpeaking during the Question Hour, Mr. Khimsar said the then Congress regime had enacted the law ahead of polls to “draw political mileage” and added that Ayushman Bharat and the Chief Minister’s Ayushman Aarogya Yojana were operative in the State to cater to all needs of medical care for the patients.\nAlso Read | Concern over delay in Right to Health law’s enactment in Rajasthan: Jan Swasthya Abhiyan\n“What is the need for a law on the right to health?” Mr. Khimsar asked, leading to objection by the Opposition Congress MLAs, who raised slogans and trooped to the well of the House. Amid the stormy scenes, Congress members staged a walkout in protest against the dissatisfactory reply by the Minister and the hints of scrapping the legislation.\nThe issue figured in the Question Hour when Congress MLA from Bundi, Harimohan Sharma, wanted to know the progress in framing of rules under the Act and the related aspects. Leader of Opposition Tika Ram Jully asked why the rules were not being framed and whether the State government wanted to implement the law.\nAs the matter was not resolved amid pandemonium in the House and the next question on the list was called, the issue spilt out of the Assembly. Former Chief Minister Gehlot condemned Mr. Khimsar’s remarks and accused the Bharatiya Janata Party (BJP) government of surrendering before the private medical lobby.\n“The Minister’s statement that there is no need for the right to health amounts to rubbing salt on the wounds of the poor and middle-class patients troubled by rising medical expenses,” Mr. Gehlot said in a post on X. He said the BJP government, which had failed to frame the rules, was now resorting to excuses.\nThe Jan Swasthya Abhiyan (JSA)-Rajasthan demanded that Mr. Khimsar publicly acknowledge the “full scope and intent” of the Right to Health Act and immediately frame and notify the rules required to operationalise the law. The health rights group also asked the Minister to withdraw his statement made in the Assembly.\nJSA coordinator Chhaya Pachauli said the State government should fulfil its statutory obligation, as the Act had remained largely unimplemented for three years in the absence of necessary rules. “The institutional mechanism mandated under the legislation should be strengthened, rather than weakened through misleading public statements,” Ms. Pachauli said.\nThe Act gives every resident of the State the right to emergency treatment care “without prepayment of requisite fee or charges” by any public health institution, health care establishment and designated health care centre. The Congress had made a promise to legislate the right to health in its manifesto for the 2018 Assembly election.\nThe legislation makes it mandatory for the hospitals to provide treatment in emergency cases without waiting for medico-legal formalities and give medicines and transport facilities without charging money. The Act’s implementation could do away with out-of-pocket expenditure and bring transparency and accountability within the healthcare system.\nPublished - February 13, 2026 04:18 am IST\nRajasthan\n                    \n                            /                      \n                        \n                        health\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/rajasthan/ministers-adverse-remarks-in-rajasthan-assembly-on-right-to-health-spark-controversy/article70624788.ece",
        "date": "Fri, 13 Feb 2026 07:59:13 +0530",
        "fetched_at": "2026-02-13 04:02:51.022174"
    },
    {
        "title": "Orissa High Court directs State Government to tally Puri Jagannath temple’s jewellery inventoried in 1978",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nUpdated  - February 13, 2026 07:48 am IST - BHUBANESWAR\nDuring the past many years, the issue of the ruinous condition of Ratna Bhandar and the missing of its keys had been raised in different forums. File\n                                          | Photo Credit: PTI\nIn an important judgment in connection with Ratna Bhandar, the treasury of Shree Jagannath Temple, Puri, the Orissa High Court has directed the State Government to complete the exercise of tallying the fresh inventory report with the inventory report of the Committee submitted in the year 1978 within the next three months.\nDuring the past many years, the issue of the ruinous condition of Ratna Bhandar and the missing of its keys had been raised in different forums.\nAs per the last inventory carried out 45 years ago, the Ratna Bhandar had more than 1.2 quintals of gold and 2.2 quintals of silver. In addition to this, there is a sizeable amount of gold ornaments which are in regular use in the temple. For obvious reasons, the State Government had shown ‘reluctance’ to open the treasury of Shree Jagannath Temple.\nAfter the Bharatiya Janata Party (BJP) came to power, the State constituted a High Level Committee under the Chairmanship of Justice Biswanath Rath, former Orissa High Court Judge. Subsequently, the Standard Operating Procedure (SOP) was framed by the government in relation to the opening of the Ratna Bhandar. They were opened on July 14, 2024.\nAlso Read | Missing keys of ‘Ratna Bhandar’ | Orissa High Court adjourns hearing on PIL seeking tabling of report\nThe jewellery and valuables of both the Ratna Bhandars were shifted to temporary strong rooms located in the adjacent Jagamohana in order to facilitate the Archaeological Survey of India to conduct the repair and conservation works of the Ratna Bhandar.\nAdjudicating a matter relating to delay in tallying, a division bench of Orissa High Court comprising Chief Justice Harish Tandon and Judge Justice M.S. Raman directed, “we hasten to add that no complacency can be shown by the State Government in relation to the process of the inventory and the report submitted by the Committee and we trust and hope that the State shall show alacrity in this regard.”\n“We further direct the State government to complete the exercise of tallying the inventory report submitted by the newly constituted Committee with the inventory report of the Committee submitted in the year 1978 within three months from date,” says the Division Bench, which had delivered judgment on January 27, 2026. The copy of judgment was made public recently.\nThe Court observed that “it is no gain saying that the inventory of the jewellery and valuables of Lord Shri Jagannath which was conducted way back in the year 1978 shall be the benchmark document in order to ascertain the inventory undertaken by the committee subsequently constituted by the State Government, whether all the jewellery and valuables of Lord Shri Jagannath which were found at the time of the inventory conducted in the year 1978 tally with the inventory done by the present committee.”\nMoreover, the High Court directed that the report of the Inquiry Committee with regard to the missing key should be placed on the floor of Assembly House in the ensuing session. “We expect that a decision would be taken thereupon,” judges remarked.\n“The inquiry committee also submitted the report on the missing or misplacement of the keys of those Ratna Bhandars, which, in terms of the provisions of the Commissions of Inquiry Act, 1952 is required to be placed on the floor of the House of the Assembly. There cannot be any dormant exercise in this regard and it is an ordained duty of the State to take prompt action,” the High Court observed.\nMeanwhile, the repair and conservation work of both the Ratna Bhandars has already been completed by the Archaeological Survey of India.\nPublished - February 13, 2026 02:55 am IST\nOrissa\n                    \n                            /                      \n                        \n                        investigation\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/odisha/orissa-high-court-directs-state-government-to-tally-puri-jagannath-temples-jewellery-inventoried-in-1978/article70624993.ece",
        "date": "Fri, 13 Feb 2026 07:48:58 +0530",
        "fetched_at": "2026-02-13 04:02:51.658786"
    },
    {
        "title": "Over 73% of MoUs converted into investments in T.N., says Stalin",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nPublished - February 13, 2026 02:39 am IST - CHENNAI\nChief Minister M.K. Stalin at the Conversion Conclave in Chennai on Thursday, February 12, 2026. \n                                          | Photo Credit: JOTHI RAMALINGAM B\nSharing data on the MoUs signed in Tamil Nadu since mid-2021, Chief Minister M.K. Stalin on Thursday said 73.53% of the 1,179 agreements had been converted into actual projects.\n“This data is for those who have been questioning us over the conversion of MoUs,” the Chief Minister said, speaking at the Conversion Conclave 2026 in Chennai.\nIn an elaborate presentation on the subject, Industries Minister T.R.B. Rajaa said a total of 1,179 MoUs, entailing a cumulative investment of ₹12.37 lakh crore and the creation of 36.52 lakh jobs, were signed in the past five years. Of them, 867 projects were in advanced stages of implementation, he added. “The conversion rate is 73.53%, while 35.11% are operational,” he said, contending that no other State had the courage or the capability to hold a conclave to prove how MoUs were being converted into investments.\n“We ensured distributed growth across all districts in Tamil Nadu. The focus was not on investment numbers; it was on the number of jobs, the quality of the jobs, and the location of the jobs. According to EPFO data, 29.63 lakh jobs have been created over the past four years. I am trying to give the facts from our side, and I’m also backing them up with data from the Union government,’ Mr. Rajaa said.\nAccording to the Minister, 18 investment conclaves were held across Tamil Nadu, and in countries including the U.S., Dubai, and the UAE. A total of 1,130 MoUs were signed at these conclaves, with a committed investment of ₹10.43 lakh crore and a committed employment for 33.30 lakh people, he said. With regard to the foreign conclaves, the conversion rate stood at 69.56%, with 26.08% already operational, while 48 of the 69 MoUs signed were at an advanced stage of implementation, he added.\nStating that the Dravidian model of governance focuses on distributed growth, the Minister added, “We have ensured distributed growth – the northern region has grown by 41%, and the southern region by 36%.”\n“In the central and western regions, land availability is tough, but we will bring more investors here,” he said.\nMr. Rajaa also showed a chart highlighting the economic impact of the investments. He said the State had achieved 11.19% GSDP growth in the financial year 2025, and 36% growth in per capita income in four years. The four-year average in manufacturing stood at 9.38%, $52.07 billion (2x growth in exports in a year), 36% growth in electronics exports in five years and 14.74% manufacturing growth in one year.\nTwo fresh MoUs were signed at the conclave. One was with Bharat Biotech for bio-similars manufacturing in Kancheepuram, entailing investments to the tune of ₹5,000 crore. An MoU was also signed with Hyundai Motors India Foundation for setting up a skill development centre for training 7,000 students in futuristic skills in Kancheepuram. The ground-breaking ceremony was held for over 70 companies.\nDabur India Ltd, the world’s largest ayurveda company, held the ground-breaking ceremony for its new, world-class FMCG manufacturing facility at Tindivanam. This is Dabur’s first manufacturing plant in south India.\nPublished - February 13, 2026 02:39 am IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/over-73-of-mous-converted-into-investments-in-tn-says-stalin/article70624492.ece",
        "date": "Fri, 13 Feb 2026 02:39:15 +0530",
        "fetched_at": "2026-02-13 04:02:52.298498"
    },
    {
        "title": "Ophthalmologist gets award for community eye care",
        "content": "February 12, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 12, 2026e-Paper\nPublished - February 13, 2026 01:03 am IST - Chennai\nMohan Rajan\nMohan Rajan, chairman and medical director of Rajan Eye Care Hospital and vice-president of the All India Ophthalmological Society, has been presented the Asia Pacific Academy Of Ophthalmology’s Outstanding Service for Prevention of Blindness Award 2026 at the Academy’s annual conference at Hong Kong.\nThis Award is in recognition of Dr. Mohan Rajan’s significant contribution to community ophthalmology in eradicating blindness in the Asia Pacific region for the past three decades, said a press release.\nPublished - February 13, 2026 01:03 am IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/cities/chennai/ophthalmologist-gets-award-for-community-eye-care/article70625529.ece",
        "date": "Fri, 13 Feb 2026 01:03:07 +0530",
        "fetched_at": "2026-02-13 04:02:52.957493"
    },
    {
        "title": "Giving 2.20 lakh digital title deeds in unrecognised habitations in two years is a record for Karnataka, says Revenue Minister",
        "content": "February 12, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 12, 2026e-Paper\nPublished - February 13, 2026 12:47 am IST - BENGALURU\nKrishna Byre Gowda\nAs the government is gearing up to provide digital title deeds for properties of over 1.1 lakh families in unrecognised habitations in Karnataka, on February 14 in Haveri, it is set to create a record of sorts.\n“We have already provided digital title deeds to over 1.1 lakh families in unrecognised habitations of the State last year and are set to provide certificates to another 1.1 lakh families now to mark completion of 1,000 days of our governance. Providing title deeds to 2.2 lakh families in unrecognised habitations in two years is a record. Also this is one of the largest numbers in the country,” Revenue Minister Krishna Byre Gowda told The Hindu.\nAn estimated 10 to 12 lakh people are expected to benefit in the last two years owing to these measures.\nPossession certificates had been given to 1.08 lakh such families by the erstwhile BJP government. However, they were not the digital ones.\n“These digital title deeds cannot be tampered with or lost. Under this drive, the government officials themselves have gone to the doorsteps of beneficiaries to identify them without asking them to apply for title deeds,” he said.\n“We are registering these title deeds with sub-registrars through absolute deeds. The beneficiaries will have to pay only the scanning charges. In addition to this, the beneficiaries will also get e-swathu – creation of a title in the panchayat records in their name. This is the absolute completion of their ownership process,” the Minister maintained.\n“These are habitations that existed for 30 to 100 years, but never had recognition of a village. They do not exist on any government record. Since they are not part of official records, it was not possible as per norms to provide them any public infrastructure like hospitals and schools or civic amenities. However, on humanitarian grounds, such facilities were being given in the last decade by violating the norms,” the Minister explained.\nThe State had 6,500 unrecognised habitations when the Karnataka Land Revenue Act, 1964, was amended to declare them as revenue villages in 2016. Of them, 1,557 were declared as revenue villages till May, 2023. In the last two-and-a-half years, another 3,000 habitations have been given recognition. Similar measures are in the pipeline for another 1,300 habitations, the Minister noted.\nPublished - February 13, 2026 12:47 am IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/karnataka/giving-220-lakh-digital-title-deeds-in-unrecognised-habitations-in-two-years-is-a-record-for-karnataka-says-revenue-minister/article70624903.ece",
        "date": "Fri, 13 Feb 2026 00:47:35 +0530",
        "fetched_at": "2026-02-13 04:02:53.613838"
    },
    {
        "title": "Karnataka High Court directs State government to set up Municipal Trust Property Management System to protect public properties",
        "content": "February 12, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 12, 2026e-Paper\nPublished - February 13, 2026 12:46 am IST\nPointing out that public properties controlled by various municipalities are not maintained and protected as mandated by law, the High Court of Karnataka directed the State government to set up and operationalise a Municipal Trust Property Management System (MTPMS), as a single source of truth for all such properties across the State and assign a Trust Property Identification Number (TPIN).\nBesides, the court directed that all municipalities under the Karnataka Municipalities (KMC) Act, 1964, will have to identify and prepare a comprehensive inventories of all “municipal properties” as defined under Section 81 of the KMC Act by correlating municipal and revenue records, land grant orders, and town planning documents within 90 days. The MTPMS should be integrated with other land related systems like Bhoomi, Mojini, e-municipalities, and Sakala portal, etc., the court said.\nStating that all identified “municipal properties” will have to be classified, risk-graded, physically demarcated on the ground, and geo-tagged using GIS technology, the court said revenue records, including Records of Rights, Tenancy and Crop (RTCs) and municipal records should clearly reflect classification as Municipal Trust Property and no alteration should be made without issuance of notice, conduct of enquiry and passing orders as per the law.\nJustice Suraj Govindaraj issued the direction while disposing of a petition filed by Syed Matin Abbas against the Mysuru Deputy Commissioner’s (DC) 2017 order of cancelling khata of property that his father had purchased in auction conducted by Town Municipal Council, Periyapatna, in 1977.\nNo “municipal property” coming under Section 81 of the Act, should be sold, leased, or otherwise alienated except in strict compliance with Section 72(2) of the Act, and with express Government approval, wherever such approval is required, as “municipal properties vest in the municipalities only in a fiduciary capacity as “trustee” and not as “absolute owner”, the court made it clear.\nWhile directing the government to set up two committees at the State and the district levels, the court has tasked the district level committees, to be headed by the respective DCs, to conduct time-bound audit of past sales, leases, grant, or transfers, encroachments or unauthorised constructions, and impermissible change of land use.\nStating that a public digital portal should be maintained displaying municipality-wise properties, and providing mechanisms for citizens to report encroachments or misuse of “municipal properties”, the court said that responsibility should be fixed on officers found to have facilitated illegal alienation, encroachment, or misuse of “municipal properties” and disciplinary or other action should be initiated against them as per law.\nCourt’s directions\nPrepare comprehensive inventory of ‘municipal properties’ across the State\nCreate Municipal Trust Property Management System to manage all of them.\nAssign Trust Property Identification Number to every ‘municipal properties’\nIdentify municipal properties with geo-tagging using GIS tech\nTime-bound audits of past sales, leases, encroachments, and land use changes\nProvide a public portal for citizen to report misuse of ‘municipal property’\nPublished - February 13, 2026 12:46 am IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/karnataka/karnataka-high-court-directs-state-government-to-set-up-municipal-trust-property-management-system-to-protect-public-properties/article70624402.ece",
        "date": "Fri, 13 Feb 2026 00:46:16 +0530",
        "fetched_at": "2026-02-13 04:02:54.249764"
    },
    {
        "title": "Siddaramaiah to present his record 17th Budget on March 6",
        "content": "February 12, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 12, 2026e-Paper\nPublished - February 12, 2026 11:37 pm IST - Bengaluru\nChief Minister Siddaramaiah, who holds the Finance portfolio, is scheduled to present his record 17th Budget on March 6.\nThe Karnataka Cabinet on Thursday approved the Budget to be presented on March 6 and the Budget session of the legislature to be held between March 6 and March 27.\nThere will be 14 days of legislature session (barring holidays), the Law and Parliamentary Affairs Minster H.K. Patil said in his post-Cabinet briefing.\nPublished - February 12, 2026 11:37 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/karnataka/siddaramaiah-to-present-his-record-17th-budget-on-march-6/article70625730.ece",
        "date": "Thu, 12 Feb 2026 23:37:55 +0530",
        "fetched_at": "2026-02-13 04:02:54.906779"
    },
    {
        "title": "Karnataka govt. gives conditional clearance to IPL matches at M. Chinnaswamy Stadium",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nPublished - February 12, 2026 11:30 pm IST - Bengaluru\nThe M. Chinnaswamy Stadium in Bengaluru. \n                                          | Photo Credit: file photo\nAfter much deliberations over cricket matches to be played at M. Chinnaswamy Stadium here, the Karnataka government on Thursday agreed to allow the Indian Premier League (IPL) matches at the stadium with certain conditions.\nEnding speculation about the home ground of the defending champions Royal Challengers Bengaluru (RCB) hosting matches, the government cleared the way for the matches even as it will spell out conditions over the next couple of days.\nIt is speculated that spectators to be allowed against the capacity of the stadium could be brought down to have better crowd management and apply safety conditions.\nAs per convention, the defending champions will host the inaugural match of the IPL season as well as Qualifier 2 and finals. With decks cleared, it is expected that RCB, the reigning champions, will start off the IPL 2026 in Bengaluru. Incidentally, Bengaluru was host to the 2016 IPL final — before the convention was adopted — but lost the match to Sunrisers Hyderabad.\nThe State government banned cricket matches at the Chinnaswamy Stadium after 11 persons died in the stampede as the crowd surged into the stadium on June 4 when the winning RCB team was celebrating its maiden IPL victory inside the stadium.\nFollowing the fiasco, the State government, which came under intense scrutiny by the Karnataka High Court, and was embarrassed in public, banned sporting activity with spectators until safety measures were put in place.\nThe retired judge Micheal Cunha who probed the matter listed 17 recommendations to make the stadium safe for spectators. While pressure was on the State government to allow matches to be played, the government asked GBA Commissioner Maheshwar Rao to scrutinise the compliance to the Cunha committee recommendation.\nOn Thursday, Law and Parliamentary Affairs Minister H.K. Patil, when asked about the level of compliance by the Karnataka State Cricket Association (KSCA) in making the stadium safe for spectators, said that the Home Minister would be revealing the details.\n“The Home Department will issue special order revealing conditions and preparedness needed. The government took note of the Cunha Committee report and the report of expert committee, headed by Maheshwar Rao, following which the decision was taken.”\nPublished - February 12, 2026 11:30 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/karnataka/karnataka-govt-gives-conditional-clearance-to-ipl-matches-at-m-chinnaswamy-stadium/article70625630.ece",
        "date": "Thu, 12 Feb 2026 23:30:42 +0530",
        "fetched_at": "2026-02-13 04:02:55.548455"
    },
    {
        "title": "Police bust racket accused of duping senior citizen by enticing him with ‘bumper prize’",
        "content": "February 12, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 12, 2026e-Paper\nUpdated  - February 12, 2026 11:21 pm IST - KOCHI\nThe Ernakulam Rural police busted an eight-member gang of migrants accused of cheating a senior citizen of lakhs of rupees by convincing him that he had won many prizes and gift vouchers while buying a car.\nThe Nedumbassery police caught the accused from Edathala. Among the accused, four are from Delhi, three from Uttar Pradesh, and one from West Bengal.\nThe 61-year-old man from Kadungalloor was allegedly duped by the gang by convincing him that he had won special discount packages for family trips to European countries along with gift vouchers. The gang contacted him over the phone and demanded ₹6.01 lakh, claiming that it was required to avail the “bumper offer”.\nThey reportedly told him to pay ₹3 lakh in advance, assuring that further discounts would be available if he did so. Based on this, the victim paid ₹1.50 lakh. A meeting in this connection was held at a hotel in Nedumbassery. The victim lodged a police complaint after the ‘bumper offer’ was not forthcoming even after making the payment.\nThe investigation team included Inspector R. Rajesh, sub-inspectors S.S. Sreelal and Anoop T., and senior civil police officer V.P. Jinto.\nPublished - February 12, 2026 11:17 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/kerala/police-bust-racket-accused-of-duping-elderly-man-by-enticing-him-with-bumper-prize/article70624257.ece",
        "date": "Thu, 12 Feb 2026 23:21:03 +0530",
        "fetched_at": "2026-02-13 04:02:56.197513"
    },
    {
        "title": "Union Minister lauds State’s education reforms at AI Conclave in Delhi",
        "content": "February 12, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 12, 2026e-Paper\nUpdated  - February 12, 2026 11:09 pm IST - VIJAYAWADA\nUnion Minister for Education Dharmendra Pradhan at the stall put up by the Andhra Pradesh School Education Department, at the AI Conclave in Delhi on Thursday.\nUnion Minister for Education, Skill Development and Entrepreneurship Dharmendra Pradhan on Thursday appreciated the innovative initiatives introduced by the Government of Andhra Pradesh, including PAL Labs, the Mid-Day Meal programme, Clicker, Guaranteed FLN, Chatbot services, and AI-enabled face recognition system.\nA statement released by the Samagra Shiksha wing said the Minister, along with Secretary, Ministry of Education Sanjay Kumar, visited the special stall set up by the Andhra Pradesh School Education Department at the ongoing AI Conclave in New Delhi.\nAndhra Pradesh Commissioner of School Education V. Vijay Rama Raju briefed the dignitaries about the education reforms being implemented in Andhra Pradesh and the digital learning opportunities being provided to students.\nSamagra Shiksha State Project Director B. Srinivasa Rao explained the progress being achieved at the field level.\nOfficials from several States visited the stalls, observed the education reforms being implemented in Andhra Pradesh and appreciated how these reforms were being integrated with AI.\nPublished - February 12, 2026 11:08 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/union-minister-lauds-states-education-reforms-at-ai-conclave-in-delhi/article70625112.ece",
        "date": "Thu, 12 Feb 2026 23:09:01 +0530",
        "fetched_at": "2026-02-13 04:02:56.842017"
    },
    {
        "title": "Government can file FIR or move Privilege Motion, I will stand with farmers: Rahul Gandhi on criticism of U.S. trade deal",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nUpdated  - February 13, 2026 05:23 am IST - New Delhi\nLeader of Opposition in the Lok Sabha Rahul Gandhi during the Budget session of Parliament, in New Delhi, Thursday, February 12, 2026. \n                                          | Photo Credit: PTI\nLeader of Opposition in the Lok Sabha Rahul Gandhi on Thursday (February 12, 2026) said the government could file cases or move a Privilege Motion against him, but he would continue to stand with farmers, as he accused Prime Minister Narendra Modi of being “anti-farmer” and of “selling” the country through the India-U.S. interim trade deal.\n“I stand with the farmers and won’t back an inch,” Mr. Gandhi said in a video that he posted on his X handle.\nEarlier in the day, Opposition leaders including Congress president Mallikarjun Kharge protested within the Parliament complex against the trade deal as well as expressed solidarity with the general strike called by labour unions and farmers’ association.\nMPs from Samajwadi Party, DMK and Left parties also took part in the protest outside Makar Dwar of Parliament.\nIn a video statement posted online, Mr. Gandhi launched a sharp attack on the government over the agreement, alleging that there was a “chokehold” on the Prime Minister and that his “reins” were in the hands of U.S. President Donald Trump.\nFIR हो,मुकदमा दर्ज हो या Privilege प्रस्ताव लाएं - मैं किसानों के लिए लड़ूंगा।जो भी ट्रेड डील किसानों की रोज़ी-रोटी छीने या देश की खाद्य सुरक्षा को कमजोर करे, वह किसान-विरोधी है।अन्नदाताओं के हितों से किसान-विरोधी मोदी सरकार को समझौता नहीं करने देंगे। pic.twitter.com/gNVMEYFp3i\n“FIR is filed, a case is registered, or a Privilege Motion is brought — I will fight for the farmers,” he said in an X post in Hindi along with the video, adding: “Any trade deal that takes away the farmers’ livelihood or weakens the country’s food security is anti-farmer. We will not let the anti-farmer Modi government compromise on the interests of the food providers.”\nIn the video, Mr. Gandhi said farmers were the foundation of the country.\n“The Congress fought for food security and Narendra Modi has betrayed our food security and our farmers. By striking a deal with the U.S., he has sold cotton, soybean, apple and fruit farmers. For years, foreigners have been trying to capture our agriculture market,” he said, adding that Mr. Modi had opened the doors for them.\n“This is the truth, he (Modi) also knows this. He has done this as there is a chokehold on his neck. Narendra Modi’s reins are in the hands of Donald Trump,” he claimed.\nMr. Gandhi claimed that “maize, cotton, soybean and fruit farmers are only the beginning” and alleged that the Prime Minister would open the entire agriculture market to “friends like Adani, Ambani and foreign powers.”\nHe also criticised the differences prevailing between Indian and American farming systems. “American farmers have farmlands that are in acres, it is all mechanised and the government gives them subsidy. On the other hand, the farms owned by our farmers are small, they don’t get MSP and there is no mechanisation,” he said.\n“Put cases against me, abuse me, do whatever you want, file a Privilege Motion, it does not matter to me… Do whatever you want, I am standing with the farmers. I will not budge even an inch,” Mr. Gandhi said doubling down on his stance.\n“Congress president Mallikarjun Kharge ji, me, and the whole Congress are standing with the farmers. We will not let this injustice happen,” he added.\nMr. Gandhi alleged that the agreement, which he said involved removing “non-tariff barriers” on American agricultural products, posed a direct threat to India’s food security and farmers’ livelihoods. He said small farmers would not be able to compete with subsidised and mechanised American agriculture.\n“We will fight from the streets to Parliament, in every village, on every platform — protecting India’s farmers and the nation’s food security,” he said.\nAt a meeting of Lok Sabha MPs of the Congress in the evening, Mr. Gandhi lauded his colleagues for dominating the first part of the Budget session, taking on the government on  a “sell out” trade deal and urged them to take the message to the people.\nPublished - February 12, 2026 11:05 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/government-can-file-fir-or-move-privilege-motion-i-will-stand-with-farmers-rahul-gandhi-on-criticism-of-us-trade-deal/article70625515.ece",
        "date": "Fri, 13 Feb 2026 05:23:21 +0530",
        "fetched_at": "2026-02-13 04:02:57.482004"
    },
    {
        "title": "Congress demands Petroleum Minister Hardeep Singh Puri’s resignation",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nPublished - February 12, 2026 10:46 pm IST - New Delhi\nUnion Minister Hardeep Singh Puri. File\n                                          | Photo Credit: ANI\nThe Congress on Thursday (February 12, 2026) demanded the resignation of Union Petroleum Minister Hardeep Puri after his name came up in the Epstein Files.\nResponding to Mr. Puri’s explanation that he was in touch with the late Jeffrey Epstein, the disgraced financier who was charged with serious sex offences, as part of his “professional exchanges,” Congress leader Pawan Khera asked why he organised a visit for LinkedIn co-founder Reid Hoffman when there was a full-fledged Indian Embassy.\n“Hardeep Puri at that time was a retired diplomat. In what capacity was he organising Hoffman’s India visit?” Mr. Khera asked in a video that he posted on his X handle.\n“Had the Indian embassy closed down? Was the Indian Ambassador not there? Wasn’t Sushma Swaraj the External Affairs Minister? Why did Narendra Modi need the services of Hardeep Puri? And why did Narendra Modi need Epstein for Reid Hoffman’s visit?” the Congress leader added.\nThe Congress party has stepped up its attack on the Union Petroleum Minister after his name appeared in some of the mails pertaining to the Epstein Files.\nLeader of the Opposition in the Lok Sabha Rahul Gandhi has raised the issue inside and outside Parliament, even though his exact comments were removed from the Lok Sabha records.\nWhile the ruling alliance said it would bring a privilege motion against Mr. Gandhi for making “unsubstantiated allegations” against Mr. Puri, the Petroleum Minister defended his mail exchanges with Epstein as “professional.”\n“What happens in New York does not stay in New York,” Mr. Khera said on X, adding, “@HardeepSPuri must resign now!”\nPublished - February 12, 2026 10:46 pm IST\nIndia\n                    \n                            /                      \n                        \n                        ministers (government)\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/congress-demands-petroleum-minister-hardeep-singh-puris-resignation/article70625398.ece",
        "date": "Thu, 12 Feb 2026 22:46:12 +0530",
        "fetched_at": "2026-02-13 04:02:58.105510"
    },
    {
        "title": "Cabinet nod for Shakti scheme smart cards to streamline zero ticket system",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nPublished - February 12, 2026 10:33 pm IST - Bengaluru\nAt present, women passengers can avail a ‘zero ticket’ by showing any valid government-issued identity card to conductors.\n                                          | Photo Credit: FILE PHOTO\nThe Karnataka Cabinet on Thursday approved the distribution of smart cards to beneficiaries of the State’s flagship Shakti Scheme, nearly two-and-a-half years after the scheme was launched.\nSpeaking to The Hindu, Transport Minister Ramalinga Reddy said that the cards will be distributed free of cost to beneficiaries. “We are planning to distribute through the Seva Sindhu portal or through Bangalore One and Karnataka One centres upon registration. However, the rollout may take some time as the cards have to be manufactured,” Mr. Reddy said.\n“The smart card will help the government accurately record the actual number of passengers who have travelled and enable the generation of reliable data,” Mr. Reddy added.\nIntroduced on June 11, 2023, as the first of the Congress government’s five guarantees, the Shakti scheme allows women, including transgender persons and students, to travel free of cost on non-premium State-run buses. The scheme has since emerged as one of the most popular welfare initiatives in the State and even earned a place in the Golden Book of World Records for ferrying the highest number of women passengers under a free-travel programme.\nAccording to official data as of February 10, 2026, as many as 666,92,61,660 women passengers have travelled under the scheme across Karnataka. The total ticket value of women passengers travelled stands at ₹17,271,11,35,254.\nDespite its success, the smart card system, envisioned to streamline ticketing and improve data collection, had remained in the pipeline.\nAt present, women passengers can avail themselves of a ‘zero ticket’ by showing any valid government-issued identity card to conductors. However, officials said there were instances where a few passengers produced identity cards that were “not valid or duplicate” to claim zero tickets. The scheme is meant exclusively for women domiciled in Karnataka.\nAn official said that the smart card was very much necessary for the conductors also as there were cases where few conductors were also issuing zero tickets without any person travelling to show or to increase the number of passengers leading to incorrect data.\nOfficial added, “Manually verifying identity cards in crowded buses often delays conductors’ work. With smart cards, conductors can generate tickets quickly by either visually verifying the card or tapping it on the Electronic Ticketing Machine (ETM), eliminating delays caused by checking identity documents”.\nPublished - February 12, 2026 10:33 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/karnataka/cabinet-nod-for-shakti-scheme-smart-cards-to-streamline-zero-ticket-system/article70625463.ece",
        "date": "Thu, 12 Feb 2026 22:33:53 +0530",
        "fetched_at": "2026-02-13 04:02:58.750425"
    },
    {
        "title": "Did Sonam Wangchuk see videos cited as proof for detention under NSA, Supreme Court asks Govt.",
        "content": "February 12, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 12, 2026e-Paper\nPublished - February 12, 2026 10:18 pm IST - NEW DELHI\nFile image of climate activist Sonam Wangchuk. \n                                          | Photo Credit: PTI\nThe Supreme Court on Thursday (February 12, 2026) asked the Centre if climate activist Sonam Wangchuk was able to see, on his part, four videos the authorities are citing, among other clips, to justify his detention under the National Security Act (NSA).\nAppearing before a Bench of Justices Aravind Kumar and P.B. Varale, Additional Solicitor General K.M. Nataraj said the authorities banked on 23 videos to order detention, and everything was supplied to Mr. Wangchuk.\nHowever, the activist’s lawyers maintained four videos were not in the pen drive given to Mr. Wangchuk and that he has repeatedly sought the videos from the authorities.\nDuring the hearing, Mr. Nataraj submitted that the detention had prevented the violence from escalating in a sensitive border area.\nOn February 11, the court had pointed to phrases in statements made by Mr. Wangchuk expressing his anxiety about departing from the Gandhian, non-violent mode of struggle. The Centre had strongly objected to the court associating Mr. Wangchuk, whom the government counsel described as a person “completely anti-India”, with Mahatma Gandhi.\nSonam Wangchuk incited violence by referring to Nepal, Bangladesh and Arab Spring: Centre tells SC\nSolicitor General Tushar Mehta and Mr. Nataraj had disagreed with the court’s earlier proposal to relook the detention order on medical grounds. Mr. Mehta said Mr. Wangchuk’s “health facade was manufactured and synthetic”.\nThe activist has been detained in Jodhpur Central Jail for nearly five months since September 26 last year, two days after violent protests demanding Statehood and Sixth Schedule status for Ladakh left four people dead and several injured in the Union Territory.\nPublished - February 12, 2026 10:18 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/did-sonam-wangchuk-see-videos-cited-as-proof-for-detention-under-nsa-supreme-court-asks-govt/article70625399.ece",
        "date": "Thu, 12 Feb 2026 22:18:39 +0530",
        "fetched_at": "2026-02-13 04:02:59.395280"
    },
    {
        "title": "UDF will take steps to boost Kerala economy: Satheesan",
        "content": "February 12, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 12, 2026e-Paper\nPublished - February 12, 2026 10:07 pm IST - Kozhikode\nUDF activists carrying Opposition leader V.D. Satheesan on their shoulders as the UDF’s Puthyuga Yathra reached Kozhikode on Thursday night. \n                                          | Photo Credit: K. Ragesh\nThe United Democratic Front (UDF) will take steps to boost Kerala’s economy if it is voted to power in the Assembly elections, Opposition leader V.D. Satheesan has said.\nHe was addressing a public event at the Muthalakkulam Ground here on Thursday night as part of the UDF’s ‘Puthuyuga Yathra’ campaign.\nAccusing the Left Democratic Front (LDF) government of pushing people into a debt trap, Mr. Satheesan said the UDF would streamline tax administration and plug leakage from the exchequer. Government funds would be utilised to help the poor, he said. Mr. Satheesan claimed that the UDF had an alternative vision for the development of the State.\nMeanwhile, the Congress leader accused the Communist Party of India (Marxist) [CPI(M)] of pursuing a communal line. He alleged that Chief Minister Pinarayi Vijayan was resorting to majority communalism as his efforts to “appease” minorities in the Lok Sabha polls miserably failed. He was followed by senior CPI(M) leaders such as A.K. Balan and Minister for Culture Saji Cherian, who came up with condemnable communal statements. Mr. Satheesan said that no communal elements would be allowed to thrive in Kerala.\nSaluting the UDF workers who turned up for the event despite the trade union strike held on the day, he said the front would stage a miraculous victory in the next Assembly election in Kozhikode district.\nSenior Congress leader Ramesh Chennithala, who opened the event, said the LDF government would crumble in the coming days. K. Praveenkumar, Kozhikode District Congress Committee president, P.K. Kunhalikutty, Indian Union Muslim League national general secretary, and M.K. Raghavan, Kozhikode MP, said the UDF would win a majority of Assembly seats in the upcoming elections in Kozhikode.\nPublished - February 12, 2026 10:07 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/kerala/udf-will-take-steps-to-boost-kerala-economy-satheesan/article70625338.ece",
        "date": "Thu, 12 Feb 2026 22:07:50 +0530",
        "fetched_at": "2026-02-13 04:03:00.037952"
    },
    {
        "title": "PM Modi to inaugurate new PMO at ‘Seva Teerth’",
        "content": "February 12, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 12, 2026e-Paper\nUpdated  - February 12, 2026 10:11 pm IST - New Delhi\nSouth Block, New Delhi, where the last meeting of the Union Cabinet will take place on February 13, 2026. File\n                                          | Photo Credit: The Hindu\nPrime Minister Narendra Modi will on Friday (February 13, 2026) inaugurate the new Prime Minister’s Office ‘Seva Teerth’, and the Central Secretariat buildings, Kartavya Bhavan 1 and 2. The PM will also preside over the last meeting of the Union Cabinet at the South Block.\nAn era will end when the iconic North and South Blocks are vacated.\nThe North and South Blocks initially housed the British government, and were taken over by the government of independent India in 1947. They were designed by Herbert Baker, a contemporary of Edwin Lutyens, the architect of ‘Lutyen’s Delhi’.\nThe South Block houses the Prime Minister’s Office, as well as the offices of the Union Ministries of External Affairs and Defence. The North Block houses the Ministries of Home Affairs, and Finance.\nThe Prime Minister’s Office will be moved on Friday (February 13, 2026) to the newly built ‘Seva Teerth’ complex.\n‘Seva Teerth’ will also house the National Security Council Secretariat and the Cabinet Secretariat, all of which were previously situated across different locations.\nKartavya Bhavan 1 and 2 house several key Ministries, including the Ministries of Finance, Defence, Health and Family Welfare, Education, Corporate Affairs, Culture, Law and Justice, Information and Broadcasting, Agriculture and Farmers Welfare, Chemicals and Fertilizers, and Tribal Affairs.\nBoth building complexes feature digitally integrated offices, structured public interface zones, and centralised reception facilities. Designed in accordance with 4-Star GRIHA standards, the complexes incorporate renewable energy systems, water conservation measures, waste management solutions, and high-performance building envelopes.\n“The inauguration marks a transformative milestone in India’s administrative governance architecture and reflects the Prime Minister’s commitment to building a modern, efficient, accessible and citizen-centric governance ecosystem,” an official statement said here.\n“For decades, several key government offices and Ministries functioned from fragmented and ageing infrastructure spread across multiple locations in the Central Vista area. This dispersion led to operational inefficiencies, coordination challenges, escalating maintenance costs and sub-optimal working environments. The new building complexes address these issues by consolidating administrative functions within modern, future-ready facilities,” it said.\nThe new complexes also feature comprehensive safety and security frameworks, including smart access control systems, surveillance networks, and advanced emergency response infrastructure, ensuring a secure and accessible environment for officials and visitors.\nPublished - February 12, 2026 09:42 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/pm-modi-to-inaugurate-new-pmo-at-seva-teerth/article70625000.ece",
        "date": "Thu, 12 Feb 2026 22:11:38 +0530",
        "fetched_at": "2026-02-13 04:03:00.676193"
    },
    {
        "title": "Middle class expanded, economy grew: Finance Minister",
        "content": "February 12, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 12, 2026e-Paper\nPublished - February 12, 2026 09:29 pm IST - New Delhi\nUnion Finance Minister Nirmala Sitharaman speaks in the Rajya Sabha during the Budget session of Parliament, in New Delhi, Thursday, February 12, 2026.\n                                          | Photo Credit: -\nNaysayers who claim the Indian economy is dead are mocking at the people of India, who are contributing to India’s growth, Union Finance Minister Nirmala Sitharaman said here on Thursday while replying to the debate on the general Budget in Rajya Sabha. She said growth without inflation is an achievement of the entire country. “That is, you are having a good, high rate of growth of the GDP, and there is a low inflation, which is being held at that kind of a level continuously,” she said.\nApparently referring to a recent statement of Opposition Leader in Lok Sabha Rahul Gandhi that the country’seconomy is dead, she said there is no way anyone can decry saying, “Oh no, but this economy is probably dead. “This economy is not really doing well. These kinds of nay-sayers are only mocking at the people of India, who are really doing their bit to contribute to India’s growth,” the Finance Minister added.\nShe said high growth and low inflation is a unique balance in the economy and it was not a rare coincidence as the Union Government undertook tremendous efforts, detailed planning and timely action to achieve this milestone. “This gives us the confidence for planning for next two decades,” she said.\nShe countered the charges that middle class is being suppressed to achieve high tax collection. “There is no evidence of middle-class suppression. Actually, there is enough and more evidence of historic middle-class expansion and formalisation driven by the economic reforms that have been undertaken in the last ten years. High personal income tax collection is not necessarily the middle class being crushed,” she said.\nThe Finance Minister said there are more people with taxable income and more income is visible in the formal sector. “So, the economy is no longer narrow, and it’s not just confined to the elite. The middle-class basket is widening. Between 2013-14 and 2024-25, the number of taxpayers, that is, people filing returns or TDS deducted, rose from 5.26 crore to 12.13 crore,” she said claiming the largest structural expansion of the middle class in this country. “People are coming on board to pay, and coming on board to pay not because we are bringing more rates,” she said.\nShe said inflation is also at a historical low. “So, somewhere middle class suppressed cannot coexist with real incomes rising and with record low inflation. And there is an upward mobility of the workforce as well,” she said.\nPublished - February 12, 2026 09:29 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/middle-class-expanded-economy-grew-finance-minister/article70625205.ece",
        "date": "Thu, 12 Feb 2026 21:29:32 +0530",
        "fetched_at": "2026-02-13 04:03:01.314772"
    },
    {
        "title": "Railway Minister promises to consider more stops for  trains between Chingavanam and Ernakulam",
        "content": "February 12, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 12, 2026e-Paper\nPublished - February 12, 2026 08:59 pm IST - KOTTAYAM\nIn a major relief to rail commuters, Union Railway Minister Ashwini Vaishnaw has promised to consider the demand to grant stops for various trains, including the newly introduced special MEMU service from Kollam, at various railway stations between Chingavanam and Ernakulam, according to K. Francis George, MP from Kottayam.\nThe assurance was given during a meeting in which the MP directly discussed various railway-related issues with the Railway Minister.\nWhile the new MEMU has been allotted stops at all halt stations between Kollam and Changanassery, the exclusion of stations such as Chingavanam, Kuruppanthara, Kaduthuruthy, Kanjiramattom and Chottanikkara amounts to serious discrimination, the MP informed the Minister.\nThe MP also pointed out that the newly introduced train is currently operating with insufficient compartments, resulting in severe overcrowding. Passengers are forced to travel in extremely congested conditions, with hardly any standing space. The MP also requested that necessary steps be taken to ensure service on all days of the week.\nPointing out that the Kottayam railway station is equipped with all essential basic facilities and has six platforms,  Mr. George also urged the Minister for new trains originating from Kottayam and that services currently terminating at Ernakulam be extended to Kottayam.\nMr. George also demanded additional stops at stations within the constituency, inclding stops for the Ernakulam–Kayamkulam MEMU passenger at Ettumanur, Kuruppanthara, Vaikom Road, and Mulanthuruthy; for the Venad Express at Vaikom Road; for the Vanchinad and Malabar Express trains at Ettumanur; and for the Velankanni Express at Kuruppanthara.\nThe Railway Minister has also assured that the remaining construction works of the second entrance at the Kottayam railway station will be completed within a month and opened to the public, the MP said.\nPublished - February 12, 2026 08:59 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/kerala/railway-minister-promises-to-consider-more-stops-for-trains-between-chingavanam-and-ernakulam/article70624150.ece",
        "date": "Thu, 12 Feb 2026 20:59:28 +0530",
        "fetched_at": "2026-02-13 04:03:01.979468"
    },
    {
        "title": "Govt. launches ‘Happy Sunday’ to foster neighbourhood bonds",
        "content": "February 12, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 12, 2026e-Paper\nPublished - February 12, 2026 08:58 pm IST - AMARAVATI\nThe Government of Andhra Pradesh has launched ‘Happy Sunday’, a community-led urban happiness and neighbourhood engagement movement, across all Urban Local Bodies (ULBs) in the State, aiming to promote citizen participation and strengthen neighbourhood bonds.\nOrders were issued through G.O. Rt. No. 157 of the Municipal Administration & Urban Development (MA&UD) Department on February 12, 2026.\nThe initiative seeks to enhance emotional well-being, encourage physically active lifestyles, and foster social cohesion by activating public spaces such as streets and parks for community interaction.\nResident Welfare Associations, apartment associations and local community groups will lead the voluntary, non-commercial activities, while ULBs will act only as facilitators by providing permissions, basic logistical support and safety coordination.\nProgrammes will generally be organised on the second and fourth Sundays of every month for two to three hours during early mornings. Activities may include wellness sessions, sports, cultural events, environmental drives and learning circles, ensuring inclusive participation across age groups.\nChief Minister N. Chandrababu Naidu said the initiative aligns with the vision of building people-first cities that strengthen social relationships alongside infrastructure.\nMA&UD Principal Secretary S. Suresh Kumar, in a press release, emphasised that the movement depended on active community leadership. Minister for MA&UD Ponguru Narayana described it as a new chapter in participatory urban governance.\nThe programme will commence State-wide from February 22, 2026.\nPublished - February 12, 2026 08:58 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/govt-launches-happy-sunday-to-foster-neighbourhood-bonds/article70624499.ece",
        "date": "Thu, 12 Feb 2026 20:58:09 +0530",
        "fetched_at": "2026-02-13 04:03:02.639268"
    },
    {
        "title": "Delhi cops quiz Penguin staff on Naravane book pre-print 'leak'",
        "content": "Raj Shekhar Jha is a journalist for the Times of India with over a decade of experience in reporting on national security, terrorism, crime and prisons.",
        "link": "https://timesofindia.indiatimes.com/india/delhi-cops-quiz-penguin-staff-on-naravane-book-pre-print-leak/articleshow/128282335.cms",
        "date": "2026-02-13T06:21:40+05:30",
        "fetched_at": "2026-02-13 04:03:04.679207"
    },
    {
        "title": "MK Stalin's Big Pre-Poll Move: Rs 5,000 Each For 1.3 Crore Women Under Kalaignar Scheme",
        "content": "Tamil Nadu Chief Minister MK Stalin on Friday announced the disbursal of Rs 5,000 to women beneficiaries under the Kalaignar Women’s Rights Scheme, describing it as part of his government’s ongoing commitment to women’s welfare.\nIn a post on X, Chief Minister Stalin emphasised that the payments, covering February, March, and April, include Rs 3,000 as the standard monthly allocation and an additional Rs 2,000 as a “summer special\" bonus. He stated that the funds have already been credited to 1.31 crore women under the scheme.\n“This promise given by this Stalin to Tamil Nadu women is the rights allocation. No matter who imposes obstacles, I will not back down from it. Using elections as an excuse, they are trying to stall the rights allocation for three months. What was promised was by our #DravidianModel government! As advance for February, March, April months: ₹3 thousand + as summer special allocation: ₹2 thousand!,\" he tweeted.\nStalin described the scheme as a hallmark of the Dravidian Model government, asserting that attempts to delay the disbursement by three months, allegedly citing elections as an excuse, would not deter his administration. “No matter who imposes obstacles, I will not back down from it,\" he wrote, highlighting his commitment to the programme.\nThe DMK leader also promised that in the proposed Dravidian Model 2.0, the monthly rights allocation would increase from Rs 1,000 to Rs 2,000, reinforcing his focus on expanding financial support to women. He concluded the post with a message of solidarity and electoral confidence, urging women to support the party in the upcoming assembly elections.\nThe tweet comes ahead of the Tamil Nadu assembly elections scheduled later this year, with Stalin’s government seeking to highlight welfare measures targeted at women as a key campaign plank.\nLatest Blogs",
        "link": "https://www.news18.com/india/stalin-credits-rs-5000-to-1-3-crore-women-under-kalaignar-scheme-promises-hike-in-allocation-ws-l-9900228.html",
        "date": "Fri, 13 Feb 2026 09:08:04 +0530",
        "fetched_at": "2026-02-13 04:03:08.180222"
    },
    {
        "title": "Can You Be Penalised For Playing Loud Music On A Flight? Here's What Government Says",
        "content": "Playing loud music on an aeroplane without earphones may lead to penal action if such actions lead to unruly behaviour under aviation rules. Replying to a question raised in the Lok Sabha by Namakkal MP Matheshwaran, Minister of State for Civil Aviation Murlidhar Mohol said the action will be taken as per the Civil Aviation Requirements (CAR) issued by the DGCA.\nThe Directorate General of Civil Aviation (DGCA) issued CAR to deal with unruly passengers.\nWithout indicating any new penal provisions for people playing loud music on the aircraft, the minister clarified that the airlines provide in-flight entertainment and play soft instrumental music during boarding and disembarkation.\nHe further highlighted Rules 22, 23, and 29 of the Aircraft Rules of 1937 that cover disruptive behaviour on board an aircraft.\nRule 22 deals with refusal of carriage and disembarkation of passengers, Rule 23 empowers the pilot-in-command to restrain persons acting in a manner prejudicial to safety or good order, and Rule 29 provides for penalties for contravention of the Aircraft Rules.\nThe minister also responded to a query related to vlogging inside an aeroplane and underscored Rule 13 of the Aircraft Rules which restricts photography at DGCA-licensed aerodromes.\nLatest Blogs",
        "link": "https://www.news18.com/india/playing-loud-music-on-flight-an-offence-heres-what-government-says-ws-be-9899313.html",
        "date": "Thu, 12 Feb 2026 19:25:43 +0530",
        "fetched_at": "2026-02-13 04:03:09.932322"
    },
    {
        "title": "CNBC AWAAZ Sweeps Budget Day, Leads FM Speech And Budget Week Ratings",
        "content": "Cementing its position as the market leader in Hindi business news, CNBC AWAAZ emerged as the go-to destination for investors and market watchers during the Union Budget 2026 coverage.\nAccording to BARC data, CNBC AWAAZ captured a dominant 63% market share during the live telecast of Finance Minister Nirmala Sitharaman’s Budget speech on 1st February 2026, significantly outperforming Zee Business, which stood at 37%.\n(Source: BARC | MKT: HSM Urban | TG: 22-40 M | Period: 1st Feb 2026(1100-1230)\nThe leadership extended across the full Budget Day as well. On 1st February 2026, CNBC AWAAZ secured a 61.3% market share, while Zee Business registered 38.7%, highlighting CNBC AWAAZ’s dominance during one of the most competitive and high-stakes news events of the financial calendar. (Source: BARC | MKT: HSM Urban | TG: 22-40 M | Period: 1st Feb 2026)\nBudget Day traditionally drives intense viewer engagement, as audiences track policy announcements, taxation reforms, sectoral allocations, fiscal discipline measures, and their real-time impact on markets. CNBC AWAAZ’s comprehensive coverage, blending expert analysis, corporate voices, and live market decoding, resonated strongly with its core audience of investors and traders.\nThe momentum carried into Budget Week, where CNBC AWAAZ maintained a commanding lead with a 76.4% market share, compared to Zee Business at 23.6%,  less than half of CNBC AWAAZ’s share, reaffirming sustained viewer preference beyond the headline announcements. (Source: BARC | MKT: HSM 10L+ | TG: 22-40 M | Period: Wk 05’26)\nOn the digital front as well, CNBC AWAAZ emerged among the world’s top-viewed live news streams on Union Budget Day 2026. During the peak live window between 11:00 am and 12:40 pm, the channel emerged as the clear leader in digital viewership, registering a peak concurrency of 765.1K, recording 3.5x the viewership of Zee Business, highlighting its growing cross-platform strength. (Source: Databeings)\nWith sustained leadership across key market hours and critical policy moments, CNBC AWAAZ continues to strengthen its position as India’s most-watched Hindi business news channel, setting new benchmarks  year after year.\nLatest Blogs",
        "link": "https://www.news18.com/india/cnbc-awaaz-sweeps-budget-day-leads-fm-speech-and-budget-week-ratings-9899245.html",
        "date": "Thu, 12 Feb 2026 18:16:16 +0530",
        "fetched_at": "2026-02-13 04:03:10.728545"
    },
    {
        "title": "The Big Rafale Deal: How G2G Model Fast-Tracks India’s Largest Defence Acquisition",
        "content": "India has finalised one of its most significant defence acquisitions ever — a proposed Rs 3.25 lakh crore agreement with France to procure 114 additional Dassault Rafale fighter jets for the Indian Air Force (IAF). The deal, cleared by the Defence Acquisition Council (DAC) ahead of French President Emmanuel Macron’s visit to New Delhi next week, will dramatically expand India’s air combat strength and transform its aerospace industrial base.\nFor Indian pilots and planners, this procurement represents a pivotal leap in capability. The Rafale, a 4.5-generation multi-role fighter with integrated electronic warfare systems, advanced sensors, and precision weapons, has already proven itself in demanding operational conditions. Its deployment in recent missions and drills has reinforced confidence in its performance.\nA key feature of the deal is the use of a direct Government-to-Government (G2G) framework between New Delhi and Paris — a model similar to the earlier Rafale acquisition a decade ago, which is seen within defence circles as faster, cleaner and more predictable than traditional multi-vendor tenders. This approach is expected to significantly cut procedural delays that often slow down large defence procurements.\nThe G2G framework bypasses much of the bureaucratic layering. Instead of negotiating with multiple vendors, India negotiates directly with the French government, which then guarantees delivery through Dassault Aviation. This dramatically cuts procedural timelines and reduces the risk of future cancellations.\nThe supplying government, meanwhile, effectively stands behind the contract. This offers clearer pricing structures, state-backed performance guarantees, and better accountability on timelines\nUnder the current proposal, 18 Rafales would be delivered from France, while the remaining 96 are slated for final assembly and manufacture in India. Officials have stressed that this arrangement will not only enhance India’s combat fleet but also catalyse skilled jobs, robust supply chains, and long-term growth of the domestic aerospace sector.\nCrucially, the deal is designed to integrate Indian weapons systems into the Rafale platform, ensuring that indigenous technologies and armaments work seamlessly with the new jets — a requirement New Delhi has underscored during negotiations.\nThe pact also envisages substantial technology transfer from Dassault Aviation and its partners to Indian firms participating in production and support. Tata Advanced Systems, for example, has already signed production transfer agreements with Dassault to manufacture key structural parts — the first time such components will be made outside France — marking a milestone under the “Make in India\" initiative.\nIndian defence planners see this acquisition as a force multiplier, bridging capability gaps while indigenous fighters such as HAL Tejas and future platforms like the Advanced Medium Combat Aircraft (AMCA) mature. Once concluded and fully implemented, the deal will turn the Rafale from an imported asset into a partly Indian-made cornerstone of India’s combat aviation fleet.\nLatest Blogs",
        "link": "https://www.news18.com/india/the-big-rafale-deal-how-g2g-model-fast-tracks-indias-largest-defence-acquisition-ws-l-9898206.html",
        "date": "Thu, 12 Feb 2026 15:08:26 +0530",
        "fetched_at": "2026-02-13 04:03:13.042569"
    },
    {
        "title": "'Emphasised On Reform Express': PM Modi Praises Nirmala Sitharaman’s Reply On Budget In Lok Sabha",
        "content": "Prime Minister Narendra Modi on Thursday lauded Finance Minister Nirmala Sitharaman’s reply in Lok Sabha on Union Budget. In a social media post, PM Modi said Sitharaman outlined this year’s budget and emphasised on “Reform Express.\"\n“In her speech in the Lok Sabha, Finance Minister Smt. Nirmala Sitharaman Ji gave a comprehensive picture of how this year’s Budget will contribute to our nation’s economic transformation. She emphasised on Reform Express, the support to MSMEs, skilling, push to next-gen infrastructure, efforts to boost healthcare, education and more,\" PM’s post on X reads.\nIn her speech in the Lok Sabha, Finance Minister Smt. Nirmala Sitharaman Ji gave a comprehensive picture of how this year’s Budget will contribute to our nation’s economic transformation. She emphasised on Reform Express, the support to MSMEs, skilling, push to next-gen…— Narendra Modi (@narendramodi) February 12, 2026\nReplying to the debate in Lok Sabha on the Union Budget 2026-27, Union Finance Minister reiterated the government’s commitment to strengthening rural and agricultural sectors along with other areas. She began her speech by stressing on the importance of this year’s budget. “This budget is a budget which is prepared as the first budget that is prepared in the second quarter of the 21st century. Therefore, this budget includes various components from 2026 to 2050. We are also starting the new five-year cycle of new finance commission. The budget is largely based on the recommendations of the commission,\" Sitharaman said.\nShe also outlined various government initiatives, including skilling and infrastructure investment. The Budget 2026 has increased public capex from Rs 11.2 lakh crore in BE 2025-26 to Rs 12.2 lakh crore in FY2026-27, she said.\n“We have said that instead of waiting to qualify and finishing your education and coming out and seeking where should they go for acquiring skills, the skilling element can be brought into education itself and at the end of the day when they come out, students can say I can become an entrepreneur and this kind of a mega centre can be kept next to any industrial cluster that any state has,\" she said.\nLok Sabha took up discussion on the Union Budget on Wednesday. Sitharaman is expected to reply to the debate in the Rajya Sabha on Thursday.\nLatest Blogs",
        "link": "https://www.news18.com/india/emphasised-on-reform-express-pm-modi-praises-nirmala-sitharamans-reply-on-budget-in-lok-sabha-ws-bl-9898117.html",
        "date": "Thu, 12 Feb 2026 14:48:46 +0530",
        "fetched_at": "2026-02-13 04:03:14.014180"
    },
    {
        "title": "'Conspiracy, Clearance Bypassed’: FIR In Ex-Army Chief’s Book Leak Puts Focus On Overseas Sales",
        "content": "The controversy surrounding the former Army chief’s book has deepened, with sources indicating that the publication was allegedly released without mandatory clearance from the Ministry of Defence (MoD) and first sold on online platforms in Canada, Australia, Germany and the United States.\nAccording to sources, the initial investigation following the registration of a case points to a “well-planned conspiracy\". It is learnt that the book was leaked in a coordinated manner, bypassing the MoD’s mandatory clearance process for publications involving serving or former defence personnel.\nAlso Read: ‘This Is The Status’: Gen Naravane Shares Publisher’s Posts In First Response To Memoir Row\nInvestigators have found that copies of the book began circulating on online platforms in Canada, Australia, Germany and the US before surfacing elsewhere. Sales are said to have started in these countries first, raising questions about the publishing and distribution chain.\nThe Special Cell has registered an FIR under sections pertaining to criminal conspiracy. The scope of the probe has now been expanded internationally, covering the US, Canada, Germany and Australia.\nA thorough investigation into the digital trail, publishing network and possible international links is currently underway. Sources said the probe is intensifying, with agencies examining overseas connections and coordination in the alleged leak and distribution of the book.\nAlso Read: ‘No Copies Published’: Penguin India On Row Over Circulation Of Ex-Army Chief’s Pre-Print Book\n\n\nDelhi Police’s Special Cell questioned members of Penguin India’s team on Thursday, following a notice issued to the publisher over its earlier statement on the book controversy. The questioning lasted for approximately two hours.\nThe Special Cell had served a notice seeking responses to specific queries and summoned representatives of the publishing house for examination. During the session, the team was reportedly asked around 15 questions.\nSources said some of the queries were answered during the questioning, while the Penguin India team sought additional time to respond to the remaining questions. The Special Cell is now expected to examine and analyse the responses submitted by the publisher.\nAlso Read: Penguin Random House India Receives Delhi Police Notice Over Leak Of General Naravane’s Memoir\n\n\nAmid the row, Penguin Random House India, which holds the publishing rights to Four Stars of Destiny, issued a clarification stating that the book has not been published in any format.\nThe publisher said that an announced title, a pre-order listing nd a published book are distinct stages, and that a book is considered published only when it is available for purchase across retail channels.\nIt further stated that no copies — in print or digital form — have been officially released, and warned that any material currently in circulation would amount to copyright infringement.\n\n\nThe entire row over the book erupted in Parliament when the Leader of the Opposition Rahul Gandhi referred to the alleged contents of General (Retd.) MM Naravane’s unpublished memoir and displayed what he claimed was a copy of the book in the Lok Sabha.\nHis remarks triggered strong objections from treasury benches, with BJP leaders questioning how an unpublished manuscript was accessed and cited in the House. The episode led to heated exchanges, walkouts and demands for clarification, bringing the status of the book’s publication and its alleged leak into sharp political focus.\n\n\nLatest Blogs",
        "link": "https://www.news18.com/india/conspiracy-clearance-bypassed-fir-in-ex-army-chiefs-book-leak-puts-focus-on-overseas-sales-ws-l-9898034.html",
        "date": "Thu, 12 Feb 2026 14:22:23 +0530",
        "fetched_at": "2026-02-13 04:03:14.982845"
    },
    {
        "title": "PM Modi To Inaugurate Seva Teerth And Kartavya Bhavan 1 And 2 On Feb 13",
        "content": "Prime Minister Narendra Modi is set to inaugurate the Seva Teerth, the new building of the Prime Minister’s Office, and Kartavya Bhawan 1 and 2, on February 13. The inauguration of the new buildings will mark a transformative milestone in India’s administrative governance architecture.\nAccording to a statement released by the Prime Minister’s Office, the structures also reflect PM Modi’s commitment to building a modern, efficient, accessible, and citizen-centric governance ecosystem.\nThe development came decades after several key government offices and ministries functioned from fragmented and ageing infrastructure spread across multiple locations in the Central Vista area causing operational inefficiencies, coordination challenges.\nThe old structures, with time, escalated maintenance costs and sub-optimal working environments. The new building complexes address these issues by consolidating administrative functions within modern, future-ready facilities, the statement added.\nSeva Teerth houses the Prime Minister’s Office, the National Security Council Secretariat, and the Cabinet Secretariat, all of which were previously located across different locations.\nMeanwhile, Kartavya Bhavan 1 and 2 will accommodate law, defence, finance, health, agriculture, and several other key ministries.\nIt has been learnt that the new building complexes feature digitally integrated offices, structured public interface zones and centralised reception facilities.\nThe building are designed in accordance with 4-Star GRIHA standards and will focus on incorporating renewable energy systems, water conservation measures, waste management solutions and high-performance building envelopes.\nThese measures significantly reduce environmental impact while enhancing operational efficiency, the PMO said.\nNotably, the building complexes will use comprehensive safety and security frameworks, such as smart access control systems, surveillance networks. It will also accomodate advanced emergency response infrastructure, ensuring a secure and accessible environment for officials and visitors.\n(With agency inputs)\nLatest Blogs",
        "link": "https://www.news18.com/india/pm-modi-to-inaugurate-seva-teerth-and-kartavya-bhavan-1-and-2-on-feb-13-9898036.html",
        "date": "Thu, 12 Feb 2026 14:10:52 +0530",
        "fetched_at": "2026-02-13 04:03:15.981816"
    },
    {
        "title": "Bihar ‘Paralysis Village’: Patients In Every Hamlet, Deaths Rise As Public Anger Mounts",
        "content": "A shocking health situation has emerged in Korjana village of Bihar’s Begusarai district, where residents claim a rising number of paralysis cases and deaths over the past year. Villagers allege that despite repeated incidents and mounting concern, authorities, from block-level officials to the local MLA, have not taken adequate notice of the situation.\n\n\nAccording to locals, the village has witnessed a sharp increase in paralysis cases, particularly in the last six months. Residents say more than five people in nearly every hamlet have been affected, and several families have performed last rites for relatives during this period.\nThe growing number of cases has led villagers to refer to Korjana as ‘Paralysis Village’.\nA team from Local18 visited the village to understand the ground reality. During the visit, residents spoke about sudden illnesses, rising treatment expenses, and what they describe as a lack of timely government intervention, raising serious questions about healthcare monitoring and administrative response in the area.\n\n\nOne of the villagers, Kiran Devi, said her father-in-law suddenly suffered a brain haemorrhage, after which he became paralysed. The family is arranging treatment on their own, but she believes timely government assistance could save his life.\nAnother villager, Pavitri Devi, who is battling paralysis, explained that her hands and feet gradually stopped functioning. She now travels to Chakva for treatment, as most patients from the village reportedly do. Despite this, lives continue to be lost. Speaking to Local18, she broke down in tears, alleging that officials remain unmoved by their suffering.\nDulari Devi stated that many paralysis cases have emerged in the last six months, yet no government aid has reached the village. Similarly, Badam Devi said she was suddenly struck by paralysis and did not even realise when the illness took hold.\nRanjay Yadav pointed out that having more than five paralysis patients in a single neighbourhood is highly unusual. Amarjeet Kumar Yadav echoed the same concern. Sanju Devi added that people from neighbouring villages now visit Korjana to witness the alarming situation themselves.\n\n\nA young villager, Dilkhush, said his grandfather’s treatment has already cost the family around Rs 50,000. They sought help from private hospitals in Chakva and Samastipur, yet no government doctor has visited Korjana so far.\nDai Rani, whose mother-in-law died after suffering from paralysis, claimed that most deaths have occurred within the past six months.\nDuring the course of reporting, another villager, Dunia Lal, reportedly died within three days of being paralysed.\nMost of the affected individuals are above 40 years of age.\n\n\nVillagers insist that no health department team has visited the area, nor has any formal investigation been initiated. They question why the Block Medical Officer is unaware of deaths and illnesses that have been occurring for nearly a year.\nIf a health sub-centre exists in the village, residents ask why no health assessment has been conducted. They also question whether the Block Development Officer (BDO) has fulfilled their responsibilities, or if their role has been limited to sanctioning funeral assistance.\nThe biggest concern raised by villagers is whether the local MLA has forgotten the community after securing votes.\n\n\nFrustration has led some residents to bitterly refer to Korjana as both ‘Paralysis Village’ and ‘Funeral Village’. Numerous questions are being directed at officials ranging from the BDO to the MLA, yet answers remain elusive.\n\n\nWhether the illness is the result of a mysterious disease or administrative negligence remains unclear and requires urgent investigation. Until the truth emerges, fear and mistrust towards the system will continue to grow in Korjana.\nThe central question remains: has empathy disappeared from governance, or are authorities simply waiting for a major inquiry before taking action?\nLatest Blogs",
        "link": "https://www.news18.com/india/bihar-paralysis-village-patients-in-every-hamlet-deaths-rise-as-public-anger-mounts-ws-l-9897732.html",
        "date": "Thu, 12 Feb 2026 13:17:15 +0530",
        "fetched_at": "2026-02-13 04:03:16.708977"
    },
    {
        "title": "News18 Afternoon Digest: BJP Seeks Suspension Of Rahul Gandhi's Parliament Membership; Bangladesh Elections & More",
        "content": "In today’s afternoon digest, News18 brings you the latest updates on the ongoing Parliament budget session, Bangladesh elections 2026, and more.\n‘Rahul Gandhi’s Membership Should Be Cancelled’: BJP Submits Notice Amid Parliament Row\nBJP MP Nishikant Dubey said there is no plan to move a privilege motion against Leader of the Opposition Rahul Gandhi. However, he has sought the suspension of Rahul Gandhi’s membership from the Indian Parliament and brought a substantial motion against him on Thursday. Read More\nCongress MPs Entered Speaker’s Chamber, Threatened Him: Kiren Rijiju Shares Video\nUnion Minister Kiren Rijiju on Thursday shared a video from inside the Chamber of the Lok Sabha Speaker Om Birla, alleging that a large group of Congress MPs abused him and threatened Prime Minister Narendra Modi ahead of the face-off between the Opposition and the government in Parliament on February 4. Read More\nTobacco Tycoon’s Son Shivam Mishra Arrested Four Days After Kanpur Lamborghini Crash\nShivam Mishra, son of tobacco businessman KK Mishra, was eventually arrested on Thursday in connection with the Kanpur Lamborghini crash that left six people injured, after a court rejected the surrender plea of a man claiming to be the driver at the time of the accident. Read More\n‘New Bangladesh Begins Today’: Muhammad Yunus Casts Vote In Political Reset\nBangladesh voted on Thursday in a crucial election held after the fall of Sheikh Hasina’s government, with Interim Government Chief Adviser Professor Muhammad Yunus casting his vote in the capital. Read More\nUN Report Links JeM To Delhi’s Red Fort Blast, Warns Group Remains Active | Exclusive\nA United Nations Security Council (UNSC) monitoring report has flagged continued activity by South Asia-based jihadist groups, including Jaish-e-Mohammed (JeM), despite years of sanctions, financial curbs and international pressure. Read More\nNamibia Look To ‘Fight Hard’ Against Injury-Stricken India At Kotla\nFacing the menacing associate teams has been anything but a cakewalk for the giants in this World Cup and defending champions India have already experienced that firsthand. Read More\nAditya Dhar To Reunite With Ranveer Singh For A Mythological Drama: Report\nAditya Dhar is reportedly gearing up for a new mythological action film, and actor Ranveer Singh is likely to star in the project. According to recent reports, Dhar has renewed his first-look deal with Jio Studios and is currently developing a large-scale mythological venture. Read More\nLatest Blogs",
        "link": "https://www.news18.com/india/news18-afternoon-digest-bjp-seeks-suspension-of-rahul-gandhis-parliament-membership-bangladesh-elections-more-ws-l-9897696.html",
        "date": "Thu, 12 Feb 2026 12:38:24 +0530",
        "fetched_at": "2026-02-13 04:03:17.444294"
    },
    {
        "title": "Arunachal Dam Project Gets Eco Go-Ahead After 3 Decades, At The Cost Of 23 Lakh Trees | Exclusive",
        "content": "The Centre’s expert panel has recommended environmental clearance for the Kamala hydroelectric project, a 1,720-MW storage dam proposed in the forested districts of Arunachal Pradesh.\nThree decades in the making, the dam project, however, comes with strong warnings over large-scale deforestation and the need for strict ecological safeguards as more than 23 lakh trees will have to be felled.\nThe dam project – proposed by NHPC Ltd – involves the construction of a concrete gravity dam at a height of 216 metres on Kamala River, which is a tributary of the Subansiri and part of the Brahmaputra basin.\nThe dam and its reservoir will spread across 3,858 hectares in Kamle, Kra Daadi and Kurung Kumey districts, most of which are covered by dense forests.\nAfter recently examining the proposal, the expert appraisal committee (EAC) noted that the dam project is in category ‘A’ of the Environmental Impact Assessment Notification, 2006 – this requires clearance at the central level.\nWhile recommending approval, the EAC flagged what it called a serious environmental concern: the proposed felling of over 23 lakh trees.\n“The project is located in a very dense forest area,\" the committee observed, stressing that such large-scale deforestation will require carefully planned mitigation and ecosystem restoration measures.\nIt said a detailed action plan must be prepared in consultation with state forest and wildlife departments, ecological experts and local communities before forest clearance can be considered.\nThe social footprint is also significant. According to official documents, 126 villages across three districts will be affected with at least 30,000 people living in the impacted area.\nThe broader study area covers 377 villages across four districts. The NHPC, however, has argued that the project serves strategic and economic goals.\nDesigned as a storage-based hydropower project, the Kamala dam is expected to provide daily peaking power and play a role in flood moderation in the downstream Brahmaputra basin. The design includes a 15-metre flood cushion above the full reservoir level to help manage monsoon floods.\nThe project has been in the pipeline for nearly three decades with initial investigations carried out by the Brahmaputra Board in 1996. This was followed by feasibility and detailed project reports by NHPC in 2004. Several alternative dam sites and designs were examined before the current alignment was finalised, with engineers citing better geology and safety as key reasons for the final choice.\nThe estimated cost of the Kamala hydroelectric project is Rs 23,764 crore. While the EAC’s recommendation clears a key regulatory hurdle, final forest clearance remains pending.\nEnvironmental groups and local residents are expected to closely monitor the next steps, as the project moves from paper approvals to decisions that will reshape large swathes of Arunachal Pradesh’s forest landscape.\nLatest Blogs",
        "link": "https://www.news18.com/india/arunachal-dam-project-gets-eco-go-ahead-after-3-decades-at-the-cost-of-23-lakh-trees-exclusive-ws-l-9897076.html",
        "date": "Thu, 12 Feb 2026 08:30:16 +0530",
        "fetched_at": "2026-02-13 04:03:18.219484"
    },
    {
        "title": "'Unauthorised': BJP Assam Sacks Social Media Member After AI Video Shows Himanta Aiming Gun At Men",
        "content": "The Assam unit of the Bharatiya Janata Party (BJP) removed one of four co-conveners from its social media department following backlash over a video that depicted Chief Minister Himanta Biswa Sarma aiming a rifle at two men, one of whom bears resemblance to Congress MP Gaurav Gogoi.\nThe video, posted last Saturday on the official X (formerly Twitter) handle of Assam BJP with the caption “Point blank shot\", was deleted the following day. The post showed digitally manipulated images of the Chief Minister appearing to shoot at a photograph of the two men, concluding with an image of Himanta Biswa Sarma dressed as a cowboy wielding a gun.\nAssam BJP president Dilip Saikia confirmed the removal to The Indian Express, characterizing the post as an “immature\" and “unauthorised\" action.\n“The party is concerned about illegal immigrant Bangladeshis in Assam, and for that, there has to be a movement in the society. But the party does not support the idea of a mala fide intent of targeting Muslims with bullets. It was mishandled by an immature and unauthorised person,\" Saikia stated.\nChief Minister Himanta Biswa Sarma distanced himself from the video, claiming no prior knowledge of its creation or posting.\n“We have registered an FIR,\" he said, referring to a complaint filed by Congress MLAs, adding, “In fact, one of our BJP people has also filed a case, saying that this is a video about which we are angry because in Assam, everybody knows that we are not against Assamese Muslims. We are against Bangladeshi Muslims, whom we call Miya Muslims.\"\nThe controversy marks the second time in recent months that the Assam BJP’s X handle has faced scrutiny. In September 2025, the account posted an AI-generated video titled “Assam without BJP\", accompanied by text references to “beef legalisation\" and “illegal immigrants.\" The Supreme Court subsequently issued a notice in October on a petition seeking removal of the video.\nLatest Blogs",
        "link": "https://www.news18.com/india/unauthorised-bjp-assam-sacks-social-media-member-after-ai-video-shows-himanta-aiming-gun-at-men-ws-l-9896997.html",
        "date": "Wed, 11 Feb 2026 23:54:54 +0530",
        "fetched_at": "2026-02-13 04:03:18.953604"
    },
    {
        "title": "Drive To ‘Jai Ho’: Mumbai Melody Road Opens On Coastal Route, Fadnavis Hints At More Such Projects",
        "content": "Mumbai has unveiled India’s first musical road, where motorists driving along a designated stretch of the Coastal Road can hear the iconic Bollywood song Jai Ho through specially installed grooves in the road surface.\nThe innovative project was inaugurated on Wednesday by Maharashtra Chief Minister Devendra Fadnavis. Deputy Chief Minister Eknath Shinde, former Shiv Sena MP Rahul Shewale, who came up with the idea, Hungary’s Consul General Faren Jari, and BMC officials were present at the launch.\nFadnavis called the musical road as a “delightful experience\" for motorists and said the concept, based on Hungarian technology, could be expanded in the future.\n\nA post shared by News18.com (@cnnnews18)\n“In the first phase, the concept has been implemented on a 500-metre stretch of the Coastal Road, and there are plans to expand the musical road concept further,\" Fadnavis said.\nShinde also encouraged Mumbaikars to experience the musical road and suggested that the concept could also be tried on the Samruddhi Expressway as a pilot project.\nAbout The Mumbai Melody Road\nThe musical stretch has been developed on the northbound carriageway of the Coastal Road, running from Nariman Point towards Worli. Civic officials said it is located in the first lane adjoining the divider, around 500 metres after vehicles exit the Worli-bound underground tunnel.\nThe road features grooves or rumble strips of precise dimensions and spacing. When vehicles pass over them at 70 to 80 kmph, the vibrations from the tyres produce musical notes, forming the melody of Jai Ho, composed by AR Rahman with lyrics by Gulzar.\nALSO READ: Mumbai’s New Coastal Road Has Mindspace Malad, Charkop Interchanges: Versova-Bhayander In 20 Minutes\nSignboards have been placed at 500 metres, 100 metres, and 60 metres before the stretch to alert drivers about the upcoming musical section and the required speed.\nAccording to the Brihanmumbai Municipal Corporation (BMC), this is the fifth such musical road in the world and the first in India.\nThe Coastal Road, named after Dharmaveer Swarajyarakshak Chhatrapati Sambhaji Maharaj, is a major infrastructure project aimed at easing traffic congestion and enabling faster travel, now offering a unique cultural and engineering experience.\nMusical roads, also called melody roads, were first developed in Japan in 2007 and have since been implemented in countries such as Hungary, South Korea, and the UAE.\nThe BMC hailed the project as a blend of engineering innovation and cultural expression, giving Mumbaikars a patriotic and musical experience as they drive.\n(With inputs from PTI)\nLatest Blogs",
        "link": "https://www.news18.com/cities/mumbai-news/mumbai-melody-road-opens-on-coastal-route-fadnavis-hints-at-more-such-projects-ws-l-9896917.html",
        "date": "Wed, 11 Feb 2026 23:21:19 +0530",
        "fetched_at": "2026-02-13 04:03:19.708419"
    },
    {
        "title": "Rajnath Singh-Led Top Defence Body Likely To Clear Acquisition Of 114 Rafale Jets, Key Meeting Tomorrow",
        "content": "India’s Defence Acquisition Council, chaired by Defence Minister Rajnath Singh, is likely to approve 114 additional Rafale fighter jets for the Indian Air Force as it holds a key meeting on Thursday (February 12).\nThe meeting will have major decisions on critical military platforms, with the agenda including proposals that could reshape combat capabilities of the armed forces amid growing security concerns.\nAt the forefront is the likely approval of 114 additional Dassault Rafale jets for the Indian Air Force under the Medium-Role Fighter Aircraft (MRFA) programme. This proposal – cleared by the Defence Procurement Board last month – is expected to be taken up by the Defence Acquisition Council (DAC) before being forwarded to the Prime Minister-led cabinet committee on security for the final nod.\nThe planned Rafale acquisition aims to address the steep decline in the squadron strength of the air force. The number has dropped to 29 squadrons against an authorised strength of 42, the lowest in decades. Even with the additional jets, which could translate into at least six to seven new squadrons and incoming HAL Tejas Mk-1A deliveries, the gap is unlikely to close quickly without these buys.\nThe MRFA project has a long and complex lineage. It evolved from the 2007 Medium Multi-Role Combat Aircraft (MMRCA) competition, in which Rafale eventually emerged the preferred choice but negotiations over cost and industrial terms had stalled.\nThe present proposal has a stronger emphasis on ‘Make in India’, with plans for transfer of technology and local production as well as integration of future weapons systems tailored to Indian requirements. If approved, the deal – estimated to be around Rs 3.25 lakh crore – will become one of India’s largest fighter aircraft procurements.\nThe DAC is also expected to consider procurement of high-altitude pseudo-satellites (HAPS), which are long-endurance, solar-powered unmanned systems capable of stratospheric surveillance.\nThese offer persistent intelligence, surveillance and reconnaissance over wide areas at considerably lower cost than traditional satellites, and are being developed by Indian entities including Defence Research and Development Organisation (DRDO) and National Aerospace Laboratories (NAL). Their inclusion is a shift towards indigenous space-domain capability that can support frontline forces in border and maritime zones.\nWhile sources indicated that approvals are unlikely, the DAC is widely expected to take up the case of the Boeing P-8I Poseidon fleet to approve six additional aircraft for the Indian Navy.\nThe P-8I, a long-range maritime surveillance and anti-submarine warfare platform, is a critical asset for securing India’s maritime interests in the Indian Ocean. The navy presently operates 12 of these aircraft, which have amassed over 40,000 mishap-free flight hours and are central to its “eye in the sky\" capability.\nThe council will discuss some more cases for the capability boost of the armed forces, including SCALP missiles, indigenous marine engine development programme for the navy among other cases.\nDelays in the indigenous LCA Mk1A programme have compounded capability shortfalls. Although at least 180 Mk1A aircraft have been contracted, deliveries – scheduled between 2027 and 2033 – have not yet begun, slowing down efforts to offset retirements of older jets such as the MiG-21 series.\nThese delays have sharpened the focus on rapid acquisitions like the Rafale buy while highlighting the need to speed up indigenous projects.\nLatest Blogs",
        "link": "https://www.news18.com/india/rafale-fighter-jets-acquisition-iaf-rajnath-singh-top-defence-body-proposal-meeting-tomorrow-ws-l-9896850.html",
        "date": "Wed, 11 Feb 2026 21:44:19 +0530",
        "fetched_at": "2026-02-13 04:03:20.552454"
    },
    {
        "title": "Bharat Bandh Today: Transport, Banks, Schools — What’s Open, What’s Closed",
        "content": "A nationwide strike, also known as Bharat Bandh, has been called on Thursday, by over 10 central trade and farmers’ unions. The strike protests against labour reforms and other policies that unions say weaken workers’ rights and protections.\nThe bandh is likely to disrupt public sector banks, transport services, government offices, and some industries, particularly in states such as Kerala and Odisha, where union mobilisation is strong.\nThe strike has been called by a joint platform of ten central trade unions, including AITUC, INTUC, CITU, HMS, TUCC, SEWA, AIUTUC, AICCTU, LPF, and UTUC.\nUnion leaders say the bandh aims to press for stronger social security measures and protection of labour rights. They oppose the four new labour codes, arguing that these weaken workers’ rights, reduce job security, and make it easier for employers to hire and fire staff.\nOther demands include scrapping the Draft Seed Bill, the Electricity Amendment Bill, and the SHANTI Act, restoring MGNREGA, and withdrawing the Viksit Bharat – Guarantee for Rozgar and Ajeevika Mission (Gramin) Act, 2025, The Times of India reported.\nFarmers’ Support\nThe Samyukt Kisan Morcha (SKM) has also extended its support, citing concerns over the India-US interim trade agreement. The group’s convenor Hannan Mollah said the deal would flood Indian markets with cheaper US imports, harming farmers’ livelihoods.\n“SKM studied the Government’s Agreements with the US, EU and New Zealand. SKM has been against this since the beginning. Agreement is not beneficial for a weaker country. They will send their goods for free to our country and they will flood our markets with cheaper goods. Our country will not be able to compete with them and our farmers will be finished,\" Mollah noted.\nAITUC General Secretary Amarjeet Kaur said around 30 crore workers are expected to join the strike across 600 districts, surpassing last year’s mobilisation of 25 crore workers.\nWhat May Be Open And Closed\nLikely Affected: Public banks and insurance offices, state transport services, government offices, PSUs, industrial units, coal and steel sectors, and MGNREGA works in protest areas.\nLikely to Remain Open: Hospitals, ambulances, essential health services, metro services (depending on local admin), private offices and IT companies (state-dependent), schools and colleges (state-wise), and essential supply services like milk and pharmacies.\nLatest Blogs",
        "link": "https://www.news18.com/india/bharat-bandh-on-february-12-transport-banks-schools-whats-open-whats-closed-ws-l-9896671.html",
        "date": "Thu, 12 Feb 2026 07:10:03 +0530",
        "fetched_at": "2026-02-13 04:03:21.495611"
    },
    {
        "title": "Uniform Dignity: Modi Govt Gives Ex-Servicemen Status To Military Nursing Service",
        "content": "The Narendra Modi government has officially extended Ex-servicemen (ESM) status to the Military Nursing Service (MNS). This decision, notified on February 10, corrects a historic oversight by amending the Ex-servicemen (Re-employment in Central Civil Services and Posts) Rules, 1979, effectively placing nursing officers on an equal statutory footing with veterans of the Regular Army, Navy, and Air Force.\nThe amendment to Section 2(c)(i) of the service rules explicitly includes the Military Nursing Service of the Indian Union within the definition of “ex-servicemen.\" This change is not merely symbolic; it ensures that nursing personnel—who are predominantly women—receive the same post-retirement security and re-employment benefits as their combatant counterparts.\nAccording to the Defence Secretary Rajesh Kumar Singh, this reflects the government’s complete commitment to the welfare, dignity, and long-term security of women serving the nation in uniform.\nAs per the new guidelines, MNS veterans are now entitled to:\nReservation Quotas: 10% reservation in Group ‘C’ and 20% in Group ‘D’ Central Government posts.\nAge Relaxation: The ability to deduct the total years of military service plus an additional three years from their actual age for civil job eligibility.\nEmployment Priority: Equal standing in recruitment processes conducted by the Union Public Service Commission (UPSC) and the Staff Selection Commission (SSC).\nThe reform follows a 2024 Supreme Court observation that MNS personnel are an integral part of the armed forces and should not be denied veteran status. Defence Secretary Rajesh Kumar Singh noted that this move reflects the government’s “complete commitment to the welfare, dignity, and long-term security of women serving the nation in uniform\".\nFor decades, MNS officers have served in frontline military hospitals, high-altitude operational zones, and hostile environments, yet faced an “ambiguity\" regarding their status upon retirement. By formalising their identity as ex-servicemen, the government has underlined its position that the contribution of women to national security is primary, not secondary. This decision is being widely hailed as a core component of the broader push for women-led development within India’s defence ecosystem.\nLatest Blogs",
        "link": "https://www.news18.com/india/uniform-dignity-modi-govt-gives-ex-servicemen-status-to-military-nursing-service-9896652.html",
        "date": "Wed, 11 Feb 2026 19:55:47 +0530",
        "fetched_at": "2026-02-13 04:03:22.393600"
    },
    {
        "title": "Cabinet Ranks Surge As SC/ST Corporations Face Major Fund Cuts In Karnataka | Exclusive",
        "content": "There is a stark disparity in the fiscal priorities of the Karnataka government, where a surge in cabinet-rank appointments for political leaders contrasts sharply with a declining trend in funding for Scheduled Caste and Scheduled Tribe development corporations. Documents exclusively accessed by CNN-News18 reveal that at least seven key corporations dedicated to marginalised communities have seen their financial lifelines either slashed or stagnated since the Siddaramaiah-led Congress government took office. This revelation comes as the state administration faces mounting criticism for elevating over 100 party workers to cabinet status, granting them high-end perks and ministerial privileges while essential welfare programs struggle for basic liquidity.\nThe data points to a systemic reduction across multiple sectors of Dalit and tribal development. The Dr BR Ambedkar Development Corporation, which received 218.50 crore under the BJP in 2022-23, saw its allocation drop to Rs 107 crore the following year and currently stands at Rs 155 crore for 2025-26, with only Rs 89.73 crore released to date. Similarly, the Karnataka Thanda Development Corporation saw its funding halved from Rs 133.50 crore under the previous regime to a mere Rs 66.95 crore in the 2023-24 fiscal year. Other bodies, including the Karnataka Adijambava and Bhovi Development Corporations, report a significant gap between promised budget figures and the actual funds hitting their accounts, often leaving them with less than 50 per cent of their intended resources as the financial year nears its conclusion.\nDefending the administration’s fiscal strategy, Congress MLA HC Balakrishna admitted to the disparity while speaking to CNN-News18, though he categorised it as a necessary adjustment for the government’s flagship guarantee schemes. “It’s a slight disparity,\" Balakrishna stated, adding that “overall allocation to SC/ST communities remains the same.\" He maintained that the funds were being utilised to ensure the broader success of social welfare guarantees that also benefit these specific communities.\nHowever, the opposition has characterised this shift as a betrayal of the very communities that helped propel the Congress to power. BJP Spokesperson GS Prashanth slammed the government for what he termed a “misuse of taxpayer money\" to fund political gratification. “There are two issues to be looked at: one, definitely BJP stood for the welfare of ST SCs and allotted a good chunk of the budget,\" Prashanth said. “What the Congress government has done is they have reduced the allocation and used the funds meant for SC/ST development for other purposes, roughly about Rs 25,000 crore in the last two years. It is very clear that Congress’s statement about standing up for SC/STs is only for the paper; in reality, they do not believe in empowering them.\"\nThe controversy is further fueled by the timing of these cuts, as the government continues to dole out ministerial ranks to its cadre despite warnings from the Chief Minister’s own economic advisor regarding the state’s dry coffers. Prashanth further added, “At this juncture, to dole out to party workers… taxpayer money is being misused. It is very shameful that Congress has resorted to appease their party workers by using taxpayer funds. Siddaramaiah and DK Shivakumar have mortgaged the interest of the people of Karnataka.\" As the debate intensifies, the government remains under pressure to explain why political perks appear to be taking precedence over the direct financial empowerment of the state’s most vulnerable populations.\nLatest Blogs",
        "link": "https://www.news18.com/india/cabinet-ranks-surge-as-sc-st-corporations-face-major-fund-cuts-in-karnataka-exclusive-ws-l-9895931.html",
        "date": "Wed, 11 Feb 2026 16:39:52 +0530",
        "fetched_at": "2026-02-13 04:03:23.172717"
    },
    {
        "title": "Drunk Father Burns Daughter’s Schoolbooks, Police Buy Her A New Set",
        "content": "In Arundi village of Nyamati taluk, a Class 10 student preparing for her SSLC examinations turned to the police after her father allegedly burned her textbooks and prevented her from attending school.\nAccording to her complaint, the girl’s father, who is reportedly addicted to alcohol, had been creating disturbances at home. As the SSLC board examinations scheduled from March 18 to April 2, 2026 approached, tensions escalated. During this period, he allegedly set fire to her textbooks and notebooks and stopped her from going to school.\nWith exams just weeks away, the loss of study materials and disruption to her routine left the student distressed. Fearing further interference with her education, she called the emergency helpline 112 and later filed a formal complaint at the Nyamati police station.\nSwift Police Response\nPolice officers Hemaraj and Ravikumar responded to the call and visited the family’s home as quickly as they could. They intervened and counselled the father, explaining the seriousness of his actions and the potential long-term impact on his daughter’s education.\nUnder the supervision of CPI Ravi of the Nyamati police station, officers ensured that the girl received new textbooks and notebooks to replace the ones that were burned. The police also contacted school authorities and requested their support to help the student continue her studies without further disruption.\nProtecting a Child’s Right to Education\nPolice officials stressed that while domestic disagreements may occur, they must not interfere with a child’s right to education. Destroying study materials, especially during board exam preparations, can severely affect a student’s confidence and academic performance.\nThe timely intervention helped stabilise the situation and ensured the girl could resume her exam preparation. The incident has drawn attention within the village, with residents expressing concern over the episode, particularly given the importance of the SSLC examinations.\nAll that the girl wanted was to study for the upcoming board exams which in a way is a turning point in her life and career. A drunken father was about to kill that future and dream but right intervention of police and the girl seeking their help, turned the tables.\nWith exams just weeks away, the loss of study materials and disruption to her routine left the student distressed. Fearing further interference with her education, she called the emergency helpline 112 and later filed a formal complaint at the Nyamati police station.\nSwift Police Response\nPolice officers Hemaraj and Ravikumar responded to the call and visited the family’s home as quickly as they could. They intervened and counselled the father, explaining the seriousness of his actions and the potential long-term impact on his daughter’s education.\nUnder the supervision of CPI Ravi of the Nyamati police station, officers ensured that the girl received new textbooks and notebooks to replace the ones that were burned. The police also contacted school authorities and requested their support to help the student continue her studies without further disruption.\nProtecting a Child’s Right to Education\nPolice officials stressed that while domestic disagreements may occur, they must not interfere with a child’s right to education. Destroying study materials, especially during board exam preparations, can severely affect a student’s confidence and academic performance.\nThe timely intervention helped stabilise the situation and ensured the girl could resume her exam preparation. The incident has drawn attention within the village, with residents expressing concern over the episode, particularly given the importance of the SSLC examinations.\nAll that the girl wanted was to study for the upcoming board exams which in a way is a turning point in her life and career. A drunken father was about to kill that future and dream but right intervention of police and the girl seeking their help, turned the tables.\nScan the QR code to download the News18 app and enjoy a seamless news experience anytime, anywhere.\nLatest Blogs",
        "link": "https://www.news18.com/india/drunk-father-burns-daughters-schoolbooks-police-buy-her-new-set-in-karnataka-skn-ws-l-9895852.html",
        "date": "Wed, 11 Feb 2026 16:19:55 +0530",
        "fetched_at": "2026-02-13 04:03:23.906669"
    },
    {
        "title": "Toll Collection Not Linked To Project Cost Recovery, Says Gadkari, Explains Factors Behind Hike",
        "content": "The toll collected from a road is not related to the recovery of project development cost, the Ministry of Road Transport and Highways informed the Rajya Sabha on Wednesday.\nUnion minister Nitin Gadkari added that the revenue collected beyond the concession period is deposited in Consolidated Fund of India (CFI) and the funds provided through budgetary allocation are utilised for further maintenance, development and augmentation of national highways.\nThe ministry, in a written reply, said the National Highways Fee (Determination of Rates and Collection) Rules, 2008, as amended, provide a transparent framework for levy and collection of user fee, with rates linked to the length of the highway and type of vehicle uniformly across the country.\nGadkari said collection of user fee (toll) at fee plazas on National Highways is done as per the provisions of National Highways Fee Rules, 2008.\n“…the fee notified as per concession agreement is collected by the concessionaire till the end of the concession period, and after the concession period is over, the fee is collected by the Central Government or the executing authority as per the fee specified…,\" he said.\nIn a separate reply, Gadkari said the increase in the amount of user fee collection at toll fee plazas on national highways depends on several factors.\n“These include the annual revision of user fee, which is linked to the wholesale price index in accordance with the National Highways Fee (Determination of Rates and Collection) Rules, 2008, increase in the length of highways under tolling, the volume of traffic plying on the stretch, and the category of vehicles using the highway,\" he said.\nIn August 2025, the Public Accounts Committee (PAC) had said that there is no institutional mechanism to independently evaluate whether toll charges are justified in relation to actual operation and maintenance costs or future service requirements.\nThe committee said it has found that toll charges on National Highways are linked to base rates first fixed in 2008 and annually revised, with a 3 per cent annual escalation, irrespective of road quality, traffic volume, or user affordability.\n“… the concept of tolling in perpetuity was first introduced through an amendment to the Fee Rules in 2008, allowing continued collection of user fees even after the recovery of project costs. This provision was further clarified and codified through the 2023 amendment to the Fee Rules, which explicitly permits tolling to continue beyond the end of the concession period, thereby formalising a regime of perpetual tolling,\" it had said.\nThe committee had desired that toll collection on any highway stretch must be rationalised and substantially reduced once capital and routine maintenance costs have been recovered.\n“Any continuation of tolls beyond this point should be permitted only if clearly justified and approved by the proposed independent oversight authority,\" the report added.\nThe committee also recommended that the ministry establish a tariff authority, on the lines of the Airports Economic Regulatory Authority (AERA) in the civil aviation sector, to ensure transparency and fairness in toll fixation, collection, and regulation.\nThis authority should be mandated to review and determine the periodicity of toll revisions based on certain parameters, it suggested.\nLatest Blogs",
        "link": "https://www.news18.com/india/toll-collection-not-linked-to-project-cost-recovery-says-gadkari-explains-factors-behind-hike-ws-kl-9895663.html",
        "date": "Wed, 11 Feb 2026 15:41:55 +0530",
        "fetched_at": "2026-02-13 04:03:24.721144"
    },
    {
        "title": "Goa Minister Atanasio Monserrate Acquitted In 2016 Rape Case",
        "content": "A special court in Goa on Wednesday acquitted BJP MLA and minister Atanasio Monserrate in a rape case registered against him nearly a decade ago.\nMonserratte, who holds the revenue portfolio, was booked in 2016 for allegedly raping a minor.\nSpecial Judge Irshad Agha has now acquitted the minister of all charges.\nAs per the FIR registered by the Goa police, a minor girl had alleged that she was sold to then St Cruz MLA Monserratte who drugged and raped her.\nInitially, the case was registered against the minister under the Goa Children’s Act. Later, the charge was dropped and sections under the Indian Penal Code were invoked after an ossification test indicated that she was above 16 years of age.\nThe case was tried before the district court after the police filed a 250-page chargesheet against him. A total of 40 witnesses were examined during the trial.\nLatest Blogs",
        "link": "https://www.news18.com/india/goa-minister-atanasio-monserrate-acquitted-in-2016-rape-case-ws-l-9895583.html",
        "date": "Wed, 11 Feb 2026 15:01:07 +0530",
        "fetched_at": "2026-02-13 04:03:25.458255"
    },
    {
        "title": "Man Survives On Leaves For 10 Years In Karnataka Forest, Sports Six-Pack Body",
        "content": "In a quiet corner of Belagavi district, Karnataka where rocky hills rise beyond fields and villages thin into scrub forest, a man has chosen a life few would imagine for themselves. He shunned the regular ‘civilized life’ and walked into forests a decade ago.\nFor 10 years, he has lived away from society, without cooked food, without routine comforts, and without the rhythms of conventional life. Meet Budan Khan Hosamani, aged 34, from Ugaragol village in Saundatti taluk of Belagavi district who is well known in the area as ‘Modern Day Tarzan’.\nA Decade in the Hills\nNearly 10 years ago, Budan Khan walked away from home and settled in the Heggolla hill region on the outskirts of his village. Since then, he has lived largely in isolation, away from regular social contact and modern conveniences.\nWhat sets him apart is not just his solitude, but his diet. Budan Khan survives entirely on raw leaves, plants and wild greens found in the forest.\nHe is said to consume nearly 80 different varieties of vegetation available in the hills. According to local accounts, he no longer eats rice, roti or any cooked food and reportedly says he cannot even look at regular meals anymore.\nReports suggest that Budan Khan began experimenting with eating leaves after observing monkeys in the forest. Over time, this practice became his only source of sustenance.\nTo support this lifestyle, he also practices yoga, which he believes helps him digest the raw vegetation and maintain balance in his body.\nWhy He Left\nAccording to those familiar with his story, Budan Khan left home after facing pressure from his family to get married and lead a settled life. Instead of following that path, he chose solitude in the hills and adopted what he considers a natural way of living.\nHe says he observed monkeys and learnt what leaves to eat and what not. He walks a great distance inside the forest everyday and does a couple of exercises that he already knew to stay in good health.\nDespite surviving solely on forest greens, Budan Khan reportedly maintains a well-built and fit physique. Observers have described him as having a six-pack body, a detail that has surprised many locals and drawn curiosity about his unusual diet and routine.\nHis parents and two brothers live in the nearby village. “We tried to convince him to come back home many times. The minute we speak about him getting married, he stops talking to us altogether. So we said, he can stay unmarried but come and live with us. He doesn’t want to come at all, he is happy in the wild. We don’t have much option when he is that stubborn, so we just left him be\" says Khan’s mother.\nIn the hills of Belagavi, away from kitchens and crowded streets, his life continues quietly, rooted in leaves, routine and isolation.\nReported By: Chandrakanth Sugandhi, News18 Kannada, Belagavi\nA Decade in the Hills\nNearly 10 years ago, Budan Khan walked away from home and settled in the Heggolla hill region on the outskirts of his village. Since then, he has lived largely in isolation, away from regular social contact and modern conveniences.\nWhat sets him apart is not just his solitude, but his diet. Budan Khan survives entirely on raw leaves, plants and wild greens found in the forest.\nHe is said to consume nearly 80 different varieties of vegetation available in the hills. According to local accounts, he no longer eats rice, roti or any cooked food and reportedly says he cannot even look at regular meals anymore.\nReports suggest that Budan Khan began experimenting with eating leaves after observing monkeys in the forest. Over time, this practice became his only source of sustenance.\nTo support this lifestyle, he also practices yoga, which he believes helps him digest the raw vegetation and maintain balance in his body.\nWhy He Left\nAccording to those familiar with his story, Budan Khan left home after facing pressure from his family to get married and lead a settled life. Instead of following that path, he chose solitude in the hills and adopted what he considers a natural way of living.\nHe says he observed monkeys and learnt what leaves to eat and what not. He walks a great distance inside the forest everyday and does a couple of exercises that he already knew to stay in good health.\nDespite surviving solely on forest greens, Budan Khan reportedly maintains a well-built and fit physique. Observers have described him as having a six-pack body, a detail that has surprised many locals and drawn curiosity about his unusual diet and routine.\nHis parents and two brothers live in the nearby village. “We tried to convince him to come back home many times. The minute we speak about him getting married, he stops talking to us altogether. So we said, he can stay unmarried but come and live with us. He doesn’t want to come at all, he is happy in the wild. We don’t have much option when he is that stubborn, so we just left him be” says Khan’s mother.\nIn the hills of Belagavi, away from kitchens and crowded streets, his life continues quietly, rooted in leaves, routine and isolation.\nReported By: Chandrakanth Sugandhi, News18 Kannada, Belagavi\nScan the QR code to download the News18 app and enjoy a seamless news experience anytime, anywhere.\nLatest Blogs",
        "link": "https://www.news18.com/buzz/man-survives-on-leaves-for-10-years-in-karnataka-forest-sports-six-pack-body-skn-ws-l-9895175.html",
        "date": "Wed, 11 Feb 2026 14:19:01 +0530",
        "fetched_at": "2026-02-13 04:03:26.221671"
    },
    {
        "title": "‘DMK Will Form Its Own Govt’: Stalin Amid Seat-Sharing Buzz With Congress Ahead Of 2026 Polls",
        "content": "Tamil Nadu Chief Minister MK Stalin expressed confidence that the DMK would form the government on its own in the 2026 Assembly elections. He said the party would contest the polls in alliance with the Congress amid talk of a rift between the allies. His remarks come as seat-sharing discussions for the elections are yet to begin with the Congress.\nSpeaking at a news channel event, Stalin, who is seeking a second consecutive term, spoke about the challenges before the DMK, the NDA factor and his equation with Rahul Gandhi.\n\n\nDismissing rumours of tension with the Congress, Stalin said he shared a “brotherly attachment\" with Rahul Gandhi. However, he did not clarify whether the DMK would share power with the Congress if the alliance returned to power.\n“The DMK will form its own government,\" Stalin said, adding that the party was confident of making “even greater inroads\" than in 2021.\n“The DMK-Congress alliance is strong in Tamil Nadu. Will fight the election together. The question of sharing of power in government does not arise now,\" he added.\n\n\nIn the 2021 Assembly elections, the DMK won 133 out of 234 seats and formed the government on its own. The Congress, which contested as its ally, won 18 out of 25 seats but was not given any ministerial post.\nThis time, friction has surfaced between the two parties. The Congress has accused the DMK of sidelining it in the state and is demanding a larger share of seats. It has also raised the issue of power sharing if the alliance wins again.\nLast month, Rahul Gandhi met DMK MP Kanimozhi. Discussions reportedly included cabinet posts, a larger share of seats and a Rajya Sabha berth. The DMK has announced that formal seat-sharing talks will begin from February 22.\n\n\nStalin launched a sharp attack on the NDA. He said the NDA was not a “double engine\" but a “dabba engine\" or an empty vessel.\nFraming the election as another phase of the Aryan-Dravidian battle, Stalin accused the NDA of spreading “falsehoods, hate and communal tension\" ahead of the polls.\n“The so-called double engine is an empty vessel. It is not a double engine, but a dabba engine,\" he said.\n\n\nStalin alleged that the NDA was trying to widen the divide among minorities in the state. He said the people of Tamil Nadu would give the NDA a “great disappointment\" for its actions and that such divisive politics had no place in the state.\nThe remarks come as the BJP is attempting to strengthen its position in Tamil Nadu. The party has brought the Edappadi K Palaniswami-led AIADMK and TTV Dhinakaran’s AMMK into the NDA. The PMK is also part of the alliance.\nLatest Blogs",
        "link": "https://www.news18.com/politics/dmk-will-form-its-own-govt-stalin-amid-seat-sharing-buzz-with-congress-ahead-of-2026-polls-9895237.html",
        "date": "Wed, 11 Feb 2026 13:29:25 +0530",
        "fetched_at": "2026-02-13 04:03:27.210494"
    },
    {
        "title": "Alwar Gets Its First Luxury High-Rise Project, Flats To Be Ready In 6 Months",
        "content": "Luxury high-rise flats have been launched in Alwar, Rajasthan, for the first time, marking a significant shift in the city’s residential landscape. Typically, buyers have to wait several years for possession after a residential or commercial project is formally launched. However, a newly introduced development in the city has generated considerable buzz for a different reason.\nBoots, a company in the infrastructure and construction sector, has formally launched Boots Heights – Aravali Apartments, described as Alwar’s first luxury high-rise residential project.\nThe development signals the beginning of organised vertical living in the city.\n\n\nLocated in Surya Nagar, Boots Heights is being presented as the city’s first premium high-rise residential offering, designed for families and professionals seeking an elevated urban lifestyle.\nThe project comprises two towers, each with 15 floors and five apartments per floor, offering a total of 150 modern 2 and 3-BHK flats. The starting price is Rs 5,500 per square foot.\n\n\nOne of the most striking aspects of the project is the promise of possession within six months, making it one of the few ready-to-move luxury developments in the region.\nThe project was originally under NBCC, a government company, which has already completed the civil structure. Boots later acquired the project through auction, enabling a faster possession timeline. Buyers are expected to receive their flats within approximately six months.\nThe project is projected to generate revenue of Rs 150 crore.\n\n\nBoots Heights is situated on the Delhi-Alwar Road (SH-25), approximately 18 kilometres from the Delhi-Mumbai Expressway. It is also close to Alwar Junction railway station, the central bus depot and the Matsya industrial area.\nIts location in the peaceful neighbourhood of Surya Nagar, combined with proximity to key commercial hubs, positions it as a viable option for both end-users and investors.\n\n\nAmong the standout features are open views of the Aravali hills, spacious balconies, large windows and an attractive façade design expected to redefine Alwar’s skyline.\nBoots Heights will offer what is described as Alwar’s largest swimming pool, along with a modern clubhouse, pickleball court, fitness and wellness zone, indoor and outdoor recreation areas, landscaped gardens and dedicated spaces for children and senior citizens.\n\n\nThe project includes 24×7 manned security, advanced surveillance systems, controlled entry and exit points, and modern fire safety infrastructure.\n\n\nDeepak Rai, Managing Director of Boots, said that the mindset of homebuyers in Alwar is evolving. “People now want not just a house, but better design, facilities and a complete lifestyle,\" he said.\nHe added that Boots Heights has been developed with the vision of bringing a luxury living experience to Alwar that was previously associated mainly with metro cities.\nLatest Blogs",
        "link": "https://www.news18.com/india/alwar-gets-its-first-luxury-high-rise-project-flats-to-be-ready-in-6-months-ws-el-9894386.html",
        "date": "Wed, 11 Feb 2026 12:12:24 +0530",
        "fetched_at": "2026-02-13 04:03:28.578165"
    },
    {
        "title": "'Gender Handbook Too Hardvard-Oriented': CJI Flags Need For Simpler Court Language In Assault Cases",
        "content": "Chief Justice of India Surya Kant on Tuesday observed that the judicial handbook detailing legal terminology was “too much Harvard-oriented\" and emphasised the urgent need for language that can be understood by victims in sexual offence cases and their families.\nHe stressed that terms used by courts in such cases must be simple, accessible, and grounded in real-world understanding, not complex and academically tilted.\nHis remark came in response to submissions in the Supreme Court’s suo moto hearing challenging a controversial March 2025 judgment of the Allahabad High Court that had triggered nationwide criticism for its narrow interpretation of the elements of sexual assault involving a minor girl.\nTHE CONTROVERSIAL ALLAHABAD HIGH COURT ORDER\nThe Supreme Court’s proceedings arise out of an order passed on March 17, 2025, by a single judge of the Allahabad High Court, which held that certain acts, including grabbing the breasts of an 11-year-old victim and breaking the string of her pyjama with the intention of dragging her beneath a culvert, did not constitute the offence of rape or attempt to rape.\nThe accused, identified as Pawan and Akash, allegedly grabbed the breasts of the 11-year-old girl.\nOne of them snapped the pyjama string and attempted to drag her under a culvert, but fled after a passerby intervened.\nThe trial court had initially summoned the accused under Section 376 of the Indian Penal Code (rape) and Section 18 of the POCSO Act (punishment for attempt to commit an offence).\nThe Allahabad High Court modified the summons, ruling that the facts did not prima facie make out an attempt to rape, and instead directed trial only under Sections 9 and 10 of the POCSO Act (aggravated and serious sexual assault) along with a minor charge under Section 354-B IPC (assault with intent to disrobe).\nThe High Court bench stated that because there was no allegation of penetrative sexual assault or sufficient evidence of a determination to commit rape, the offence could not be elevated to attempt to rape.\nTHEN THE SUPREME COURT TOOK A SUO MOTO CASE\nIn reaction to the Allahabad High Court order, the Supreme Court took up the matter on its own motion in March 2025.\nThe top court bench described the High Court’s reasoning as deeply problematic in terms of legal categorisation and criminal justice standards.\nThe bench noted that while Sections 9 and 10 of POCSO provide for punishment for serious sexual assault and that Section 354-B covers certain forms of assault, the threshold for attempt to rape had been incorrectly applied.\nThe Supreme Court agreed with submissions that the High Court’s interpretation did not appropriately reflect the severity and intention in the factual matrix of the incident.\nDuring the February 10, 2026, hearing, senior advocates highlighted that judicial language must not distort or diminish the lived reality of victims, particularly in crimes of a sexual nature.\nCounsel pointed out that terms such as “preparation\" and “forceful penetrative sexual assault\" could be confusing or misleading if applied mechanically without attention to context.\nWHAT CJI KANT SAID ON JUDICIAL LANGUAGE\nReacting to these submissions, Chief Justice Surya Kant stated that the existing judicial handbook’s terms, currently too academic or foreign in orientation, cannot serve justice unless they are translated into plain language that litigants and victims can comprehend.\nThe Chief Justice reiterated that the goal must be clarity, dignity, and accessibility, underscoring that legal terminology should not become a barrier to justice.\n“The handbook is also unfortunately too much Harvard-oriented. Dictionary assistance, we need very simple language. Common man should understand these things, even the victim’s family can understand,\" CJI Kant said.\nHe reiterated that terminology prescribed in manuals or academic texts often fails victims and their families.\n“What is the right word to be chosen is the real challenge,\" the CJI said in court.\nOn whether to frame guidelines immediately, the CJI said the court would first seek a time-bound report from the National Judicial Academy, with input from domain experts and law academics.\n“We will ask the National Judicial Academy to submit a time-bound report.\"\n“Unless we dispose of the main case, the IA (Intervention Application) cannot be entertained,\" he said.\nIn response to an intervention application by the Kerala State Legal Services Authority seeking age-appropriate language for judges, the CJI stressed that first, the substantive matter involving the victim must be resolved, after which the court would move to guideline framing.\nHe added that judicial language must be calibrated to factual scenarios and the decency owed to victims, saying:\n“Even a simplified dictionary will not be helpful. It has to be something which can even run into volumes. Work on a pan-India basis is needed.\"\nThe CJI also announced plans for periodic judicial sensitisation.\nLatest Blogs",
        "link": "https://www.news18.com/india/cji-surya-kant-gender-handbook-harvard-oriented-urges-simple-court-language-sexual-assault-cases-ws-l-9894174.html",
        "date": "Wed, 11 Feb 2026 11:07:35 +0530",
        "fetched_at": "2026-02-13 04:03:29.349630"
    },
    {
        "title": "Uttar Pradesh Budget 2026 LIVE: Employment Generation, Youth Empowerment, Key Focus Areas Of UP Govt",
        "content": "Uttar Pradesh State Budget 2026-27 LIVE Updates: Uttar Pradesh Finance Minister Suresh Khanna on Wednesday presented a Rs 9.13 lakh crore Budget for the financial year 2026-27 in the state Assembly, marking an increase of about 12.2 per cent over the previous year’s outlay.\nTabling the Budget before the House, Khanna said the state government is always fully committed to fiscal management and debt control.\nEarlier on February 9, the budget session of the Uttar Pradesh assembly began with the Governor’s address and is set to conclude on February 20.\nThe Uttar Pradesh government has highlighted employment generation, youth empowerment and large-scale recruitment across departments as key achievements and priorities in the 2026-27 state Budget.\nSamajwadi Party MP Awadhesh Prasad on Wednesday expressed scepticism regarding the Uttar Pradesh State Budget 2026-27, saying that there’s nothing in the central budget for Uttar Pradesh or Ayodhya, and this budget has nothing to do with the state’s farmers, youth, or labourers.\nUttar Pradesh Finance Minister Suresh Khanna on Wednesday presented a Rs 9.13 lakh crore Budget for the financial year 2026-27 in the state Assembly, marking an increase of about 12.2 per cent over the previous year’s outlay.\nTabling the Budget before the House, Khanna said the state government is always fully committed to fiscal management and debt control.\nPresenting the Budget, the Uttar Pradesh Finance Minister Suresh Khanna said, “During the previous and present tenure of our government, the state has witnessed all-round development, be it strengthening of law and order, expansion of infrastructure facilities, industrial investment, employment generation, women empowerment, skill development of youth, prosperity of farmers and poverty alleviation.”\n“The GSDP of the state for the year 2024-2025 has been estimated at Rs 30.25 lakh crore, which reflects an increase of 13.4 per cent compared to the previous year,” he added.\nUttar Pradesh Finance Minister Suresh Khanna on Wednesday presented the Budget 2026-27 in the State Legislative Assembly.\n#WATCH | Lucknow | Uttar Pradesh Finance Minister Suresh Khanna presents State Budget 2026-27 in State Legislative Assembly\n“During the previous and present tenure of our government, the state has witnessed all-round development, be it strengthening of law and order, expansion… pic.twitter.com/kUzBQaUxgT\n— ANI (@ANI) February 11, 2026\n\nThe Uttar Pradesh government will present the biggest budget in the history of the state today, Deputy Chief Minister Brajesh Pathak said.\n“This is the biggest budget in terms of figures in the history of the state. It will strengthen the state’s infrastructure, accelerate development, and improve basic services such as water, electricity, roads, schools, and hospitals. The most important thing is that this budget will prove to be a milestone in raising the standard of living of women, youth, farmers and the poor, that is, the common man, and will be a budget that will fulfil the resolve of Prime Minister Narendra Modi for a developed India,” Pathak was quoted by news agency ANI.\nAs the Uttar Pradesh government prepares to present its budget on Wednesday, Chief Minister Yogi Adityanath highlighted what he described as a transformative decade for the state under Prime Minister Narendra Modi’s leadership.\nIn a post on ‘X’, CM Yogi said, “New Uttar Pradesh in a New India” has experienced unprecedented development and prosperity over the past ten years.\nCalling the upcoming budget a “decennial testament,” the Chief Minister said it reflects his government’s sustained commitment to the aspirations of the state’s 25 crore citizens.\nLatest Blogs",
        "link": "https://www.news18.com/india/up-budget-2026-live-updates-cm-yogi-suresh-khanna-key-announcements-uttar-pradesh-state-budget-2026-27-highlights-liveblog-9894237.html",
        "date": "Wed, 11 Feb 2026 14:38:46 +0530",
        "fetched_at": "2026-02-13 04:03:30.507449"
    },
    {
        "title": "Parliament Budget Session 2026 Live Updates: Govt Says Rahul Gandhi Misled House, To File Privilege Notice Against Him",
        "content": "Budget Session Of Parliament 2026 Live Updates: Lok Sabha Leader of Opposition Rahul Gandhi on Wednesday spoke on the Union Budget and India-US trade deal in the Lower House following several days of opposition protests over his earlier remarks about former Army Chief General MM Naravane’s unpublished memoir. His remarks triggered an uproar in the House, with the government accusing him of misleading the House.\nFurther, Parliamentary Affairs Minister Kiren Rijiju has said that the government will file a privilege notice against Rahul Gandhi, alleging that he made baseless allegations.\nIt is learnt that the suspension of eight Opposition MPs will remain in force. Further, the Opposition staged a walkout from the Lok Sabha over the MP suspension issue.\nOn Tuesday, as both Houses discussed the Budget, the Opposition MPs took the opportunity to slam the Centre over the framework of the India-United States interim trade agreement.\nFurther, the Opposition has submitted a no-confidence notice against Lok Sabha Speaker Om Birla. Gaurav Gogoi, Deputy Leader of Congress in Lok Sabha, said the notice, signed by 118 Opposition MPs, was submitted under Article 94-C of the Constitution to the Lok Sabha Secretary-General. Notably, the Trinamool Congress (TMC) chose not to sign the notice. According to media reports, the discussion on the motion to remove the Speaker could take place on March 9.\nMeanwhile, BJP women MPs wrote to Speaker Birla, urging him to take “strictest possible action” under parliamentary rules against certain Opposition MPs following disruptions in the House on February 4. Follow for Live updates.\nUnion Minister Pralhad Joshi responded to Rahul Gandhi’s remarks, saying that allegations against a member of the House require proper notice. He added that if the person in question is not a member, making such claims is unacceptable. Joshi criticised Gandhi’s approach, stating, “Simply bringing a piece of paper and saying, ‘I authenticate, I authenticate,’ does not make it authentic. He should understand this. He does not understand the meaning of authentication or even the rules. That is why he says anything.”\nUnion Parliamentary Affairs Minister Kiren Rijiju accused Congress leader Rahul Gandhi of misleading the Lok Sabha on Wednesday and announced plans to file a privilege notice against him. Rijiju alleged that Gandhi’s remarks during the House proceedings contained inaccuracies that misrepresented facts.\nBJP MP Anurag Thakur described the Union Budget as driving the government’s vision of a “Viksit Bharat,” calling it the “Vikas Express” propelling the nation forward. He highlighted the wide range of sectors set to benefit, noting them from A to Z, and emphasised that the government’s fiscal plan aims to ensure inclusive growth across industries and social groups.\nBJP MP Anurag Thakur described the Union Budget as driving the government’s vision of a “Viksit Bharat,” calling it the “Vikas Express” propelling the nation forward. He highlighted the wide range of sectors set to benefit, noting them from A to Z, and emphasised that the government’s fiscal plan aims to ensure inclusive growth across industries and social groups.\nResponding to the Union Budget discussion in the Lok Sabha, BJP MP Anurag Thakur lauded Indian women for their leadership and financial skills. “Indian women are born economists with rare foresight and natural accountants by instinct,” he said, noting that the Budget not only supports the poor through welfare initiatives but also empowers women, aids farmers, and opens up opportunities for the youth.\nDuring the Budget Session 2026, IT Minister Ashwini Vaishnaw emphasised that India’s digital infrastructure and data are fully secure, dismissing Rahul Gandhi’s claims of a potential data threat. “India’s data is secure,” the Minister said.\n#WATCH | Delhi | Union Minister Ashwini Vaishnaw says, “The data in India is secured under the Data Protection Act. All sensitive sectors in the country have their own regulations. Things should be authenticated before levelling allegations.” pic.twitter.com/LjWGQOiuaw\n— ANI (@ANI) February 11, 2026\n\nUnion Parliamentary Affairs Minister Kiren Rijiju responded to Rahul Gandhi’s criticism, asserting that India’s sovereignty and national interests cannot be compromised. “Nobody can sell India,” Rijiju said, emphasising the government’s commitment to protecting the country’s economic and strategic interests.\nBJP MP Anurag Thakur addresses the Lok Sabha on Wednesday.\nRahul Gandhi pointed out that people generate data, and with its 1.4 billion population, India has one of the largest data reserves globally. “Everybody talks about AI, but talking about AI is like talking about an internal combustion engine without petrol. The petrol for AI is data,” he said.\nLoP Rahul Gandhi stated in the Lok Sabha that India should never be equated with Pakistan in diplomatic or strategic matters. “We will not be made equal to Pakistan,” he declared, highlighting India’s distinct global stature, economic power, and robust democratic framework.\nContinuing his speech, Rahul Gandhi stressed that India needs to focus on energy security amid a volatile global landscape. Highlighting changing geopolitical dynamics, he urged that the country’s foreign policy should be driven by national interests and strategic considerations, particularly regarding energy resources and international alliances.\nCongress leader Rahul Gandhi on Wednesday said Prime Minister Narendra Modi was mistaken in claiming that the “era of war is over.” Addressing the Lok Sabha, Gandhi contended that ongoing global conflicts and rising geopolitical tensions suggest the opposite.\nDuring the Parliament Budget Session 2026, Leader of Opposition Rahul Gandhi said that energy and finance are increasingly being used as strategic weapons in today’s world. Speaking in the Lok Sabha, he argued that global conflicts and geopolitical tensions have reshaped economic policies.\nLeader of Opposition in Lok Sabha Rahul Gandhi on Wednesday spoke on the Union Budget in the Lok Sabha.\nUnion Parliamentary Affairs Minister Kiren Rijiju on Wednesday criticised Congress leader and Leader of Opposition Rahul Gandhi amid the controversy surrounding MM Naravane’s memoir. Rijiju said it is “not right to use our security as a political weapon.” Read more\nShortcomings have been identified in the no-confidence motion notice submitted by Opposition MPs seeking the removal of Lok Sabha Speaker Om Birla, ANI reported, citing Sources said, on Wednesday. The notice reportedly referred to events of February 2025 four times, which, under parliamentary rules, could have been grounds for its rejection.\nThe Opposition on Wednesday staged a walkout from the Lok Sabha in protest against the suspension of eight MPs, highlighting their disagreement with the decision and expressing dissent over the handling of the issue in the House.\nAccording to govt sources, the suspension of eight Lok Sabha MPs is unlikely to be revoked, suggesting that the disciplinary action against them will remain in place for the time being.\nUnion Parliamentary Affairs Minister Kiren Rijiju on Wednesday claimed that 20-25 Congress MPs entered the Lok Sabha Speaker Om Birla’s chamber and “abused him”, with senior leaders like Priyanka Gandhi Vadra and KC Venugopal present and encouraging the confrontation. He noted that the Speaker remained calm and tolerant, warning that stricter actions could have been taken otherwise.\nUnion Parliamentary Affairs Minister Kiren Rijiju on Wednesday criticised Congress leader Rahul Gandhi, saying he cannot “teach lessons” to him and questioning the ideology behind his actions. He urged senior Congress members to guide him, emphasising that Parliament should not function like a playground. Rijiju stressed that the country’s security is a serious matter and should not be misused for political purposes or to undermine anyone’s dignity.\nCommunications Minister Jyotiraditya Scindia addressed the Lok Sabha on Wednesday.\nRajya Sabha proceedings resumed at 11 am on Wednesday.\nLok Sabha proceedings resume at 11 am on Wednesday.\nLeader of Opposition in Lok Sabha, Rahul Gandhi, will intervene in the ongoing discussion on the Union Budget 2026-27 in the Lower House on Wednesday, ANI reported.\nAccording to sources, Lok Sabha Speaker Om Birla has decided, on moral grounds, not to attend House proceedings until the no-confidence motion notice against him is disposed of. Meanwhile, he has instructed the House Secretary-General to review the notice and take appropriate action, according to sources.\nThe Opposition submitted a no-confidence motion against Lok Sabha Speaker Om Birla on Tuesday. According to sources from the Lok Sabha Secretariat, the discussion on the motion is expected to take place on March 9, the first day of the second part of the Budget Session.\nLatest Blogs",
        "link": "https://www.news18.com/india/parliament-budget-session-2026-live-updates-budget-debate-lok-sabha-rajya-sabha-rahul-gandhi-narendra-modi-india-us-trade-deal-latest-news-liveblog-ws-l-9894103.html",
        "date": "Wed, 11 Feb 2026 15:27:11 +0530",
        "fetched_at": "2026-02-13 04:03:31.532797"
    },
    {
        "title": "NEW RULES: Standing Up for 'Vande Mataram' Now Mandatory | Govt Issues Guidelines | News18",
        "content": "In a historic move on February 11, 2026, the Union Home Ministry issued a 10-page directive formalizing the protocol for India's national song, 'Vande Mataram'. For the first time, the government has mandated that the audience must stand at attention whenever the official version is played or sung at government events and schools., , , , , , , n18oc_indiaNews18 Mobile App - https://onelink.to/desc-youtube\nLatest Blogs",
        "link": "https://www.news18.com/videos/india/new-rules-standing-up-for-vande-mataram-now-mandatory-govt-issues-guidelines-news18-9896003.html",
        "date": "Wed, 11 Feb 2026 09:52:15 +0530",
        "fetched_at": "2026-02-13 04:03:32.253798"
    },
    {
        "title": "Over 50% Of Global Exploitation, Racism Complaints By Indian Students Come From Russia: Govt",
        "content": "A new data from the Ministry of External Affairs shows that over half of all complaints of exploitation and racial discrimination by Indian students globally come from Russia, The Times of India reported.\nAccording to the data, Indian students across 196 countries lodged around 350 complaints of harassment, exploitation and racial discrimination in 2025. Of these, more than 200 originated in Russia, with Moscow emerging as the biggest hotspot.\nThe number of complaints from Russia has risen sharply over the past three years, from 68 in 2023 to 78 in 2024, surging to 201 in 2025.\nMost Indian students in Russia are pursuing medical courses, and hail from states including Rajasthan, Gujarat, Andhra Pradesh, Telangana, Kerala and Tamil Nadu. Russia remains a popular destination due to lower tuition fees and relatively easier admission procedures.\nThe issue came into focus following a stabbing incident at the State Medical University in Ufa, in Russia’s Bashkortostan Republic, on Saturday. A 15-year-old school student armed with a knife attacked students in a dormitory, injuring four Indian medical students and two police officers.\nALSO READ: What Is The Ratio Of OBC, SC, ST Students In Indian Colleges? | Explained\nThe Indian Embassy in Moscow said the four students were “stable and recovering well,\" and consular officials from Kazan visited them in hospital. The teenager pleaded guilty and has been remanded to two months’ judicial custody.\nMeanwhile, during a Rajya Sabha question hour in December last year, Minister of State for External Affairs Kirti Vardhan Singh had stressed that the government gives high priority to the welfare and safety of Indian students abroad.\nHe had noted that Indian missions regularly contact students, visit educational institutions, and provide support through the MADAD portal, emergency helplines, emails, and social media, to ensure grievances are addressed promptly.\n“Complaints related to misleading academic programmes or untoward incidents/experiences faced by Indian students abroad are promptly taken up with the concerned educational institutions and/or with the authorities of the host country for necessary action,\" Vardhan had noted.\nLatest Blogs",
        "link": "https://www.news18.com/india/over-50-of-global-exploitation-racism-complaints-by-indian-students-come-from-russia-govt-ws-l-9893802.html",
        "date": "Tue, 10 Feb 2026 22:57:56 +0530",
        "fetched_at": "2026-02-13 04:03:33.013537"
    },
    {
        "title": "No Mandatory Service Charge: Centre As Restaurants Across India Slapped With Hefty Fines",
        "content": "The Centre on Tuesday said that levying a mandatory service charge on food bills violates consumer protection laws, warning that restaurants engaging in the practice are liable to face penalties.\nThe Ministry of Consumer Affairs, Food and Public Distribution said the Central Consumer Protection Authority (CCPA) has taken action against 27 restaurants across the country for what it described as “unfair trade practices\".\nThe action was initiated suo motu under the Consumer Protection Act, 2019, which prohibits the compulsory collection of service charges.\nAccording to the CCPA, automatically adding a service charge to a customer’s bill is unlawful.\nThe authority cited violations under Section 2(47) of the Act, which defines unfair trade practices. As part of the enforcement drive, Café Blue Bottle in Patna was fined Rs 30,000, while Mumbai-based restaurant China Gate was penalised Rs 50,000 for levying a default 10 per cent service charge on customers.\nThe ministry noted that the Delhi High Court, in March 2025, upheld the CCPA’s guidelines, affirming that mandatory collection of service charges by hotels and restaurants is contrary to law.\nUnder these guidelines, hotels and restaurants are barred from automatically or compulsorily adding a service charge to food bills, or collecting it under any alternative name.\nEstablishments must clearly inform customers that payment of a service charge is voluntary and optional, and cannot deny entry or services to those who refuse to pay it. The guidelines also specify that service charges cannot be subjected to GST.\nActing on complaints received through the National Consumer Helpline, the CCPA has directed erring restaurants to refund the full amount charged to consumers, immediately discontinue the practice, and remove the default inclusion of service or similar charges from their billing systems.\nThe ministry said enforcement action will continue to ensure compliance and protect consumer rights.\nLatest Blogs",
        "link": "https://www.news18.com/india/no-mandatory-service-charge-centre-as-restaurants-across-india-slapped-with-hefty-fines-9893774.html",
        "date": "Tue, 10 Feb 2026 22:14:20 +0530",
        "fetched_at": "2026-02-13 04:03:34.126005"
    },
    {
        "title": "AI Misinfo, Deepfake Under Scanner As Govt Brings Tougher IT Rules For Social Media Platforms",
        "content": "The government has notified a new law and revised guidelines aimed at tackling deepfakes and misleading AI-generated content on the internet, requiring platforms and users to clearly disclose material that is not real and significantly tightening timelines for takedown of harmful content.\nUnder the new framework, anyone uploading AI-generated or AI-altered photos, videos or audio, including deepfakes, will be required to declare that the content has been created or modified using artificial intelligence. Social media platforms such as Facebook, Instagram, YouTube and X will also be mandated to clearly label AI-generated content so users are not misled into believing it depicts a real person or a real event.\nThe law further mandates that AI-generated files carry embedded digital tracking, or metadata, enabling experts to identify the AI tool used to create the content. Platforms have been barred from allowing the removal or suppression of such labels or associated metadata once applied, a move aimed at strengthening traceability and accountability in cases of misuse.\nTaking cognisance of the spread of AI-based deepfakes, the IT Ministry has set a strict three-hour deadline for social media intermediaries to take down AI-generated or deepfake content once it is flagged by the government or ordered by a court. Earlier, platforms had up to 36 hours to remove such content. Grievance redressal timelines have also been tightened, with platforms now required to acknowledge user complaints within two hours, down from 24, and resolve them within seven days instead of 15.\nThe revised guidelines also direct social media companies to deploy reasonable and appropriate technical measures, including automated tools, to detect and prevent the circulation of illegal, sexually exploitative or deceptive AI-generated content. Platforms must ensure that users are not allowed to create, publish or disseminate synthetically generated information that violates existing laws, including the Bharatiya Nyaya Sanhita, the POCSO Act and the Explosive Substances Act.\nAdditionally, intermediaries have been instructed to periodically inform users — at least once every three months — about the consequences of violating rules related to AI misuse through their terms of service, privacy policies or other appropriate means. Where violations are detected, platforms are required to take “expeditious and appropriate action\".\nThe changes are intended to curb the misuse of artificial intelligence, improve transparency online and ensure faster action against harmful digital content, even as social media platforms have already begun rolling out features that allow users to label content generated or modified using AI.\nLatest Blogs",
        "link": "https://www.news18.com/india/social-media-firms-asked-to-remove-harmful-content-within-3-hours-as-govt-notifies-new-it-act-rules-9893032.html",
        "date": "Tue, 10 Feb 2026 19:12:38 +0530",
        "fetched_at": "2026-02-13 04:03:35.558524"
    },
    {
        "title": "Govt Is Working On A Strategy For Real-Time Reporting Of Cybercrimes: Amit Shah",
        "content": "Union Home Minister Amit Shah on Tuesday said the Ministry of Home Affairs has put in place a comprehensive and multi-dimensional strategy to tackle cybercrime, with a strong focus on real-time reporting of cyber incidents.\nSpeaking at a national conference on ‘Tackling Cyber-Enabled Frauds and Dismantling the Ecosystem’, organised by the Central Bureau of Investigation (CBI), Shah said cybercrime has evolved beyond financial fraud and now poses serious challenges to the country’s digital security.\nThe Home Minister said the government’s strategy rests on several key pillars, including real-time reporting of cybercrime, the creation of a robust network of forensic laboratories, capacity building of enforcement agencies, research and development, promotion of cyber awareness, and ensuring cyber hygiene across cyberspace.\n“Our goal is to bring together all stakeholders to create a secure and trustworthy digital ecosystem,\" Shah said, adding that agencies such as the CBI, National Investigation Agency (NIA), Reserve Bank of India (RBI), state police forces and other investigating bodies are being integrated into a coordinated framework to combat cyber threats effectively.\nHe noted that the rapid growth of digital transactions and UPI-based payments has made cybersecurity a critical national priority.\nWhile acknowledging that cyber fraud cases have increased alongside India’s expanding digital footprint, Shah said sustained and coordinated measures are being taken to counter emerging threats.\nHighlighting institutional coordination, the Home Minister referred to platforms such as I-Force, established to facilitate real-time cooperation among enforcement agencies. He said the initiative has delivered results and will now be further strengthened with deeper inter-agency collaboration.\nProviding an update on enforcement efforts, Shah said agencies led by the Indian Cyber Crime Coordination Centre (I4C) have so far saved or frozen over Rs 8,000 crore of the nearly Rs 20,000 crore lost to cyber fraud until November 30, 2025.\nDuring this period, around 82 lakh cybercrime complaints were received, resulting in the registration of 1.84 lakh FIRs.\nHowever, Shah cautioned that cybercriminal networks are becoming increasingly organised and technologically advanced, often staying ahead of law enforcement.\nHe urged participants at the conference to intensify efforts and take the fight against cybercrime to the next level.\nThe Home Minister also said that while 62 banks and financial institutions have already been onboarded onto the secure framework, the government aims to bring all cooperative banks under its ambit by December 31 to further strengthen safeguards within the financial system.\nLatest Blogs",
        "link": "https://www.news18.com/india/data-is-being-stolen-and-sold-to-enemies-amit-shah-says-govt-stepping-up-cybersecurity-efforts-ws-l-9892983.html",
        "date": "Tue, 10 Feb 2026 21:16:10 +0530",
        "fetched_at": "2026-02-13 04:03:36.369500"
    },
    {
        "title": "Bird Flu Alert In Andhra Pradesh: High Vigilance In One District, Government Issues Advisory",
        "content": "Bird flu, also known as avian influenza, has triggered fresh concern in parts of Andhra Pradesh, prompting the state government to step up surveillance and containment measures. While officials stress that the situation remains under control, precautionary steps have been intensified not only in the affected pockets but also in neighbouring villages and districts to prevent further spread.\nDeaths of country chickens were reported from parts of Chittoor and Annamayya districts, prompting the Animal Husbandry Department to send samples to the Bhopal-based National Institute of High Security Animal Diseases for testing.\nState minister Kinjarapu Atchannaidu has urged people not to panic, stating that the outbreak is being handled through coordinated action by animal husbandry and local administrative teams. He stressed that early detection and rapid response are helping authorities keep the risk contained.\nCases Surface In Annamayya District\nThe immediate alert was issued after suspected bird flu cases emerged in Sadum mandal of Annamayya district. Unusual bird deaths were reported in villages such as Puttavaripalli and Ammagaripalli, prompting swift intervention by officials. Once the infection was suspected, special Rapid Action Teams were deployed to the area.\nThese teams are carrying out scientific culling of infected birds, disinfecting poultry farms and surrounding zones, and restricting the movement of birds and farm equipment. Such containment protocols are standard practice to stop avian influenza from spreading to healthy flocks.\nSurveillance Extended To Chittoor\nAuthorities have also widened monitoring to nearby regions after reports of unexplained bird deaths surfaced in parts of Chittoor district, including Karvetinagaram mandal. Samples from affected birds have been collected and sent to the National Institute of High Security Animal Diseases laboratory in Bhopal for confirmatory testing. Officials said further action will depend on laboratory findings.\nGuidelines For Poultry Farmers\nThe Animal Husbandry Department has issued continuous advisories to poultry farmers in and around affected zones. Farm owners have been asked to strictly follow biosecurity norms, limit entry of outsiders into poultry sheds, and immediately report any sudden or unusual bird deaths to veterinary officials. Field teams led by senior department officers are visiting villages to spread awareness and ensure compliance with safety protocols.\nNo Need To Fear Cooked Chicken Or Eggs\nAmid rising public concern, the government has clarified that bird flu primarily affects birds and does not pose a risk through properly cooked food. Citizens have been reassured that thoroughly cooked chicken and boiled eggs remain safe for consumption. However, people are advised to maintain basic hygiene, such as washing hands after handling raw meat and avoiding contact with sick or dead birds.\nOfficials remain confident that with early intervention, strict monitoring, and public cooperation, the outbreak can be contained before it spreads to other districts. The focus, they say, is on prevention without triggering unnecessary alarm.\nDeaths of country chickens were reported from parts of Chittoor and Annamayya districts, prompting the Animal Husbandry Department to send samples to the Bhopal-based National Institute of High Security Animal Diseases for testing.\n\nState minister Kinjarapu Atchannaidu has urged people not to panic, stating that the outbreak is being handled through coordinated action by animal husbandry and local administrative teams. He stressed that early detection and rapid response are helping authorities keep the risk contained.\nCases Surface In Annamayya District\n\nThe immediate alert was issued after suspected bird flu cases emerged in Sadum mandal of Annamayya district. Unusual bird deaths were reported in villages such as Puttavaripalli and Ammagaripalli, prompting swift intervention by officials. Once the infection was suspected, special Rapid Action Teams were deployed to the area.\n\nThese teams are carrying out scientific culling of infected birds, disinfecting poultry farms and surrounding zones, and restricting the movement of birds and farm equipment. Such containment protocols are standard practice to stop avian influenza from spreading to healthy flocks.\n\nSurveillance Extended To Chittoor\n\nAuthorities have also widened monitoring to nearby regions after reports of unexplained bird deaths surfaced in parts of Chittoor district, including Karvetinagaram mandal. Samples from affected birds have been collected and sent to the National Institute of High Security Animal Diseases laboratory in Bhopal for confirmatory testing. Officials said further action will depend on laboratory findings.\n\nGuidelines For Poultry Farmers\n\nThe Animal Husbandry Department has issued continuous advisories to poultry farmers in and around affected zones. Farm owners have been asked to strictly follow biosecurity norms, limit entry of outsiders into poultry sheds, and immediately report any sudden or unusual bird deaths to veterinary officials. Field teams led by senior department officers are visiting villages to spread awareness and ensure compliance with safety protocols.\n\nNo Need To Fear Cooked Chicken Or Eggs\n\nAmid rising public concern, the government has clarified that bird flu primarily affects birds and does not pose a risk through properly cooked food. Citizens have been reassured that thoroughly cooked chicken and boiled eggs remain safe for consumption. However, people are advised to maintain basic hygiene, such as washing hands after handling raw meat and avoiding contact with sick or dead birds.\nOfficials remain confident that with early intervention, strict monitoring, and public cooperation, the outbreak can be contained before it spreads to other districts. The focus, they say, is on prevention without triggering unnecessary alarm.\n\nScan the QR code to download the News18 app and enjoy a seamless news experience anytime, anywhere.\nLatest Blogs",
        "link": "https://www.news18.com/india/bird-flu-alert-in-andhra-pradesh-high-vigilance-in-one-district-government-issues-advisory-shil-ws-l-9892826.html",
        "date": "Tue, 10 Feb 2026 16:45:08 +0530",
        "fetched_at": "2026-02-13 04:03:37.140326"
    },
    {
        "title": "'How Did He Get Book?' BJP Asks Rahul Gandhi Amid Naravane's Memoir Row, Congress Responds",
        "content": "The BJP on Tuesday stepped up its attack on Congress leader Rahul Gandhi, questioning how he obtained a physical copy of former Army chief General MM Naravane’s memoir after its publisher said the book has not yet been released.\nThe controversy centres on Four Stars of Destiny, General Naravane’s memoir, after Penguin Random House India issued a clarification stating that while it holds exclusive publishing rights, the manuscript has not been published “in any form\" so far.\nThe publisher said the statement was issued in view of reports about unauthorised copies being circulated.\nDespite the clarification, Gandhi maintained that the book was publicly available, citing a social media post by General Naravane from December 2023.\nA screenshot of the post shows the former Army chief announcing that his book was “available now\" and directing readers to a link.\nAddressing reporters outside Parliament, Gandhi said the publisher’s claim was questionable. “Here is a tweet from General Naravane which says, ‘Just follow the link to my book.’ Either General Naravane is lying or Penguin is lying, and I do not believe the former Army Chief would lie,\" he said.\nHere is a tweet from Mr Naravane which says, “Just follow the link to my book.\" The point I am making is this: either Mr Naravane is lying, or Penguin is lying. I do not think the former Army Chief would lie. Penguin says the book has not been published, but the book is available… pic.twitter.com/Xtn7gygC2K— Congress (@INCIndia) February 10, 2026\nThe BJP rejected Gandhi’s argument, saying he had misunderstood the difference between a pre-order announcement and an official publication.\nBJP national spokesperson Shehzad Poonwalla accused the Congress leader of misleading Parliament and the public, calling him a “national embarrassment\".\nIn a post on X, the spokesperson said the tweet cited by Gandhi referred only to a pre-order facility. “Now the questions remain: how did he get the book? Was there a violation of the Copyright Act and the Official Secrets Act? Did Rahul Gandhi mislead the country and make false allegations against Defence Minister Rajnath Singh? Did he disrupt Parliament based on this?\" the post read.\nRahul Gandhi is a national embarrassmentDoesn’t know difference between pre-order and published\nThe tweet he quoted was a Pre-order\nNow the question remains\n1) how did he get the book?2) isn’t it violation of Copyright Act and Official Secrets Act ?3) did Rahul not lie… pic.twitter.com/nby08xwmlJ\n— Shehzad Jai Hind (Modi Ka Parivar) (@Shehzad_Ind) February 10, 2026\nGeneral Naravane’s December 2023 post had included an image from Penguin highlighting that Four Stars of Destiny was available for pre-order, a distinction the BJP has emphasised in its response.\nHello friends. My book is available now. Just follow the link. Happy reading. Jai Hind pic.twitter.com/VCiLiZOWIi— Manoj Naravane (@ManojNaravane) December 15, 2023\nHowever, General Naravane on Tuesday himself shared Penguin Random House India’s clarification on the status of his memoir, Four Stars of Destiny, as the controversy over the book’s publication continued to trigger sharp political exchanges.\n\n\nCongress MP Karti Chidambaram also reacted to the controversy, saying that anything available in the public domain should be considered as published.\n“In today’s world, if something is available in the public domain, it is effectively published. If Penguin has an issue with people using portions of the material, they should pursue a copyright case, we are not concerned with that. The only person who has the authority to clarify this is the author himself, and he has not denied writing it. We are merely quoting what already exists,\" the Congress MP said.\nThe row over the memoir erupted last week during a heated debate in Parliament when Gandhi sought to read excerpts from a book review published by an Indian news website, relating to the 2020 India-China standoff in eastern Ladakh that culminated in the Galwan Valley clash.\nGandhi was stopped by the Speaker, who cited House rules barring unpublished material from being read into the official record.\nAlthough Gandhi offered a personal assurance on the authenticity of the excerpts, he was prevented from reading them out again the following day, triggering sharp exchanges between ruling party and opposition MPs.\nThe disruption led to the suspension of eight opposition MPs for the remainder of the session.\nAmid continued protests, Prime Minister Narendra Modi’s scheduled Lok Sabha address was cancelled, a move the Speaker attributed to opposition members allegedly planning an “attack\" on the Prime Minister.\nSubsequently, Gandhi wrote to Lok Sabha Speaker Om Birla, describing the episode as a “blot on our democracy\" and protesting against what he termed an attempt to silence debate on national security issues.\nLatest Blogs",
        "link": "https://www.news18.com/india/how-did-he-get-the-book-bjp-asks-rahul-gandhi-as-mm-naravanes-memoir-publisher-denies-release-9892696.html",
        "date": "Tue, 10 Feb 2026 20:13:38 +0530",
        "fetched_at": "2026-02-13 04:03:37.864367"
    },
    {
        "title": "'Book Considered Published Only When On Sale': Penguin's Fresh Clarification In Naravane Row",
        "content": "Amid the ongoing controversy over General (Retd.) MM Naravane’s memoir Four Stars of Destiny, Penguin India on Tuesday issued another clarification, stating that an announced title, a pre-order listing and a published book are distinct stages, and that a book is considered published only when it is available for purchase across retail channels.\nIn its latest clarification, the publisher said the presence of a pre-order listing does not amount to publication. “A book is considered published only when it is available for purchase across retail channels,\" Penguin Random House India said, reiterating that Four Stars of Destiny has not been published in any format.\nThe renewed clarification comes after Congress MP Rahul Gandhi questioned the publisher’s stand, alleging inconsistencies over the book’s status. Citing a 2023 post by Naravane that said, “Hello friends. My book is available now. Just follow the link. Happy reading. Jai Hind,\" Rahul Gandhi claimed the tweet suggested the book had been made available. He said either Naravane or Penguin was “lying\" about the release.\nRahul Gandhi is a national embarrassmentDoesn’t know difference between pre-order and published\nThe tweet he quoted was a Pre-order\nNow the question remains\n1) how did he get the book?2) isn’t it violation of Copyright Act and Official Secrets Act ?3) did Rahul not lie… pic.twitter.com/nby08xwmlJ\n— Shehzad Jai Hind (Modi Ka Parivar) (@Shehzad_Ind) February 10, 2026\nThe publisher has maintained that the tweet carried only a pre-order link and that the book was withdrawn two days later. Since then, Four Stars of Destiny has remained unavailable on e-commerce platforms, Penguin said.\nAfter Penguin’s second clarification, BJP leader Shehzad Poonawalla, too, attacked Congress MP Rahul Gandhi, calling him a “national embarrassment\" and accusing him of not understanding the difference between a pre-order listing and a published book.\nAlso Read: ‘I Believe Gen Naravane, Don’t Think He’ll Lie’: Rahul Gandhi Reacts To Penguin’s Statement On Book\nPoonawalla said the tweet cited by Gandhi referred only to a pre-order and raised questions over how Gandhi accessed the book in the first place, asking whether it amounted to violations of the Copyright Act and the Official Secrets Act.\nHe also alleged that Gandhi had misled the country, levelled “completely false\" allegations against Defence Minister Rajnath Singh, and disrupted Parliament on the basis of what he claimed was an incorrect premise.\nEarlier, Penguin India had issued a formal statement on X asserting that it holds the sole publishing rights for the book and that it has not been released. “We wish to make it clear that the book has not gone into publication. No copies of the book, in print or digital form, have been published, distributed, sold, or otherwise made available to the public by Penguin Random House India,\" the publisher said.\nThe publisher also warned that any copies currently in circulation, whether in print, digital, PDF or any other format, amount to copyright infringement and must be stopped immediately. It added that it would pursue legal remedies against any illegal or unauthorised sharing of the book and said the clarification was being issued to place its position on record.\nCongress MP Rahul Gandhi triggered a political row after displaying a copy of former Army chief General (Retd.) MM Naravane’s memoir Four Stars of Destiny in the Lok Sabha, drawing strong objections from senior BJP leaders who said the Leader of the Opposition cannot quote in Parliament from an unpublished book.\nLatest Blogs",
        "link": "https://www.news18.com/india/book-considered-published-only-when-on-sale-penguins-fresh-clarification-in-naravane-row-ws-l-9892577.html",
        "date": "Tue, 10 Feb 2026 15:52:14 +0530",
        "fetched_at": "2026-02-13 04:03:38.590508"
    }
]