[
    {
        "title": "“Deeply disturbing”: Candace Owens backs must read opinion post on Erika Kirk’s behavior after Charlie Kirk’s passing",
        "content": "Sehjal Gupta is a sports journalist covering US and international sports, with a specialization in the NFL. She has been writing about sports since 2025, reporting on leagues, tournaments, and athletes who shape the game. A Master’s in Management adds depth to her analysis, while her love for Hollywood movies and pop culture sparks her storytelling voice, a flair that also shapes her entertainment writing, giving it the same energy and creativity she brings to sports.Read More",
        "link": "https://timesofindia.indiatimes.com/world/us-streamers/deeply-disturbing-candace-owens-backs-must-read-opinion-post-on-erika-kirks-behavior-after-charlie-kirks-passing/articleshow/128329026.cms",
        "date": "2026-02-14T05:48:38+05:30",
        "fetched_at": "2026-02-14 03:52:07.395215"
    },
    {
        "title": "‘I know this disease will kill me’: RFK Jr admits snorting cocaine off toilet seats, non-profit org calls on him to 'resign'",
        "content": "At TOI World Desk, our dedicated team of seasoned journalists and passionate writers tirelessly sifts through the vast tapestry of global events to bring you the latest news and diverse perspectives round the clock. With an unwavering commitment to accuracy, depth, and timeliness, we strive to keep you informed about the ever-evolving world, delivering a nuanced understanding of international affairs to our readers. Join us on a journey across continents as we unravel the stories that shape our interconnected world.Read More",
        "link": "https://timesofindia.indiatimes.com/world/us/i-know-this-disease-will-kill-me-rfk-jr-admits-snorting-cocaine-off-toilet-seats-non-profit-org-calls-on-him-to-resign/articleshow/128316569.cms",
        "date": "2026-02-13T22:56:33+05:30",
        "fetched_at": "2026-02-14 03:52:08.013471"
    },
    {
        "title": "NABARD projects ₹4.88 lakh crore priority sector credit for Rajasthan",
        "content": "February 14, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 14, 2026e-Paper\nUpdated  - February 14, 2026 07:39 am IST - JAIPUR\nChief Secretary of the Rajasthan Government V. Srinivas during the NABARD’s State Credit Seminar. Photo: X/@svoruganti1466.\nThe National Bank for Agriculture and Rural Development (NABARD) has projected the priority sector credit potential of ₹4.88 lakh crore for 2026-27 in Rajasthan. The State Focus Paper (SFP), revealing the district-wise realistic potential in both physical and financial terms, was launched in Jaipur on Friday (February 13, 2026).\nAlso Read | NABARD pegs FY27 priority sector credit potential of Telangana at ₹4.43 lakh crore\nChief Secretary V. Srinivas highlighted the ₹6.11 lakh crore State Budget outlay while releasing the SFP at the NABARD’s State Credit Seminar. Mr. Srinivas said the NABARD had carried out credit planning with the preparation of SFP for the next financial year to align financial institutions with the State’s development priorities.\nMr. Srinivas asked the banks and other stakeholders to work in unison to achieve the projections made in the SFP. “NABARD has played a significant role in strengthening the cooperative movement through computerisation, training programmes and financial support to cooperatives,” he said.\nNABARD Chief General Manager for Rajasthan, R. Ravi Babu, said the priority sector credit potential had been calculated in line with the State government’s vision for ‘Developed Rajasthan-2047’. “The block-wise credit potentials are estimated for different sub-sectors while considering the available infrastructure and the actual ground-level credit flow,” he said.\nWithin the estimates, agriculture and allied activities were projected at ₹2.24 lakh crore and micro, small and medium enterprises at ₹2.27 lakh crore in an indication of the growth balance emerging between farm and non-farm sectors.\nMr. Babu said the credit potential assessed in the SFP would serve as a benchmark for the preparation of the annual credit plan. A roadmap will also be created for achieving the credit projections, improving last-mile delivery, and promoting inclusion, especially for women farmers and cooperative institutions.\nThe efforts made by the primary agricultural credit societies (PACS), multi-purpose PACS, district central cooperative banks and farmer producer organisations during 2025-26 were also praised at the seminar.\nAmong others, Additional Chief Secretary (Industries) Shikhar Agrawal, Additional Chief Secretary (Energy) Ajitabh Sharma, Principal Secretary (Cooperative) Manju Rajpal, and Finance (Budget) Secretary Rajan Vishal were present.\nPublished - February 14, 2026 05:56 am IST\nRajasthan\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/rajasthan/nabard-projects-488-lakh-crore-priority-sector-credit-for-rajasthan/article70628906.ece",
        "date": "Sat, 14 Feb 2026 07:39:45 +0530",
        "fetched_at": "2026-02-14 03:52:09.046074"
    },
    {
        "title": "BJP hints at fielding three candidates for Rajya Sabha election from Odisha",
        "content": "February 14, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 14, 2026e-Paper\nUpdated  - February 14, 2026 06:50 am IST - BHUBANESWAR\nThis image is used for representational purposes only.\n                                          | Photo Credit: The Hindu\nThe Bharatiya Janata Party (BJP) on Friday (February 13, 2026) exuded confidence that the party would send three out of four seats from the Odisha quota to Rajya Sabha next month.\nThe tenure of four Rajya Sabha members of Odisha is coming to an end on April 2 this year. However, the BJP does not have the requisite numbers in the State Assembly to ensure the election of a third candidate to the Upper House of Parliament.\nIn the 147-member Odisha Legislative Assembly, the BJP has 79 MLAs, followed by the Biju Janata Dal with 50, the Congress with 14, one member from the CPI(M), and three independents. The BJP currently enjoys the support of all three Independent MLAs.\nA candidate requires first-preference votes of 31 MLAs to secure election to the Rajya Sabha. Given the present strength in the Assembly, the BJP and the BJD can comfortably ensure the election of two and one candidates, respectively. It requires political manoeuvring by either BJP or BJD to ensure the election of their candidate.\nVijay Singh Tomar, in-charge of BJP party affairs for Odisha, on Friday (February 13, 2026) told reporters, “we are confident of sending three Rajya Sabha members from Odisha. Party’s Parliamentary Committee will take a call as to who would be their candidates.”\nThere are 10 Rajya Sabha MPs from Odisha — seven from the BJD and three from the BJP. The tenure of BJD MPs Niranjan Bishi and Muzibulla Khan and BJP MPs Mamata Mohanta and Sujeet Kumar will end on April 2.\nIt is to be noted that Odisha Pradesh Congress Committee President Bhakta Charan Das had announced to meet former Chief Minister and BJD supremo Naveen Patnaik for a discussion to jointly send a person of eminence to Rajya Sabha.\nPublished - February 14, 2026 05:36 am IST\nOrissa\n                    \n                            /                      \n                        \n                        Rajya Sabha\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/odisha/bjp-hints-at-fielding-three-candidates-for-rajya-sabha-election-from-odisha/article70628778.ece",
        "date": "Sat, 14 Feb 2026 06:50:16 +0530",
        "fetched_at": "2026-02-14 03:52:09.657301"
    },
    {
        "title": "Opposition steps up attack on Petroleum Minister Hardeep Singh Puri over Epstein Files",
        "content": "February 14, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 14, 2026e-Paper\nUpdated  - February 14, 2026 06:59 am IST - New Delhi\nCongress spokesperson Pawan Khera said that there was more yet to emerge from the Epstein-related material, and the truth would come out in due course.\n                                          | Photo Credit: File photo\nStepping up their attack on Union Petroleum Minister Hardeep Singh Puri, Opposition parties demanded his resignation, alleging that the revelations regarding his interactions with convicted sex offender Jeffrey Epstein had raised serious questions about his conduct.\nMembers of the INDIA (Indian National Developmental Inclusive Alliance) bloc on Friday (February 13, 2025) protested outside the main entrance of the Parliament building. They also raised slogans inside the Lok Sabha, forcing an adjournment.\nAddressing a press conference at the Congress headquarters, party spokesperson Pawan Khera asked in what capacity and under whose instructions Mr. Puri had met Epstein in the United States between 2014 and 2016, when he had held no official post.\nAlso Read | Files expose alleged links between Epstein, Anil Ambani and Delhi ‘leadership’\nMr. Khera said that Mr. Puri was then a retired Indian Foreign Service officer. Three Indian ambassadors were posted in Washington during this period but none of them had met Epstein. “Whose brief was Puri carrying?” Mr. Khera asked.\nAlleging that Epstein appeared to be attempting to influence foreign policy matters, Mr. Khera cited an email in which Epstein reportedly expressed “strong opinions” on developments in the Middle East.\nThe Congress leader claimed that the remarks were in reference to a visit by Palestinian President Mahmoud Abbas to India, and questioned whether subsequent diplomatic moves were influenced by such considerations.\n“This suggests that our foreign policy was not being run by the Prime Minister or the Foreign Minister, but by a sex predator sitting in the U.S.,” Mr. Khera said, noting that the then External Affairs Minister Sushma Swaraj did not figure in the Epstein-related documents.\nReferring to reports that Mr. Puri had discussed the ‘Digital India’ initiative with Epstein, Mr. Khera asked under what authority such conversations were held prior to the programme’s official announcement.\n“On November 13, 2014, Epstein sent an email to [Linked-in co-founder] Reid Hoffman, providing information about ‘Digital India’, even though ‘Digital India’ was launched in July 2015. This means that Hardeep Puri had already informed Epstein about ‘Digital India’ before the citizens of India,” he alleged.\nALSO WATCH  Watch: Hardeep Singh Puri rejects Rahul Gandhi’s allegations linking his name to Epstein files\nHe also accused the Minister of making misleading claims in his public statements, citing emails in which Mr. Puri is reportedly said to have sought meetings with Epstein.\nMr. Khera said that there was more yet to emerge from the Epstein-related material, and the truth would come out in due course.\nPublished - February 14, 2026 05:05 am IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/opposition-steps-up-attack-on-petroleum-minister-hardeep-singh-puri-over-epstein-files/article70629705.ece",
        "date": "Sat, 14 Feb 2026 06:59:11 +0530",
        "fetched_at": "2026-02-14 03:52:10.265273"
    },
    {
        "title": "Expanding export-driven manufacturing sector helps in stabilising rupee: Chief Economic Advisor",
        "content": "February 14, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 14, 2026e-Paper\nPublished - February 14, 2026 04:30 am IST - Chennai\nVIT Founder and Chancellor G. Viswanathan was honoured with the Lifetime Achievement Award by TiE Chennai at a function on Friday. \n                                          | Photo Credit: Special Arrangement\nStating that the present currency vulnerability has stemmed largely from trade uncertainties that have affected capital flow, Chief Economic Advisor V. Anantha Nageswaran said on Friday that a thrust on expanding the export-driven manufacturing sector should help in stabilising the rupee.\nTo achieve this, he suggested a three-pronged strategy: import substitution, time-bound protectionism for Indian exporters linked to production and export performance, and investment in climate adaptation before focusing on emission mitigation.\n“To be able to export in a world that is increasingly becoming self-centric and to be able to attract capital when capital itself can be held back or used as a strategic weapon isn’t going to be easy. If we don’t get our exports and capital flows correct, the casualty will be the currency. We saw that in 2025,” Mr. Nageswaran said at the inauguration of Tiecon Chennai 2026.\nV. Anantha Nageswaran, Chief Economic Advisor to the Government of India, Speaking at Inauguration of TiE con Chennai 2026 in Guindy on Friday.\n                                                            | Photo Credit: \n                                B. VELANKANNI RAJ\nIndia’s tryst with import substitution between 1947 and the 1980s was fraught with protectionism that did not elevate capabilities or manufacturing capacity, but rather spread complacency. “So, no protection in perpetuity, but protection in return for quid pro quo obligations on productivity and export performance will have to be the mantra for the next 25 years in a world that’s going to be challenging,” he observed.\n“Let us be very clear: renewable energy production requires a lot of energy in and of itself,” he said. Giving details, he said large quantities of silver, polysilicon and aluminium, and a substantial input of power were required to produce one gigawatt of solar power. Similarly, for wind power, 2,866 tonnes of copper was required for which at least 4,80,000 tonnes of ore requires handling, given that the yield of copper was only 0.6%.\n“We need to invest in climate adaptation, before we focus on emission mitigation. That is where public transportation and demand management both matter,” Mr. Nageswaran added.\nManoj Kumar, CEO, Naandi Foundation and co-founder, ARAKU Coffee, shared his experience of establishing one of the largest certified organic and free trade cooperatives among the tribal residents of the Araku Valley in Andhra Pradesh, which was once a hotbed of the Maoist movement. The valley has around 3,000 villages with about 1,00,000 families. The Naandi Foundation sought to rebuild trust among the community while conserving their deep-rooted values, he said. Each tribal family now owned a coffee estate supplying to the global brand, ARAKU Coffee.\nMurugavel Janakiraman, president, TiE Chennai, urged the participating entrepreneurs, industry leaders, investors, and ecosystem partners to embrace technological advancements like AI into their operations.\nPublished - February 14, 2026 04:30 am IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/expanding-export-driven-manufacturing-sector-helps-in-stabilising-rupee-chief-economic-advisor/article70628116.ece",
        "date": "Sat, 14 Feb 2026 01:10:47 +0530",
        "fetched_at": "2026-02-14 03:52:10.865696"
    },
    {
        "title": "West Bengal elections: CPI(M) MA Baby calls for ‘secular alliance’ with Congress",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nPublished - February 14, 2026 04:05 am IST - Kolkata\nCPI(M) General Secretary MA Baby addresses a press conference at the party's headquarters in Kolkata, West Bengal, on February 13, 2026.\n                                          | Photo Credit: PTI\nM.A. Baby, general secretary of the Communist Party of India (Marxist), said on Friday (February 13) that when Congress “realises” the importance of holding hands with secular, democratic, and progressive forces, they cooperate with them.\nHe added that this was not possible in West Bengal due to the “sectarian approach” Congress was allegedly adopting here.\n“In the fight against communal forces, especially the BJP, we want to develop political arrangements wherever possible with all forces, including Congress, in the fight against the fascistic RSS (Rashtriya Swayamsevak Sangh) and their political party BJP,” Mr. Baby said from the CPI(M) state headquarters in Kolkata on Friday (February 13, 2026). He also added that they are in cooperation with the Congress in Bihar and Tamil Nadu.\nThis comes days after West Bengal Congress formally announced that they are going solo in the upcoming Assembly elections. Congress had been in a seat-sharing arrangement with the Left Front, including CPI (M), in the last State Assembly elections.\n“Politically we want to isolate, expose, and defeat the BJP, which is controlled by the fascistic RSS,” Mr. Baby said. He added that in Bengal it is also their goal to defeat Mamata Banerjee’s Trinamool Congress government, which he alleged is an “anti-people government”.\nMr Baby also shared hope that the CPI(M) government will see a resurgence in West Bengal in the upcoming 2026 Assembly elections.\nOn February 5, Congress announced that it will contest independently in all the 294 Assembly constituencies in West Bengal, ending speculation of any electoral understanding with the Left Front in the polls due in the next few months.\nMeanwhile, CPI(M) is looking to find new alliance partners and recently held talks with Humayun Kabir, who has recently set up Janata Unnayan Party (JUP) and is also likely to get into talks with the Indian Secular Front of Naswad Siddique.\nPublished - February 14, 2026 04:05 am IST\nWest Bengal\n                    \n                            /                      \n                        \n                        Kolkata\n                    \n                            /                      \n                        \n                        Communist Party of India -Marxist\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/west-bengal-elections-cpim-ma-baby-calls-for-secular-alliance-with-congress/article70629527.ece",
        "date": "Sat, 14 Feb 2026 03:33:19 +0530",
        "fetched_at": "2026-02-14 03:52:11.469956"
    },
    {
        "title": "CITU leader for govt. takeover of HMT Kalamassery unit",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nPublished - February 14, 2026 01:51 am IST - KOCHI\nThe Kerala government shall acquire the Kalamassery unit of the Hindustan Machine Tools (HMT), which has been under severe financial distress for long, Centre for Indian Trade Unions (CITU) national vice president K. Chandran Pillai has said.\nMr. Pillai proposed the possibility of transforming the company into a major industrial training facility if such a takeover happens. He was addressing the media at Kalamassery, along with leaders of HMT Employees Union (CITU), on the plight of the employees of the company and the alleged delay in implementing a package promised by Union Minister for Heavy Industries H.D. Kumaraswamy to revive the cash-strapped enterprise.\nAsked if the State government could not do anything to revive HMT, Mr. Pillai pointed to the instances of the Left Democratic Front (LDF) acquiring loss-making public sector undertakings, including Hindustan Newsprint Limited, and reviving them.\nThe LDF government has intervened in certain situations where some Central PSUs were in trouble. When it comes to HMT,  the Centre does not have any such plan. The State government may take an initiative to take over that enterprise, Mr. Pillai said.\n“If the government makes such an adventurous intervention or a proposal, the trade unions will support it,” he said.\nEarlier, the HMT Employees Union (CITU) had made a similar demand in a memorandum submitted to Chief Minister Pinarayi Vijayan during his Navakerala Sadas outreach programme, union secretary P. Krishnadas said. In January, Industries Minister P. Rajeeve had said that the State government would take a decision if the Centre was ready to hand over the unit to it.\nThe trade union leaders reiterated their demand to use the money gained from selling the company’s land in Kalamassery for the revival of the State unit. They also demanded an immediate pay revision and recruitment of adequate employees.\nPublished - February 14, 2026 01:51 am IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/kerala/citu-leader-for-govt-takeover-of-hmt-kalamassery-unit/article70629019.ece",
        "date": "Sat, 14 Feb 2026 01:51:15 +0530",
        "fetched_at": "2026-02-14 03:52:12.073807"
    },
    {
        "title": "Udhayanidhi felicitates film artistes, says awards chosen by committee",
        "content": "February 14, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 14, 2026e-Paper\nPublished - February 14, 2026 01:08 am IST - CHENNAI\nDeputy Chief Minister Udhayanidhi Stalin presenting the best music director award for the year 2022 to musician A.R. Rahman in Chennai on Friday.\n                                          | Photo Credit: Special Arrangement\nMusic director A.R. Rahman, actors Karthi, Dhanush, R. Parthiban, Surya, Vikram Prabhu, and Sai Pallavi, among other actors and artistes, received various awards instituted by the Tamil Nadu government in Chennai on Friday.\nDeputy Chief Minister Udhayanidhi Stalin handed over cinema awards for the years between 2016 and 2022, small screen awards for the years between 2014 and 2022, and the Tamil Nadu Government M.G.R Film and Television Institute Awards for documentaries for the academic years between 2015-16 and 2021-22 (except 2018-19).\nReferring to criticism soon after the awards were announced last month, Mr. Udhayanidhi Stalin said these awards were not announced for many years together and soon after assuming office, the Chief Minister said these awards should be announced soon. “The Chief Minister announced the constitution of a selection committee headed by retired judge Justice K.B.K. Vasuki. Only based on the recommendations of that committee, these awards are being given. So, it was entirely on a ‘credit’ basis that the awards are given.”\nThe State government named Tamil films Maanagaram, Aram, Pariyerum Perumal, Asuran, Koozhangal, Jai Bhim, and Gargi for the first prize under the best film categories between the years 2016 and 2022. Cine directors Lokesh Kanagaraj (Maanagaram), Pushkar-Gayathri (Vikram Vedha), Mari Selvaraj (Pariyerum Perumal), R. Parthiban (Otha Seruppu-Size 7), Sudha Kongara (Soorarai Pottru), T.J. Gnanavel (Jai Bhim), and Gautham Ramachandran (Gargi) were named for the best director awards for these years.\nFor the small screen, Azhagi, Romapuri Pandian, Ramanujar, Nandhini, Poove Poochoodava, Sembaruthi, Raasathi, Sundari and Ethir Neechal were named for the first prize in the TV serial category for the years between 2014 and 2022. P. Ram Kumar (Sheeps Vanished in the Herd), S. Kannan (Neeyum Bommai Naanum Bommai), A.K. Kranthi (Adharma), S. Varun Subbiah (Karai), S. Karunakaran (Wine Shop), R. Giridharan (Madras) were chosen for the Tamil Nadu Government M.G.R Film and Television Institute Awards.\nPublished - February 14, 2026 01:08 am IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/udhayanidhi-felicitates-film-artistes-says-awards-chosen-by-committee/article70629589.ece",
        "date": "Sat, 14 Feb 2026 01:08:54 +0530",
        "fetched_at": "2026-02-14 03:52:12.671673"
    },
    {
        "title": "Execution of projects a key challenge in India, says Palanivel Thiaga Rajan",
        "content": "February 14, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 14, 2026e-Paper\nPublished - February 14, 2026 12:52 am IST - CHENNAI\nPalanivel Thiaga Rajan, Minister for Information Technology and Digital Services,  presents PMA Lifetime Achievement award to Kota Hari Narayana at the IPMA Global project profession forum 2026, in Chennai on Friday. Also seen are Director (Finance), Prasanna Kumar Motupalli, CMD, NLC India Ltd, Maj General P Srinivas Commandant college of defence Sec’bad, N. Ram, Director, The Hindu Group (THG) Publishing Private Limited, A Sivathanu Pillai, President PMA India, Vladimir Obradovic, Vice President iPMA, Mladen Vukomanović, President IPMA.\n                                          | Photo Credit: R. Ravindran\nTamil Nadu Minister for Information and Technology and Digital Services on Friday said while India is excellent at “envisioning” and policy-making, the primary challenge remains execution.\n“Project management is the bridge needed to close this gap,” he said at the IPMA Global Project Profession Forum 2026 held at Mamallapuram near Chennai. He emphasised the use of “100% pure databases” and AI to democratise citizen services. He highlighted that project management principles must be applied to government schemes to ensure “last-mile” delivery.\nThe Minister advocated for a shift from intuitive or political decision-making to evidence-based management, where progress is measured by objective metrics rather than effort alone.\nN.Ram, Director of The Hindu Group, spoke about the technological shifts in Journalism. He said the BrahMos project is an outstanding example of project management. He pointed out how this particular project was meticulously conceived, planned and executed.\nMladen Vukomanovic, president, IPMA, provided a global perspective on the evolving role of the project professional. He emphasised that success is no longer just about meeting time, budget, and scope. The focus must shift toward value delivery and the long-term social and economic impact of a project.\nA. Sivathanu Pillai, president, PMA India, outlined how professional project management is essential for India to reach its goal of becoming a fully developed nation by the centenary of its independence. Drawing on his experience in aerospace and defence, he advocated for a “mission-oriented” management style to tackle challenges such as climate change, energy security, and space exploration. He emphasized that India must not just manage projects but own the technologies behind them.\nKota Harinarayana, former Program Director for Light Combat Aircraft, was conferred with the Lifetime Achievement Award at the event. The Project Management Associates (PMA) Honorary Fellowship Award was given to former ISRO Chairman S. Somanath. Several other awards were given to individuals and organizations who have excelled in their respective fields.\nPublished - February 14, 2026 12:52 am IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/execution-of-projects-a-key-challenge-in-india-says-palanivel-thiaga-rajan/article70629665.ece",
        "date": "Sat, 14 Feb 2026 00:52:53 +0530",
        "fetched_at": "2026-02-14 03:52:13.310393"
    },
    {
        "title": "Chief Minister M.K. Stalin inaugurates various projects, lays foundation for multiple museums across Tamil Nadu",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nUpdated  - February 14, 2026 12:40 am IST - CHENNAI\nTamil Nadu Chief Minister M.K. Stalin virtually inaugurating the open-air museum in Keeladi on Friday.\n                                          | Photo Credit: Special arrangement\nChief Minister M.K. Stalin on Friday (February 13, 2025) virtually inaugurated an open-air museum in Keeladi in Sivaganga district, established at a cost of ₹24 crore. Spread over 4.5 acres, the museum has artefacts spread over 65,000 sq.ft., and will be of interest to Tamil scholars and enthusiasts, archaeologists, and students.\nThe Chief Minister also virtually inaugurated new infrastructure and facade lighting at the Manora Memorial Pillar at Sarabendrarajapattinam in Thanjavur district.\nHe also laid the foundation for the construction of the Noyyal museum in Erode district and the Navai museum in Mandapam in Ramanthapuram district. He released the book Rock Art of Tamil Nadu, authored by K. Rajan and R. Sivanandam.\nHe also laid the foundation for the construction of the Grand Chola Museum, spread over 50 acres within the Tamil University campus in Thanjavur, at a cost of ₹56 crore.\nMr. Stalin also virtually inaugurated new buildings for the Commercial Taxes and Registration Department in various locations across the State.\nThe Chief Minister virtually unveiled the bust of former Chief Minister of the then Madras Presidency P. Subbarayan, along with a memorial hall, constructed in Namakkal district at a cost of ₹2.66 crore. He also inaugurated a memorial hall in honour of late Keelapazhuvur Chinnasamy, who sacrificed his life fighting the imposition of Hindi, in Ariyalur district at a cost of ₹3 crore.\nHe also unveiled a bronze equestrian statue of late freedom fighter Theeran Chinnamalai installed in Erode district at a cost of ₹1 crore and also unveiled a statue of former MP C. Muthusamy in Karur district installed at a cost of ₹50 lakh.\nMr. Stalin virtually inaugurated new buildings constructed for various wings of the Police Department at a total cost of ₹122 crore and also laid the foundation for the construction of a new building to house the Tambaram Police Commissionerate at a total cost of ₹55 crore. He also flagged off new vehicles procured for various wings of the Police Department. He launched the distribution of enhanced incentive of ₹1,500 to the priests of 19,000 temples, where oru kaala poojas are held. Besides, he launched the distribution of pooja materials to temples where oru kaala poojas are held.\nThe Chief Minister virtually inaugurated ELCOSEZ, set up by the Electronics Corporation of Tamil Nadu Limited in Sholinganallur in Chennai, spread over 6.33 acres and constructed at a cost of ₹84.42 crore. The 10-storeyed building has a built-up area of 2.33 lakh sq.ft. The Chief Minister also distributed religious minority status certificates to religious minority educational institutions.\n(Assistance for overcoming suicidal thoughts is available on the State’s health helpline 104, Tele-MANAS 14416. and Sneha’s suicide prevention helpline 044-24640050)\nPublished - February 14, 2026 12:39 am IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/chief-minister-mk-stalin-inaugurates-various-projects-lays-foundation-for-multiple-museums-across-tamil-nadu/article70629596.ece",
        "date": "Sat, 14 Feb 2026 00:40:14 +0530",
        "fetched_at": "2026-02-14 03:52:13.910939"
    },
    {
        "title": "Prison Department stall wins award at Numaish",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nPublished - February 14, 2026 12:05 am IST - HYDERABAD\nDirector General of Prisons and Correctional Services, Telangana, Soumya Mishra along with other officials receiving the award.\n                                          | Photo Credit: By Arrangement\nThe Prison Department stall at the 85th All India Industrial Exhibition, popularly known as Numaish, held at the Exhibition Grounds in Nampally, has been adjudged the Best Stall in the State Government Stalls category, marking the fifth time the department has received the honour.\nThe award was presented to Director General of Prisons and Correctional Services, Telangana, Soumya Mishra, by the Minister for Prohibition and Excise, Tourism and Culture, Jupally Krishna Rao in the presence of office-bearers of the Exhibition Society. Among those present were R. Sukesh Reddy, vice president; B. N. Rajeshwar, secretary; and N. Sanjeev Kumar, treasurer.\nThe stall, designed to resemble a prison structure, stood out for its distinctive appearance and drew considerable public attention. Intricately crafted models of the Charminar made by inmates emerged as a major attraction. For the first time, natural honey harvested and packed by prisoners was displayed. A range of products tailored for women recorded strong sales, while waste-to-wealth items also received appreciation from visitors.\nOfficials said the stall registered total sales of ₹67,31,342 during the exhibition, indicating strong public demand for products manufactured by inmates as part of prison rehabilitation initiatives.\nPublished - February 14, 2026 12:05 am IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/cities/Hyderabad/prison-department-stall-wins-award-at-numaish/article70627968.ece",
        "date": "Sat, 14 Feb 2026 00:05:39 +0530",
        "fetched_at": "2026-02-14 03:52:14.513453"
    },
    {
        "title": "Chief Minister M.K. Stalin hands over appointment orders to 9,800 new government recruits",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nPublished - February 13, 2026 11:58 pm IST - CHENNAI\nChief Minister M.K. Stalin on Friday called upon newly recruited government officials to discharge their duties by remaining true to their conscience and also to remain honest. “If you are honest, it will reflect the government’s honesty,” Mr. Stalin said, addressing new recruits during a function at Jawaharlal Nehru stadium in Chennai.\nThese 9,801 new recruits have been recruited by the Tamil Nadu Public Service Commission (TNPSC), the Medical Services Recruitment Board (MSRB), and the Teachers Recruitment Board (TRB) for various posts. “If you are punctual, duty-conscious, and approachable to the people and are kind to them, that will earn you a good reputation. While you work for the government, please do take care of your health too,” he said.\nAdvising them to work efficiently so that Tamil Nadu could become a role model for other States, Mr. Stalin said: “We should increase the revenue to the government so that various welfare programmes for the people can be continued. We should lend a helping hand to the next generation.” Only if the government officials served well, can the government machinery function without any obstructions, he said.\nThe DMK government has implemented various welfare programmes, including Kalaignar Magalir Urimai Thogai, Makkalai Thedi Maruthuvam, Illam Thedi Kalvi, and Ungaludan Stalin, among others, and government officials have resolved various issues facing the general public. “If these programmes have earned a reputation for the government, it was because of government employees and teachers,” Mr. Stalin said.\nDuring the past five years, 45,126 candidates were recruited by the TNPSC, 24,927 were recruited by the Tamil Nadu Uniformed Services Recruitment Board, 12,894 were recruited by the TRB, 11,244 were recruited by the MSRB, the Chief Minister said. Besides, 5,899 were granted appointments on compassionate grounds, he said.\nUnder various departments, boards, and local bodies, 54,864 were provided jobs and 177 got jobs under the sports quota, he said. “During these five years, we have given appointment orders to 1,55,131 youths,” Mr. Stalin said. Besides, through the industrial investments brought into the State, his government has ensured employment for about 38 lakh people, he said.\nMr. Stalin also launched the ‘Thervukkalam’ mobile app to benefit job aspirants and also Thiran 360 portal, which will help youths in skill development. He unveiled the foundation for the construction of a building in Shenoy Nagar in Chennai at a cost of ₹62.50 crore, which will house the coaching centre for youths into All India government services. The Chief Minister inaugurated new buildings for the Anna Administrative Staff College constructed at a cost of ₹3.38 crore.\nDeputy Chief Minister Udhayanidhi Stalin; Ministers Ma. Subramanian, P.K. Sekarbabu, Anbil Mahesh Poyyamozhi and N. Kayalvizhi Selvaraj; Chennai Mayor R. Priya; Egmore MLA I. Paranthamen; Chief Secretary N. Muruganandam and senior officials participated.\nPublished - February 13, 2026 11:58 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/chief-minister-mk-stalin-hands-over-appointment-orders-to-9800-new-government-recruits/article70627824.ece",
        "date": "Fri, 13 Feb 2026 23:58:03 +0530",
        "fetched_at": "2026-02-14 03:52:15.131726"
    },
    {
        "title": "‘Idathavalam’ for pilgrims inaugurated in Thiruvananthapuram",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nUpdated  - February 13, 2026 11:45 pm IST - THIRUVANANTHAPURAM\nChief Minister Pinarayi Vijayan on Friday inaugurated a stopover point (Idathavalam) for pilgrims with modern facilities at the Sree Mahadeva temple in Kazhakuttam in the capital. The facility has been built at a cost of ₹10 crore. Spread over three floors and covering an area of ​​32,000 sq ft, the stopover point has an annadana mandapam where 300 people can be served food at a time. In addition, facilities such as a dormitory to house 75 men and 25 women, secure locker rooms and high-speed Wi-Fi system have been provided.\nMr. Vijayan said that the government aims to build twelve such stopover points across Kerala with the financial assistance of KIIFB. Currently, work of six such facilities is progressing in the State.\nPublished - February 13, 2026 11:43 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/kerala/idathavalam-for-pilgrims-inaugurated-in-thiruvananthapuram/article70629904.ece",
        "date": "Fri, 13 Feb 2026 23:45:41 +0530",
        "fetched_at": "2026-02-14 03:52:15.733793"
    },
    {
        "title": "KLA, T.N. govt. sign MoU for R&D hub, innovation centre in Chennai",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nPublished - February 13, 2026 11:39 pm IST - CHENNAI\nChief Minister M.K. Stalin exchanging the MoU with representatives of KLA India in the presence of Deputy Chief Minister Udhayanidhi Stalin, Minister T.R.B. Rajaa, and Chief Secretary N. Muruganandam at the Secretariat in Chennai on Friday.\n                                          | Photo Credit: Special arrangement\nAmerican semiconductor equipment company KLA Corporation, through its KLA India, has signed a memorandum of understanding (MoU) with the Tamil Nadu government for establishing a research and development (R&D) hub and innovation centre in Chennai with an investment of ₹3,510 crore. The MoU was signed in the presence of Tamil Nadu Chief Minister M.K. Stalin in the Secretariat in Chennai on Friday.\nAn official release said that the centre would be spread over a 12 acre campus. It is expected to generate employment for about 4,000 professionals over the next 10 years. Deputy Chief Minister Udhayanidhi Stalin, Minister T.R.B. Rajaa, Chief Secretary N. Muruganandam and senior officials participated.\nPublished - February 13, 2026 11:39 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/kla-tn-govt-sign-mou-for-rd-hub-innovation-centre-in-chennai/article70627816.ece",
        "date": "Fri, 13 Feb 2026 23:39:43 +0530",
        "fetched_at": "2026-02-14 03:52:16.375813"
    },
    {
        "title": "Cabinet nod for extending contract with NTPC Kayamkulam",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nPublished - February 13, 2026 11:09 pm IST - THIRUVANANTHAPURAM\nThe Cabinet on Friday gave its approval for extending the contract with the NTPC Kayamkulam power plant for a further three years.\nThe decision was taken in the context of the 25-year contractual period coming to an end.\nThe conditions for the renewal include a clause that the memorandum of understanding and the power purchase agreement would stand cancelled if the 180 MW supply from the NTPC Talcher unit is stopped, Power Department sources said. Two, a 2000 MWh battery energy storage system (BESS) has to be established at Kayamkulam.\nThe NTPC should either establish it on its own or as a joint venture with the Kerala State Electricity Board (KSEB).\nThe KSEB should consider floating solar projects through a joint venture with the NTPC. The KSEB and the NTPC should also carry out a study on the feasibility of converting the NTPC Kayamkulam plant to run on peat gas.\nPublished - February 13, 2026 11:09 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/kerala/cabinet-nod-for-extending-contract-with-ntpc-kayamkulam/article70629960.ece",
        "date": "Fri, 13 Feb 2026 23:09:46 +0530",
        "fetched_at": "2026-02-14 03:52:16.971989"
    },
    {
        "title": "NLCIL secures NABL accreditation",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nPublished - February 13, 2026 11:05 pm IST - CUDDALORE\nNLC India Ltd. (NLCIL) has secured the National Accreditation Board for Testing and Calibration Laboratories (NABL) accreditation for its Centre for Applied Research and Development (CARD) laboratories.\nAccording to NLCIL, the renewed accreditation is valid till January 2030 and covers 115 testing parameters across the disciplines of mechanical, chemical, and biological testing. The accreditation encompassing CARD’s key laboratories includes air quality testing, water and effluent quality testing, soil testing, microbiology, fuel quality testing, and general analytical testing among others.\nThe ISO/IEC 17025:2017 accreditation ensures that CARD’s testing systems adhere to internationally recognised benchmarks in laboratory management, reliability of results, and traceability.\nThe NLCIL said the accreditation enhances the company’s capability to support its mining, thermal power, and renewable energy operations through reliable in-house testing and R&D excellence.\nPublished - February 13, 2026 11:05 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/nlcil-secures-nabl-accreditation/article70627815.ece",
        "date": "Fri, 13 Feb 2026 23:05:14 +0530",
        "fetched_at": "2026-02-14 03:52:17.578957"
    },
    {
        "title": "Hasina’s presence in India, Ganga waters treaty to be key priorities for BNP government: sources",
        "content": "February 14, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 14, 2026e-Paper\nUpdated  - February 14, 2026 01:56 am IST - DHAKA\nA municipal worker cleans a road near the chairman’s office of the Bangladesh Nationalist Party (BNP) a day after the national Parliamentary election in Dhaka, Bangladesh, February 13, 2026. \n                                          | Photo Credit: AP\nStopping “border killings”, starting negotiations for renewal of the Ganga waters agreement, and increasing the number of medical visas are some of the priority areas for Bangladesh’s incoming government, sources in the Bangladesh Nationalist Party told The Hindu on Friday (February 13, 2026).\nAlso read: Bangladesh election results highlights\nThe BNP, led by its chairman Tarique Rahman, is set to return to power in Dhaka after two decades, following a landslide victory in the February 12 Parliamentary election, winning an absolute majority of seats.\nGiving an insight into the list of deliverables, BNP’s sources said India should urgently deal with the issue of Sheikh Hasina’s presence on Indian soil, as Ms. Hasina has been making comments about the developments in her country.\n“Out of all issues, it is the border killings by the Border Security Force of India that create great difficulty for the Government of Bangladesh. Reports of killings in the bordering areas immediately inflame passion, especially in university campuses where protests break out, escalating the situation,” said a source who is working on the neighbourhood projects of the BNP.\nWomen, minority representation at two-decade low in Bangladesh\nCongress, Trinamool congratulate BNP for winning parliamentary elections in Bangladesh\nBNP: Back in power after 20 years\nThe BNP member said that India and Bangladesh have a settled border and it makes no sense to shoot to kill someone. “If someone is suspected of smuggling, then they should be arrested and not fired upon,” the source argued, seeking a more humane approach to the matter.\nHe further said that India should look into the issue of the continued presence of former Prime Minister Ms. Hasina and her top aides on Indian soil, as the Awami League leader’s comments will pose a challenge to the normalisation of ties and indicated that these issues will be among the first items that would be discussed by the incoming government.\nThe other big issue that will have to be prioritised, The Hindu was told it is the renewal of the Ganga Waters Treaty that will have to be renewed before December 2026. Indian diplomatic sources had flagged that the technical teams that were supposed to meet to iron out the details of the renewal agreement in the two years did not meet, though the matter featured during the July 2024 visit of Ms. Hasina when she was Prime Minister. Bangladesh will also raise the need to conclude this treaty in a “fair” manner, the source said.\nHe further said the number of medical visas that are issued by India are inadequate and that India must relax medical visas, as it is a great people-to-people connector. “We are being pushed to go to China in search of medical treatment. If pushed by denial of a medical visa, we will find an alternative, as in today’s world an alternative will present itself automatically, but our cultural commonalities make medical treatment in India a more comfortable process,” said the source, urging India to enhance people-to-people diplomacy.\nALSO WATCH  Watch: What the Bangladesh 2026 election results really mean\nPublished - February 13, 2026 10:52 pm IST\nIndia-Bangladesh\n                    \n                            /                      \n                        \n                        Bangladesh\n                    \n                            /                      \n                        \n                        water\n                    \n                            /                      \n                        \n                        treaty\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/stopping-border-killings-ganga-waters-treaty-renewal-hasinas-presence-in-india-to-be-priority-for-incoming-bnp-government/article70629783.ece",
        "date": "Sat, 14 Feb 2026 01:56:18 +0530",
        "fetched_at": "2026-02-14 03:52:18.189215"
    },
    {
        "title": "DCCB should give farm loans irrespective of losses, says Minister",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nPublished - February 13, 2026 10:28 pm IST - Belagavi\nSatish Jarkiholi\n                                          | Photo Credit: SPECIAL ARRANGEMENT\nDistrict Central Cooperative Bank (DCCB) have to give loans to farmers. It is the duty of such financial institutions. They can not escape from such responsibilities saying that it could cause them losses, Satish Jarkiholi , district in-charge Minister said in Belagavi.\nHe was responding to a statement by Anna Saheb Jolle, Belagavi DCCB chairman, that giving loans to farmers meant loss for the bank, but it was continuing to give loans as per government policies.\n“I do not know in what sense the chairman made the statement, but I think it is being wrongly interpreted. Whether the BDCC Bank makes a profit or a loss, it must give loans to farmers. The DCC banks were built for the purpose of giving farm loans. They have to follow the directions of the Union and State governments and RBI. Surely, Mr. Jolle and other directors understand this,’’ the Minister told reporters on Friday.\nThe BDCC bank is a farmers’ bank and it should give loans to farmers. But farm loans, just as other loans, have to be given only as per the directions of RBI and NABARD. It is a different matter that the bank has been giving non-agricultural loans to private persons and companies, as it has to make profits to sustain and grow. Of course, it is not in the hands of the BDCC bank directors to increase the limits of loans given to farmers. It is the domain of institutions like RBI and NABARD, Mr. Jarkiholi said. He said that Chief Minister Siddaramaiah would accept the demands of all legislators who were seeking funds for the development of their constituencies. However, we have not asked for special funds for Belagavi district.\nWe are hopeful of getting all requisite funds, including those for irrigation projects, the Minister said.\nMr. Jarkiholi refused to respond to claims by Channaraj Hattiholi, MLC and Congress leader that the time had come for Deputy Chief Minister D.K. Shivakumar to become the Chief Minister.\nPublished - February 13, 2026 10:28 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/karnataka/dccb-should-give-farm-loans-irrespective-of-losses-says-minister/article70629150.ece",
        "date": "Fri, 13 Feb 2026 22:28:48 +0530",
        "fetched_at": "2026-02-14 03:52:18.792906"
    },
    {
        "title": "Congress, Trinamool congratulate BNP for winning parliamentary elections in Bangladesh",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nUpdated  - February 14, 2026 02:00 am IST - New Delhi/Kolkata\nBangladesh Nationalist Party (BNP) Chairman Tarique Rahman speaks with the media after voting outside a polling station during the national election in Dhaka, Bangladesh, February 12, 2026. \n                                          | Photo Credit: Reuters\nOpposition parties, including the Congress and the Trinamool Congress, on Friday (February 13, 2026) congratulated the BNP for winning the parliamentary elections in Bangladesh.\nThe Bangladesh Nationalist Party (BNP) led by its chairman Tarique Rahman has got an absolute majority in the parliamentary election of February 12, the latest official update issued by the Election Commission of Bangaldesh has announced. As per the latest report, the BNP-led alliance has secured 212 seats, a two-thirds majority, in the Parliament and the 11-party alliance led by Jamaat-e-Islami has won 77 seats.\nFollow the Bangladesh election results live\nThe election was held to elect a new government to replace the interim administration, which took charge after the fall of the Awami League regime in August 2024.\nIn a post on X, Congress chief Mallikarjun Kharge said: “On behalf of the Indian National Congress, I congratulate Mr. Tarique Rahman and the BNP for winning the Parliamentary elections in Bangladesh.” India and Bangladesh share deep-rooted bonds of history, language, culture, and multitude of other commonalities, the party chief said.\nOn behalf of the Indian National Congress, I congratulate Mr. Tarique Rahman and the BNP for winning the Parliamentary elections in Bangladesh.India and Bangladesh share deep rooted bonds of history, language, culture, and multitude of other commonalities. A democratic,…\n“A democratic, progressive and inclusive Bangladesh would always be supported by all Indians for the stability and peace of our region,” Mr. Kharge said.\nWest Bengal Chief Minister and Trinamool chairperson Mamata Banerjee extended greetings to Mr. Rahman on leading the party to victory in the parliamentary elections.\nMy hearty congratulations, shubhonandan, to all my brothers and sisters, all the people, in Bangladesh. My advance Ramazan mubarak to all of them.For this great victory, my congratulations to my Tarique-Bhai, his party, and all the parties. Pray, you all be well and happy.…\nIn a post on X, she said, “My hearty congratulations, shubhonandan, to all my brothers and sisters, all the people, in Bangladesh. My advance Ramazan mubarak to all of them. For this great victory, my congratulations to my Tarique-Bhai, his party, and all the parties. Pray, you all be well and happy.”\nMs. Banerjee expressed hope that ties between India and Bangladesh remain cordial. “Wish that our relations with Bangladesh be always cordial,” she said.\nThe election was seen as a direct contest between the BNP and its former ally Jamaat-e-Islami, in the absence of ousted premier Sheikh Hasina's now debarred Awami League. The BNP was in power last time between 2001 and 2006 when Jamaat was its crucial partner, with two of its leaders serving as ministers.\nPublished - February 13, 2026 10:26 pm IST\nIndia-Bangladesh\n                    \n                            /                      \n                        \n                        Bangladesh\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        politics\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/congress-aitmc-congratulate-bnp-for-winning-parliamentary-elections-in-bangladesh/article70629564.ece",
        "date": "Sat, 14 Feb 2026 02:00:30 +0530",
        "fetched_at": "2026-02-14 03:52:19.393166"
    },
    {
        "title": "IAF, Royal Thai Air Force jointly conduct air combat exercise in Indian Ocean Region",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nPublished - February 13, 2026 10:09 pm IST - New Delhi\nThe Indian Air Force undertaking a joint in-situ air exercise with the Royal Thai Air Force, on Tuesday (February 10, 2026). Photo credits: X/@IAF_MCC via ANI Photo\nThe Indian Air Force (IAF) conducted an in-situ bilateral exercise with the Royal Thai Air Force (RTAF) in the Indian Ocean Region (IOR) from February 9 to 12, 2026, aimed at strengthening military cooperation and enhancing operational synergy between the two countries.\nAccording to the Ministry of Defence, the engagement was executed as an air combat training exercise featuring the IAF’s Su-30MKI multirole fighter aircraft and the RTAF’s SAAB Gripen jets. The IAF’s IL-78 mid-air refuelling tankers enabled extended-range maritime operations, underscoring the force’s long-distance deployment capabilities.\nThe exercise was conducted under the enhanced surveillance and command network of the IAF’s Airborne Warning and Control System (AWACS) aircraft, while Ground Control Interception (GCI) elements of the RTAF provided coordinated control support, the Ministry added.\nIAF assets operated from airbases in the Andaman and Nicobar Islands, demonstrating strategic reach into the IOR, while the Thai Gripen fighters were launched from bases in Thailand. The drill showcased interoperability between the two air forces and provided operational exposure, including the exchange of best practices in air combat and maritime domain operations.\n#IAF is undertaking joint in-situ air exercise with #RoyalThaiAirForce (RTAF). The exercise will enhance operational coordination and interoperability between the two Air Forces. IAF Su-30MKI, AWACS, AEW&C and IL-78 refuelling aircraft are participating in the Ex, alongside… pic.twitter.com/07ampQ0ptx\nThe exercise reflects the growing defence engagement between India and Thailand and marks a significant step in expanding the ambit of India’s “Act East” policy into the aerospace domain, defence sources say.\nPublished - February 13, 2026 10:09 pm IST\ndefence\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/iaf-royal-thai-air-force-jointly-conduct-air-combat-exercise-in-indian-ocean-region/article70629238.ece",
        "date": "Fri, 13 Feb 2026 22:09:48 +0530",
        "fetched_at": "2026-02-14 03:52:19.985514"
    },
    {
        "title": "Police book case over fake transfer recommendation issued in CM’s name",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nPublished - February 13, 2026 10:09 pm IST - Bengaluru\nThe Bengaluru police have registered an FIR over the alleged creation of a fake recommendation in the name of Chief Minister Siddaramaiah for the transfer of the Mandya Health and Family Welfare officer and its circulation on social media.\nThe letter, which is alleged to have been fabricated by unknown persons, stated that Dr. K. Mohan, Health and Family Welfare Officer, should be transferred and appointed as Excise Deputy Commissioner, Mysuru Rural. However, the letter neither bore an official date nor carried a reference number, though it was purported to have been drafted in 2024.\nPublished - February 13, 2026 10:09 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/cities/bangalore/police-book-case-over-fake-transfer-recommendation-issued-in-cms-name/article70629780.ece",
        "date": "Fri, 13 Feb 2026 22:09:10 +0530",
        "fetched_at": "2026-02-14 03:52:20.641632"
    },
    {
        "title": "Natyadharmi awards for three",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nPublished - February 13, 2026 09:49 pm IST - KOCHI\nNatyadharmi Parakkadavu, a cultural organisation, has announced its awards for artistes in various categories.\nKathakali maestro Sadanam Krishnankutty has been chosen for the Padmashree Moozhikulam Kochukuttan Chakyar Award, while Kathakali singer Kottakkal Madhu has won the Sandeep Kalathimekkad Memorial Award. Young carnatic singer Moozhikulam Harikrishnan has been selected for the Mattampillil Parameswara Menon Memorial Award.\nThe awards, carrying ₹10,000 each, memento, and a certificate, will be presented by by Kalamandalam Vice-Chancellor B. Ananthakrishnan on April 9 at Ramapuram Chettarikkal Temple near Parakkadavu, the organisers said.\nPublished - February 13, 2026 09:49 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/kerala/natyadharmi-awards-for-three/article70629504.ece",
        "date": "Fri, 13 Feb 2026 21:49:16 +0530",
        "fetched_at": "2026-02-14 03:52:21.244375"
    },
    {
        "title": "CJI’s office received 8,630 complaints against judges in a decade, Law Minister tells Lok Sabha",
        "content": "February 14, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 14, 2026e-Paper\nPublished - February 13, 2026 09:47 pm IST - New Delhi\nUnion MoS (IC) Arjun Ram Meghwal speaks in Lok Sabha during the ongoing Budget session, in New Delhi on Friday.  \n                                          | Photo Credit: Sansad TV\nThe office of the Chief Justice of India (CJI) received 8,630 complaints against sitting judges in the last decade, Law Minister Arjun Ram Meghwal informed the Lok Sabha on Friday (February 13, 2026).\nThe information came in response to a question raised in the House by Dravida Munnetra Kazhagam (DMK) MP V.S. Matheswaran who had sought the database of complaints regarding corruption, sexual misconduct, or other serious impropriety received against judges of the High Courts or the Supreme Court.\nAlso Read | How is a Supreme Court judge to be probed?\nResponding to the query, Minister of State for Law and Justice  Arjun Ram Meghwal submitted that 8,360 complaints against judges were recorded between 2016 and 2025. As per the table shared by the Minister, the CJI’s office got 729 complaints against judges in 2016, followed by 682 in 2017, 717 in 2018, and 1,037 in 2019. In 2020 and 2021, such complaints stood at 518 and 686 respectively. In 2022, 1012 complaints were received, followed by 977 in 2023, 1,170 in 2024, and 1,102 in 2025.\nThough Mr. Matheswaran asked if any action had been taken on the complaints, the Minister did not address the query in his written reply.\nTo another question by the MP on whether the Central government was aware of any system maintained by the Supreme Court to document and track complaints related to corruption, sexual misconduct, or other serious impropriety against judges of the higher judiciary, the Minister said that under the existing “in-house procedure”, the Chief Justice of India and the Chief Justices of the High Courts are authorised to receive and handle complaints against judges.\nAlso Read | Over 1,600 complaints against judiciary: Rijiju\nThe Minister further noted that complaints submitted through the Centralised Public Grievance Redress and Monitoring System (CPGRAMS) or other channels are forwarded to the CJI or the respective High Court Chief Justices.\nThe MP also enquired if the government intended to introduce guidelines or measures to ensure proper documentation, monitoring, and accountability in dealing with complaints against members of the higher judiciary. However, the Minister did not address it.\nPublished - February 13, 2026 09:47 pm IST\njudiciary (system of justice)\n                    \n                            /                      \n                        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        laws\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/cjis-office-received-8630-complaints-against-judges-in-a-decade-law-minister-tells-lok-sabha/article70628332.ece",
        "date": "Fri, 13 Feb 2026 21:47:50 +0530",
        "fetched_at": "2026-02-14 03:52:21.842032"
    },
    {
        "title": "10 booked for alleged assault over parking dispute",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nPublished - February 13, 2026 09:46 pm IST - KOCHI\nThe Palarivattom police booked 10 people, including members of a family, for allegedly assaulting two IT employees at Chalikkavattom in the city following a dispute over car parking.\nThe case was registered based on a complaint filed by Vijayakumar Krishnapilla from Thakkala, Kanyakumari, and Ajayan from Coimbatore who stay in a rented house at Chalikkavattom.\nThey were allegedly assaulted by Siyad, a neighbour, and his family members and friends. The first information report (FIR) named Siyad, his wife, his brother-in-law, and seven others. The incident occurred around 11 p.m. on Wednesday (February 11, 2026). The tenth accused, Binu, allegedly trespassed into the complainants’ house and made death threats against them on Thursday (February 12, 2026) morning, the FIR said.\nThe accused were charged with voluntarily causing hurt among other charges.\nPublished - February 13, 2026 09:46 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/kerala/10-booked-for-alleged-assault-over-parking-dispute/article70629454.ece",
        "date": "Fri, 13 Feb 2026 21:46:33 +0530",
        "fetched_at": "2026-02-14 03:52:22.444190"
    },
    {
        "title": "DGCA slaps ₹1 crore fine on Air India for operating plane without requisite certification",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nPublished - February 13, 2026 09:23 pm IST - Mumbai/New Delhi\nAn Air India plane. File\n                                          | Photo Credit: Reuters\nAviation safety watchdog DGCA has imposed a fine of ₹1 crore on Tata Group-owned Air India for operating an Airbus A320 Neo plane without the requisite airworthiness certification on at least eight routes last year, according to sources.\nThe Directorate General of Civil Aviation (DGCA), on December 2 last year, said it was probing the incident of Air India operating an A320 Neo plane without having a requisite airworthiness certification on at least eight routes.\nThe sources said on Friday (February 13, 2026) that the regulator has imposed a ₹1 crore fine on Air India for the violations.\n\"Air India acknowledges the receipt of a DGCA order in relation to an incident that was voluntarily reported back in 2025. All identified gaps have since been satisfactorily addressed and shared with the authority,\" the airline said in a statement.\nOn November 26, 2025, the airline informed the DGCA about the flying of the A320 aircraft with the expired airworthiness review certificate (ARC) on eight revenue sectors.\nARC is issued annually in respect of an aircraft after a comprehensive review of its maintenance records, physical condition and verification of compliance with all airworthiness standards. It is a validation of an aircraft's main certificate of airworthiness.\nUnder the norms, Air India has been delegated the powers to issue the ARC for an aircraft.\nTata Group-owned Air India has previously faced regulatory actions for certain violations as well.\nPublished - February 13, 2026 09:23 pm IST\nAirlines\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/business/Industry/dgca-slaps-1-crore-fine-on-air-india-for-operating-plane-without-requisite-certification/article70629558.ece",
        "date": "Fri, 13 Feb 2026 21:23:16 +0530",
        "fetched_at": "2026-02-14 03:52:23.050664"
    },
    {
        "title": "Kalaburagi district administration signs MoU with The Hindu Group for AI-powered English Language Training under STEP programme",
        "content": "February 14, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 14, 2026e-Paper\nPublished - February 13, 2026 09:19 pm IST - KALABURAGI\nKalaburagi Deputy Commissioner B. Fouzia Taranum and general manager (STEP Division) of The Hindu Group Sai Krishnan, with others, G. during the MoU signing event in Kalaburagi on Friday.\n                                          | Photo Credit: ARUN KULKARNI\nIn a significant initiative to strengthen employability and communication skills among youth, the Kalaburagi District Administration on Friday signed a Memorandum of Understanding (MoU) with THG Publishing Private Limited, publishers of The Hindu, Business Line, Frontline and Sportstar, for the implementation of the STEP Blended English Learning Programme across the district.\nKalaburagi Deputy Commissioner B. Fouzia Taranum and general manager (STEP Division) of The Hindu Group Sai Krishnan G. exchanging memorandum of understanding in Kalaburagi on Friday.\n                                                            | Photo Credit: \n                                ARUN KULKARNI\nThe MoU was formally exchanged by B. Fouzia Taranum, Deputy Commissioner of Kalaburagi and Sai Krishnan G., general manager, STEP Division of The Hindu Group at the former’s office on Friday.\nAmong those present were Preeti Chandrashekhar, Joint Director of Social Welfare; Abdul Azeem, Joint Director, District Industries Centre and member-secretary, Kalaburagi Next Foundation Trust; Nagubai Suryawanshi, District Skill Development Officer; Nagaraj Y. Phatak, Assistant Manager, The Hindu Group; and other senior officials.\nThe collaboration aims to enhance English language proficiency and professional communication skills among students enrolled in skill academies and technical institutions supported by the District Administration. The initiative is designed to equip young learners with industry-relevant language competencies, thereby improving their career readiness, confidence and long-term employability prospects.\nUnder the MoU, the students will be enrolled in a 50-hour self-paced online learning module over a period of three months. The programme will begin with a diagnostic assessment to determine each learner’s proficiency level, followed by structured modules customised for each student covering Listening, Speaking, Reading and Writing (LSRW) skills, along with grammar, vocabulary and employability-oriented communication.\nIn addition to the online component, the programme will include structured trainer-led classroom intervention sessions for up to 12 weeks, focusing on general communication, workplace English, interview preparation, group discussions, presentation skills and professional writing. Learners who successfully complete the course will be eligible to appear for the STEP certification examination and receive a proficiency certificate highlighting their English competency level.\nTHG Publishing Private Limited, through its STEP division, will design and deliver the training modules, provide digital access to enrolled learners, conduct standardised proficiency assessments and extend academic and technical support throughout the programme. Orientation sessions will also be conducted for students and institutional administrators to ensure effective roll-out.\nPublished - February 13, 2026 09:19 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/karnataka/kalaburagi-district-administration-signs-mou-with-the-hindu-group-for-ai-powered-english-language-training-under-step-programme/article70628820.ece",
        "date": "Fri, 13 Feb 2026 21:19:21 +0530",
        "fetched_at": "2026-02-14 03:52:23.674956"
    },
    {
        "title": "A.P. treasury benches unhappy with reply of Revenue Minister on grievance redressal",
        "content": "February 14, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 14, 2026e-Paper\nPublished - February 13, 2026 09:15 pm IST - VIJAYAWADA\nOf the 2,34,644 applications received during Revenue Conferences, 2,33,578 complaints have been resolved, Revenue Minister Anagani Satya Prasad informs the Assembly. \n                                          | Photo Credit: File Photo\nThe Treasury benches in the Andhra Pradesh Legislative Assembly were unhappy with the reply given by Revenue Minister Anagani Satya Prasad on Friday that a majority of the petitions and grievances relating to his department had been addressed.\nTDP MLAs Dhulipala Narendra, Gorantla Butchaiah Chowdary and others, who raised the question during Question Hour on Friday, said that the petitioners were yet to get justice though they submitted their pleas during the Revenue Sadassulu.\nClosing the petitions is not a solution. Rendering justice is necessary. Many stretches of lands are still earmarked under 22 A (prohibited list), making it miserable for the people. Dalits, BCs and everyone are suffering, they said.\nSpeaker Chintakayala Ayyanna Patrudu, who was in the Chair, directed that State-level meetings with the District Collectors and Joint Collectors concerned be organised to address the issue. The Chief Minister should also be present, he said.\nMr. Satya Prasad informed the House that 2,34,644 applications were received during the Revenue Conferences. Of these, 1,85,731 were related to revenue matters such as land records, mutations, pattas, and other administrative issues, while 48,913 petitions pertained to survey-related concerns, including boundary disputes and land measurements.\nProviding further classification, the Minister said 659 grievances were identified as financial in nature involving compensation or monetary claims, while the remaining 2,33,985 were categorised as non-financial issues.\nMr. Satya Prasad said that 2,33,578 complaints have already been resolved. He described the resolution rate as a significant achievement and evidence of the administration’s commitment to transparent and time-bound grievance redressal.\n“Some cases are related to family disputes or court cases. The local elders, sarpanches or MLAs can take a lead in solving them,”  the Minister said.\nIn response, the TDP MLAs  asked, “Do you want us to do Panchayats?”.\nPublished - February 13, 2026 09:15 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/ap-treasury-benches-unhappy-with-reply-of-revenue-minister-on-grievance-redressal/article70629121.ece",
        "date": "Fri, 13 Feb 2026 21:15:57 +0530",
        "fetched_at": "2026-02-14 03:52:24.598697"
    },
    {
        "title": "KIIFB in-principle nod for MC Road and Sabari Rail projects",
        "content": "February 14, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 14, 2026e-Paper\nPublished - February 13, 2026 09:14 pm IST - THIRUVANANTHAPURAM\nA clutch of major infrastructure projects, including the four-laning of MC Road and the Sabari Rail project, will be funded through the Kerala Infrastructure Investment Fund Board (KIIFB).\nA KIIFB board meeting held on Friday gave its in-principle nod for providing funding to the tune of ₹5,217 crore for the four-laning of the Kesavadasapuram-Angamaly MC Road, ₹1,900 crore for the Angamaly-Erumely Sabari Rail project and ₹600 crore for the Aerospace Control Systems Complex proposed under KSpace.\nThese were among 11 projects worth ₹8,081 crore which were granted in-principle nod and 14 other projects worth ₹689 crore granted financial approval at the 56th board meeting chaired by Chief Minister Pinarayi Vijayan.\nWith this, the financial heft of projects granted approval under KIIFB has touched ₹1.10 lakh crore, Finance Minister K.N. Balagopal said at a press conference here.\nThe Cabinet meeting held on February 4 had decided that the State would bear half the cost — ₹ 1,900 crore — of the Sabari Rail project. The four-laning of MC Road and the Aerospace Control Systems Complex project were announced in the 2026-27 State Budget.\nIn-principle approval has also been granted for the procurement of medical equipment for hospitals (₹210.51 crore), Phase I development of the Conolly Canal in Kozhikode (₹73.21 crore) and infrastructure development of the K.R. Narayanan National Institute of Visual Science and Arts (₹26.59 crore).\nAmong the 14 projects granted financial approval are the Work Near Home: Skill Ecosystem 2.0 project ( ₹153 crore ), the development of the General Hospital, Thrissur (₹136.79 crore ) and infrastructure development of the Mental Health Centre in Thiruvananthapuram ( ₹ 87.68 crore), Mr. Balagopal said.\nMajority of the projects in this category, worth ₹282.98 crore, come under Public Works, and Health and Family Welfare (₹224.47 crore).\nSo far, KIIFB has given financial approval for 1,237 projects worth ₹98,836.83 crore and  in-principle nod “subject to conditions” for 11 projects worth ₹8,081 crore.\nKIIFB CEO K.M. Abraham and Additional CEO Mini Antony were also present.\nPublished - February 13, 2026 09:14 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/kerala/kiifb-in-principle-nod-for-mc-road-and-sabari-rail-projects/article70629498.ece",
        "date": "Fri, 13 Feb 2026 21:14:36 +0530",
        "fetched_at": "2026-02-14 03:52:25.190440"
    },
    {
        "title": "How can Ambati Rambabu’s ‘derogatory remarks’ against Chief Minister’s mother be taken lightly, asks Lokesh",
        "content": "February 14, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 14, 2026e-Paper\nPublished - February 13, 2026 09:11 pm IST - VIJAYAWADA\nHRD Minister Nara Lokesh.\n                                          | Photo Credit: File Photo\nMinister for HRD and IT Nara Lokesh on Friday condemned former Minister Ambati Rambabu for “insulting” Chief Minister N. Chandrababu Naidu’s mother.\nDuring a discussion on the Motion of Thanks to the Governor’s address in the Legislative Assembly, Mr. Lokesh questioned how such remarks could be dismissed as “two small words,” He said that insulting any woman, especially a mother, cannot be taken lightly.\nHe refuted allegations made by YSRCP Legislative Council Floor leader Botcha Satyanarayana and YSRCP MLC B. Israel regarding the arrest of Mr. Ambati Rambabu and their claims that law and order in the State had deteriorated.\n“The coalition government does not engage in vendetta politics, but it will take strict action against anyone who speaks disrespectfully about women,” he asserted.\nThe Minister made it clear that whether it concerned the Chief Minister’s mother, Mr. Jagan Mohan Reddy’s mother, or any other woman, the government would not tolerate derogatory remarks. He challenged the opposition party leaders to spell out whether Mr. Ambati Rambabu’s statement was right or wrong, and asked what action was taken during the previous government in similar situations.\nPublished - February 13, 2026 09:11 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/how-can-ambati-rambabus-derogatory-remarks-against-chief-ministers-mother-be-taken-lightly-asks-lokesh/article70629233.ece",
        "date": "Fri, 13 Feb 2026 21:11:45 +0530",
        "fetched_at": "2026-02-14 03:52:25.789969"
    },
    {
        "title": "Former Minister Ambati Rambabu remanded in judicial custody in ‘illegal lottery’ case",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nUpdated  - February 14, 2026 12:19 am IST - GUNTUR\nYSRCP leader Ambati Rambabu. \n                                          | Photo Credit: File Photo\nYSRCP leader and former Minister Ambati Rambabu was remanded to 14 days judicial custody in another case relating to 2023, where he allegedly conducted a lottery in Sattenapalli.\nSattenapalli Circle Inspector Narahari Nagamalleswara Rao said the court, on Thursday, had remanded Mr. Ambati Rambabu based on prima facie evidence, including digital evidence, submitted to the court on the alleged lottery.\nHe said that a private case had been filed against the accused in 2023 by Jana Sena Party’s Guntur district president Gade Venkateswara Rao, and certain evidences were secured against the alleged illegal lottery. He said there were allegations that Mr. Ambati Rambabu collected money for lottery tickets from the old-age and other pensioners from the pension amount that was distributed to the beneficiaries at that time.\nNow, the police were seeking his custody for further investigation into the case, he added.\nMr. Venkateswara Rao said he submitted all the evidences to the court and hoped that justice would be delivered.\nPublished - February 13, 2026 09:03 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/former-minister-ambati-rambabu-remanded-in-judicial-custody-in-illegal-lottery-case/article70629137.ece",
        "date": "Sat, 14 Feb 2026 00:19:08 +0530",
        "fetched_at": "2026-02-14 03:52:26.390405"
    },
    {
        "title": "GST improved transparency, widened tax base, increased purchasing power, say experts",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nPublished - February 13, 2026 08:56 pm IST - TIRUPATI\nThe participants of ICSSR-sponsored seminar on GST at SPMVV campus in Tirupati on Friday.\n                                          | Photo Credit: K.V. POORNACHANDRA KUMAR\nSpeakers at a workshop on Friday (February 13, 2026) on “Socio-economic impact of GST introduction and reforms on the consumption pattern of the middle and neo middle classes with gender perspective” shed light on the importance of the Goods and Services Tax (GST) in bettering the lives of the middle classes, especially women.\nThe capacity building workshop jointly organised by Sri Padmavati Mahila Viswa Vidyalayam (SPMVV) Department of Women’s Studies and the New Delhi-based Centre for Women’s Development Studies brought together people from various walks of life such as economists, accountants, entrepreneurs, tax experts, and academicians.\nCGST & Customs Commissioner (Tirupati) Satish Dhavale shared how the GST streamlined indirect taxation, improved transparency, widened the tax base, and also strengthened compliance mechanisms.\nSimilarly, the GST 2.0 led to rationalisation of tax rates that resulted in lower taxes and it, in turn, indirectly improved savings. “This increased the purchasing power benefitted the middle and neo-middle class households,” Mr. Dhavale noted.\nSPMVV Registrar R. Usha said that such policy-oriented academic programmes would help young researchers in subjects like taxation and public policy gain insights in real-time economic developments.\nG. Ramamani, Assistant Commissioner, Central Tax & Customs, explained the practical aspects of GST implementation and its impact on small businesses and women entrepreneurs. A. Parthasaradhi, Chairman of ICMAI, Tirupati, spoke on consumption patterns under GST 2.0, distribution effects and women’s role in decisions pertaining to expenditure.\nSVU retired professor of economics D. Krishnamoorthy, chartered accountants M.C. Venkatanath and Bhagya Teja, SPMVV assistant professor of Law G. Indira Priyadarshini, entrepreneur C. Komala, author S.V. Bharathi discussed industry perspectives, MSME experiences and legal aspects.\nSPMVV’s P. Neeraja and CWDS representative Vandana acted as the event coordinators.\nPublished - February 13, 2026 08:56 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/gst-improved-transparency-widened-tax-base-increased-purchasing-power-say-experts/article70629005.ece",
        "date": "Fri, 13 Feb 2026 20:56:43 +0530",
        "fetched_at": "2026-02-14 03:52:26.989045"
    },
    {
        "title": "Bar Council elections held peacefully",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nPublished - February 13, 2026 08:55 pm IST - Vijayawada\nElections to the Bar Council of Andhra Pradesh were held peacefully, with over 80% polling on Friday.\nBar Council secretary B. Padmalatha said in a press release that votes were cast at 149 polling stations, including at the office of the Supreme Court Bar Association in New Delhi, under the supervision of Returning Officer Justice A.V. Sesha Sai and Observer Justice V.R.K. Krupa Sagar.\nThe counting of votes would begin on February 16 at the High Court.\nPublished - February 13, 2026 08:55 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/bar-council-elections-held-peacefully/article70629193.ece",
        "date": "Fri, 13 Feb 2026 20:55:33 +0530",
        "fetched_at": "2026-02-14 03:52:27.599853"
    },
    {
        "title": "Ivory theft from Pangode military establishment catches Forest department off guard",
        "content": "February 13, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 13, 2026e-Paper\nPublished - February 13, 2026 08:53 pm IST - KOCHI\nThe Kerala Forest department, which had earlier declined a request of the Pangode Military Station, Thiruvananthapuram, to obtain wildlife articles, including ivory, in its safe custody, has been caught off-guard by the reported theft of two ivory pieces from the Officers’ Mess of the station the other day.\nThe department was unaware of the possession of ivory at the military establishment.\nThough the Kerala government was earlier in favour of handing over the articles to the military establishments, it had to backtrack following the objection from the Union Ministry of Environment, Forest and Climate Change.\nIncidentally, the government had cleared the requests from the Pangode station and the Grenadiers RC for obtaining 10 pairs each of elephant ivory and antlers and 10 mount/horns in its safe custody in 2024. The State government was in favour of handing over three pairs of ivory and antlers from its strongroom to the Madras Regiment. Later, the 4th Battalion of the 8th Gorkha Rifles approached the department for two pairs of ivory to be displayed at its units. However, the Union Ministry  reminded the State government and the department that the Wildlife Protection Act and its rules “do not provide for handing over the wild animal articles/trophies which are the property of the State government, to anyone, including for safe custody.”\nThe Ministry had also pointed out that the trophies had to be “disposed of in accordance with the Wild Life Disposal of Wild Animal Article Rules, 2023 by way of incineration.” Huge quantities of wildlife articles, including ivory, are stored at the Forest department’sstrongroom in the State headquarters and various offices. The protection and management of the ivory has turned out to be an expensive and cumbersome affair for the department, according to the officials.\nMeanwhile, the Forest officials are waiting for a formal communication from the police regarding the theft at the station, worth ₹2 crore, in the intervening night between February 11 and 12, 2026, to act. It is to be seen whether the ivory had reached the military establishment through legal routes. An investigation will be launched after receiving formal communication from the authorities concerned, forest officials said.\nThe department is in the process of giving finishing touches to the proposal for providing a one-time amnesty for those who could not surrender the wildlife articles in their possession before the expiry of the deadline.\nWild animals and articles are considered government property under the Act, and those owning both the animals and the articles need to obtain ownership certificates from the department, sources pointed out.\nPublished - February 13, 2026 08:53 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/kerala/ivory-theft-from-pangode-military-establishment-catches-forest-department-off-guard/article70628725.ece",
        "date": "Fri, 13 Feb 2026 20:53:23 +0530",
        "fetched_at": "2026-02-14 03:52:28.193072"
    },
    {
        "title": "Gangster Mukhtar Ansari’s Close Aide Shoaib Kidwai Shot Dead In UP's Barabanki",
        "content": "Shoaib Kidwai, alias Bobby, a known aide of slain gangster Mukhtar Ansari, was shot dead in broad daylight by unidentified motorcycle-borne assailants on the Ayodhya highway in Barabanki. The incident took took place on Friday afternoon near Asaini turn under the Kotwali area.\nShoaib Kidwai, a resident of the Civil Lines area in the district town, was travelling in a car from Lucknow to Barabanki when two motorcycle-borne assailants intercepted his vehicle and opened fire. He was rushed to a nearby hospital, where doctors declared him dead.\nKidwai was accused in several criminal cases, including murder, extortion, and gang-related offences.\nVIDEO | Barabanki, Uttar Pradesh: Shoaib Kidwai alias Bobby, a shooter associated with slain mafia don Mukhtar Ansari, shot dead by unidentified assailants in broad daylight. Visuals from the spot.#MukhtarAnsari(Full video available on PTI Videos – https://t.co/n147TvrpG7) pic.twitter.com/WvzHsIoWvD\n— Press Trust of India (@PTI_News) February 13, 2026\n\nKidwai’s name had earlier surfaced in the Lucknow jailer murder case, in which he was named as an accused by investigating agencies. Police said he had been facing multiple criminal cases and had long posed a law-and-order challenge.\nOfficials have indicated that early information points to potential internal rivalry and a gang war as the reasons behind the killing. This angle is also under investigation.\nIn response to the incident, security has been heightened throughout the district, with additional police personnel deployed in sensitive areas. Senior officers visited the crime scene and examined the location, while CCTV footage from nearby areas is being reviewed to identify the attackers.\nSuperintendent of Police Arpit Vijayvargiya mentioned that the initial investigation suggests the attack was premeditated. A forensic team has gathered evidence, and raids are underway to apprehend the suspects, he added.\nLatest Blogs",
        "link": "https://www.news18.com/india/gangster-mukhtar-ansaris-close-aide-shoaib-kidwai-shot-dead-in-ups-barabanki-ws-bl-9902096.html",
        "date": "Fri, 13 Feb 2026 19:23:52 +0530",
        "fetched_at": "2026-02-14 03:52:31.341491"
    },
    {
        "title": "End Of An Era: PM Modi Chairs Last Cabinet Meeting In South Block",
        "content": "Prime Minister Narendra Modi on Friday chaired the final meeting of the Union Cabinet at the South Block in New Delhi, marking the end of an era for the British-era Secretariat building.\nFollowing this meeting, the Prime Minister’s Office (PMO) officially shifted to a new complex, ‘Seva Teerth’, as part of the Central Vista redevelopment project.\nPHOTO | Delhi: PM Modi (@narendramodi) chairs the final Cabinet meeting at the South Block building, marking the end of operations at the premises.(Source: Third Party) pic.twitter.com/s1OUmJn0vW\n— Press Trust of India (@PTI_News) February 13, 2026\n\n\nSeveral Union Cabinet ministers, Ministers of State (independent charge) were present in the meeting, including:\nAmit Shah\nRajnath Singh\nNirmala Sitharaman\nS Jaishankar\nJP Nadda\nManohar Lal Khattar\nPiyush Goyal\nJitan Ram Manjhi\nKinjarapu Rammohan Naidu\nShivraj Singh Chouhan\nHD Kumaraswamy\nDharmendra Pradhan\nGajendra Singh Shekhawat\nPralhad Joshi\nThe cabinet meeting was followed by the PMO’s relocation to ‘Seva Teerth’. This marked the end of an era, as all government departments vacated the North and South blocks — the seat of power since 1921.\nThe North and South blocks have been the seat of power in the country since 1921. Earlier, the Home Ministry had moved out of the North Block complex at Raisina Hills in Lutyens’ Delhi.\n\n\nPrime Minister Narendra Modi on Friday inaugurated the Seva Teerth complex, the new Prime Minister’s Office (PMO), marking the end of nearly 80 years of operations from South Block at Raisina Hill in New Delhi.\nThis is the first time the PMO has shifted out of South Block, marking a historic administrative transition after nearly eight decades. Since Independence in 1947, the PMO had operated from South Block, part of the British-era Secretariat complex designed by Edwin Lutyens and Herbert Baker.\nThe Seva Teerth complex comprises three structures:\nSeva Teerth-1: Houses the PMO with modern workspaces and ceremonial meeting halls.\nSeva Teerth-2: Occupied by the Cabinet Secretariat.\nSeva Teerth-3: Will host the National Security Council Secretariat and the Office of the National Security Advisor.\nSeva Teerth features open-plan interiors, encrypted communications systems, advanced security frameworks and integrated administrative spaces aimed at improving coordination.\n\n\nThe North and South Blocks would be transformed into the world’s largest museum.\nThe Yuge Yugeen Bharat National Museum is a landmark project designed to document over 5,000 years of Indian civilisational history. Spanning a massive 1.55 lakh square metres, it is set to surpass the British Museum and the Louvre in scale. The name itself, “Yuge Yugeen Bharat\", translates from Sanskrit as “everlasting India,\" reflecting the nation’s unbroken heritage from the Vedic period to the digital age.\nLatest Blogs",
        "link": "https://www.news18.com/india/end-of-an-era-pm-modi-chairs-last-cabinet-meeting-in-south-block-ws-l-9901954.html",
        "date": "Fri, 13 Feb 2026 19:17:44 +0530",
        "fetched_at": "2026-02-14 03:52:31.984123"
    },
    {
        "title": "India Is Shaping Next Technological Revolution: Mauritius Minister On AI Impact Summit 2026",
        "content": "New Delhi is all set to host the India–AI Impact Summit 2026, announced by Hon’ble Prime Minister Narendra Modi at the France AI Action Summit, the first time in the Global South, from February 16-20.\nThe Summit charts a path towards a future where the transformative power of AI serves humanity, drives inclusive growth, fosters social development, and promotes people-centric innovations that protect our planet. It also seeks to amplify the voice of the Global South, ensuring that technological advancements and opportunities are shared broadly, not concentrated in a few regions.\nWith Prime Minister of Mauritius Navinchandra Ramgoolam set to participate, News18 spoke to Jyoti Jeetun, Mauritian Minister of Financial Services and Economic Planning.\nEdited excerpts:\nQ: India is hosting the AI Action Summit for the first time in the Global South. With Mauritius Prime Minister Dr Navinchandra Ramgoolam attending, how do you see Mauritius aligning with India’s AI vision? Can we expect deeper collaboration in areas like FinTech and digital services?\nA: India’s leadership in hosting the AI Action Summit for the Global South is both timely and visionary. We commend Prime Minister Narendra Modi and the Government of India for taking this initiative. The participation of our Prime Minister, Navinchandra Ramgoolam, underscores Mauritius’ strong commitment not only to artificial intelligence but also to strengthening our strategic partnership with India.\nIndia has long been a global technology leader. Its IT services exports, skilled technology professionals, and the presence of Indian-origin CEOs leading major global tech firms reflect its technological depth. It is only natural that India is now shaping the next technological revolution through AI.\nMauritius sees significant scope for collaboration in AI-driven financial services, FinTech innovation, digital governance, and cross-border digital infrastructure. We are keen to align with India’s digital transformation journey and explore joint initiatives that can benefit both our economies as well as the wider Global South.\n\nQ: Mauritius is often described as a gateway to Africa. How can India and Mauritius collaborate on trilateral initiatives involving Africa, especially in trade, financial services and technology?\nA: Mauritius is strategically positioned between India and Africa, both geographically and economically. We are a member of the African Union, COMESA and SADC, and we share deep historical and economic ties with India.\nIndia is one of the fastest-growing major economies in the world. On the other hand, Africa represents a continent of 1.4 billion people, and notably, 15 of the 25 fastest-growing economies last year were in Africa. This signals tremendous opportunity.\nMauritius offers a stable, transparent and well-regulated financial ecosystem that can serve as a bridge for Indian companies seeking expansion into Africa. We provide legal certainty, financial structuring expertise, and a professional services ecosystem that supports cross-border investments.\nWith the African Union now a permanent member of the G20 — inducted under India’s presidency — the potential for structured India-Africa engagement has become even stronger. Mauritius can play a catalytic role in enabling that partnership.\nQ: Mauritius has traditionally been seen as a tax-efficient jurisdiction for investments into India. How are you positioning the country today as a financial centre?\nA: Mauritius’ financial services sector has been built and consolidated over the past three decades. Today, we are ranked first in Africa in the Global Financial Centres Index (GFCI), reflecting the strength and credibility of our financial ecosystem.\nOur financial centre is built on substance, governance, regulatory rigour and quality. For decades, Mauritius has been among the largest sources of foreign direct investment into India, reflecting mutual trust and structured engagement.\nWe continue to enhance economic substance requirements, compliance standards and regulatory oversight. Governance and transparency are ongoing priorities, and we are committed to strengthening them further in partnership with global counterparts.\nQ: Following India’s recent tax scrutiny after the Tiger Global Management case, some foreign investors are reassessing structures routed through Mauritius. Should investors be concerned? How is Mauritius responding?\nA: It would not be appropriate for me to comment on specific judicial rulings. However, what I can say is that Mauritius has proactively strengthened its regulatory and economic substance framework over the past several years.\nOur financial sector today is robust, stable and well-regulated. We offer a strong ecosystem of experienced professionals, legal certainty, and a transparent regulatory environment.\nWe recognise that the global financial landscape is evolving, and Mauritius is continuously adapting to meet new standards and expectations. We are committed to ongoing reforms and engagement with international partners to ensure that investors continue to see Mauritius as a stable and credible financial jurisdiction.\nI would reassure investors that Mauritius is focused on reinvention, resilience and long-term sustainability.\nLatest Blogs",
        "link": "https://www.news18.com/india/india-is-shaping-next-technological-revolution-mauritius-minister-on-ai-impact-summit-2026-ws-kl-9902016.html",
        "date": "Fri, 13 Feb 2026 19:57:14 +0530",
        "fetched_at": "2026-02-14 03:52:32.698296"
    },
    {
        "title": "DGCA Imposes Rs 1 Crore Penalty On Air India For Flying Airbus Without Airworthiness Permit",
        "content": "Aviation watchdog Directorate General of Civil Aviation (DGCA) has imposed a penalty of $110,350 (around Rs 1 crore) for operating an Airbus aircraft on eight flights without a valid airworthiness permit, according to a confidential order issued earlier this month, news agency Reuters reported.\nAn Airbus A320 flew passengers between New Delhi, Bengaluru, Mumbai, and Hyderabad on November 24 to 25 without the mandatory Airworthiness Review Certificate, or ARC, a key permit issued annually by the regulator after a plane passes safety and compliance checks.\nAs per the order dated February 5, 2026, issued to Air India CEO Campbell Wilson, Joint Director General of Civil Aviation Maneesh Kumar noted that the security lapse had “further eroded public confidence and adversely impacted the safety compliance of the organisation.\"\nAn internal investigation conducted by Air India described the incident as a result of “systemic failures\" and acknowledged the urgent need to strengthen its compliance culture. The probe also reportedly blamed pilots who operated the eight flights, saying they did not follow standard operating procedures before take-off, the news agency reported.\nThe regulator held the airline’s accountable manager responsible for the breach and directed the carrier to deposit the penalty within 30 days.\n\n\nMeanwhile, Air India responded to the DGCA order and said that all flaws have been satisfactorily addressed and shared with the authority.\n“Air India acknowledges the receipt of a DGCA order in relation to an incident that was voluntarily reported back in 2025. All identified gaps have since been satisfactorily addressed and shared with the authority.\nAir India remains unwavering in its commitment to maintaining the highest standards of operational integrity and safety,\" an Air India spokesperson said.\nThe airline has faced increased scrutiny over safety practices in recent months. It had earlier received warnings from the watchdog for operating aircraft without checking emergency equipment and for other audit lapses.\nThe latest penalty came months after Air India suffered its worst disaster on June 12 after a London-bound Boeing Dreamliner, carrying 242 passengers and crew, including former Gujarat chief minister Vijay Rupani, crashed into a medical college complex shortly after taking off from Ahmedabad’s Sardar Vallabhbhai Patel International Airport. 275 people lost their lives, including 120 men, 124 women, and 16 children.\n(With inputs from Reuters)\nLatest Blogs",
        "link": "https://www.news18.com/india/aviation-watchdog-imposes-rs-1-crore-penalty-on-air-india-over-safety-lapses-report-9901838.html",
        "date": "Fri, 13 Feb 2026 18:59:53 +0530",
        "fetched_at": "2026-02-14 03:52:33.374289"
    },
    {
        "title": "Elephant Tusks Worth Rs 2 Crore Stolen From A Military Camp In Kerala",
        "content": "The Poojappura police have registered a theft case after two elephant tusks, estimated to be worth over Rs 2 crore, were reported missing from the high-security Pangode Military Camp in the Kerala capital.\nAccording to the complaint, the tusks were allegedly stolen from within the camp premises. A case has been filed under Sections 331(4) and 305(e) of the Bharatiya Nyaya Sanhita (BNS).\nPolice suspect the involvement of a person who had entered the camp premises to organise a DJ party. However, officials said details surrounding the theft remain unclear.\n“We currently don’t have any information about the theft. We are gathering the information,\" the Defence PRO told Onmanorama.\nA detailed investigation has been launched to determine how the tusks went missing from the tightly secured defence establishment.\nPangode Military Camp, located in Thirumala in Thiruvananthapuram, functions under the Southern Command of the Indian Army. The base conducts key training activities and hosts joint military exercises. Known for its strict access controls, the camp is considered one of Kerala’s major defence installations.\nLatest Blogs",
        "link": "https://www.news18.com/india/elephant-tusks-worth-rs-2-crore-stolen-from-a-military-camp-in-kerala-ws-el-9899842.html",
        "date": "Fri, 13 Feb 2026 15:45:00 +0530",
        "fetched_at": "2026-02-14 03:52:34.049599"
    },
    {
        "title": "'Matter Of Pride': UP Deputy CM Keshav Prasad Maurya Praises Govt's Vande Mataram Directive",
        "content": "Uttar Pradesh Deputy Chief Minister Keshav Prasad Maurya on Friday welcomed the Union Home Ministry’s directive mandating the singing of all six verses of the national song, Vande Mataram, before the national anthem, calling it a “matter of pride.\"\nSpeaking to news agency ANI, Maurya said, “Vande Mataram has been notified in the gazette; now all Indians should sing Vande Mataram as the national song. This is a matter of pride, and I congratulate the Home Minister for this.\"\nBJP MP Sudha Murthy also expressed support, stating, “I like Vande Mataram and Jana Gana Mana.\"\nThe reactions follow the Union Ministry of Home Affairs (MHA) releasing detailed guidelines for the national song, stating that when both the national song and the national anthem are performed at an event, all six stanzas of the official version of Vande Mataram must be presented first.\nEarlier on Thursday, Madhya Pradesh Chief Minister Mohan Yadav welcomed the directive, saying the state government would implement it immediately. Speaking to reporters, CM Yadav said, “I not only approve of the decision by the Home Ministry, under the leadership of the Prime Minister, to sing six verses of Vande Mataram before Jana Gana Mana, but also I feel joy that this decision by our Prime Minister will bring the entire nation together with us to remember all those who sacrificed their lives for the country before independence. We are fortunate that the Prime Minister has decided to sing the entire Vande Mataram. The Madhya Pradesh government also supports this decision, and we will implement it immediately in our state.\"\nMadhya Pradesh School Education Minister Uday Pratap Singh also praised the move, noting its potential to inspire nationalism among future generations. He said, “I believe this auspicious day has arrived quite late. The work that should have been done years ago has now been carried out by Prime Minister Modi. I proudly say that this decision will become a major role to inspire a sense of nationalism among the coming generations in India. I thank Prime Minister Modi from the bottom of my heart, and I feel proud that a decision which should have been taken much earlier was implemented during his tenure.\"\nOn implementation in schools, Singh added, “Most schools and institutions follow this on their own, but I believe that when something becomes law, it naturally becomes mandatory for every institution and school to implement it. I would say this is a very good decision.\"\nThe move has received widespread support, with leaders hailing it as a step toward fostering national pride and unity.\nLatest Blogs",
        "link": "https://www.news18.com/india/matter-of-pride-up-deputy-cm-keshav-prasad-maurya-praises-govts-vande-mataram-directive-ws-l-9901187.html",
        "date": "Fri, 13 Feb 2026 15:06:31 +0530",
        "fetched_at": "2026-02-14 03:52:34.684903"
    },
    {
        "title": "Ministers Assert India-US Trade Deal Safeguards Farmers' Interests, Call Rahul Gandhi 'Habitual Liar'",
        "content": "Prime Minister Narendra Modi has always been in favour of the farmers and continues to prioritise their welfare in international trade agreements, said Union Minister of Agriculture and Farmers Welfare, Shivraj Singh Chouhan.\nTaking to X, Chouhan said, “Prime Minister Narendra Modi has always been in favour of the farmers. All his decisions have been taken in favour of the farmers. His plans have changed their lives.\"\nTalking about the recent trade agreement signed with the United States, the Union Minister said that the deal is designed to protect the interests of the domestic agricultural sector.\nChouhan noted that the Prime Minister’s decisions consistently aim to improve the lives of those in the farming community through strategic planning and policy shifts.\nThe Agriculture Minister emphasised that the agreement specifically addresses the needs of farmers who produce various staples. “The farmers who produce grains like wheat, rice, corn, soya and other grains have been taken care of,\" Chouhan said.\nआदरणीय प्रधानमंत्री श्री @narendramodi जी के नेतृत्व में देश का अन्नदाता सुरक्षित भी है, समर्थ भी है और सशक्त भी है। pic.twitter.com/I79m3TsV27— Shivraj Singh Chouhan (@ChouhanShivraj) February 12, 2026\nHe further explained that the deal ensures protection for those involved in different segments of the industry. According to the Minister, “The farmers who produce fruits and vegetables have also been protected in this agreement.\"\nTalking about the exposure to the international market, Chouhan said that beyond spices, several other commodities are expected to benefit from increased international exposure. “Spices, coffee, tea, marine products, and many other things will get a new market,\" he said.\nUnion Minister Dharmendra Singh Pradhan also talked about PM Modi’s visionary leadership and said that “India will never compromise on the interests of our ‘Annadatas’.\"\n“Farmers’ interests are fully protected, dairy and poultry are safeguarded, and exports are expanding, directly strengthening livelihoods,\" Pradhan said, adding, “On the global stage, India has delivered a historic win by securing duty-free access to the US for garment and textile exports, injecting fresh momentum into industry, manufacturing, and India’s global economic presence.\nUnder the visionary leadership of Prime Minister Shri Narendra Modi, India will never compromise on the interests of our ‘Annadatas’.Farmers’ interests are fully protected, dairy and poultry are safeguarded, and exports are expanding, directly strengthening livelihoods.\nOn the…\n— Dharmendra Pradhan (@dpradhanbjp) February 13, 2026\nIn addition to this, the Minister also slammed Rahul Gandhi and Congress party for spreading misinformation, theatrics, and divisive politics.\nAccusing the Congress of doing nothing to address the real concerns of our farmers, Pradhan attacked them for repeatedly tying to downplay India’s global achievements. “Their politics thrives not on solutions, but on denial, distortion, and manufactured outrage,\" he added.\nUnion Commerce Minister Piyush Goyal also on Thursday hit out at Congress leader Rahul Gandhi, calling him a “habitual liar\" and accusing him of misleading farmers with what he termed a “fake narrative\" regarding the recent trade agreement with the United States.\nIn a self-made video posted on X, Goyal alleged that Rahul Gandhi had “broken all records of speaking falsehood\" and made “baseless allegations\" in a video released earlier in the day.\nAnnadata Devo Bhava!Under PM @NarendraModi ji’s leadership, our farmers will always be secure, empowered, and prosperous. pic.twitter.com/tkUCHCsa7w\n— Piyush Goyal (@PiyushGoyal) February 12, 2026\nHe further accused the Congress leader of attempting to provoke farmers.\n“Rahul Gandhi is a habitual liar…In a video released today, he has broken all records of speaking falsehood and made baseless allegations. He is misleading our farmers with his fake narrative and trying to provoke them,\" he said.\n“Prime Minister Narendra Modi has always been empathetic towards our farmers. He has always put the interest of farmers first and taken all decisions to ensure their prosperity…In the recent trade deal with the United States of America, the interests of farmers have been kept paramount and fully protected…,\" Goyal said in the video.\nLatest Blogs",
        "link": "https://www.news18.com/india/bjp-asserts-india-us-trade-deal-safeguards-farmers-interests-calls-rahul-gandhi-habitual-liar-9900922.html",
        "date": "Fri, 13 Feb 2026 16:08:56 +0530",
        "fetched_at": "2026-02-14 03:52:35.302032"
    },
    {
        "title": "Minister Ashish Shelar Receives UNESCO World Heritage Certificate For 12 Marata Forts",
        "content": "Maharashtra’s Cultural Affairs Minister, Ashish Shelar, has formally received the UNESCO World Heritage certificate recognising twelve forts associated with Chhatrapati Shivaji Maharaj. The certificate was accepted at the UNESCO headquarters in Paris, marking the completion of a long process that brought global recognition to the historic Maratha military network.\nThe forts were inscribed last year under the title ‘Maratha Military Landscapes of India’ during the 47th session of UNESCO held on July 11, 2025. After technical presentations and follow-up documentation by the Maharashtra government delegation, the official recognition document has now been handed over. Officials described it as an important cultural moment not only for the state but for the country’s historical legacy.\nMaharashtra Chief Minister, Devendra Fadnavis, also expressed joy over the development.\nA moment of joy and pride !The official certificate declaring 12 forts of Chhatrapati Shivaji Maharaj as UNESCO World Heritage Sites was formally handed over to Cultural Affairs Minister Ashish Shelar.\nThe recognition marks a historic and emotional moment for the people of…\n— Devendra Fadnavis (@Dev_Fadnavis) February 12, 2026\nThe group includes Raigad, Rajgad, Pratapgad, Panhala, Shivneri, Lohgad, Salher, Sindhudurg, Suvarnadurg, Vijaydurg, Khanderi and Gingee Fort in Tamil Nadu. Built across mountains and coastline, these forts formed a strategic defence system during Shivaji Maharaj’s rule. Historians regard the network as a unique example of military planning combined with governance and public welfare.\nThe state government said the recognition places India’s indigenous fort architecture on the global heritage map. During his visit, Shelar also paid tribute to B. R. Ambedkar at the UNESCO premises, where Maharashtra had installed his bust on Constitution Day last year. The memorial symbolises values of equality, education, and social justice, which align with UNESCO’s ideals.\nCalling the honour emotional and historic, the minister thanked national and state leadership for support throughout the nomination process. Officials present at the ceremony included India’s Permanent Representative to UNESCO, Vishal Sharma, and senior officers from the cultural and archaeology departments. The state government said the recognition will help conservation efforts and increase global awareness of Maharashtra’s heritage. For many in the state, the acknowledgement is seen as a tribute to Shivaji Maharaj’s vision and a reminder of the region’s enduring historical identity.\n\nTourism officials believe the World Heritage status will encourage responsible tourism while ensuring better preservation of the forts. Plans are being discussed to improve visitor facilities, signage, and guided interpretation without disturbing the original structures. Conservation experts say global recognition also brings stricter monitoring standards, which will help protect the sites from damage and unplanned development. For local communities living around the forts, the move is expected to create livelihood opportunities through heritage tourism and cultural activities.\nLatest Blogs",
        "link": "https://www.news18.com/india/minister-ashish-shelar-receives-unesco-world-heritage-certificate-for-12-marata-forts-ws-bl-9900495.html",
        "date": "Fri, 13 Feb 2026 12:16:12 +0530",
        "fetched_at": "2026-02-14 03:52:36.032743"
    },
    {
        "title": "Maharashtra Govt Unveils Multi-Sector Plan To Make Mumbai ‘Drug-Free And World-Class’",
        "content": "The Maharashtra government has announced a broad plan to improve living conditions in Mumbai, aiming to turn the city into what it described as a “drug-free and world-class\" urban centre. Deputy Chief Minister Eknath Shinde shared the roadmap after a meeting of the Mumbai City District Planning Committee on Wednesday.\nThe government said that the new approach will combine health, housing, civic works and enforcements measures at the same time. The coordinated action will bring quicker and more visible results for residents.\nOne major focus is tackling substance abuse. Every municipal hospital will open de-addiction, counselling and rehabilitation facilities under a city-wide anti-drug campaign. Authorities will also push stalled housing schemes and speed up cluster redevelopment, while continuing work on large affordable housing projects across Mumbai.\nWith monsoon approaching, civic agencies have been instructed to complete road repairs, desilting of drains and flood prevention work.\nThe Maharashtra Deputy CM said that the first phase of concrete roads has already been finished and the second phase is nearing completion, with the next phase to start soon.\n📍 #मुंबई |मुंबई शहर जिल्हा नियोजन समितीची बैठक आज जागतिक व्यापार केंद्रातील नियोजन समिती कक्षात पार पडली. या बैठकीत वर्ष २०२६ -२७ साठी वाढीव मागण्यांसह ८१३ कोटी ३५ लाख ७२ हजार रकमेच्या प्रारूप आराखड्यास मंजुरी देण्यात आली.\nयात प्रामुख्याने मुंबईला ड्रग्स-फ्री, झोपडपट्टीमुक्त… pic.twitter.com/ygXkEQkq0s\n— Eknath Shinde – एकनाथ शिंदे (@mieknathshinde) February 12, 2026\nWaterlogging points will get pumping systems, holding ponds will remain operational and damaged asphalt roads will be repaired.\nEncroachments on footpaths will be cleared through a special drive to improve pedestrian safety. At the same time, authorities have been told to consider the livelihoods of those affected.\nTraffic congestion near railway stations and markets will be addressed through coordination between multiple agencies. Mobile toilets and women-only “pink toilets\" will be placed in crowded areas, and maintenance of public toilets will be tightened.\nThe plan also includes pollution control measures. Construction sites, both private and government, will have to use sprinklers and protective netting to reduce dust and improve air quality.\nIn healthcare, the government aims to widen coverage under the public health scheme to include expensive treatments such as angiography and stent procedures. Hospitals have been directed to ensure medicines are provided free to patients after inspections found some were still purchasing them outside facilities.\nPolice and district authorities have additionally been instructed to identify illegal foreign nationals and take legal action where required.\nShinde said the government wants to provide immediate relief while also planning long-term improvements so that the city becomes cleaner, safer and better prepared through coordinated efforts rather than isolated projects.\nFor Mumbaikars, the announcement raises cautious hope. Many of these promises have been made before, but citizens say the real test will be daily experience — cleaner streets, smoother travel, and reliable public services. If departments work together and deadlines are met, the impact could be visible quickly. Otherwise, it risks becoming another plan on paper. The government now faces the challenge of turning intent into visible change across neighbourhoods.\nLatest Blogs",
        "link": "https://www.news18.com/india/maharashtra-govt-unveils-multi-sector-plan-to-make-mumbai-drug-free-and-world-class-ws-l-9900449.html",
        "date": "Fri, 13 Feb 2026 11:25:54 +0530",
        "fetched_at": "2026-02-14 03:52:36.880207"
    },
    {
        "title": "Telangana Local Body Election Results Live: Congress Crosses 900-Mark, BRS Leads On 521 Seats; BJP Trailing",
        "content": "Telangana Municipal Election Results 2026 Live Updates: Counting of votes for elections in 116 municipalities and seven municipal corporations in Telangana began on Friday, marking a key test of popularity for the ruling Congress, opposition BJP and BRS.\nCongress has crossed the 900-mark in overall leads and wins, consolidating a strong position in the early trends. Meanwhile, BRS is leading on 521 seats, the BJP on 174, and other parties and independents on 169 seats, indicating a decisive edge for Congress in the ongoing count.\nAhead of the counting, major parties moved their candidates to undisclosed locations to prevent poaching by rivals, according to PTI sources. Counting is being conducted at 123 centres across the state since 8 am. The process is expected to take time, as ballot papers were used in these elections. Voting took place on February 11.\nThe State Election Commission (SEC) stated that adequate security arrangements have been made to ensure peace and order. Section 163 of the BNSS (prohibitory orders) is in force around the counting centres.\nDirector General of Police (DGP) B Shivadhar Reddy said that comprehensive security measures are in place. Nearly 12,000 police personnel, supported by armed forces and Quick Response Teams, have been deployed to maintain law and order during the counting. Follow for live updates.\nTotal seats: 60\nTotal municipalities-19\nAs per the data announced by Telangana State Election Commission, Congress has won Yellandu, Aswaraopeta, Parakala, Dharmapuri, Korutla, Station Ghanpur, Bhupalapally, Yellareddy, Banswada, Bichkunda, Huzurabad, Choppadandi, Edulapuram, Wyra, Madhira, Kalluru, Sattupalli, Luxettipet, Chennur, Dornakal, Maripeda, Bhoothpur, Chevella, Shadnagar, Shankarpally, Kodangal, Tandur, Atmakur, Pebbair, Wanaparthy, Kalwakurthy, Kollapur, Nagarkurnool, Chandur, Chityal, Devarakonda, Haliya, Miryalguda, Nandikonda, Huzurnagar, Kodada, Neredcherla and Suryapet municipalities.\nAs of 6 pm, Telangana State Election Commission has announced results of 2,836 Wards. Check party wise result:\nTotal – 34\nTotal -24\nOut of the 2,996 Wards, Telangana State Election Commission has announced the results of 2,774 wards. Check party wise result below.\nTotal seats 30, check party wise results below:\nIn the Kothagudem Municipal Corporation, CPI emerged as the largest party with 21 seats, followed by Congress with 17, while BRS won six, Independents five, and BJP one.\nCongress is leading in Ramagundam, Nalgonda and Manchirial Corporations as counting of votes are underway.\nCongress has crossed the 900-mark in overall leads and wins, consolidating a strong position in the early trends. Meanwhile, BRS is leading on 521 seats, the BJP on 174, and other parties and independents on 169 seats, indicating a decisive edge for Congress in the ongoing count.\nIn Vikarabad district, results have been declared for 41 out of 100 wards across four municipalities, including seats decided unanimously. Congress emerged ahead with 20 wards, followed by BRS with 14. BJP secured 3 wards, while AIMIM and Independent candidates won 2 wards each.\nTelangana Congress leaders celebrated at the party office in Nampally, Hyderabad, distributing sweets, bursting crackers, beating drums and dancing as early trends in the municipal election results boosted their morale. Expressing confidence of securing more seats, party workers rejoiced after the State Election Commission announced that Congress had won 240 of the 448 Municipal Corporation wards declared so far.\n#WATCH | Telangana Congress leaders distribute sweets, burst crackers, beat drums and dance as they celebrate at the party office in Nampally, Hyderabad, expressing confidence that they will win more seats in today’s municipal election results.\nAs per the State Election… pic.twitter.com/1wOnuSyFEd\n— ANI (@ANI) February 13, 2026\n\nEarly trends indicate that Congress has crossed the 600-mark in total seats, establishing a strong lead. Meanwhile, BRS is ahead on 350 seats, and the BJP is leading in 102 seats, reflecting a competitive contest across several municipalities and wards in the state.\nSo far, Congress has secured victories in 27 municipalities, while BRS won in four, reflecting a strong lead for the ruling party in the local polls.\nEarly trends show that Congress has crossed the 430-mark in total seats, while BRS leads on 250 seats. The BJP is ahead on 64 seats, indicating a competitive race among the major parties.\nCongress has won Aswaraopeta Municipality in Bhadradri Kothgudem district of Telangana.\nCongress has won Nandikonda Municipality in Nalgonda district of Telangana.\nCongress has won ward number 15 in Sangareddy.\nBRS has won ward number 12 in Ibrahimpatnam Municipality with a margin of 100 votes.\nIn Sangareddy District, BRS emerged victorious in the Gaddapotharam Municipality elections, winning 14 seats, while Congress secured 3 seats and an independent candidate won 1 seat.\nRajanna Sircilla in-charge Collector Garima Agrawal inspected the ongoing municipal vote counting process, overseeing arrangements to ensure a smooth and orderly procedure.\nDirector General of Police B Shivadhar Reddy stated that robust security measures have been implemented for the vote counting. Around 12,000 police personnel, supported by Quick Response Teams, have been deployed at the counting centres, and prohibitory orders are in effect in and around these areas to ensure law and order, PTI reported.\nIn Warangal District’s Wardhannapet, counting of votes for the municipal elections is currently underway. Visuals have emerged from the counting centre. The police and Election Commission have put in place security and logistical arrangements to ensure the process is conducted smoothly and in an orderly manner.\n#WATCH | Telangana: Counting of votes for Municipal election is underway in Wardhannapet, Warangal District. The Police and Election Commission have made arrangements for the counting of votes at the centres. pic.twitter.com/ap8oW61TZH\n— ANI (@ANI) February 13, 2026\n\nThe counting of votes for elections in 116 municipalities and seven municipal corporations in Telangana began on Friday.\nLatest Blogs",
        "link": "https://www.news18.com/india/telangana-municipal-elections-results-2026-ts-local-body-polls-vote-counting-winners-list-telangna-election-commission-latest-news-liveblog-ws-l-9900279.html",
        "date": "Fri, 13 Feb 2026 19:30:40 +0530",
        "fetched_at": "2026-02-14 03:52:37.879463"
    },
    {
        "title": "MK Stalin's Big Pre-Poll Move: Rs 5,000 Each For 1.3 Crore Women Under Kalaignar Scheme",
        "content": "Tamil Nadu Chief Minister MK Stalin on Friday announced the disbursal of Rs 5,000 to women beneficiaries under the Kalaignar Women’s Rights Scheme, describing it as part of his government’s ongoing commitment to women’s welfare.\nIn a post on X, Chief Minister Stalin emphasised that the payments, covering February, March, and April, include Rs 3,000 as the standard monthly allocation and an additional Rs 2,000 as a “summer special\" bonus. He stated that the funds have already been credited to 1.31 crore women under the scheme.\nதமிழ்நாட்டு மகளிருக்கு இந்த ஸ்டாலின் தந்த உறுதிமொழிதான் உரிமைத்தொகை. யார் தடை ஏற்படுத்தினாலும் அதிலிருந்து பின்வாங்க மாட்டேன்.தேர்தலைக் காரணம் காட்டி, மூன்று மாதங்களுக்கு உரிமைத்தொகையை முடக்கப் பார்க்கிறார்கள். முந்திக்கொண்டது நமது #DravidianModel அரசு!\nபிப்ரவரி, மார்ச்,… pic.twitter.com/n7VrMqcrb7\n— M.K.Stalin – தமிழ்நாட்டை தலைகுனிய விடமாட்டேன் (@mkstalin) February 13, 2026\n\n“This promise given by this Stalin to Tamil Nadu women is the rights allocation. No matter who imposes obstacles, I will not back down from it. Using elections as an excuse, they are trying to stall the rights allocation for three months. What was promised was by our #DravidianModel government! As advance for February, March, April months: ₹3 thousand + as summer special allocation: ₹2 thousand!,\" he tweeted.\nStalin described the scheme as a hallmark of the Dravidian Model government, asserting that attempts to delay the disbursement by three months, allegedly citing elections as an excuse, would not deter his administration. “No matter who imposes obstacles, I will not back down from it,\" he wrote, highlighting his commitment to the programme.\nThe DMK leader also promised that in the proposed Dravidian Model 2.0, the monthly rights allocation would increase from Rs 1,000 to Rs 2,000, reinforcing his focus on expanding financial support to women. He concluded the post with a message of solidarity and electoral confidence, urging women to support the party in the upcoming assembly elections.\nThe tweet comes ahead of the Tamil Nadu assembly elections scheduled later this year, with Stalin’s government seeking to highlight welfare measures targeted at women as a key campaign plank.\nTamil Nadu Congress Chief Vows To Protect Scheme\nSelvaperunthagai K, President of the Tamil Nadu Congress Committee, welcomed the increase in monthly assistance for women household heads, noting that 1.31 crore families will benefit from the move.\nமகளிர் குடும்பத் தலைவர்களுக்கான மாதாந்திர உதவித் தொகை உயர்வு அறிவிப்பு மகிழ்ச்சி அளிக்கிறது.இதனால் தமிழ்நாடு முழுவதும் 1.31 கோடி குடும்பங்கள் நேரடியாகப் பயன் பெற உள்ளன.\nகடந்த மாதம் தமிழர் திருநாளான பொங்கல் முன்னிட்டு ஒரு குடும்பத்திற்கு ரூ.3,000 வழங்கப்பட்டதும், தற்போது…\n— Selvaperunthagai K (@SPK_TNCC) February 13, 2026\n\nIn a post on X, Selvaperunthagai wrote, “The announcement of the monthly assistance amount increase for women household heads brings joy. As a result, 1.31 crore families across Tamil Nadu will directly benefit. Last month, ahead of the Tamil harvest festival of Pongal, Rs 3,000 was provided per family, and now this month, with Rs 5,000 being provided under the women’s rights scheme, families will receive a total of Rs 8,000 in consecutive months, bringing about real change in the lives of families. This will serve as true relief for poor and middle-class families struggling under the burden of rising prices.\"\nHe praised the move as recognition of women’s labor and self-reliance, while accusing the Union government of attempting to “obstruct this people-welfare scheme.\"\n“We cannot accept this trend of disregarding state rights and the welfare of the people. The Tamil Nadu Congress Committee will firmly safeguard this scheme that ensures social justice and human compassion,\" he further wrote.\nCommentator Sumanth Raman Targets Tamil Nadu Govt Over Cash Scheme\nCommentator Sumanth Raman criticised the Tamil Nadu government over its announcement of Rs 2,000 for “summer expenses,\" questioning the timing ahead of elections. In a post on X, he alleged that the financial assistance amounted to voter inducement.\n“A Govt that claims to have transformed Tamil Nadu and fulfilled most of its promises has to resort to what is effectively a bribe to the voters before the elections. Rs 2000 for Summer expenses? What next? Monsoon expenses and Winter expenses?\" Raman wrote in a post on X.\nHe also pointed out that with Rs 3,000 given for Pongal and now Rs 2,000 for summer expenses, nearly Rs 10,000 crore is being distributed, suggesting the move is linked to the upcoming polls.\n“How is this any different from the BJP bribing Bihar voters with Rs 10,000 before the elections? Rs 3,000 for Pongal expenses and now Rs 2000 for summer expenses? Almost Rs 10,000 crore being distributed because elections are coming,\" he further wrote.\nLatest Blogs",
        "link": "https://www.news18.com/india/stalin-credits-rs-5000-to-1-3-crore-women-under-kalaignar-scheme-promises-hike-in-allocation-ws-l-9900228.html",
        "date": "Fri, 13 Feb 2026 09:08:04 +0530",
        "fetched_at": "2026-02-14 03:52:38.485947"
    },
    {
        "title": "Can You Be Penalised For Playing Loud Music On A Flight? Here's What Government Says",
        "content": "Playing loud music on an aeroplane without earphones may lead to penal action if such actions lead to unruly behaviour under aviation rules. Replying to a question raised in the Lok Sabha by Namakkal MP Matheshwaran, Minister of State for Civil Aviation Murlidhar Mohol said the action will be taken as per the Civil Aviation Requirements (CAR) issued by the DGCA.\nThe Directorate General of Civil Aviation (DGCA) issued CAR to deal with unruly passengers.\nWithout indicating any new penal provisions for people playing loud music on the aircraft, the minister clarified that the airlines provide in-flight entertainment and play soft instrumental music during boarding and disembarkation.\nHe further highlighted Rules 22, 23, and 29 of the Aircraft Rules of 1937 that cover disruptive behaviour on board an aircraft.\nRule 22 deals with refusal of carriage and disembarkation of passengers, Rule 23 empowers the pilot-in-command to restrain persons acting in a manner prejudicial to safety or good order, and Rule 29 provides for penalties for contravention of the Aircraft Rules.\nThe minister also responded to a query related to vlogging inside an aeroplane and underscored Rule 13 of the Aircraft Rules which restricts photography at DGCA-licensed aerodromes.\nLatest Blogs",
        "link": "https://www.news18.com/india/playing-loud-music-on-flight-an-offence-heres-what-government-says-ws-be-9899313.html",
        "date": "Thu, 12 Feb 2026 19:25:43 +0530",
        "fetched_at": "2026-02-14 03:52:39.707808"
    },
    {
        "title": "CNBC AWAAZ Sweeps Budget Day, Leads FM Speech And Budget Week Ratings",
        "content": "Cementing its position as the market leader in Hindi business news, CNBC AWAAZ emerged as the go-to destination for investors and market watchers during the Union Budget 2026 coverage.\nAccording to BARC data, CNBC AWAAZ captured a dominant 63% market share during the live telecast of Finance Minister Nirmala Sitharaman’s Budget speech on 1st February 2026, significantly outperforming Zee Business, which stood at 37%.\n(Source: BARC | MKT: HSM Urban | TG: 22-40 M | Period: 1st Feb 2026(1100-1230)\nThe leadership extended across the full Budget Day as well. On 1st February 2026, CNBC AWAAZ secured a 61.3% market share, while Zee Business registered 38.7%, highlighting CNBC AWAAZ’s dominance during one of the most competitive and high-stakes news events of the financial calendar. (Source: BARC | MKT: HSM Urban | TG: 22-40 M | Period: 1st Feb 2026)\nBudget Day traditionally drives intense viewer engagement, as audiences track policy announcements, taxation reforms, sectoral allocations, fiscal discipline measures, and their real-time impact on markets. CNBC AWAAZ’s comprehensive coverage, blending expert analysis, corporate voices, and live market decoding, resonated strongly with its core audience of investors and traders.\nThe momentum carried into Budget Week, where CNBC AWAAZ maintained a commanding lead with a 76.4% market share, compared to Zee Business at 23.6%,  less than half of CNBC AWAAZ’s share, reaffirming sustained viewer preference beyond the headline announcements. (Source: BARC | MKT: HSM 10L+ | TG: 22-40 M | Period: Wk 05’26)\nOn the digital front as well, CNBC AWAAZ emerged among the world’s top-viewed live news streams on Union Budget Day 2026. During the peak live window between 11:00 am and 12:40 pm, the channel emerged as the clear leader in digital viewership, registering a peak concurrency of 765.1K, recording 3.5x the viewership of Zee Business, highlighting its growing cross-platform strength. (Source: Databeings)\nWith sustained leadership across key market hours and critical policy moments, CNBC AWAAZ continues to strengthen its position as India’s most-watched Hindi business news channel, setting new benchmarks  year after year.\nLatest Blogs",
        "link": "https://www.news18.com/india/cnbc-awaaz-sweeps-budget-day-leads-fm-speech-and-budget-week-ratings-9899245.html",
        "date": "Thu, 12 Feb 2026 18:16:16 +0530",
        "fetched_at": "2026-02-14 03:52:40.543116"
    },
    {
        "title": "The Big Rafale Deal: How G2G Model Fast-Tracks India’s Largest Defence Acquisition",
        "content": "India has finalised one of its most significant defence acquisitions ever — a proposed Rs 3.25 lakh crore agreement with France to procure 114 additional Dassault Rafale fighter jets for the Indian Air Force (IAF). The deal, cleared by the Defence Acquisition Council (DAC) ahead of French President Emmanuel Macron’s visit to New Delhi next week, will dramatically expand India’s air combat strength and transform its aerospace industrial base.\nFor Indian pilots and planners, this procurement represents a pivotal leap in capability. The Rafale, a 4.5-generation multi-role fighter with integrated electronic warfare systems, advanced sensors, and precision weapons, has already proven itself in demanding operational conditions. Its deployment in recent missions and drills has reinforced confidence in its performance.\nA key feature of the deal is the use of a direct Government-to-Government (G2G) framework between New Delhi and Paris — a model similar to the earlier Rafale acquisition a decade ago, which is seen within defence circles as faster, cleaner and more predictable than traditional multi-vendor tenders. This approach is expected to significantly cut procedural delays that often slow down large defence procurements.\nThe G2G framework bypasses much of the bureaucratic layering. Instead of negotiating with multiple vendors, India negotiates directly with the French government, which then guarantees delivery through Dassault Aviation. This dramatically cuts procedural timelines and reduces the risk of future cancellations.\nThe supplying government, meanwhile, effectively stands behind the contract. This offers clearer pricing structures, state-backed performance guarantees, and better accountability on timelines\nUnder the current proposal, 18 Rafales would be delivered from France, while the remaining 96 are slated for final assembly and manufacture in India. Officials have stressed that this arrangement will not only enhance India’s combat fleet but also catalyse skilled jobs, robust supply chains, and long-term growth of the domestic aerospace sector.\nCrucially, the deal is designed to integrate Indian weapons systems into the Rafale platform, ensuring that indigenous technologies and armaments work seamlessly with the new jets — a requirement New Delhi has underscored during negotiations.\nThe pact also envisages substantial technology transfer from Dassault Aviation and its partners to Indian firms participating in production and support. Tata Advanced Systems, for example, has already signed production transfer agreements with Dassault to manufacture key structural parts — the first time such components will be made outside France — marking a milestone under the “Make in India\" initiative.\nIndian defence planners see this acquisition as a force multiplier, bridging capability gaps while indigenous fighters such as HAL Tejas and future platforms like the Advanced Medium Combat Aircraft (AMCA) mature. Once concluded and fully implemented, the deal will turn the Rafale from an imported asset into a partly Indian-made cornerstone of India’s combat aviation fleet.\nLatest Blogs",
        "link": "https://www.news18.com/india/the-big-rafale-deal-how-g2g-model-fast-tracks-indias-largest-defence-acquisition-ws-l-9898206.html",
        "date": "Thu, 12 Feb 2026 15:08:26 +0530",
        "fetched_at": "2026-02-14 03:52:41.863980"
    },
    {
        "title": "'Emphasised On Reform Express': PM Modi Praises Nirmala Sitharaman’s Reply On Budget In Lok Sabha",
        "content": "Prime Minister Narendra Modi on Thursday lauded Finance Minister Nirmala Sitharaman’s reply in Lok Sabha on Union Budget. In a social media post, PM Modi said Sitharaman outlined this year’s budget and emphasised on “Reform Express.\"\n“In her speech in the Lok Sabha, Finance Minister Smt. Nirmala Sitharaman Ji gave a comprehensive picture of how this year’s Budget will contribute to our nation’s economic transformation. She emphasised on Reform Express, the support to MSMEs, skilling, push to next-gen infrastructure, efforts to boost healthcare, education and more,\" PM’s post on X reads.\nIn her speech in the Lok Sabha, Finance Minister Smt. Nirmala Sitharaman Ji gave a comprehensive picture of how this year’s Budget will contribute to our nation’s economic transformation. She emphasised on Reform Express, the support to MSMEs, skilling, push to next-gen…— Narendra Modi (@narendramodi) February 12, 2026\nReplying to the debate in Lok Sabha on the Union Budget 2026-27, Union Finance Minister reiterated the government’s commitment to strengthening rural and agricultural sectors along with other areas. She began her speech by stressing on the importance of this year’s budget. “This budget is a budget which is prepared as the first budget that is prepared in the second quarter of the 21st century. Therefore, this budget includes various components from 2026 to 2050. We are also starting the new five-year cycle of new finance commission. The budget is largely based on the recommendations of the commission,\" Sitharaman said.\nShe also outlined various government initiatives, including skilling and infrastructure investment. The Budget 2026 has increased public capex from Rs 11.2 lakh crore in BE 2025-26 to Rs 12.2 lakh crore in FY2026-27, she said.\n“We have said that instead of waiting to qualify and finishing your education and coming out and seeking where should they go for acquiring skills, the skilling element can be brought into education itself and at the end of the day when they come out, students can say I can become an entrepreneur and this kind of a mega centre can be kept next to any industrial cluster that any state has,\" she said.\nLok Sabha took up discussion on the Union Budget on Wednesday. Sitharaman is expected to reply to the debate in the Rajya Sabha on Thursday.\nLatest Blogs",
        "link": "https://www.news18.com/india/emphasised-on-reform-express-pm-modi-praises-nirmala-sitharamans-reply-on-budget-in-lok-sabha-ws-bl-9898117.html",
        "date": "Thu, 12 Feb 2026 14:48:46 +0530",
        "fetched_at": "2026-02-14 03:52:42.540561"
    },
    {
        "title": "'Conspiracy, Clearance Bypassed’: FIR In Ex-Army Chief’s Book Leak Puts Focus On Overseas Sales",
        "content": "The controversy surrounding the former Army chief’s book has deepened, with sources indicating that the publication was allegedly released without mandatory clearance from the Ministry of Defence (MoD) and first sold on online platforms in Canada, Australia, Germany and the United States.\nAccording to sources, the initial investigation following the registration of a case points to a “well-planned conspiracy\". It is learnt that the book was leaked in a coordinated manner, bypassing the MoD’s mandatory clearance process for publications involving serving or former defence personnel.\nAlso Read: ‘This Is The Status’: Gen Naravane Shares Publisher’s Posts In First Response To Memoir Row\nInvestigators have found that copies of the book began circulating on online platforms in Canada, Australia, Germany and the US before surfacing elsewhere. Sales are said to have started in these countries first, raising questions about the publishing and distribution chain.\nThe Special Cell has registered an FIR under sections pertaining to criminal conspiracy. The scope of the probe has now been expanded internationally, covering the US, Canada, Germany and Australia.\nA thorough investigation into the digital trail, publishing network and possible international links is currently underway. Sources said the probe is intensifying, with agencies examining overseas connections and coordination in the alleged leak and distribution of the book.\nAlso Read: ‘No Copies Published’: Penguin India On Row Over Circulation Of Ex-Army Chief’s Pre-Print Book\n\n\nDelhi Police’s Special Cell questioned members of Penguin India’s team on Thursday, following a notice issued to the publisher over its earlier statement on the book controversy. The questioning lasted for approximately two hours.\nThe Special Cell had served a notice seeking responses to specific queries and summoned representatives of the publishing house for examination. During the session, the team was reportedly asked around 15 questions.\nSources said some of the queries were answered during the questioning, while the Penguin India team sought additional time to respond to the remaining questions. The Special Cell is now expected to examine and analyse the responses submitted by the publisher.\nAlso Read: Penguin Random House India Receives Delhi Police Notice Over Leak Of General Naravane’s Memoir\n\n\nAmid the row, Penguin Random House India, which holds the publishing rights to Four Stars of Destiny, issued a clarification stating that the book has not been published in any format.\nThe publisher said that an announced title, a pre-order listing nd a published book are distinct stages, and that a book is considered published only when it is available for purchase across retail channels.\nIt further stated that no copies — in print or digital form — have been officially released, and warned that any material currently in circulation would amount to copyright infringement.\n\n\nThe entire row over the book erupted in Parliament when the Leader of the Opposition Rahul Gandhi referred to the alleged contents of General (Retd.) MM Naravane’s unpublished memoir and displayed what he claimed was a copy of the book in the Lok Sabha.\nHis remarks triggered strong objections from treasury benches, with BJP leaders questioning how an unpublished manuscript was accessed and cited in the House. The episode led to heated exchanges, walkouts and demands for clarification, bringing the status of the book’s publication and its alleged leak into sharp political focus.\n\n\nLatest Blogs",
        "link": "https://www.news18.com/india/conspiracy-clearance-bypassed-fir-in-ex-army-chiefs-book-leak-puts-focus-on-overseas-sales-ws-l-9898034.html",
        "date": "Thu, 12 Feb 2026 14:22:23 +0530",
        "fetched_at": "2026-02-14 03:52:43.218096"
    },
    {
        "title": "PM Modi To Inaugurate Seva Teerth And Kartavya Bhavan 1 And 2 On Feb 13",
        "content": "Prime Minister Narendra Modi is set to inaugurate the Seva Teerth, the new building of the Prime Minister’s Office, and Kartavya Bhawan 1 and 2, on February 13. The inauguration of the new buildings will mark a transformative milestone in India’s administrative governance architecture.\nAccording to a statement released by the Prime Minister’s Office, the structures also reflect PM Modi’s commitment to building a modern, efficient, accessible, and citizen-centric governance ecosystem.\nThe development came decades after several key government offices and ministries functioned from fragmented and ageing infrastructure spread across multiple locations in the Central Vista area causing operational inefficiencies, coordination challenges.\nThe old structures, with time, escalated maintenance costs and sub-optimal working environments. The new building complexes address these issues by consolidating administrative functions within modern, future-ready facilities, the statement added.\nSeva Teerth houses the Prime Minister’s Office, the National Security Council Secretariat, and the Cabinet Secretariat, all of which were previously located across different locations.\nMeanwhile, Kartavya Bhavan 1 and 2 will accommodate law, defence, finance, health, agriculture, and several other key ministries.\nIt has been learnt that the new building complexes feature digitally integrated offices, structured public interface zones and centralised reception facilities.\nThe building are designed in accordance with 4-Star GRIHA standards and will focus on incorporating renewable energy systems, water conservation measures, waste management solutions and high-performance building envelopes.\nThese measures significantly reduce environmental impact while enhancing operational efficiency, the PMO said.\nNotably, the building complexes will use comprehensive safety and security frameworks, such as smart access control systems, surveillance networks. It will also accomodate advanced emergency response infrastructure, ensuring a secure and accessible environment for officials and visitors.\n(With agency inputs)\nLatest Blogs",
        "link": "https://www.news18.com/india/pm-modi-to-inaugurate-seva-teerth-and-kartavya-bhavan-1-and-2-on-feb-13-9898036.html",
        "date": "Thu, 12 Feb 2026 14:10:52 +0530",
        "fetched_at": "2026-02-14 03:52:43.898988"
    },
    {
        "title": "Bihar ‘Paralysis Village’: Patients In Every Hamlet, Deaths Rise As Public Anger Mounts",
        "content": "A shocking health situation has emerged in Korjana village of Bihar’s Begusarai district, where residents claim a rising number of paralysis cases and deaths over the past year. Villagers allege that despite repeated incidents and mounting concern, authorities, from block-level officials to the local MLA, have not taken adequate notice of the situation.\n\n\nAccording to locals, the village has witnessed a sharp increase in paralysis cases, particularly in the last six months. Residents say more than five people in nearly every hamlet have been affected, and several families have performed last rites for relatives during this period.\nThe growing number of cases has led villagers to refer to Korjana as ‘Paralysis Village’.\nA team from Local18 visited the village to understand the ground reality. During the visit, residents spoke about sudden illnesses, rising treatment expenses, and what they describe as a lack of timely government intervention, raising serious questions about healthcare monitoring and administrative response in the area.\n\n\nOne of the villagers, Kiran Devi, said her father-in-law suddenly suffered a brain haemorrhage, after which he became paralysed. The family is arranging treatment on their own, but she believes timely government assistance could save his life.\nAnother villager, Pavitri Devi, who is battling paralysis, explained that her hands and feet gradually stopped functioning. She now travels to Chakva for treatment, as most patients from the village reportedly do. Despite this, lives continue to be lost. Speaking to Local18, she broke down in tears, alleging that officials remain unmoved by their suffering.\nDulari Devi stated that many paralysis cases have emerged in the last six months, yet no government aid has reached the village. Similarly, Badam Devi said she was suddenly struck by paralysis and did not even realise when the illness took hold.\nRanjay Yadav pointed out that having more than five paralysis patients in a single neighbourhood is highly unusual. Amarjeet Kumar Yadav echoed the same concern. Sanju Devi added that people from neighbouring villages now visit Korjana to witness the alarming situation themselves.\n\n\nA young villager, Dilkhush, said his grandfather’s treatment has already cost the family around Rs 50,000. They sought help from private hospitals in Chakva and Samastipur, yet no government doctor has visited Korjana so far.\nDai Rani, whose mother-in-law died after suffering from paralysis, claimed that most deaths have occurred within the past six months.\nDuring the course of reporting, another villager, Dunia Lal, reportedly died within three days of being paralysed.\nMost of the affected individuals are above 40 years of age.\n\n\nVillagers insist that no health department team has visited the area, nor has any formal investigation been initiated. They question why the Block Medical Officer is unaware of deaths and illnesses that have been occurring for nearly a year.\nIf a health sub-centre exists in the village, residents ask why no health assessment has been conducted. They also question whether the Block Development Officer (BDO) has fulfilled their responsibilities, or if their role has been limited to sanctioning funeral assistance.\nThe biggest concern raised by villagers is whether the local MLA has forgotten the community after securing votes.\n\n\nFrustration has led some residents to bitterly refer to Korjana as both ‘Paralysis Village’ and ‘Funeral Village’. Numerous questions are being directed at officials ranging from the BDO to the MLA, yet answers remain elusive.\n\n\nWhether the illness is the result of a mysterious disease or administrative negligence remains unclear and requires urgent investigation. Until the truth emerges, fear and mistrust towards the system will continue to grow in Korjana.\nThe central question remains: has empathy disappeared from governance, or are authorities simply waiting for a major inquiry before taking action?\nLatest Blogs",
        "link": "https://www.news18.com/india/bihar-paralysis-village-patients-in-every-hamlet-deaths-rise-as-public-anger-mounts-ws-l-9897732.html",
        "date": "Thu, 12 Feb 2026 13:17:15 +0530",
        "fetched_at": "2026-02-14 03:52:44.553235"
    },
    {
        "title": "News18 Afternoon Digest: BJP Seeks Suspension Of Rahul Gandhi's Parliament Membership; Bangladesh Elections & More",
        "content": "In today’s afternoon digest, News18 brings you the latest updates on the ongoing Parliament budget session, Bangladesh elections 2026, and more.\n‘Rahul Gandhi’s Membership Should Be Cancelled’: BJP Submits Notice Amid Parliament Row\nBJP MP Nishikant Dubey said there is no plan to move a privilege motion against Leader of the Opposition Rahul Gandhi. However, he has sought the suspension of Rahul Gandhi’s membership from the Indian Parliament and brought a substantial motion against him on Thursday. Read More\nCongress MPs Entered Speaker’s Chamber, Threatened Him: Kiren Rijiju Shares Video\nUnion Minister Kiren Rijiju on Thursday shared a video from inside the Chamber of the Lok Sabha Speaker Om Birla, alleging that a large group of Congress MPs abused him and threatened Prime Minister Narendra Modi ahead of the face-off between the Opposition and the government in Parliament on February 4. Read More\nTobacco Tycoon’s Son Shivam Mishra Arrested Four Days After Kanpur Lamborghini Crash\nShivam Mishra, son of tobacco businessman KK Mishra, was eventually arrested on Thursday in connection with the Kanpur Lamborghini crash that left six people injured, after a court rejected the surrender plea of a man claiming to be the driver at the time of the accident. Read More\n‘New Bangladesh Begins Today’: Muhammad Yunus Casts Vote In Political Reset\nBangladesh voted on Thursday in a crucial election held after the fall of Sheikh Hasina’s government, with Interim Government Chief Adviser Professor Muhammad Yunus casting his vote in the capital. Read More\nUN Report Links JeM To Delhi’s Red Fort Blast, Warns Group Remains Active | Exclusive\nA United Nations Security Council (UNSC) monitoring report has flagged continued activity by South Asia-based jihadist groups, including Jaish-e-Mohammed (JeM), despite years of sanctions, financial curbs and international pressure. Read More\nNamibia Look To ‘Fight Hard’ Against Injury-Stricken India At Kotla\nFacing the menacing associate teams has been anything but a cakewalk for the giants in this World Cup and defending champions India have already experienced that firsthand. Read More\nAditya Dhar To Reunite With Ranveer Singh For A Mythological Drama: Report\nAditya Dhar is reportedly gearing up for a new mythological action film, and actor Ranveer Singh is likely to star in the project. According to recent reports, Dhar has renewed his first-look deal with Jio Studios and is currently developing a large-scale mythological venture. Read More\nLatest Blogs",
        "link": "https://www.news18.com/india/news18-afternoon-digest-bjp-seeks-suspension-of-rahul-gandhis-parliament-membership-bangladesh-elections-more-ws-l-9897696.html",
        "date": "Thu, 12 Feb 2026 12:38:24 +0530",
        "fetched_at": "2026-02-14 03:52:45.196843"
    },
    {
        "title": "Arunachal Dam Project Gets Eco Go-Ahead After 3 Decades, At The Cost Of 23 Lakh Trees | Exclusive",
        "content": "The Centre’s expert panel has recommended environmental clearance for the Kamala hydroelectric project, a 1,720-MW storage dam proposed in the forested districts of Arunachal Pradesh.\nThree decades in the making, the dam project, however, comes with strong warnings over large-scale deforestation and the need for strict ecological safeguards as more than 23 lakh trees will have to be felled.\nThe dam project – proposed by NHPC Ltd – involves the construction of a concrete gravity dam at a height of 216 metres on Kamala River, which is a tributary of the Subansiri and part of the Brahmaputra basin.\nThe dam and its reservoir will spread across 3,858 hectares in Kamle, Kra Daadi and Kurung Kumey districts, most of which are covered by dense forests.\nAfter recently examining the proposal, the expert appraisal committee (EAC) noted that the dam project is in category ‘A’ of the Environmental Impact Assessment Notification, 2006 – this requires clearance at the central level.\nWhile recommending approval, the EAC flagged what it called a serious environmental concern: the proposed felling of over 23 lakh trees.\n“The project is located in a very dense forest area,\" the committee observed, stressing that such large-scale deforestation will require carefully planned mitigation and ecosystem restoration measures.\nIt said a detailed action plan must be prepared in consultation with state forest and wildlife departments, ecological experts and local communities before forest clearance can be considered.\nThe social footprint is also significant. According to official documents, 126 villages across three districts will be affected with at least 30,000 people living in the impacted area.\nThe broader study area covers 377 villages across four districts. The NHPC, however, has argued that the project serves strategic and economic goals.\nDesigned as a storage-based hydropower project, the Kamala dam is expected to provide daily peaking power and play a role in flood moderation in the downstream Brahmaputra basin. The design includes a 15-metre flood cushion above the full reservoir level to help manage monsoon floods.\nThe project has been in the pipeline for nearly three decades with initial investigations carried out by the Brahmaputra Board in 1996. This was followed by feasibility and detailed project reports by NHPC in 2004. Several alternative dam sites and designs were examined before the current alignment was finalised, with engineers citing better geology and safety as key reasons for the final choice.\nThe estimated cost of the Kamala hydroelectric project is Rs 23,764 crore. While the EAC’s recommendation clears a key regulatory hurdle, final forest clearance remains pending.\nEnvironmental groups and local residents are expected to closely monitor the next steps, as the project moves from paper approvals to decisions that will reshape large swathes of Arunachal Pradesh’s forest landscape.\nLatest Blogs",
        "link": "https://www.news18.com/india/arunachal-dam-project-gets-eco-go-ahead-after-3-decades-at-the-cost-of-23-lakh-trees-exclusive-ws-l-9897076.html",
        "date": "Thu, 12 Feb 2026 08:30:16 +0530",
        "fetched_at": "2026-02-14 03:52:45.841278"
    },
    {
        "title": "'Unauthorised': BJP Assam Sacks Social Media Member After AI Video Shows Himanta Aiming Gun At Men",
        "content": "The Assam unit of the Bharatiya Janata Party (BJP) removed one of four co-conveners from its social media department following backlash over a video that depicted Chief Minister Himanta Biswa Sarma aiming a rifle at two men, one of whom bears resemblance to Congress MP Gaurav Gogoi.\nThe video, posted last Saturday on the official X (formerly Twitter) handle of Assam BJP with the caption “Point blank shot\", was deleted the following day. The post showed digitally manipulated images of the Chief Minister appearing to shoot at a photograph of the two men, concluding with an image of Himanta Biswa Sarma dressed as a cowboy wielding a gun.\nAssam BJP president Dilip Saikia confirmed the removal to The Indian Express, characterizing the post as an “immature\" and “unauthorised\" action.\n“The party is concerned about illegal immigrant Bangladeshis in Assam, and for that, there has to be a movement in the society. But the party does not support the idea of a mala fide intent of targeting Muslims with bullets. It was mishandled by an immature and unauthorised person,\" Saikia stated.\nChief Minister Himanta Biswa Sarma distanced himself from the video, claiming no prior knowledge of its creation or posting.\n“We have registered an FIR,\" he said, referring to a complaint filed by Congress MLAs, adding, “In fact, one of our BJP people has also filed a case, saying that this is a video about which we are angry because in Assam, everybody knows that we are not against Assamese Muslims. We are against Bangladeshi Muslims, whom we call Miya Muslims.\"\nThe controversy marks the second time in recent months that the Assam BJP’s X handle has faced scrutiny. In September 2025, the account posted an AI-generated video titled “Assam without BJP\", accompanied by text references to “beef legalisation\" and “illegal immigrants.\" The Supreme Court subsequently issued a notice in October on a petition seeking removal of the video.\nLatest Blogs",
        "link": "https://www.news18.com/india/unauthorised-bjp-assam-sacks-social-media-member-after-ai-video-shows-himanta-aiming-gun-at-men-ws-l-9896997.html",
        "date": "Wed, 11 Feb 2026 23:54:54 +0530",
        "fetched_at": "2026-02-14 03:52:46.449162"
    },
    {
        "title": "Drive To ‘Jai Ho’: Mumbai Melody Road Opens On Coastal Route, Fadnavis Hints At More Such Projects",
        "content": "Mumbai has unveiled India’s first musical road, where motorists driving along a designated stretch of the Coastal Road can hear the iconic Bollywood song Jai Ho through specially installed grooves in the road surface.\nThe innovative project was inaugurated on Wednesday by Maharashtra Chief Minister Devendra Fadnavis. Deputy Chief Minister Eknath Shinde, former Shiv Sena MP Rahul Shewale, who came up with the idea, Hungary’s Consul General Faren Jari, and BMC officials were present at the launch.\nFadnavis called the musical road as a “delightful experience\" for motorists and said the concept, based on Hungarian technology, could be expanded in the future.\n\nA post shared by News18.com (@cnnnews18)\n“In the first phase, the concept has been implemented on a 500-metre stretch of the Coastal Road, and there are plans to expand the musical road concept further,\" Fadnavis said.\nShinde also encouraged Mumbaikars to experience the musical road and suggested that the concept could also be tried on the Samruddhi Expressway as a pilot project.\nAbout The Mumbai Melody Road\nThe musical stretch has been developed on the northbound carriageway of the Coastal Road, running from Nariman Point towards Worli. Civic officials said it is located in the first lane adjoining the divider, around 500 metres after vehicles exit the Worli-bound underground tunnel.\nThe road features grooves or rumble strips of precise dimensions and spacing. When vehicles pass over them at 70 to 80 kmph, the vibrations from the tyres produce musical notes, forming the melody of Jai Ho, composed by AR Rahman with lyrics by Gulzar.\nALSO READ: Mumbai’s New Coastal Road Has Mindspace Malad, Charkop Interchanges: Versova-Bhayander In 20 Minutes\nSignboards have been placed at 500 metres, 100 metres, and 60 metres before the stretch to alert drivers about the upcoming musical section and the required speed.\nAccording to the Brihanmumbai Municipal Corporation (BMC), this is the fifth such musical road in the world and the first in India.\nThe Coastal Road, named after Dharmaveer Swarajyarakshak Chhatrapati Sambhaji Maharaj, is a major infrastructure project aimed at easing traffic congestion and enabling faster travel, now offering a unique cultural and engineering experience.\nMusical roads, also called melody roads, were first developed in Japan in 2007 and have since been implemented in countries such as Hungary, South Korea, and the UAE.\nThe BMC hailed the project as a blend of engineering innovation and cultural expression, giving Mumbaikars a patriotic and musical experience as they drive.\n(With inputs from PTI)\nLatest Blogs",
        "link": "https://www.news18.com/cities/mumbai-news/mumbai-melody-road-opens-on-coastal-route-fadnavis-hints-at-more-such-projects-ws-l-9896917.html",
        "date": "Wed, 11 Feb 2026 23:21:19 +0530",
        "fetched_at": "2026-02-14 03:52:47.081765"
    },
    {
        "title": "Rajnath Singh-Led Top Defence Body Likely To Clear Acquisition Of 114 Rafale Jets, Key Meeting Tomorrow",
        "content": "India’s Defence Acquisition Council, chaired by Defence Minister Rajnath Singh, is likely to approve 114 additional Rafale fighter jets for the Indian Air Force as it holds a key meeting on Thursday (February 12).\nThe meeting will have major decisions on critical military platforms, with the agenda including proposals that could reshape combat capabilities of the armed forces amid growing security concerns.\nAt the forefront is the likely approval of 114 additional Dassault Rafale jets for the Indian Air Force under the Medium-Role Fighter Aircraft (MRFA) programme. This proposal – cleared by the Defence Procurement Board last month – is expected to be taken up by the Defence Acquisition Council (DAC) before being forwarded to the Prime Minister-led cabinet committee on security for the final nod.\nThe planned Rafale acquisition aims to address the steep decline in the squadron strength of the air force. The number has dropped to 29 squadrons against an authorised strength of 42, the lowest in decades. Even with the additional jets, which could translate into at least six to seven new squadrons and incoming HAL Tejas Mk-1A deliveries, the gap is unlikely to close quickly without these buys.\nThe MRFA project has a long and complex lineage. It evolved from the 2007 Medium Multi-Role Combat Aircraft (MMRCA) competition, in which Rafale eventually emerged the preferred choice but negotiations over cost and industrial terms had stalled.\nThe present proposal has a stronger emphasis on ‘Make in India’, with plans for transfer of technology and local production as well as integration of future weapons systems tailored to Indian requirements. If approved, the deal – estimated to be around Rs 3.25 lakh crore – will become one of India’s largest fighter aircraft procurements.\nThe DAC is also expected to consider procurement of high-altitude pseudo-satellites (HAPS), which are long-endurance, solar-powered unmanned systems capable of stratospheric surveillance.\nThese offer persistent intelligence, surveillance and reconnaissance over wide areas at considerably lower cost than traditional satellites, and are being developed by Indian entities including Defence Research and Development Organisation (DRDO) and National Aerospace Laboratories (NAL). Their inclusion is a shift towards indigenous space-domain capability that can support frontline forces in border and maritime zones.\nWhile sources indicated that approvals are unlikely, the DAC is widely expected to take up the case of the Boeing P-8I Poseidon fleet to approve six additional aircraft for the Indian Navy.\nThe P-8I, a long-range maritime surveillance and anti-submarine warfare platform, is a critical asset for securing India’s maritime interests in the Indian Ocean. The navy presently operates 12 of these aircraft, which have amassed over 40,000 mishap-free flight hours and are central to its “eye in the sky\" capability.\nThe council will discuss some more cases for the capability boost of the armed forces, including SCALP missiles, indigenous marine engine development programme for the navy among other cases.\nDelays in the indigenous LCA Mk1A programme have compounded capability shortfalls. Although at least 180 Mk1A aircraft have been contracted, deliveries – scheduled between 2027 and 2033 – have not yet begun, slowing down efforts to offset retirements of older jets such as the MiG-21 series.\nThese delays have sharpened the focus on rapid acquisitions like the Rafale buy while highlighting the need to speed up indigenous projects.\nLatest Blogs",
        "link": "https://www.news18.com/india/rafale-fighter-jets-acquisition-iaf-rajnath-singh-top-defence-body-proposal-meeting-tomorrow-ws-l-9896850.html",
        "date": "Wed, 11 Feb 2026 21:44:19 +0530",
        "fetched_at": "2026-02-14 03:52:47.698109"
    },
    {
        "title": "Bharat Bandh Today: Transport, Banks, Schools — What’s Open, What’s Closed",
        "content": "A nationwide strike, also known as Bharat Bandh, has been called on Thursday, by over 10 central trade and farmers’ unions. The strike protests against labour reforms and other policies that unions say weaken workers’ rights and protections.\nThe bandh is likely to disrupt public sector banks, transport services, government offices, and some industries, particularly in states such as Kerala and Odisha, where union mobilisation is strong.\nThe strike has been called by a joint platform of ten central trade unions, including AITUC, INTUC, CITU, HMS, TUCC, SEWA, AIUTUC, AICCTU, LPF, and UTUC.\nUnion leaders say the bandh aims to press for stronger social security measures and protection of labour rights. They oppose the four new labour codes, arguing that these weaken workers’ rights, reduce job security, and make it easier for employers to hire and fire staff.\nOther demands include scrapping the Draft Seed Bill, the Electricity Amendment Bill, and the SHANTI Act, restoring MGNREGA, and withdrawing the Viksit Bharat – Guarantee for Rozgar and Ajeevika Mission (Gramin) Act, 2025, The Times of India reported.\nFarmers’ Support\nThe Samyukt Kisan Morcha (SKM) has also extended its support, citing concerns over the India-US interim trade agreement. The group’s convenor Hannan Mollah said the deal would flood Indian markets with cheaper US imports, harming farmers’ livelihoods.\n“SKM studied the Government’s Agreements with the US, EU and New Zealand. SKM has been against this since the beginning. Agreement is not beneficial for a weaker country. They will send their goods for free to our country and they will flood our markets with cheaper goods. Our country will not be able to compete with them and our farmers will be finished,\" Mollah noted.\nAITUC General Secretary Amarjeet Kaur said around 30 crore workers are expected to join the strike across 600 districts, surpassing last year’s mobilisation of 25 crore workers.\nWhat May Be Open And Closed\nLikely Affected: Public banks and insurance offices, state transport services, government offices, PSUs, industrial units, coal and steel sectors, and MGNREGA works in protest areas.\nLikely to Remain Open: Hospitals, ambulances, essential health services, metro services (depending on local admin), private offices and IT companies (state-dependent), schools and colleges (state-wise), and essential supply services like milk and pharmacies.\nLatest Blogs",
        "link": "https://www.news18.com/india/bharat-bandh-on-february-12-transport-banks-schools-whats-open-whats-closed-ws-l-9896671.html",
        "date": "Thu, 12 Feb 2026 07:10:03 +0530",
        "fetched_at": "2026-02-14 03:52:48.444754"
    },
    {
        "title": "Uniform Dignity: Modi Govt Gives Ex-Servicemen Status To Military Nursing Service",
        "content": "The Narendra Modi government has officially extended Ex-servicemen (ESM) status to the Military Nursing Service (MNS). This decision, notified on February 10, corrects a historic oversight by amending the Ex-servicemen (Re-employment in Central Civil Services and Posts) Rules, 1979, effectively placing nursing officers on an equal statutory footing with veterans of the Regular Army, Navy, and Air Force.\nThe amendment to Section 2(c)(i) of the service rules explicitly includes the Military Nursing Service of the Indian Union within the definition of “ex-servicemen.\" This change is not merely symbolic; it ensures that nursing personnel—who are predominantly women—receive the same post-retirement security and re-employment benefits as their combatant counterparts.\nAccording to the Defence Secretary Rajesh Kumar Singh, this reflects the government’s complete commitment to the welfare, dignity, and long-term security of women serving the nation in uniform.\nAs per the new guidelines, MNS veterans are now entitled to:\nReservation Quotas: 10% reservation in Group ‘C’ and 20% in Group ‘D’ Central Government posts.\nAge Relaxation: The ability to deduct the total years of military service plus an additional three years from their actual age for civil job eligibility.\nEmployment Priority: Equal standing in recruitment processes conducted by the Union Public Service Commission (UPSC) and the Staff Selection Commission (SSC).\nThe reform follows a 2024 Supreme Court observation that MNS personnel are an integral part of the armed forces and should not be denied veteran status. Defence Secretary Rajesh Kumar Singh noted that this move reflects the government’s “complete commitment to the welfare, dignity, and long-term security of women serving the nation in uniform\".\nFor decades, MNS officers have served in frontline military hospitals, high-altitude operational zones, and hostile environments, yet faced an “ambiguity\" regarding their status upon retirement. By formalising their identity as ex-servicemen, the government has underlined its position that the contribution of women to national security is primary, not secondary. This decision is being widely hailed as a core component of the broader push for women-led development within India’s defence ecosystem.\nLatest Blogs",
        "link": "https://www.news18.com/india/uniform-dignity-modi-govt-gives-ex-servicemen-status-to-military-nursing-service-9896652.html",
        "date": "Wed, 11 Feb 2026 19:55:47 +0530",
        "fetched_at": "2026-02-14 03:52:49.050356"
    },
    {
        "title": "Cabinet Ranks Surge As SC/ST Corporations Face Major Fund Cuts In Karnataka | Exclusive",
        "content": "There is a stark disparity in the fiscal priorities of the Karnataka government, where a surge in cabinet-rank appointments for political leaders contrasts sharply with a declining trend in funding for Scheduled Caste and Scheduled Tribe development corporations. Documents exclusively accessed by CNN-News18 reveal that at least seven key corporations dedicated to marginalised communities have seen their financial lifelines either slashed or stagnated since the Siddaramaiah-led Congress government took office. This revelation comes as the state administration faces mounting criticism for elevating over 100 party workers to cabinet status, granting them high-end perks and ministerial privileges while essential welfare programs struggle for basic liquidity.\nThe data points to a systemic reduction across multiple sectors of Dalit and tribal development. The Dr BR Ambedkar Development Corporation, which received 218.50 crore under the BJP in 2022-23, saw its allocation drop to Rs 107 crore the following year and currently stands at Rs 155 crore for 2025-26, with only Rs 89.73 crore released to date. Similarly, the Karnataka Thanda Development Corporation saw its funding halved from Rs 133.50 crore under the previous regime to a mere Rs 66.95 crore in the 2023-24 fiscal year. Other bodies, including the Karnataka Adijambava and Bhovi Development Corporations, report a significant gap between promised budget figures and the actual funds hitting their accounts, often leaving them with less than 50 per cent of their intended resources as the financial year nears its conclusion.\nDefending the administration’s fiscal strategy, Congress MLA HC Balakrishna admitted to the disparity while speaking to CNN-News18, though he categorised it as a necessary adjustment for the government’s flagship guarantee schemes. “It’s a slight disparity,\" Balakrishna stated, adding that “overall allocation to SC/ST communities remains the same.\" He maintained that the funds were being utilised to ensure the broader success of social welfare guarantees that also benefit these specific communities.\nHowever, the opposition has characterised this shift as a betrayal of the very communities that helped propel the Congress to power. BJP Spokesperson GS Prashanth slammed the government for what he termed a “misuse of taxpayer money\" to fund political gratification. “There are two issues to be looked at: one, definitely BJP stood for the welfare of ST SCs and allotted a good chunk of the budget,\" Prashanth said. “What the Congress government has done is they have reduced the allocation and used the funds meant for SC/ST development for other purposes, roughly about Rs 25,000 crore in the last two years. It is very clear that Congress’s statement about standing up for SC/STs is only for the paper; in reality, they do not believe in empowering them.\"\nThe controversy is further fueled by the timing of these cuts, as the government continues to dole out ministerial ranks to its cadre despite warnings from the Chief Minister’s own economic advisor regarding the state’s dry coffers. Prashanth further added, “At this juncture, to dole out to party workers… taxpayer money is being misused. It is very shameful that Congress has resorted to appease their party workers by using taxpayer funds. Siddaramaiah and DK Shivakumar have mortgaged the interest of the people of Karnataka.\" As the debate intensifies, the government remains under pressure to explain why political perks appear to be taking precedence over the direct financial empowerment of the state’s most vulnerable populations.\nLatest Blogs",
        "link": "https://www.news18.com/india/cabinet-ranks-surge-as-sc-st-corporations-face-major-fund-cuts-in-karnataka-exclusive-ws-l-9895931.html",
        "date": "Wed, 11 Feb 2026 16:39:52 +0530",
        "fetched_at": "2026-02-14 03:52:49.683516"
    },
    {
        "title": "Drunk Father Burns Daughter’s Schoolbooks, Police Buy Her A New Set",
        "content": "In Arundi village of Nyamati taluk, a Class 10 student preparing for her SSLC examinations turned to the police after her father allegedly burned her textbooks and prevented her from attending school.\nAccording to her complaint, the girl’s father, who is reportedly addicted to alcohol, had been creating disturbances at home. As the SSLC board examinations scheduled from March 18 to April 2, 2026 approached, tensions escalated. During this period, he allegedly set fire to her textbooks and notebooks and stopped her from going to school.\nWith exams just weeks away, the loss of study materials and disruption to her routine left the student distressed. Fearing further interference with her education, she called the emergency helpline 112 and later filed a formal complaint at the Nyamati police station.\nSwift Police Response\nPolice officers Hemaraj and Ravikumar responded to the call and visited the family’s home as quickly as they could. They intervened and counselled the father, explaining the seriousness of his actions and the potential long-term impact on his daughter’s education.\nUnder the supervision of CPI Ravi of the Nyamati police station, officers ensured that the girl received new textbooks and notebooks to replace the ones that were burned. The police also contacted school authorities and requested their support to help the student continue her studies without further disruption.\nProtecting a Child’s Right to Education\nPolice officials stressed that while domestic disagreements may occur, they must not interfere with a child’s right to education. Destroying study materials, especially during board exam preparations, can severely affect a student’s confidence and academic performance.\nThe timely intervention helped stabilise the situation and ensured the girl could resume her exam preparation. The incident has drawn attention within the village, with residents expressing concern over the episode, particularly given the importance of the SSLC examinations.\nAll that the girl wanted was to study for the upcoming board exams which in a way is a turning point in her life and career. A drunken father was about to kill that future and dream but right intervention of police and the girl seeking their help, turned the tables.\nWith exams just weeks away, the loss of study materials and disruption to her routine left the student distressed. Fearing further interference with her education, she called the emergency helpline 112 and later filed a formal complaint at the Nyamati police station.\nSwift Police Response\nPolice officers Hemaraj and Ravikumar responded to the call and visited the family’s home as quickly as they could. They intervened and counselled the father, explaining the seriousness of his actions and the potential long-term impact on his daughter’s education.\nUnder the supervision of CPI Ravi of the Nyamati police station, officers ensured that the girl received new textbooks and notebooks to replace the ones that were burned. The police also contacted school authorities and requested their support to help the student continue her studies without further disruption.\nProtecting a Child’s Right to Education\nPolice officials stressed that while domestic disagreements may occur, they must not interfere with a child’s right to education. Destroying study materials, especially during board exam preparations, can severely affect a student’s confidence and academic performance.\nThe timely intervention helped stabilise the situation and ensured the girl could resume her exam preparation. The incident has drawn attention within the village, with residents expressing concern over the episode, particularly given the importance of the SSLC examinations.\nAll that the girl wanted was to study for the upcoming board exams which in a way is a turning point in her life and career. A drunken father was about to kill that future and dream but right intervention of police and the girl seeking their help, turned the tables.\nScan the QR code to download the News18 app and enjoy a seamless news experience anytime, anywhere.\nLatest Blogs",
        "link": "https://www.news18.com/india/drunk-father-burns-daughters-schoolbooks-police-buy-her-new-set-in-karnataka-skn-ws-l-9895852.html",
        "date": "Wed, 11 Feb 2026 16:19:55 +0530",
        "fetched_at": "2026-02-14 03:52:50.396271"
    },
    {
        "title": "Toll Collection Not Linked To Project Cost Recovery, Says Gadkari, Explains Factors Behind Hike",
        "content": "The toll collected from a road is not related to the recovery of project development cost, the Ministry of Road Transport and Highways informed the Rajya Sabha on Wednesday.\nUnion minister Nitin Gadkari added that the revenue collected beyond the concession period is deposited in Consolidated Fund of India (CFI) and the funds provided through budgetary allocation are utilised for further maintenance, development and augmentation of national highways.\nThe ministry, in a written reply, said the National Highways Fee (Determination of Rates and Collection) Rules, 2008, as amended, provide a transparent framework for levy and collection of user fee, with rates linked to the length of the highway and type of vehicle uniformly across the country.\nGadkari said collection of user fee (toll) at fee plazas on National Highways is done as per the provisions of National Highways Fee Rules, 2008.\n“…the fee notified as per concession agreement is collected by the concessionaire till the end of the concession period, and after the concession period is over, the fee is collected by the Central Government or the executing authority as per the fee specified…,\" he said.\nIn a separate reply, Gadkari said the increase in the amount of user fee collection at toll fee plazas on national highways depends on several factors.\n“These include the annual revision of user fee, which is linked to the wholesale price index in accordance with the National Highways Fee (Determination of Rates and Collection) Rules, 2008, increase in the length of highways under tolling, the volume of traffic plying on the stretch, and the category of vehicles using the highway,\" he said.\nIn August 2025, the Public Accounts Committee (PAC) had said that there is no institutional mechanism to independently evaluate whether toll charges are justified in relation to actual operation and maintenance costs or future service requirements.\nThe committee said it has found that toll charges on National Highways are linked to base rates first fixed in 2008 and annually revised, with a 3 per cent annual escalation, irrespective of road quality, traffic volume, or user affordability.\n“… the concept of tolling in perpetuity was first introduced through an amendment to the Fee Rules in 2008, allowing continued collection of user fees even after the recovery of project costs. This provision was further clarified and codified through the 2023 amendment to the Fee Rules, which explicitly permits tolling to continue beyond the end of the concession period, thereby formalising a regime of perpetual tolling,\" it had said.\nThe committee had desired that toll collection on any highway stretch must be rationalised and substantially reduced once capital and routine maintenance costs have been recovered.\n“Any continuation of tolls beyond this point should be permitted only if clearly justified and approved by the proposed independent oversight authority,\" the report added.\nThe committee also recommended that the ministry establish a tariff authority, on the lines of the Airports Economic Regulatory Authority (AERA) in the civil aviation sector, to ensure transparency and fairness in toll fixation, collection, and regulation.\nThis authority should be mandated to review and determine the periodicity of toll revisions based on certain parameters, it suggested.\nLatest Blogs",
        "link": "https://www.news18.com/india/toll-collection-not-linked-to-project-cost-recovery-says-gadkari-explains-factors-behind-hike-ws-kl-9895663.html",
        "date": "Wed, 11 Feb 2026 15:41:55 +0530",
        "fetched_at": "2026-02-14 03:52:51.067576"
    },
    {
        "title": "Goa Minister Atanasio Monserrate Acquitted In 2016 Rape Case",
        "content": "A special court in Goa on Wednesday acquitted BJP MLA and minister Atanasio Monserrate in a rape case registered against him nearly a decade ago.\nMonserratte, who holds the revenue portfolio, was booked in 2016 for allegedly raping a minor.\nSpecial Judge Irshad Agha has now acquitted the minister of all charges.\nAs per the FIR registered by the Goa police, a minor girl had alleged that she was sold to then St Cruz MLA Monserratte who drugged and raped her.\nInitially, the case was registered against the minister under the Goa Children’s Act. Later, the charge was dropped and sections under the Indian Penal Code were invoked after an ossification test indicated that she was above 16 years of age.\nThe case was tried before the district court after the police filed a 250-page chargesheet against him. A total of 40 witnesses were examined during the trial.\nLatest Blogs",
        "link": "https://www.news18.com/india/goa-minister-atanasio-monserrate-acquitted-in-2016-rape-case-ws-l-9895583.html",
        "date": "Wed, 11 Feb 2026 15:01:07 +0530",
        "fetched_at": "2026-02-14 03:52:51.702830"
    },
    {
        "title": "Man Survives On Leaves For 10 Years In Karnataka Forest, Sports Six-Pack Body",
        "content": "In a quiet corner of Belagavi district, Karnataka where rocky hills rise beyond fields and villages thin into scrub forest, a man has chosen a life few would imagine for themselves. He shunned the regular ‘civilized life’ and walked into forests a decade ago.\nFor 10 years, he has lived away from society, without cooked food, without routine comforts, and without the rhythms of conventional life. Meet Budan Khan Hosamani, aged 34, from Ugaragol village in Saundatti taluk of Belagavi district who is well known in the area as ‘Modern Day Tarzan’.\nA Decade in the Hills\nNearly 10 years ago, Budan Khan walked away from home and settled in the Heggolla hill region on the outskirts of his village. Since then, he has lived largely in isolation, away from regular social contact and modern conveniences.\nWhat sets him apart is not just his solitude, but his diet. Budan Khan survives entirely on raw leaves, plants and wild greens found in the forest.\nHe is said to consume nearly 80 different varieties of vegetation available in the hills. According to local accounts, he no longer eats rice, roti or any cooked food and reportedly says he cannot even look at regular meals anymore.\nReports suggest that Budan Khan began experimenting with eating leaves after observing monkeys in the forest. Over time, this practice became his only source of sustenance.\nTo support this lifestyle, he also practices yoga, which he believes helps him digest the raw vegetation and maintain balance in his body.\nWhy He Left\nAccording to those familiar with his story, Budan Khan left home after facing pressure from his family to get married and lead a settled life. Instead of following that path, he chose solitude in the hills and adopted what he considers a natural way of living.\nHe says he observed monkeys and learnt what leaves to eat and what not. He walks a great distance inside the forest everyday and does a couple of exercises that he already knew to stay in good health.\nDespite surviving solely on forest greens, Budan Khan reportedly maintains a well-built and fit physique. Observers have described him as having a six-pack body, a detail that has surprised many locals and drawn curiosity about his unusual diet and routine.\nHis parents and two brothers live in the nearby village. “We tried to convince him to come back home many times. The minute we speak about him getting married, he stops talking to us altogether. So we said, he can stay unmarried but come and live with us. He doesn’t want to come at all, he is happy in the wild. We don’t have much option when he is that stubborn, so we just left him be\" says Khan’s mother.\nIn the hills of Belagavi, away from kitchens and crowded streets, his life continues quietly, rooted in leaves, routine and isolation.\nReported By: Chandrakanth Sugandhi, News18 Kannada, Belagavi\nA Decade in the Hills\nNearly 10 years ago, Budan Khan walked away from home and settled in the Heggolla hill region on the outskirts of his village. Since then, he has lived largely in isolation, away from regular social contact and modern conveniences.\nWhat sets him apart is not just his solitude, but his diet. Budan Khan survives entirely on raw leaves, plants and wild greens found in the forest.\nHe is said to consume nearly 80 different varieties of vegetation available in the hills. According to local accounts, he no longer eats rice, roti or any cooked food and reportedly says he cannot even look at regular meals anymore.\nReports suggest that Budan Khan began experimenting with eating leaves after observing monkeys in the forest. Over time, this practice became his only source of sustenance.\nTo support this lifestyle, he also practices yoga, which he believes helps him digest the raw vegetation and maintain balance in his body.\nWhy He Left\nAccording to those familiar with his story, Budan Khan left home after facing pressure from his family to get married and lead a settled life. Instead of following that path, he chose solitude in the hills and adopted what he considers a natural way of living.\nHe says he observed monkeys and learnt what leaves to eat and what not. He walks a great distance inside the forest everyday and does a couple of exercises that he already knew to stay in good health.\nDespite surviving solely on forest greens, Budan Khan reportedly maintains a well-built and fit physique. Observers have described him as having a six-pack body, a detail that has surprised many locals and drawn curiosity about his unusual diet and routine.\nHis parents and two brothers live in the nearby village. “We tried to convince him to come back home many times. The minute we speak about him getting married, he stops talking to us altogether. So we said, he can stay unmarried but come and live with us. He doesn’t want to come at all, he is happy in the wild. We don’t have much option when he is that stubborn, so we just left him be” says Khan’s mother.\nIn the hills of Belagavi, away from kitchens and crowded streets, his life continues quietly, rooted in leaves, routine and isolation.\nReported By: Chandrakanth Sugandhi, News18 Kannada, Belagavi\nScan the QR code to download the News18 app and enjoy a seamless news experience anytime, anywhere.\nLatest Blogs",
        "link": "https://www.news18.com/buzz/man-survives-on-leaves-for-10-years-in-karnataka-forest-sports-six-pack-body-skn-ws-l-9895175.html",
        "date": "Wed, 11 Feb 2026 14:19:01 +0530",
        "fetched_at": "2026-02-14 03:52:52.371573"
    }
]