[
    {
        "title": "State government allocates ₹51.92 crore for proposed bronze museum at Egmore",
        "content": "The Tamil Nadu government has given administrative sanction and allocated ₹51.922,70,000 crore for the proposed bronze museum at Egmore, said K. Manivasan, Additional Chief Secretary, Department of Tourism and Hindu Religious and Charitable Endowments (HR&CE) Department. The announcement regarding the creation of the museum was made by Finance Minister Thangam Thennarasu during the presentation of the Budget in 2025. The Egmore Museum houses more than 2,000 bronze statues, meticulously crafted from aimpon (an alloy of five metals) by master artisans of the past. “To showcase these sculptural masterpieces, which are renowned for their serene expressions, elegant postures, as well as intricate mudras, a gallery with a traditional architectural design will be constructed within the museum complex, at an estimated cost of ₹40 crore, ensuring an immersive experience that will captivate international visitors,” Mr. Thennarasu said. In his order granting administrative sanction and allocation of funds, Mr. Manivasan also recalled the earlier announcement that a total of ₹1 crore would be allotted for thematic galleries on bronzes. Mr. Manivasan said the Commissioner of Museums had obtained a detailed project report from Sanrachana Architectural Studio for the construction of a traditional building through the Public Works Department at a cost of ₹41.91 crore, and a gallery with modern technology and interiors through the Museums Department at a cost of ₹14.30 crore. After examining the report submitted by the Commissioner of Museums, the government sanctioned a total amount of ₹51.92 crore. This includes ₹40.02 crore for the construction of the museum complex within the Egmore Museum campus and ₹11.90 crore for the thematic galleries on bronzes. The government order also directed the Commissioner of Museums to obtain the opinion of a suitably qualified officer regarding the demolition of the old building within the museum complex. Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/state-government-allocates-5192-crore-for-proposed-bronze-museum-at-egmore/article70601058.ece",
        "date": "Sat, 07 Feb 2026 00:39:05 +0530",
        "fetched_at": "2026-02-06 19:29:13.511944"
    }
]