[
    {
        "title": "'Absolutely not': Indian-origin Texas GOP chairman announces re-election bid, faces resistance",
        "content": "At TOI World Desk, our dedicated team of seasoned journalists and passionate writers tirelessly sifts through the vast tapestry of global events to bring you the latest news and diverse perspectives round the clock. With an unwavering commitment to accuracy, depth, and timeliness, we strive to keep you informed about the ever-evolving world, delivering a nuanced understanding of international affairs to our readers. Join us on a journey across continents as we unravel the stories that shape our interconnected world.Read More",
        "link": "https://timesofindia.indiatimes.com/world/us/absolutely-not-indian-origin-texas-gop-chairman-announces-re-election-bid-faces-resistance/articleshow/128175122.cms",
        "date": "2026-02-11T01:40:34+05:30",
        "fetched_at": "2026-02-11 03:14:02.741084"
    },
    {
        "title": "A poem on St. Thomas Mount",
        "content": "February 11, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 11, 2026e-Paper\nPublished - February 11, 2026 06:30 am IST\nThe frontispiece of the poem is an interesting depiction of the Mount\n                                          | Photo Credit: Special Arrangement\nThis is my third consecutive article for this column that features a book of some kind, and I apologise for the monotony. However, it was too tough to resist writing about this poem. H.D. Love’s Vestiges of Old Madras never ceases to amaze, and educate. Each reading throws up some nugget, as it did last week. This was a poem titled St. Thomas’s Mount. It was written around 1769 or thereabouts for it mentions the attacks on the place by Hyder Ali in 1767 and the cyclone of 1768. The poem was published anonymously in 1774 in England and ascribed to “A Gentleman from India”. The preface, anonymous, is dated Jan 1, 1773, and written at Fort St. George. The author, it says, was not yet 20 when he wrote this poem.\nLove establishes that this was Eyles Irwin, born in 1750 and arrived in Madras in 1768. “Fascinated by natural beauty and historic associations of the Mount, he wrote (this) pastoral poem,” says Love. In Madras, Irwin, who was in East India Company service, was appointed Land Surveyor in 1771. Five years later, it was found that he had done nothing and so, the post was abolished. He seems to have done well enough personally, for he applied and obtained from the Company eleven acres of land in the village of “Erembore” for his residence. Irwin was evidently a man of letters for in 1777, back in England, he printed his Series of Adventures in the Course of a Voyage up the Red Sea. He also has other works of poetry and prose to his credit. His death, as per Love, was in England, in 1817.\nThe poem is available free for download at archive.org. The frontispiece is an interesting depiction of the Mount, that Love says, is by J. Collyer. This was very likely Joseph Collyer the Younger, engraver to Queen Charlotte. He never came to India and so must have based his engraving on a sketch made by someone in Madras. If so, it depicts the hill, the steps that Petrus Uscan sponsored to the top, and a shrine at the summit. At the base, behind a compound are bungalows set amidst trees – these may be the cantonment houses for officers.\nOutside the compound is barren land with a few palm trees. It reminded me of Jayshree Vencatesan, India’s first Ramsar Award winner. She has always maintained that lush and dense greenery was a colonial creation in Madras, the original vegetation being palm and scrub. A camel and an elephant, with keepers, are wandering around. A tamed cheetah, with its trainer, is hunting what seems to be an antelope on another side.\nNow to the poem: it is in three cantos, the first having 220 verses, the second 175, and the third 170. Irwin seems to be one of those that rejoices in warm weather. “Th’ eternal season of our eastern years,” according to him is spring and he wonders if his compatriots back home in England, battered by winter storms and gloom, envy him his good fortune. To us, reading it after 250 years and more makes us wonder, for Meenambakkam, if anything, is always a degree or two hotter than the Nungambakkam meteorological office temperature reading. But it also reinforces the theory that during colonial times, the Mount was considered an ideal getaway from the city.\nThe area evidently had several mango orchards for the poem pays tribute to the “blessed shade” of the trees and the abundance of the “ambrosial fruit”. The poem then goes on to sing in praise of the elephant and the camel. Then Irwin describes a cheetah, trained to hunt, being encouraged by its keeper to go after antelopes. In his notes, Love has surmised that Collyer’s engraving predated the poem, but what is clear is that it is a faithful depiction of the poem itself. Or was Irwin inspired by the engraving and so fashioned his opening canto after it?\nThe second canto describes the legend of Saint Thomas right up to his martyrdom and notes how after his passing, all three religions – Gentoo, Mussulman, and Christian, coexist here – “When men unite in a friendly band, and truth presides over a guileless land.” The third canto is somewhat difficult to fathom for it is about various women of the poet’s acquaintance, then in Madras. They are all addressed by their surnames – “fair Lesley, sweet Powney,” a melodious Brooke and the songstress Taswell. Men with these surnames were certainly well-known in Madras history. The poem itself is addressed to an anonymous lady leaving India.\nTaken overall, it is not a great work of poetry, but it adds to the collection on the city, or at least the regions that it comprises today.\n(Sriram V. is a writer and historian.)\nPublished - February 11, 2026 06:30 am IST\nChennai\n                    \n                            /                      \n                        \n                        heritage\n                    \n                            /                      \n                        \n                        history\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/cities/chennai/a-poem-on-st-thomas-mount-in-chennai/article70615020.ece",
        "date": "Tue, 10 Feb 2026 17:47:30 +0530",
        "fetched_at": "2026-02-11 03:14:03.839289"
    },
    {
        "title": "Draft DAP aims to align defence acquisition with rapidly evolving geo-strategic landscape: Government",
        "content": "February 11, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 11, 2026e-Paper\nPublished - February 11, 2026 05:55 am IST - New Delhi\nUnion Defence Minister Rajnath Singh. File\n                                          | Photo Credit: ANI\nThe proposed draft ‘Defence Acquisition Procedure (DAP)-2026’ seeks to ensure categorisation and procurement strategy based on technological availability and manufacturing readiness and to accelerate the acquisition process, the government said on Tuesday (February 10, 2026).\nThe draft DAP-2026 document has been uploaded on the website of the Defence Ministry, and it seeks comments or suggestions on it from various stakeholders.\n“The Department of Defence has prepared the draft ‘Defence Acquisition Procedure-2026’ to propel jointness, atmanirbharta and integration, force modernisation, and speed of acquisition with scaling of production, leading to the growth and development of the defence ecosystem in the country,” the Ministry said in a statement.\nThe proposed draft aims to align India’s defence acquisition with the “rapidly evolving geo-strategic landscape”, the growth of the Indian economy, the skilling of human capital, the growth of the private defence industry in the country and the technological imperatives of modern warfare, it said.\nOnce approved, it will replace the existing Defence Acquisition Procedure-2020.\nThe DAP is the cornerstone for the ‘Atmanirbhar Bharat’ initiative in defence and focuses on institutionalised preference for “Buy Indian-IDDM (Indian-Indigenously Designed, Developed and Manufactured)” category for procurement, thereby boosting domestic manufacturing and effective reduction of imports, the government said.\n“The proposed draft will ensure categorisation and procurement strategy based on technological availability and manufacturing readiness, exclusive procedures for faster acquisition of equipment with a short technological cycle, spiral designing and procurement of major platforms, exploitation of modern technology before bulk procurement, pragmatic indigenous content (IC) and indigenous design (ID) content evaluation, and utilisation of indigenous military material, among others,” it said.\nThe new DAP proposes to “ease financial and experience criteria” for inclusive participation, delegation of decision-making for quicker acquisition, revamping of trials and quality assurance processes, aggressive infusion of digitisation and automation in acquisition procedures and processes, and ‘Atmanirbharta’ with a focus on indigenous designing and retention of IPR, along with incentives for innovations, it added.\n“The DAP would boost defence manufacturing and exports along with restrictions on imports to domestically unavailable and critical equipment only,” it said.\nThe draft DAP-2026 document, including the Handbook on Guidelines & Annexures, has been uploaded on the website of the Ministry.\nThe ministry seeks comments or suggestions on the draft DAP-2026 from stakeholders through email in pdf or MS Word format within a period of three weeks, i.e., latest by March 3, as per the prescribed format hosted at the website.\nWhile the Defence Procurement Manual (DPM) 2025 deals with the maintenance and sustenance of “defence equipment/platforms/systems, etc. under the revenue head of expenditure”, the DAP deals with the capital procurement of equipment/platforms/systems, etc. under the capital head of expenditure”, the Ministry said.\nThe DAP-2026 intends to “weave the security of the nation and technological growth in a single thread and create the canvas for Viksit Bharat-2047,” it said.\nPublished - February 11, 2026 05:55 am IST\nIndia\n                    \n                            /                      \n                        \n                        defence\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/draft-dap-aims-to-align-defence-acquisition-with-rapidly-evolving-geo-strategic-landscape-government/article70617351.ece",
        "date": "Wed, 11 Feb 2026 04:19:43 +0530",
        "fetched_at": "2026-02-11 03:14:04.469056"
    },
    {
        "title": "Chambal aqueduct set to facilitate water supply from river link project in Rajasthan",
        "content": "February 10, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 10, 2026e-Paper\nPublished - February 11, 2026 04:25 am IST - JAIPUR\nRajasthan Water Resources Minister Suresh Singh Rawat (second from right) inspecting the construction work for an aqueduct on Chambal river at Guhata in Bundi district.\n                                          | Photo Credit: Special Arrangement\nA new 2.3-km-long aqueduct on the Chambal river in Rajasthan is set to facilitate the supply of drinking and irrigation water from the revised Parvati-Kalisindh-Chambal link project to as many as 17 districts. The link project has been integrated with the Eastern Rajasthan Canal Project (ERCP) and included in the national perspective plan by the special committee constituted for river linking.\nThe memorandum of agreement for the project’s implementation was signed between the Rajasthan and Madhya Pradesh governments on December 17, 2024. As part of the link project, a provision has been made to supply water to the large and medium irrigation projects and dams located in the project area on the basis of technical and financial feasibility.\nWater Resources Minister Suresh Singh Rawat, who inspected the aqueduct construction work at Guhata in Bundi district on Monday (February 9, 2026), described it as a “milestone in water engineering”. The aqueduct, for which the work started in May 2025, has an internal width of 41.25 metres and a height of 7.7 metres.\nMr. Rawat said the construction work, taken up at a cost of ₹2,230 crore in the link project’s first phase, would be completed by June 2028. He walked about 2 km while thoroughly inspecting each point of the aqueduct, designed to transport water from the source to the distribution point with the utilisation of gravity.\nThe aqueduct will connect Pipalda Samel village in Kota district’s Digod tehsil at one end and Guhata on the other. The water from the Navnera barrage, built on Kalisindh, will be lifted into the Mej river and transported from the Mej barrage through a feeder to the Galwa, Bisalpur and Isarda dams.\nThe construction of the new aqueduct will also provide an additional route for public transport. Mr. Rawat said the aqueduct would ensure the success of the ambitious project, being implemented at a cost of ₹90,000 crore and stipulating the transfer of excess water from the Chambal river basin to the regions facing water scarcity for the benefit of a 3.25 crore population.\nThe previous Congress government had demanded the national project status for ERCP, fixing the share of the Centre and the State in the expenditure in the ratio of 90:10. The project is expected to resolve the water scarcity issue in eastern and south-eastern districts in the State at least till 2051.\nPublished - February 11, 2026 04:25 am IST\nRajasthan\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/rajasthan/chambal-aqueduct-set-to-facilitate-water-supply-from-river-link-project-in-rajasthan/article70615836.ece",
        "date": "Wed, 11 Feb 2026 03:18:33 +0530",
        "fetched_at": "2026-02-11 03:14:05.081075"
    },
    {
        "title": "CM Naidu seeks Central support for irrigation and infrastructure projects in A.P.",
        "content": "February 10, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 10, 2026e-Paper\nPublished - February 11, 2026 03:22 am IST - VIJAYAWADA\nA.P. Chief Minister Chandrababu Naidu during a meeting with Union Jal Shakti Minister C.R. Patil in New Delhi on February 10, 2026.\n                                          | Photo Credit: Special Arrangement\nAndhra Pradesh Chief Minister N. Chandrababu Naidu on Tuesday (February 10, 2026) raised a series of crucial issues concerning Andhra Pradesh during separate meetings with Union Ministers for Jal Shakti, Agriculture, Railways, and Urban Development as part of his official visit to New Delhi, seeking expeditious clearances, enhanced financial assistance, and resolution of long-pending inter-State disputes.\nIn his meeting with Union Jal Shakti Minister C.R. Patil, the Chief Minister expressed serious concern over Karnataka’s move to increase the height of the Almatti dam, warning that it would adversely affect downstream water availability to Andhra Pradesh. He urged the Centre to safeguard the State’s interests and sought early resolution of inter-State river water disputes.\nRequesting the permanent lifting of the stop-work order on the Polavaram project and seeking reimbursement for additional expenditure incurred on canal capacity enhancement, he also sought financial support for Polavaram Phase II, estimated at ₹32,000 crore, and approvals for the Polavaram–Nallamala Sagar link project under the national river interlinking programme.\nDuring a meeting with Union Agriculture Minister Shivraj Singh Chouhan, Mr. Naidu pressed for enhanced Central assistance to promote organic and natural farming. Highlighting Andhra Pradesh’s reduction in chemical fertiliser usage by 2.28 per cent in 2024–25, he sought immediate release of ₹216 crore under the PM-PRANAM scheme.\nNearly 18 lakh farmers had opted for organic farming across 8 lakh hectares. The Chief Minister also sought ₹200 crore for the development of the coconut sector, the release of pending funds under ‘Per Drop More Crop’, and Central support for Totapuri mango farmers and the establishment of a Makhana Development Board in the Kolleru region.\nDuring his meeting with Union Railway Minister Ashwini Vaishnaw, Mr. Naidu sought fast-tracking of pending railway projects, operationalisation of the South Coastal Railway Zone from April 1, and alignment of the Bengaluru–Chennai high-speed rail corridor via Tirupati. He also proposed new rail lines, freight corridors, Vande Bharat services, and mega coaching terminals across the State.\nIn discussions with Union Urban Development Minister Manohar Lal Khattar, the Chief Minister sought ₹105 crore of Central assistance under Swachh Bharat Mission (Urban) 2.0 to implement Andhra Pradesh’s ₹276-crore Zero Landfill action plan.\nHe said the State was committed to becoming a national model in urban sanitation and sustainable waste management.\nPublished - February 11, 2026 03:22 am IST\nAndhra Pradesh\n                    \n                            /                      \n                        \n                        Agriculture\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/cm-naidu-seeks-central-support-for-irrigation-and-infrastructure-projects-in-ap/article70616224.ece",
        "date": "Wed, 11 Feb 2026 02:59:31 +0530",
        "fetched_at": "2026-02-11 03:14:05.693131"
    },
    {
        "title": "Villagers in Odisha boycott anganwadi over appointment of Dalit employee",
        "content": "February 10, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 10, 2026e-Paper\nUpdated  - February 11, 2026 01:42 am IST - BHUBANESWAR\nNo takers: The anganwadi in Odisha’s Kendrapara district has not been functioning for nearly three months.\n                                          | Photo Credit: Special Arrangement\nAn anganwadi in Odisha’s Kendrapara district has not been functioning for nearly three months after residents stopped sending children allegedly due to the appointment of a Dalit woman, Sharmistha Sethy, as a helper-cum-cook.\nThe 20-year-old graduate claimed that villagers started boycotting the centre at Nuagaon under Ghadiamal gram panchayat in Rajnagar block soon after her appointment on November 20, 2025. “They are also not collecting free food items like sattu (flour made from roasted gram) and eggs for children. My family is very poor. I got this job after much hardship. I want to become a teacher, but no one listened to my repeated appeals,” she said.\nMs. Sethy claimed that the boycott was rooted in caste prejudice. “They are not sending their children because I am a Dalit. Society has advanced in many ways, but if we continue to cling to casteism, we cannot progress,” she said.\nAn anganwadi worker corroborated Ms. Sethy’s account, saying 20 children are enrolled at the centre but none of them are attending it now. “We went door to door, but no one is willing to send their children,” the worker said.\nThe Kendrapara district administration on Tuesday deputed a team of officials to assess the situation and explore possible solutions.\n“I held talks with the villagers, but they are not citing any specific reason for keeping their children away. They are not openly attributing the issue to the helper’s caste,” Child Development Project Officer Deepali Mishra said.\nMs. Mishra said the post of helper-cum-cook was advertised in 2024 and again in 2025. Eligible villagers were encouraged to apply, she said. “Ms. Sethy was the lone applicant. We are making efforts to ensure that the children return so that their pre-school education is not affected. The final decision will be taken by higher authorities,” she said.\nMs. Sethy, who receives monthly remuneration of ₹5,000, is tasked with cooking meals, assisting in play-based learning activities, and helping with health monitoring.\nNone of the villagers were willing to comment on the issue.\nPublished - February 11, 2026 01:16 am IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/odisha/villagers-in-odisha-boycott-anganwadi-over-appointment-of-dalit-employee/article70615651.ece",
        "date": "Wed, 11 Feb 2026 01:42:36 +0530",
        "fetched_at": "2026-02-11 03:14:06.293316"
    },
    {
        "title": "Wajid Ali Shah was not exiled to Calcutta, he came on his own, says book by descendant",
        "content": "February 11, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 11, 2026e-Paper\nUpdated  - February 11, 2026 02:45 am IST - Kolkata\nA calendar prepared by Wajid Ali Shah, the last emperor of Awadh, on display at the Victoria Memorial Hall in Kolkata. File\n                                          | Photo Credit: The Hindu\nNawab Wajid Ali Shah was not exiled to Calcutta but he came to the city because he wanted to take a ship to London to submit a petition but that departure was restricted and he stayed on, according to a biography written by his great-grandson that has just been translated from Urdu to English by the biographer’s daughter, Talat Fatima.\n“Lucknow and Calcutta can be called the two very big and very important chapters in Wajid Ali Shah’s life. People usually think that he was sent in exile to Calcutta, that it was like a punishment from the British. The fact is he came to Calcutta on his own volition. He wanted to present a petition before the British Parliament and before the Queen on his dethronement and on the atrocities committed by the British in India. He wanted to reach London via Calcutta, but unfortunately that did not happen,” said Dr. Fatima, a great-great-daughter of the last king of Awadh.\nShe is the author of soon-to-be-released Wajid Ali Shah: A Cultural and Literary Legacy —published in India by Hachette — which is the translation into English of the biography, authored in the mid-1990s, by her father Kaukub Quder Sajjad Ali Meerza, a scholar who also served as a research consultant to Satyajit Ray for Shatranj Ke Khiladi.\n“Most books about Wajid Ali Shah talk about his image, but this book (her father’s) stands out because it is backed by research of about 38 months, that is why it has many hitherto-unknown facts. There are many confusions related to his date of birth, date of death, date of coronation, number of his books and compositions — all this has been meticulously researched,” Dr. Fatima told The Hindu.\n“A lot needs to be known about him as a poet and a writer. Lucknow has some of his compositions, but in Calcutta a major part of his compositions that exist are his letters. He used to write love letters to his begums from whom he was separated. He used to write about his mental sufferings in those letters. People usually feel shy of sharing their love letters with the public, but not Wajid Ali Shah. He was an entirely different person. He said that his love letters were masterpieces in literature. Whatever he wrote to his begums are in Kolkata, mostly in Fort William,” she said.\nWhen asked how many begums the last king of Lucknow have, Dr. Fatima said the figure was between 50 and 60, with six to seven staying with him in Calcutta, where he spent the last three decades of his life, dying in 1887 at the age of 65. She said she chose to translate her father’s work because the readership of Urdu was very limited while that of English was worldwide.\n“Wajid Ali Shah is more relevant today than ever. We have a lot to learn from him. He was a devout Muslim, but at the same he was secular to the core. Even his compositions included verses on Radha and Krishna, which you will find in the book. He had a healthy attitude towards other religions and languages. He wrote in Urdu, Persian, Arabic, Braj Bhasha. People harp about his relationship with the opposite sex, but that’s mostly because of his own bold pen. This book tells you there is a lot more about him,” Dr. Fatima said.\nPublished - February 11, 2026 01:11 am IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/west-bengal/wajid-ali-shah-was-not-exiled-to-calcutta-he-came-on-his-own-says-book-by-descendant/article70615751.ece",
        "date": "Wed, 11 Feb 2026 02:45:43 +0530",
        "fetched_at": "2026-02-11 03:14:06.903832"
    },
    {
        "title": "A tug of war over claiming credit",
        "content": "February 10, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 10, 2026e-Paper\nPublished - February 11, 2026 12:40 am IST\nFor a while, allegations of ‘vote chori’ — the deletion or removal of names from electoral rolls — by the BJP-led Central government and the Election Commission of India dominated the national political discourse. As that rhetoric subsided, a similar narrative began gaining prominence in Andhra Pradesh, with the YSR Congress Party (YSRCP) accusing the current government of ‘credit chori’, or of taking credit for projects and policies laid down during Y.S. Jagan Mohan Reddy’s tenure.\nDuring the 2024 Assembly elections, the TDP campaigned hard on infrastructure and investment, claiming that Mr. Reddy’s five-year rule had neglected both. Post-election, the new ‘double-engine’ government went on to showcase Andhra Pradesh as a major hub for investment, highlighting the State’s improved infrastructure.\nIn October 2025, Google announced plans to build a massive one-gigawatt AI data centre campus in Visakhapatnam. The project — Google’s largest AI hub outside the U.S. — will cost nearly $15 billion over five years, ending in 2030. The TDP, led by Information Technology Minister Nara Lokesh, credited the investor-friendly, proactive approach and ease-of-doing-business policies of the Naidu government.\nBut the YSRCP was not ready to let the narrative slip away. It pointed to the groundwork it laid between 2019 and 2024 — including allotting land to companies such as the Adani Group and providing bureaucratic clearances. It argued that the TDP’s claim was an instance of ‘credit chori.’\nFor the YSRCP, claiming the Google deal appears to be less about pride and more about damage control. Under constant attack from the NDA for its policies, such as mandating 75% job reservation for locals, which drew widespread criticism nationally, the party is clearly keen to avoid conceding full credit to the NDA.\nThe YSRCP also came under attack for failing to develop infrastructure in the State. Pothole-ridden roads became a major poll plank for the NDA. When the first test flight landed at the Alluri Sitharama Raju Greenfield International Airport at Bhogapuram on January 4, both sides once again engaged in a credit war.\nIt 2019, it was during the TDP government’s tenure that the foundation stone for the airport was laid. However, just months later, Mr. Reddy assumed office as Chief Minister. The YSRCP claims this marked a turning point. It asserts that the project gained momentum after the foundation stone was re-laid by Mr. Reddy in 2023. According to the party, land acquisition and key clearances were completed during Mr. Reddy’s five-year tenure, paving the way for completion of the airport.\nThe TDP, however, maintains that the project was conceptualised and initiated during its tenure and that the remaining processes were carried forward. It points out that TDP MP Kinjarapu Rammohan Naidu holds the Civil Aviation portfolio in the NDA government at the Centre.\nEven farmer-focused initiatives are caught in the narrative battle. Mr. Reddy claimed that the comprehensive land resurvey conducted during his tenure enabled the issuance of the new pattadar passbooks to farmers. But the TDP criticised the YSRCP-issued passbooks for showing Mr. Reddy’s photo. Calling it unacceptable, it replaced these with passbooks displaying the State emblem. The TDP asserts that the new passbooks are also error-free — a result of reforms in the revenue system.\nWhat prompted Mr. Reddy to push for the inclusion of his name in the completion of the airport project and the finalisation of the Google data centre deal? It is that the TDP has long accused him of failing to advance projects initiated by the previous TDP government — unlike his father, former Chief Minister Y.S. Rajasekhara Reddy, and the subsequent Chief Ministers of united Andhra. Mr. Reddy also stalled the Amaravati capital project and slowed the Polavaram Irrigation Project.\nThe YSRCP aims to shake off the image of having hindered development. It also wants to claim credit for completing two major projects that could transform the State — particularly north coastal Andhra, where the party had performed poorly in the 2024 elections.\nWhile both the YSRCP and TDP are eager to stake their claim to these projects, the timelines provide a clearer indication of who deserves the credit. Ultimately, it will be up to the electorate to decide.\nPublished - February 11, 2026 12:40 am IST\nAndhra Pradesh\n                    \n                            /                      \n                        \n                        Telugu Desam Party\n                    \n                            /                      \n                        \n                        Yuvajana Sramika Rythu Congress Party\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/opinion/op-ed/a-tug-of-war-over-claiming-credit/article70616506.ece",
        "date": "Wed, 11 Feb 2026 00:40:23 +0530",
        "fetched_at": "2026-02-11 03:14:07.513609"
    },
    {
        "title": "Vidhana Soudha group D employee arrested for stealing visitor’s bag with gold, cash from Minister’s office",
        "content": "February 10, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 10, 2026e-Paper\nPublished - February 11, 2026 12:15 am IST - Bengaluru\nThe Vidhana Soudha police have arrested a Group D employee for allegedly stealing a bag containing gold ornaments and cash from the office of the Urban Development and Town Planning Minister Byrathi Suresh.\nAccording to the police, the complainant, Naveen, had visited the Minister’s office and inadvertently left behind his bag, which contained around 300 gm of gold jewellery and ₹1.5 lakh in cash. After realising that the bag was missing, he returned to the office the next day in search of the bag and later lodged a complaint with the Vidhana Soudha police.\nBased on the complaint, the police verified CCTV footage from the premises and identified the suspect as Antony, a watch-and-ward staff member working at Vidhana Soudha. He was detained for questioning and reportedly confessed to the theft during interrogation.\nFollowing his confession, the police recovered the stolen valuables and registered a case of theft against Antony.\nPublished - February 11, 2026 12:15 am IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/karnataka/vidhana-soudha-group-d-employee-arrested-for-stealing-visitors-bag-with-gold-cash-from-ministers-office/article70615951.ece",
        "date": "Wed, 11 Feb 2026 00:15:02 +0530",
        "fetched_at": "2026-02-11 03:14:08.135234"
    },
    {
        "title": "T.N. likely to become $150 billion electronics hub by 2030, says State Industries Minister T.R.B. Rajaa",
        "content": "February 11, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 11, 2026e-Paper\nPublished - February 11, 2026 12:09 am IST - CHENNAI\nIndustries Minister T.R.B. Rajaa and other dignitaries at the 15th edition of Source India-Electronics Supply Chain held at the Chennai Trade Centre on Tuesday.\n                                          | Photo Credit: M. SRINATH\nThe electronics manufacturing industry aims to hit $500 billion by 2030, and Tamil Nadu will likely be a $150 billion market then, State Industries Minister T.R.B. Rajaa said in Chennai on Tuesday.\n“Tamil Nadu has around 41% share in India’s total electronics exports during the financial year (FY) 2025 at $15 billion. This is likely to have grown to 45% in FY2026,” he said, expressing concern that the Centre has not released State-wise data on electronics exports for the current financial year.\nAt the 15th edition of Source India-Electronics Supply Chain, organised by the Electronic Industries Association of India (ELCINA), Mr. Rajaa said: “We have done everything possible in India. Now, we want to go compete with the world, which we have been doing in several sectors for a long time. We have expertise in manufacturing and services, and the next big thing to do is R&D (Research and Development)”. He requested the stakeholders present at the event to invest more in R&D.\nSasikumar Gendham, president of ELCINA, said: “Electronics is no longer just an industry — it is the infrastructure for modern civilisation. From mobility and healthcare to defence, energy, AI and space, it sits at the core of every national priority. As global supply chains are being re-imagined, with reliability and resilience becoming as important as cost, India stands at a historic inflection point. The question is not whether India can play a global role, but how fast and how decisively we scale.”\nHe then pointed out we must move decisively beyond low-value assembly into design-led manufacturing, advanced components and materials, tooling and IP ownership. Mr. Gendham said electronics leadership demanded strong component ecosystems, MSME integration, academia-industry collaboration, and deep supplier development. “With established clusters in Chennai, Sriperumbudur, Hosur, Coimbatore, and Tiruchirappalli, Tamil Nadu has built a full-stack electronics ecosystem — from design and components to final assembly and exports,” he added.\nAtul Lall, vice-chairman and managing director, Dixon Technologies India Ltd. and past ELCINA president, said: “India’s electronics manufacturing sector is entering a phase of accelerated growth, driven by scale, policy support and increasing global confidence. The next phase of competitiveness will depend on deeper localisation, strong component ecosystems and continued investment in technology and skills.”\nA report on the Tamil Nadu Electronics Industry, released at the event, said the State accounted for 28.6% of India’s electronics manufacturing gross sales value, ranking second only to Uttar Pradesh. “However, Tamil Nadu is aggressively investing in the future as it leads in actual asset addition within the electronics industry, with a commanding 47.6%. The State’s overall exports in 2023-24 was estimated at $43.5 billion, with 22% attributed to electronics exports,” the report stated. It added: “Tamil Nadu also has 191 units related to electronics manufacturing. With the state having the most units producing mobile handsets and related components, Tamil Nadu’s exports are $14.65 billion. These factors show how the sector has seen a rise of 414% from 2021-22, when electronics exports were a mere $1.86 billion.”\nThe report also gave some recommendations on creating a dedicated electronics manufacturing promotion agency, establishing a semiconductor technology park, and investing in an advanced testing and certification centre.\nPublished - February 11, 2026 12:09 am IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/tn-likely-to-become-150-billion-electronics-hub-by-2030-says-state-industries-minister-trb-rajaa/article70616211.ece",
        "date": "Wed, 11 Feb 2026 00:09:19 +0530",
        "fetched_at": "2026-02-11 03:14:08.749876"
    },
    {
        "title": "Kerala launches ‘Rakshakavacham’ accident insurance scheme for private sector workers",
        "content": "February 10, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 10, 2026e-Paper\nPublished - February 10, 2026 11:50 pm IST - Thiruvananthapuram\nMinister for Labour V Sivankutty launching ‘Rakshakavacham’ on Tuesday.\nMinister for Labour V Sivankutty on Tuesday launched ‘Rakshakavacham,’ a new accident insurance scheme aimed at providing financial security to private sector workers in the state.\nDescribing it as a “major labour welfare initiative,” Mr Sivankutty said the scheme would offer crucial protection to workers and their families during times of crisis.\nInaugurating the scheme here, he said ‘Rakshakavacham’ would provide protection and assurance to lakhs of private sector workers, describing the labour force as the backbone of Kerala’s development.\n‘Rakshakavacham’ means “shield of protection.”\nThe Minister said the government had earlier implemented the Wage Security Scheme to ensure timely payment of wages, and at present, over 3.65 lakh establishments and more than 13 lakh workers are covered under the system.\n“Beyond wage security, the government felt the need to support the family of a worker during times of crisis. It was from this concern that the ‘Rakshakavacham’ insurance scheme was conceived,” the Minister said.\nThe scheme is a group personal accident insurance programme implemented through the Comprehensive Health Insurance Agency of Kerala (CHIAK) for workers employed in establishments registered under the Wage Security Scheme. CHIAK is the nodal agency for implementing public health insurance schemes in the State.\nIn the event of accidental death, whether at the workplace or otherwise, the family of the deceased worker will receive ₹5 lakh as immediate financial assistance. The amount will be provided in addition to benefits available under the Workmen’s Compensation Act, Mr Sivankutty said.\nHe added that with an annual contribution of ₹150, the government aims to extend the safety cover to around 25 lakh workers.\nConsidering the importance of the scheme, ₹30 lakh gas been allocated for it in the 2025–26 State Budget.\nThe Minister noted that accidents involving private sector workers often push families into debt and poverty and said the assistance under the scheme would offer significant relief and help them recover.\nRegistration for the scheme will be carried out through CHIAK with the support of the Labour Department. In the event of death, applications can be submitted to the nodal agency’s district officer along with the death certificate, FIR and legal heir certificate.\nOfficials have been instructed to verify eligibility and ensure speedy disbursement of assistance, he said, appealing to employers to enrol their workers under the scheme.\nPublished - February 10, 2026 11:50 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/kerala/kerala-launches-rakshakavacham-accident-insurance-scheme-for-private-sector-workers/article70616950.ece",
        "date": "Tue, 10 Feb 2026 23:50:53 +0530",
        "fetched_at": "2026-02-11 03:14:09.367446"
    },
    {
        "title": "Family forced to carry body of relative home on two-wheeler in Andhra Pradesh as government hospital has no ambulance",
        "content": "February 10, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 10, 2026e-Paper\nPublished - February 10, 2026 11:09 pm IST - BAPATLA\nThe family of a deceased man in Andhra Pradesh was forced to transport his body to their home on a two-wheeler for about 10 km as the hospital did not have an ambulance for the purpose and private vehicles demanded up to ₹2,000 to carry the body. The incident, which lays bare glaring gaps in basic public health infrastructure, occurred in Karlapalem mandal of Bapatla district on Tuesday.\nNakka Nageswara Rao of Rallacheruvu hamlet in Chintayapalem panchayat reportedly suffered severe chest pain and his family members rushed him on a two-wheeler to the Bapatla Area Hospital. When they reached the hospital, doctors declared him brought dead.\nThe grieving family then approached private auto drivers to take the body back to their house in the village. However, the auto drivers demanded up to ₹2,000 to carry the body, which the impoverished family could not afford. Left with no other option, they carried the body on the same two-wheeler to their home for about 10 km.\nThe incident, which occurred close to the district headquarters, has sparked public outrage.\nReacting to the incident, the YSRCP accused the State government of failure to ensure availability of even basic ambulance service to people. “When the family sought a vehicle to take the body home, they were asked to pay thousands. With empty pockets and no official help, the grieving relatives carried the body for nearly 10 kilometres on a bike. This humiliation happened near a district headquarters. Not in a forest. Not in an inaccessible region,” the party highlighted in a post on X.\nFollowing media reports, District Collector Dr. V. Vinod Kumar ordered a comprehensive inquiry into the incident. Speaking to The Hindu, he said that there was no ‘Mahaprasthanam’ (hearse service) vehicle currently available at the Bapatla Area Hospital. He said that such vehicles are allotted to hospitals based on the number of deaths recorded and that the Bapatla hospital had not qualified so far due to relatively low mortality figures.\nHowever, the Collector made it clear that families of patients who die while undergoing treatment in government hospitals are not required to bear transportation costs. He assured that the government would provide necessary assistance to indigent families from available funds.\nThe Collector issued a circular instructing that in unavoidable situations, hospital authorities must ensure ambulance arrangements or provide financial assistance before releasing bodies. He also announced plans to convene a district-level meeting with police, Regional Transport Officers, health officials and private ambulance operators to regulate ambulance charges.\nThe incident has renewed demands for strengthening humane healthcare services at peripheral hospitals.\nPublished - February 10, 2026 11:09 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/family-forced-to-carry-body-of-relative-home-on-two-wheeler-in-andhra-pradesh-as-government-hospital-has-no-ambulance/article70616117.ece",
        "date": "Tue, 10 Feb 2026 23:09:06 +0530",
        "fetched_at": "2026-02-11 03:14:09.979086"
    },
    {
        "title": "Supreme Court asks Election Commission to consider writ petitioner’s suggestions against excessive poll expenditure",
        "content": "February 10, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 10, 2026e-Paper\nPublished - February 10, 2026 10:57 pm IST - NEW DELHI\nSupreme Court of India. File\n                                          | Photo Credit: ANI\nThe Supreme Court on Tuesday (February 10, 2026) asked the Election Commission of India (ECI) to consider suggestions made in a writ petition to frame a standard operating procedure to trim election expenditure.\nA Bench headed by Chief Justice of India Surya Kant said the suggestions made by petitioner Prabhakar Deshpande were “worth consideration”.\nMr. Deshpande, an IIT graduate and chemical engineer, had sought directions for the poll panel to formulate a plan of action against erring candidates and to re-examine the cap on election expenses to ensure democratic credibility.\nWhile the ECI defended its existing oversight mechanisms, including the deployment of independent expenditure observers from the All India Services, the Bench noted that the petitioner’s grievances regarding the effectiveness of these measures were filed in the larger public interest.\n“We have no reason to doubt the plea has been filed in the larger public interest. The plea seeks the Election Commission to formulate a detailed policy to curb excessive election expenditure. The plea cited a report detailing such expenditure. The ECI has filed a counter inter alia questioning the authenticity of the report,” the Bench observed.\nPublished - February 10, 2026 10:57 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/supreme-court-eci-consider-suggestions-against-excessive-poll-expenditure/article70616782.ece",
        "date": "Tue, 10 Feb 2026 22:57:31 +0530",
        "fetched_at": "2026-02-11 03:14:10.588546"
    },
    {
        "title": "VMC council approves revised expenditure budget of ₹1.64 lakh crore for 2026-27",
        "content": "February 10, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 10, 2026e-Paper\nUpdated  - February 11, 2026 12:12 am IST - VIJAYAWADA\nVijayawada Municipal Corporation (VMC) council on Tuesday approved a revised expenditure budget of ₹1,643.64 crore for the year 2026-27, after the YSRCP corporators raised objections to allocation of ₹450 crore for the stormwater drain project.\nThe tenure of the VMC elected body will end in March, after which the Special Officer would take on the responsibility of the corporation. In the last budget meeting, presented by Mayor R. Bhagyalakshmi, the initial proposed budget was ₹2,093.65 crore, with the total expenditure being ₹2,093.65 crore and the total income being ₹1,968.13 crore respectively.\nHowever, YSRCP corporators unanimously opposed allocations of ₹450 crore for the stormwater drain project, after which the budget estimates, both capital income and expenditure, were revised.\nOf the ₹600-crore proposed for the project, VMC’s proposed share is ₹150 crore, while Capital Region Development Authority’s (CRDA) share is ₹150 crore and concessionaire’s share is ₹300 crore. The YSRCP corporators rejected the Public-Private-Partnership (PPP) proposal, citing increased burden on the public.\n“Earlier too, Larsen and Toubro was given the contract for completing the project, but they discontinued in between, leaving much work unfinished. Now, once again they talk about handing it over to a private player. Ultimately, the burden will fall on the public,” said YSRCP floor leader Venkata Satyanarayana.\nAmong other proposed expenditures, ₹60 lakh has been allocated for shelter homes for homeless people, ₹50 lakh for modernisation of food street, ₹5 crore for development of hill areas in the city, ₹50 lakh for canal beautification, ₹3 crore for road widening projects, ₹50 lakh for footpaths, ₹5 crore for animal birth control operations and establishment of dog centres and ₹4 crore for eradication of mosquitoes.\nTDP floor leader N. Balaswamy, meanwhile, suggested that the allocations for addressing mosquito and stray dog issues be increased to ₹10 crore. The two issues have become subjects of discussion regularly in council meetings.\nNo allocation has been made for the Budameru Development Plan this year, while in 2025-26, ₹7.50 crore was allocated for the same. The corporation is not expected to receive funds for the same.\nOn the income front, the corporation is expected to receive funds to the tune of ₹100 crore under Urban Reforms Funds, ₹178 crore under the 15th Finance Commission Grants, ₹10 crore under the SASCI (Special Assistance to States for Capital Investment) scheme. It is not expected to receive any funds for pollution control.\nThe overall budget points to a trend of increasing borrowings and burden, said CPI(M) corporator B. Satya Babu. He questioned the State government’s lack of funding for the city. There is ₹1,200 crore pending from both State and Centre on various heads of work, he alleged.\nPublished - February 10, 2026 10:54 pm IST\nAndhra Pradesh\n                    \n                            /                      \n                        \n                        Vijayawada\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/vmc-council-approves-revised-budget-of-164-lakh-crore-for-2026-27/article70616740.ece",
        "date": "Wed, 11 Feb 2026 00:12:02 +0530",
        "fetched_at": "2026-02-11 03:14:11.213174"
    },
    {
        "title": "Congress likely to focus on trade deal as Budget discussion gets underway in Lok Sabha",
        "content": "February 10, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 10, 2026e-Paper\nPublished - February 10, 2026 10:49 pm IST - New Delhi\nThe Opposition agreed to allow normal functioning since it wants to raise crucial issues, including the trade deal, during the Budget discussion. Photo: AICC via ANI\nThe Congress party is likely to step up its pressure against the Narendra Modi Government over the Indo-U.S. trade deal, with the Leader of the Opposition in the Lok Sabha Rahul Gandhi likely to focus on it when he takes part in the discussion on the Union Budget on Wednesday (February 11, 2026).\nThe Lok Sabha, which has been paralysed since February 2, started functioning on Tuesday (February 10, 2026), after the Opposition submitted a notice to move a resolution against Speaker Om Birla for conducting the proceedings in a “partisan” manner.\nAlso Read: Parliament Budget Session Day 10 updates\nBefore moving the petition, senior Opposition leaders, including Akhilesh Yadav of the Samajwadi Party (SP), K.C. Venugopal and Gaurav Gogoi of the Congress, Abhishek Banerjee of the Trinamool Congress, and T.R. Baalu of the Dravida Munnetra Kazhagam (DMK) met Union Parliamentary Affairs Minister Kiren Rijiju to end the stalemate, but were unsuccessful.\nThe Opposition agreed to allow normal functioning since it wants to raise crucial issues, including the trade deal, during the Budget discussion.\nEarlier in the day, Mr. Gandhi pointed to a poster Opposition MPs were carrying near the Makar Dwar of Parliament during their protest, which read ‘Narender Surrender’.\n“This has happened”, in the Indo-U.S. trade deal, he said.\nIn a statement posted on his X handle, Congress president Mallikarjun Kharge claimed the trade agreement sacrificed India’s strategic national interests and exposed the betrayal of the Modi government.\n“Fine print of the Indo-U.S. trade deal has exposed how PM Modi mortgaged India’s national interests,” Mr. Kharge alleged, terming it “trapped surrender”.\nThe truth of the “trap deal” was now slowly coming out, he said, listing four key objections to the pact.\nReferring to the issue of Russian oil, he said the White House fact sheet now listed “India’s commitment to stop purchasing Russian Federation oil” as a condition for the removal of an additional 25% tariff, even though the joint statement had not mentioned it.\nWhy had the government agreed to such “erosion of sovereignty”, Mr. Kharge asked, adding that the Congress had already flagged the U.S. executive order on monitoring India’s oil imports.\nMr. Kharge alleged that the government had “back-stabbed” farmers by opening agriculture to foreign goods. Pulses were added to the February 9 fact sheet although absent in the February 6 joint statement, he said. References to animal feed utility for red sorghum had disappeared, he said, while imports of dried distillers’ grains (DDGs) and sorghum could hurt dairy farmers and cattle.\n“Two crore dairy farmers will suffer the consequences, but the RSS (Rashtriya Swayamsevak Sangh)-Sangh Parivar-BJP (Bharatiya Janata Party), who carry out lynchings in the name of the cow, are hell-bent on destroying our country’s cattle population,” Mr. Kharge alleged.\nThe deal would hurt the apparel sector, especially because of American concessions to Bangladesh, the Congress said.\nPublished - February 10, 2026 10:49 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/congress-likely-to-focus-on-trade-deal-as-budget-discussion-gets-underway-in-lok-sabha/article70616768.ece",
        "date": "Tue, 10 Feb 2026 22:49:45 +0530",
        "fetched_at": "2026-02-11 03:14:11.852258"
    },
    {
        "title": "Election Commission extends deadline for Bengal SIR hearings to February 14",
        "content": "February 11, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 11, 2026e-Paper\nUpdated  - February 11, 2026 01:57 am IST - KOLKATA\nPeople wait in a queue during hearings under the Special Intensive Revision of electoral rolls, at a centre, in Kolkata, Saturday, February 7, 2026.\n                                          | Photo Credit: PTI\nThe Election Commission of India on Tuesday (February 10, 2026) extended the deadline for Special Intensive Revision (SIR) hearings in West Bengal to February 14, 2026. The date for publication of the final voter lists has been moved to February 28. This came after the Chief Electoral Officer of West Bengal sent a formal request to the ECI for an extension on February 7, citing pending work.\nThe Supreme Court on Monday (February 9) asked the ECI to extend the SIR deadlines by at least one-week.\n“Since the process of scrutinising documents submitted by affected people in response to notices served on them is likely to take longer than anticipated, and as suggested on behalf of some of the petitioners, we direct that at least one week beyond 14.02.2026 be granted to the EROs/AEROs to complete the scrutiny of the documents and take an appropriate decision,” the Supreme Court order said on Monday (February 9, 2026).\nThe Supreme Court order by a division bench, comprising Chief Justice Surya Kant and Justices Joymalya Bagchi and N. V. Anjaria, and requests from the CEO and the WB office led to the ECI extending the deadline.\n“Further, in compliance with the Supreme Court’s direction, the Commission has revised the SIR schedule in the State of West Bengal,” an official notification from the ECI addressed to the CEO, WB stated on Tuesday (February 10, 2026).\nThe revised dates are February 14 for completing of SIR hearings, February 21 for scrutiny of documents and disposal, with final electoral rolls to be published on February 28. Previously, the SIR hearings were to be completed by February 7, and the final electoral list was to be published by February 14.\nThe West Bengal SIR exercise is in its final phase, with only about 3-5% hearings remaining, according to the West Bengal CEO. However, around 25% of document uploading and digitisation remains pending, which led officials to seek more time from the CEO, Manoj Kumar Agarwal.\nOver 94.49 lakh people were summoned for hearings under the logical discrepancies category, and over 31.68 lakh voters who were classified as “unmapped” were also asked to appear for hearings.\nThose who fail to appear for their hearings within the extended timeline may be struck from the final 2026 voter lists.\nPublished - February 10, 2026 10:35 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/west-bengal/eci-extends-deadline-for-bengal-sir-hearings-to-feb-14-final-rolls-to-be-published-on-feb-28/article70616096.ece",
        "date": "Wed, 11 Feb 2026 01:57:53 +0530",
        "fetched_at": "2026-02-11 03:14:12.473451"
    },
    {
        "title": "KDA urges govt. to continue Nali-Kali programme",
        "content": "February 11, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 11, 2026e-Paper\nPublished - February 10, 2026 10:13 pm IST - Bengaluru\nKannada Development Authority submitting a report to Minister of School Education and Literacy Madhu Bangarappa in Bengaluru on Tuesday.\n                                          | Photo Credit: SPECIAL ARRANGEMENT\nThe Kannada Development Authority (KDA) has appealed the State government to continue the ‘Nali-Kali’, a multi class teaching programme with necessary modifications, stating that it  helps unleash the creativity hidden in children.\nThe KDA, which submitted a report to Minister School Education and Literacy Madhu Bangarappa on Tuesday on the implementation of the  programme, alleged that it  failed due to poor implementation .\n“Even after 30 years of implementation of the Nali-Kali programme, teachers have not been able to properly adopt this.  As a result, teachers have  expressed their opposition to the Nali-Kali and parents are also not fond of this. The Nali-Kali can be successful only if teachers take responsibility for identifying the learning style of the child. Teachers should provide them with appropriate tools and techniques to enhance the learning experience of children. Unfortunately, no such efforts have been made anywhere,” reads the report.\n“The teachers have failed to creatively utilise one period of  80 minutes of the Nali-Kali project. When the trained teachers retired, the guest teachers appointed in their place did not get the expected results as they did not receive proper training. The age, learning level and learning ability of children from class one to three are not the same. In such a situation, the teachers have failed in terms of group formation and management to make multi-class teaching meaningful. This has severely hampered language learning,” it stated.\n“In classes with a large number of students, the teachers are not able to pay equal attention to all the children. The learning materials (stickers, picture lists, charts, etc.) required to conduct classes meaningfully have not been adequately supplied to many schools.  Children who studied under the Nali-Kali up to Class 3  are finding it difficult to adapt to a different system in the class 4,” it stated.\nSpeaking to The Hindu, KDA chairman Purushothama Bilimale said, “There were allegations that due to the Nali-Kali project and the Kannada medium, parents are hesitant to admit their children to government schools and have turned to private schools. In this context, it was decided to conduct a study on the programme. Information was obtained from parents, teachers, children, and other stakeholders across the state,  and a report was submitted to the School Education Minister”.\nHowever, the State government has decided to phase out the Nali-Kali programme in primary education and convert the multi class teaching into single grade teaching.\nPublished - February 10, 2026 10:13 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/karnataka/kda-urges-govt-to-continue-nali-kali-programme/article70616026.ece",
        "date": "Tue, 10 Feb 2026 22:13:59 +0530",
        "fetched_at": "2026-02-11 03:14:13.091300"
    },
    {
        "title": "Southern Railway to discontinue UTS App on March 1; passengers urged to switch to RailOne",
        "content": "February 11, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 11, 2026e-Paper\nPublished - February 10, 2026 09:54 pm IST - KOZHIKODE\nThe Unreserved Ticketing System (UTS), the official mobile application of Indian Railways designed for booking unreserved train tickets, will be discontinued with effect from March 1. This change is part of a feature upgrade undertaken by the Centre for Railway Information Systems (CRIS).\n​A press release issued on Tuesday (February 10) said that several key features had already been deactivated to ensure a managed transition. Passengers will find that season ticket bookings, new user registrations, and platform ticket purchases are no longer functional on the legacy app.\n​Besides, the R-Wallet top-up facility has been disabled. While the UTS app may still appear on various app stores, railway officials have cautioned that downloading or updating the software will not restore these services.\n​As the UTS platform reaches the end of its life, the Southern Railway has started directing all passengers to the new RailOne app. Developed by CRIS, RailOne is now the primary gateway for all unreserved ticketing and passenger services.\n​The new platform boasts several improvements over its predecessor, including a modernised user interface for faster navigation and enhanced security protocols for digital payments. Besides, it also has integrated passenger services designed for a more seamless travel experience.\n​The Palakkad Division of the Southern Railway has urged the public to download the RailOne app immediately to avoid any last-minute disruption to their journeys. Planning ahead and moving to the RailOne platform now will ensure that ticketing arrangements remain unaffected when the UTS app is fully decommissioned next month.\n​Passengers who currently hold active tickets or balances in their R-Wallet are encouraged to check the RailOne app for migration options or contact the station helpdesk for further assistance.\nPublished - February 10, 2026 09:54 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/kerala/southern-railway-to-discontinue-uts-app-on-march-1-passengers-urged-to-switch-to-railone/article70615290.ece",
        "date": "Tue, 10 Feb 2026 21:54:18 +0530",
        "fetched_at": "2026-02-11 03:14:13.688159"
    },
    {
        "title": "Stalin inaugurates new projects in Kolathur constituency",
        "content": "February 10, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 10, 2026e-Paper\nUpdated  - February 10, 2026 09:28 pm IST - CHENNAI\nChief Minister M.K. Stalin unveiling foundation stone for the construction of rain water harvesting facilities, pedestrian pathway, badminton court, recreation facilities, among others in Kolathur on Tuesday. \n                                          | Photo Credit: Special Arrangement\nChief Minister M.K. Stalin on Tuesday visited his Kolathur Assembly constituency, where he inaugurated projects and also unveiled foundation for more projects.\nMr. Stalin inaugurated the sewage pumping station set up by Chennai Metropolitan Water Supply and Sewerage Board (CMWSSB) with facility to assess H2S gas emission and also integrated with IoT-based automated system. The station set up at ₹2.82 crore is located on Siva Elango Salai.\nHe also unveiled foundation stone for the construction of rain water harvesting facilities, pedestrian pathway, badminton court, recreation facilities, among others in Jawahar Nagar on Siva Elango Salai. All these facilities are to be set up at a total cost of ₹3.45 crore, an official release said.\nMinister for Hindu Religious and Charitable Endowments P.K. Sekarbabu, Chennai Mayor R. Priya, Chennai Central MP Dayanidhi Maran; legislators Thayagam Kavi, A. Vetriazhagan, Joseph Samuel, and senior officials were among those present.\nHe also inaugurated and inspected a newly constructed integrated police office complex built with modern facilities, housing the Kolathur Police District Deputy Commissioner’s office, and other offices.\nThe four-storey complex includes facilities such as a reception hall, computer rooms, record storage rooms, armoury, property room, lock-up, dining area, conference hall, police personnel rest rooms and recreation hall.\nThe integrated police offices functioning in the building located at Peravallur on the 70 feet road include the Kolathur Police District Deputy Commissioner’s Office, Kolathur Range Assistant Commissioner’s Office, K-5 Peravallur Law and Order and Crime Police Station, W-38 Kolathur All Women Police Station (AWPS), Kolathur Traffic Enforcement Police Station, Kolathur Traffic Investigation Wing, Kolathur District Cyber Crime Unit, and the Inspector’s Office of the West Zone Serious Crime Squad.\nDirector General of Police (In charge) G. Venkataraman and the Greater Chennai City Police Commissioner A. Arun, honoured the Chief Minister with a shawl and presented him a memento.\nPublished - February 10, 2026 09:27 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/stalin-inaugurates-new-projects-in-his-kolathur-assembly-constituency/article70615718.ece",
        "date": "Tue, 10 Feb 2026 21:28:16 +0530",
        "fetched_at": "2026-02-11 03:14:14.288004"
    },
    {
        "title": "Govt. spent ₹5,000 crore to strengthen public education sector: CM",
        "content": "February 11, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 11, 2026e-Paper\nPublished - February 10, 2026 09:21 pm IST - KANNUR\nThe State government has spent ₹5,000 crore to protect and strengthen the public education sector, Chief Minister Pinarayi Vijayan said on Tuesday (February 10). He was declaring the Munderi Government Higher Secondary School as the State’s first integrated international school.\nThe Chief Minister said the objective of development was to ensure that everyone benefited from it equally. He noted that universal and free education, strengthened by social reformers and later by policy interventions, had ensured near-total school enrollment in the state.\nThe government, he said, had taken major steps since 2016 through the Public Education Protection Mission to upgrade infrastructure, ensure the timely distribution of textbooks from June 1, and improve academic standards.\nAccording to him, improvements in general education had also led to children of migrant workers enrolling in public schools, reflecting the growing confidence in the system. Significant changes were also underway in the higher education sector.\nHighlighting the transformation of the Munderi school from a conventional high school into a national model, Mr. Vijayan said infrastructure of international standards had been created alongside curriculum and timetable reforms. Arts and sports were given equal emphasis.\nEstablished in the 1980s with strong public support, the school had grown steadily over five decades.\nA cluster model integrating the higher secondary school with 14 primary schools in the panchayat was implemented under the ‘Mudra’ scheme, which aided rapid development.\nThe campus now features modern laboratories, an advanced robotics lab, smart classrooms, and bio-gardens to help students learn from nature.\nThe school, the Chief Minister said, had become a source of pride for Kerala’s public education sector.\nFormer MP K.K. Ragesh and District Collector Arun K. Vijayan were present.\nPublished - February 10, 2026 09:21 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/kerala/govt-spent-5000-crore-to-strengthen-public-education-sector-cm/article70616347.ece",
        "date": "Tue, 10 Feb 2026 21:21:00 +0530",
        "fetched_at": "2026-02-11 03:14:14.887263"
    },
    {
        "title": "BRS accuses State government of allowing A.P. draw excess Krishna water",
        "content": "February 10, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 10, 2026e-Paper\nPublished - February 10, 2026 09:14 pm IST - HYDERABAD\nThe Bharat Rashtra Samithi (BRS) has accused the Congress government and Chief Minister A. Revanth Reddy of keeping silent on drawal of Krishna water by Andhra Pradesh in excess of the share as per the ad hoc arrangement in force till finalisation of shares by the Krishna Water Disputes Tribunal (KWDT-II).\nDeputy Floor Leader of the BRS in Assembly and former minister T. Harish Rao stated here on Tuesday (February 10) that the issue of excess use of water by A.P. over the agreed share was proved with the letter of Engineer-in-Chief of Telangana addressed to the Krishna River Management Board (KRMB) on January 28.\nQuoting the contents of the letter, Mr. Harish Rao against the agreed water share of 66:34 (AP:Telangana) only 2.45 tmc ft water was due for drawal by A.P. as on January 27, both from Srisailam and Nagarjunasagar reservoirs. Addressing a press conference he stated that AP had drawn 664 tmc ft of Krishna water so far this water year (2025-26), 16 tmc ft in excess, and it amounted to over 80% share against its entitlement of 66%.\nThe BRS leader explained that a letter written to the ENC of A.P. by the Member-Secretary of KRMB, in response to Telangana’s letter to the board, on February 6 it was stated that as on January 29 A.P. had utilised 79.21% and Telangana just 20.79% against their agreed temporary shares of 66 and 34, respectively. The letter had put the water drawal of A.P. at 555.5 tmc ft as on January 31 against 156.04 tmc ft.\nAccording to the river board, the drawal shares work out to 78.07% and 21.93% by AP and Telangana, respectively, as on January 31. Such a huge excess drawal of water by A.P. was making the prospects of standing crops under lift irrigation systems including Kalwakurthy based on Srisailam reservoir water and Left Canal under Nagarjunasagar project uncertain.\nMr. Harish Rao alleged that Mr. Revanth Reddy was paying ‘guru dakshina’ to his A.P. counterpart and political mentor N. Chandrababu Naidu by allowing the neighbouring State to draw Krishna water indiscriminately. He further alleged that the Telangana government had kept the ENC post, which would pursue the matter of river water use, vacant for about a week after the retirement of Mohd. Amjad Hussain on January 29.\nHe accused the Centre led by Bharatiya Janata Party (BJP) too of doing injustice to Telangana by favouring A.P. in the matter of river water use, despite two Union Ministers from Telangana. He demanded that the State government stop water drawal by A.P. immediately and carry forward the unused water this year to next water year or else the BRS would not keep silent and stage a protest at KRMB office, if necessary.\nPublished - February 10, 2026 09:14 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/telangana/brs-accuses-state-government-of-allowing-ap-draw-excess-krishna-water/article70616455.ece",
        "date": "Tue, 10 Feb 2026 21:14:43 +0530",
        "fetched_at": "2026-02-11 03:14:15.483937"
    },
    {
        "title": "Soldier due for disability pension, if chronic disability was due to military service: Kerala HC",
        "content": "February 10, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 10, 2026e-Paper\nPublished - February 10, 2026 09:09 pm IST - KOCHI\nThe Kerala High Court has held that a soldier is entitled to disability pension even if he sought voluntary discharge from service, provided the chronic disability was acquired or aggravated due to military service.\nB. Manikuttan, a native of Mavelikara who served as a Havildar in the Army, approached the High Court after the Armed Forces Tribunal dismissed his plea challenging the denial of disability pension on the ground that he had sought voluntary discharge.\nMr. Manikuttan contended that he was in sound physical condition at the time of his enrolment in 1986. However, after being posted in Jammu and Kashmir in 1994, he was diagnosed with bronchial asthma. As his condition worsened, it was recommended that he be released from service, following which he sought voluntary discharge.\nA Division Bench comprising Justice K. Natarajan and Justice Johnson John held that the petitioner was eligible for disability pension, noting that bronchial asthma is a chronic, lifelong condition. The court also took into account the Medical Board’s finding that the disability had been aggravated by military service.\nThe court directed the authorities to pay the arrears of disability pension within three months and noted that the Release Medical Board had assessed the petitioner’s disability at 20%.\nPublished - February 10, 2026 09:09 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/kerala/soldier-due-for-disability-pension-if-chronic-disability-was-due-to-military-service-kerala-hc/article70616321.ece",
        "date": "Tue, 10 Feb 2026 21:09:49 +0530",
        "fetched_at": "2026-02-11 03:14:16.084505"
    },
    {
        "title": "Kishan Reddy says municipal elections will be ‘bipolar contest’ between BJP and Congress",
        "content": "February 10, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 10, 2026e-Paper\nPublished - February 10, 2026 09:03 pm IST - HYDERABAD\nSenior BJP leader and Union Minister for Coal and Mines G. Kishan Reddy said that the upcoming municipal elections in Telangana will be a direct contest between the BJP and the ruling Congress, asserting that BRS is “nowhere in the picture”.\nSpeaking at a press conference in New Delhi on Tuesday, he accused Chief Minister A. Revanth Reddy of making “false and misleading” statements about the BJP and Central funding, claiming the remarks were driven by the growing popularity of the BJP among voters.\nMr. Kishan Reddy said the BRS had “lost public confidence” and “collapsed”, remarking that voting for the party was equivalent to “throwing your vote into the Musi river”. At the same time, he alleged that both the BRS and the Congress were attempting to influence voters by distributing large amounts of money.\nThe Union Minister challenged the Chief Minister to present a detailed account of his government’s achievements and its progress in fulfilling election promises. “This is the fourth election since he came to power but nothing substantial has been delivered,” he alleged.\nMr. Kishan Reddy sought a judicial probe into the BJP’s Makthal municipal ward candidate Erukala Mahadevappa. He advised the Chief Minister not to “use the BJP as a tool to target others” and said the party would support action if the government proceeds with the arrest of former Chief Minister K. Chandrasekhar Rao in connection with alleged phone-tapping and other irregularities during the previous regime.\nHe further claimed that both the Congress and the BRS had “mortgaged the honour of Telangana people to Darussalam”, asserting that irregularities during the two parties’ tenures would be investigated if the BJP comes to power.\nAccusing Mr. Revanth Reddy of “low-level politics” and “tall claims without action”, he reiterated his offer for a public debate — either at the Secretariat or the Press Club — on Central funding to Telangana over the past 12 years. The Secunderabad MP maintained that the Centre had “never, at any point”, stated it would declare the Palamuru–Rangareddy project a national project.\nPublished - February 10, 2026 09:03 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/telangana/kishan-reddy-says-municipal-elections-will-be-bipolar-contest-between-bjp-and-congress/article70616266.ece",
        "date": "Tue, 10 Feb 2026 21:03:20 +0530",
        "fetched_at": "2026-02-11 03:14:16.685945"
    },
    {
        "title": "T.N. officials prepare for upcoming Census 2027 activities",
        "content": "February 10, 2026e-Paper\nThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\nFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\nToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\nScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\nData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\nHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\nThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\nFebruary 10, 2026e-Paper\nPublished - February 10, 2026 08:48 pm IST - CHENNAI\nA State-level video conference meeting was held on Tuesday with the participation of all District Collectors and Commissioners of Municipal Corporation, to brief them on the upcoming Census 2027 activities. Commissioner of Revenue Administration M. Saikumar, also the State Nodal Officer for Census, 2027 chaired the meeting.\nDuring the session, the Commissioner of Revenue Administration (CRA) emphasised the critical nature of the exercise and provided a roadmap of the essential action points to be prioritized by the Collectors and Commissioners at the District and Corporation levels to ensure seamless execution, an official release said. Director of Census Operations, Tamil Nadu M. Sundaresh Babu provided a comprehensive technical briefing.\nThe historical legacy and socio-economic importance of the Census, legal provisions and statutory obligations governing the process, new features and methodology specifically designed for the 2027 Census, integration of advanced technology and digital platforms to enhance data accuracy and collection speed, were among those discussed during the meeting.\nKrishnagiri and Tiruvallur Collectors shared their insights and learnings from the Census Pre-test, highlighting ground-level challenges and best practices for the main enumeration, it said.\nPublished - February 10, 2026 08:48 pm IST\nCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\nBACK TO TOP\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/tn-officials-prepare-for-upcoming-census-2027-activities/article70615636.ece",
        "date": "Tue, 10 Feb 2026 20:48:01 +0530",
        "fetched_at": "2026-02-11 03:14:17.280702"
    },
    {
        "title": "Over 50% Of Global Exploitation, Racism Complaints By Indian Students Come From Russia: Govt",
        "content": "A new data from the Ministry of External Affairs shows that over half of all complaints of exploitation and racial discrimination by Indian students globally come from Russia, The Times of India reported.\nAccording to the data, Indian students across 196 countries lodged around 350 complaints of harassment, exploitation and racial discrimination in 2025. Of these, more than 200 originated in Russia, with Moscow emerging as the biggest hotspot.\nThe number of complaints from Russia has risen sharply over the past three years, from 68 in 2023 to 78 in 2024, surging to 201 in 2025.\nMost Indian students in Russia are pursuing medical courses, and hail from states including Rajasthan, Gujarat, Andhra Pradesh, Telangana, Kerala and Tamil Nadu. Russia remains a popular destination due to lower tuition fees and relatively easier admission procedures.\nThe issue came into focus following a stabbing incident at the State Medical University in Ufa, in Russia’s Bashkortostan Republic, on Saturday. A 15-year-old school student armed with a knife attacked students in a dormitory, injuring four Indian medical students and two police officers.\nALSO READ: What Is The Ratio Of OBC, SC, ST Students In Indian Colleges? | Explained\nThe Indian Embassy in Moscow said the four students were “stable and recovering well,\" and consular officials from Kazan visited them in hospital. The teenager pleaded guilty and has been remanded to two months’ judicial custody.\nMeanwhile, during a Rajya Sabha question hour in December last year, Minister of State for External Affairs Kirti Vardhan Singh had stressed that the government gives high priority to the welfare and safety of Indian students abroad.\nHe had noted that Indian missions regularly contact students, visit educational institutions, and provide support through the MADAD portal, emergency helplines, emails, and social media, to ensure grievances are addressed promptly.\n“Complaints related to misleading academic programmes or untoward incidents/experiences faced by Indian students abroad are promptly taken up with the concerned educational institutions and/or with the authorities of the host country for necessary action,\" Vardhan had noted.\nLatest Blogs",
        "link": "https://www.news18.com/india/over-50-of-global-exploitation-racism-complaints-by-indian-students-come-from-russia-govt-ws-l-9893802.html",
        "date": "Tue, 10 Feb 2026 22:57:56 +0530",
        "fetched_at": "2026-02-11 03:14:23.874739"
    },
    {
        "title": "No Mandatory Service Charge: Centre As Restaurants Across India Slapped With Hefty Fines",
        "content": "The Centre on Tuesday said that levying a mandatory service charge on food bills violates consumer protection laws, warning that restaurants engaging in the practice are liable to face penalties.\nThe Ministry of Consumer Affairs, Food and Public Distribution said the Central Consumer Protection Authority (CCPA) has taken action against 27 restaurants across the country for what it described as “unfair trade practices\".\nThe action was initiated suo motu under the Consumer Protection Act, 2019, which prohibits the compulsory collection of service charges.\nAccording to the CCPA, automatically adding a service charge to a customer’s bill is unlawful.\nThe authority cited violations under Section 2(47) of the Act, which defines unfair trade practices. As part of the enforcement drive, Café Blue Bottle in Patna was fined Rs 30,000, while Mumbai-based restaurant China Gate was penalised Rs 50,000 for levying a default 10 per cent service charge on customers.\nThe ministry noted that the Delhi High Court, in March 2025, upheld the CCPA’s guidelines, affirming that mandatory collection of service charges by hotels and restaurants is contrary to law.\nUnder these guidelines, hotels and restaurants are barred from automatically or compulsorily adding a service charge to food bills, or collecting it under any alternative name.\nEstablishments must clearly inform customers that payment of a service charge is voluntary and optional, and cannot deny entry or services to those who refuse to pay it. The guidelines also specify that service charges cannot be subjected to GST.\nActing on complaints received through the National Consumer Helpline, the CCPA has directed erring restaurants to refund the full amount charged to consumers, immediately discontinue the practice, and remove the default inclusion of service or similar charges from their billing systems.\nThe ministry said enforcement action will continue to ensure compliance and protect consumer rights.\nLatest Blogs",
        "link": "https://www.news18.com/india/no-mandatory-service-charge-centre-as-restaurants-across-india-slapped-with-hefty-fines-9893774.html",
        "date": "Tue, 10 Feb 2026 22:14:20 +0530",
        "fetched_at": "2026-02-11 03:14:24.602573"
    },
    {
        "title": "AI Misinfo, Deepfake Under Scanner As Govt Brings Tougher IT Rules For Social Media Platforms",
        "content": "The government has notified a new law and revised guidelines aimed at tackling deepfakes and misleading AI-generated content on the internet, requiring platforms and users to clearly disclose material that is not real and significantly tightening timelines for takedown of harmful content.\nUnder the new framework, anyone uploading AI-generated or AI-altered photos, videos or audio, including deepfakes, will be required to declare that the content has been created or modified using artificial intelligence. Social media platforms such as Facebook, Instagram, YouTube and X will also be mandated to clearly label AI-generated content so users are not misled into believing it depicts a real person or a real event.\nThe law further mandates that AI-generated files carry embedded digital tracking, or metadata, enabling experts to identify the AI tool used to create the content. Platforms have been barred from allowing the removal or suppression of such labels or associated metadata once applied, a move aimed at strengthening traceability and accountability in cases of misuse.\nTaking cognisance of the spread of AI-based deepfakes, the IT Ministry has set a strict three-hour deadline for social media intermediaries to take down AI-generated or deepfake content once it is flagged by the government or ordered by a court. Earlier, platforms had up to 36 hours to remove such content. Grievance redressal timelines have also been tightened, with platforms now required to acknowledge user complaints within two hours, down from 24, and resolve them within seven days instead of 15.\nThe revised guidelines also direct social media companies to deploy reasonable and appropriate technical measures, including automated tools, to detect and prevent the circulation of illegal, sexually exploitative or deceptive AI-generated content. Platforms must ensure that users are not allowed to create, publish or disseminate synthetically generated information that violates existing laws, including the Bharatiya Nyaya Sanhita, the POCSO Act and the Explosive Substances Act.\nAdditionally, intermediaries have been instructed to periodically inform users — at least once every three months — about the consequences of violating rules related to AI misuse through their terms of service, privacy policies or other appropriate means. Where violations are detected, platforms are required to take “expeditious and appropriate action\".\nThe changes are intended to curb the misuse of artificial intelligence, improve transparency online and ensure faster action against harmful digital content, even as social media platforms have already begun rolling out features that allow users to label content generated or modified using AI.\nLatest Blogs",
        "link": "https://www.news18.com/india/social-media-firms-asked-to-remove-harmful-content-within-3-hours-as-govt-notifies-new-it-act-rules-9893032.html",
        "date": "Tue, 10 Feb 2026 19:12:38 +0530",
        "fetched_at": "2026-02-11 03:14:25.867535"
    },
    {
        "title": "Govt Is Working On A Strategy For Real-Time Reporting Of Cybercrimes: Amit Shah",
        "content": "Union Home Minister Amit Shah on Tuesday said the Ministry of Home Affairs has put in place a comprehensive and multi-dimensional strategy to tackle cybercrime, with a strong focus on real-time reporting of cyber incidents.\nSpeaking at a national conference on ‘Tackling Cyber-Enabled Frauds and Dismantling the Ecosystem’, organised by the Central Bureau of Investigation (CBI), Shah said cybercrime has evolved beyond financial fraud and now poses serious challenges to the country’s digital security.\nThe Home Minister said the government’s strategy rests on several key pillars, including real-time reporting of cybercrime, the creation of a robust network of forensic laboratories, capacity building of enforcement agencies, research and development, promotion of cyber awareness, and ensuring cyber hygiene across cyberspace.\n“Our goal is to bring together all stakeholders to create a secure and trustworthy digital ecosystem,\" Shah said, adding that agencies such as the CBI, National Investigation Agency (NIA), Reserve Bank of India (RBI), state police forces and other investigating bodies are being integrated into a coordinated framework to combat cyber threats effectively.\nHe noted that the rapid growth of digital transactions and UPI-based payments has made cybersecurity a critical national priority.\nWhile acknowledging that cyber fraud cases have increased alongside India’s expanding digital footprint, Shah said sustained and coordinated measures are being taken to counter emerging threats.\nHighlighting institutional coordination, the Home Minister referred to platforms such as I-Force, established to facilitate real-time cooperation among enforcement agencies. He said the initiative has delivered results and will now be further strengthened with deeper inter-agency collaboration.\nProviding an update on enforcement efforts, Shah said agencies led by the Indian Cyber Crime Coordination Centre (I4C) have so far saved or frozen over Rs 8,000 crore of the nearly Rs 20,000 crore lost to cyber fraud until November 30, 2025.\nDuring this period, around 82 lakh cybercrime complaints were received, resulting in the registration of 1.84 lakh FIRs.\nHowever, Shah cautioned that cybercriminal networks are becoming increasingly organised and technologically advanced, often staying ahead of law enforcement.\nHe urged participants at the conference to intensify efforts and take the fight against cybercrime to the next level.\nThe Home Minister also said that while 62 banks and financial institutions have already been onboarded onto the secure framework, the government aims to bring all cooperative banks under its ambit by December 31 to further strengthen safeguards within the financial system.\nLatest Blogs",
        "link": "https://www.news18.com/india/data-is-being-stolen-and-sold-to-enemies-amit-shah-says-govt-stepping-up-cybersecurity-efforts-ws-l-9892983.html",
        "date": "Tue, 10 Feb 2026 21:16:10 +0530",
        "fetched_at": "2026-02-11 03:14:26.474796"
    },
    {
        "title": "Bird Flu Alert In Andhra Pradesh: High Vigilance In One District, Government Issues Advisory",
        "content": "Bird flu, also known as avian influenza, has triggered fresh concern in parts of Andhra Pradesh, prompting the state government to step up surveillance and containment measures. While officials stress that the situation remains under control, precautionary steps have been intensified not only in the affected pockets but also in neighbouring villages and districts to prevent further spread.\nDeaths of country chickens were reported from parts of Chittoor and Annamayya districts, prompting the Animal Husbandry Department to send samples to the Bhopal-based National Institute of High Security Animal Diseases for testing.\nState minister Kinjarapu Atchannaidu has urged people not to panic, stating that the outbreak is being handled through coordinated action by animal husbandry and local administrative teams. He stressed that early detection and rapid response are helping authorities keep the risk contained.\nCases Surface In Annamayya District\nThe immediate alert was issued after suspected bird flu cases emerged in Sadum mandal of Annamayya district. Unusual bird deaths were reported in villages such as Puttavaripalli and Ammagaripalli, prompting swift intervention by officials. Once the infection was suspected, special Rapid Action Teams were deployed to the area.\nThese teams are carrying out scientific culling of infected birds, disinfecting poultry farms and surrounding zones, and restricting the movement of birds and farm equipment. Such containment protocols are standard practice to stop avian influenza from spreading to healthy flocks.\nSurveillance Extended To Chittoor\nAuthorities have also widened monitoring to nearby regions after reports of unexplained bird deaths surfaced in parts of Chittoor district, including Karvetinagaram mandal. Samples from affected birds have been collected and sent to the National Institute of High Security Animal Diseases laboratory in Bhopal for confirmatory testing. Officials said further action will depend on laboratory findings.\nGuidelines For Poultry Farmers\nThe Animal Husbandry Department has issued continuous advisories to poultry farmers in and around affected zones. Farm owners have been asked to strictly follow biosecurity norms, limit entry of outsiders into poultry sheds, and immediately report any sudden or unusual bird deaths to veterinary officials. Field teams led by senior department officers are visiting villages to spread awareness and ensure compliance with safety protocols.\nNo Need To Fear Cooked Chicken Or Eggs\nAmid rising public concern, the government has clarified that bird flu primarily affects birds and does not pose a risk through properly cooked food. Citizens have been reassured that thoroughly cooked chicken and boiled eggs remain safe for consumption. However, people are advised to maintain basic hygiene, such as washing hands after handling raw meat and avoiding contact with sick or dead birds.\nOfficials remain confident that with early intervention, strict monitoring, and public cooperation, the outbreak can be contained before it spreads to other districts. The focus, they say, is on prevention without triggering unnecessary alarm.\nDeaths of country chickens were reported from parts of Chittoor and Annamayya districts, prompting the Animal Husbandry Department to send samples to the Bhopal-based National Institute of High Security Animal Diseases for testing.\n\nState minister Kinjarapu Atchannaidu has urged people not to panic, stating that the outbreak is being handled through coordinated action by animal husbandry and local administrative teams. He stressed that early detection and rapid response are helping authorities keep the risk contained.\nCases Surface In Annamayya District\n\nThe immediate alert was issued after suspected bird flu cases emerged in Sadum mandal of Annamayya district. Unusual bird deaths were reported in villages such as Puttavaripalli and Ammagaripalli, prompting swift intervention by officials. Once the infection was suspected, special Rapid Action Teams were deployed to the area.\n\nThese teams are carrying out scientific culling of infected birds, disinfecting poultry farms and surrounding zones, and restricting the movement of birds and farm equipment. Such containment protocols are standard practice to stop avian influenza from spreading to healthy flocks.\n\nSurveillance Extended To Chittoor\n\nAuthorities have also widened monitoring to nearby regions after reports of unexplained bird deaths surfaced in parts of Chittoor district, including Karvetinagaram mandal. Samples from affected birds have been collected and sent to the National Institute of High Security Animal Diseases laboratory in Bhopal for confirmatory testing. Officials said further action will depend on laboratory findings.\n\nGuidelines For Poultry Farmers\n\nThe Animal Husbandry Department has issued continuous advisories to poultry farmers in and around affected zones. Farm owners have been asked to strictly follow biosecurity norms, limit entry of outsiders into poultry sheds, and immediately report any sudden or unusual bird deaths to veterinary officials. Field teams led by senior department officers are visiting villages to spread awareness and ensure compliance with safety protocols.\n\nNo Need To Fear Cooked Chicken Or Eggs\n\nAmid rising public concern, the government has clarified that bird flu primarily affects birds and does not pose a risk through properly cooked food. Citizens have been reassured that thoroughly cooked chicken and boiled eggs remain safe for consumption. However, people are advised to maintain basic hygiene, such as washing hands after handling raw meat and avoiding contact with sick or dead birds.\nOfficials remain confident that with early intervention, strict monitoring, and public cooperation, the outbreak can be contained before it spreads to other districts. The focus, they say, is on prevention without triggering unnecessary alarm.\n\nScan the QR code to download the News18 app and enjoy a seamless news experience anytime, anywhere.\nLatest Blogs",
        "link": "https://www.news18.com/india/bird-flu-alert-in-andhra-pradesh-high-vigilance-in-one-district-government-issues-advisory-shil-ws-l-9892826.html",
        "date": "Tue, 10 Feb 2026 16:45:08 +0530",
        "fetched_at": "2026-02-11 03:14:27.228208"
    },
    {
        "title": "'How Did He Get Book?' BJP Asks Rahul Gandhi Amid Naravane's Memoir Row, Congress Responds",
        "content": "The BJP on Tuesday stepped up its attack on Congress leader Rahul Gandhi, questioning how he obtained a physical copy of former Army chief General MM Naravane’s memoir after its publisher said the book has not yet been released.\nThe controversy centres on Four Stars of Destiny, General Naravane’s memoir, after Penguin Random House India issued a clarification stating that while it holds exclusive publishing rights, the manuscript has not been published “in any form\" so far.\nThe publisher said the statement was issued in view of reports about unauthorised copies being circulated.\nDespite the clarification, Gandhi maintained that the book was publicly available, citing a social media post by General Naravane from December 2023.\nA screenshot of the post shows the former Army chief announcing that his book was “available now\" and directing readers to a link.\nAddressing reporters outside Parliament, Gandhi said the publisher’s claim was questionable. “Here is a tweet from General Naravane which says, ‘Just follow the link to my book.’ Either General Naravane is lying or Penguin is lying, and I do not believe the former Army Chief would lie,\" he said.\nHere is a tweet from Mr Naravane which says, “Just follow the link to my book.\" The point I am making is this: either Mr Naravane is lying, or Penguin is lying. I do not think the former Army Chief would lie. Penguin says the book has not been published, but the book is available… pic.twitter.com/Xtn7gygC2K— Congress (@INCIndia) February 10, 2026\nThe BJP rejected Gandhi’s argument, saying he had misunderstood the difference between a pre-order announcement and an official publication.\nBJP national spokesperson Shehzad Poonwalla accused the Congress leader of misleading Parliament and the public, calling him a “national embarrassment\".\nIn a post on X, the spokesperson said the tweet cited by Gandhi referred only to a pre-order facility. “Now the questions remain: how did he get the book? Was there a violation of the Copyright Act and the Official Secrets Act? Did Rahul Gandhi mislead the country and make false allegations against Defence Minister Rajnath Singh? Did he disrupt Parliament based on this?\" the post read.\nRahul Gandhi is a national embarrassmentDoesn’t know difference between pre-order and published\nThe tweet he quoted was a Pre-order\nNow the question remains\n1) how did he get the book?2) isn’t it violation of Copyright Act and Official Secrets Act ?3) did Rahul not lie… pic.twitter.com/nby08xwmlJ\n— Shehzad Jai Hind (Modi Ka Parivar) (@Shehzad_Ind) February 10, 2026\nGeneral Naravane’s December 2023 post had included an image from Penguin highlighting that Four Stars of Destiny was available for pre-order, a distinction the BJP has emphasised in its response.\nHello friends. My book is available now. Just follow the link. Happy reading. Jai Hind pic.twitter.com/VCiLiZOWIi— Manoj Naravane (@ManojNaravane) December 15, 2023\nHowever, General Naravane on Tuesday himself shared Penguin Random House India’s clarification on the status of his memoir, Four Stars of Destiny, as the controversy over the book’s publication continued to trigger sharp political exchanges.\n\n\nCongress MP Karti Chidambaram also reacted to the controversy, saying that anything available in the public domain should be considered as published.\n“In today’s world, if something is available in the public domain, it is effectively published. If Penguin has an issue with people using portions of the material, they should pursue a copyright case, we are not concerned with that. The only person who has the authority to clarify this is the author himself, and he has not denied writing it. We are merely quoting what already exists,\" the Congress MP said.\nThe row over the memoir erupted last week during a heated debate in Parliament when Gandhi sought to read excerpts from a book review published by an Indian news website, relating to the 2020 India-China standoff in eastern Ladakh that culminated in the Galwan Valley clash.\nGandhi was stopped by the Speaker, who cited House rules barring unpublished material from being read into the official record.\nAlthough Gandhi offered a personal assurance on the authenticity of the excerpts, he was prevented from reading them out again the following day, triggering sharp exchanges between ruling party and opposition MPs.\nThe disruption led to the suspension of eight opposition MPs for the remainder of the session.\nAmid continued protests, Prime Minister Narendra Modi’s scheduled Lok Sabha address was cancelled, a move the Speaker attributed to opposition members allegedly planning an “attack\" on the Prime Minister.\nSubsequently, Gandhi wrote to Lok Sabha Speaker Om Birla, describing the episode as a “blot on our democracy\" and protesting against what he termed an attempt to silence debate on national security issues.\nLatest Blogs",
        "link": "https://www.news18.com/india/how-did-he-get-the-book-bjp-asks-rahul-gandhi-as-mm-naravanes-memoir-publisher-denies-release-9892696.html",
        "date": "Tue, 10 Feb 2026 20:13:38 +0530",
        "fetched_at": "2026-02-11 03:14:27.838338"
    },
    {
        "title": "'Book Considered Published Only When On Sale': Penguin's Fresh Clarification In Naravane Row",
        "content": "Amid the ongoing controversy over General (Retd.) MM Naravane’s memoir Four Stars of Destiny, Penguin India on Tuesday issued another clarification, stating that an announced title, a pre-order listing and a published book are distinct stages, and that a book is considered published only when it is available for purchase across retail channels.\nIn its latest clarification, the publisher said the presence of a pre-order listing does not amount to publication. “A book is considered published only when it is available for purchase across retail channels,\" Penguin Random House India said, reiterating that Four Stars of Destiny has not been published in any format.\nThe renewed clarification comes after Congress MP Rahul Gandhi questioned the publisher’s stand, alleging inconsistencies over the book’s status. Citing a 2023 post by Naravane that said, “Hello friends. My book is available now. Just follow the link. Happy reading. Jai Hind,\" Rahul Gandhi claimed the tweet suggested the book had been made available. He said either Naravane or Penguin was “lying\" about the release.\nRahul Gandhi is a national embarrassmentDoesn’t know difference between pre-order and published\nThe tweet he quoted was a Pre-order\nNow the question remains\n1) how did he get the book?2) isn’t it violation of Copyright Act and Official Secrets Act ?3) did Rahul not lie… pic.twitter.com/nby08xwmlJ\n— Shehzad Jai Hind (Modi Ka Parivar) (@Shehzad_Ind) February 10, 2026\nThe publisher has maintained that the tweet carried only a pre-order link and that the book was withdrawn two days later. Since then, Four Stars of Destiny has remained unavailable on e-commerce platforms, Penguin said.\nAfter Penguin’s second clarification, BJP leader Shehzad Poonawalla, too, attacked Congress MP Rahul Gandhi, calling him a “national embarrassment\" and accusing him of not understanding the difference between a pre-order listing and a published book.\nAlso Read: ‘I Believe Gen Naravane, Don’t Think He’ll Lie’: Rahul Gandhi Reacts To Penguin’s Statement On Book\nPoonawalla said the tweet cited by Gandhi referred only to a pre-order and raised questions over how Gandhi accessed the book in the first place, asking whether it amounted to violations of the Copyright Act and the Official Secrets Act.\nHe also alleged that Gandhi had misled the country, levelled “completely false\" allegations against Defence Minister Rajnath Singh, and disrupted Parliament on the basis of what he claimed was an incorrect premise.\nEarlier, Penguin India had issued a formal statement on X asserting that it holds the sole publishing rights for the book and that it has not been released. “We wish to make it clear that the book has not gone into publication. No copies of the book, in print or digital form, have been published, distributed, sold, or otherwise made available to the public by Penguin Random House India,\" the publisher said.\nThe publisher also warned that any copies currently in circulation, whether in print, digital, PDF or any other format, amount to copyright infringement and must be stopped immediately. It added that it would pursue legal remedies against any illegal or unauthorised sharing of the book and said the clarification was being issued to place its position on record.\nCongress MP Rahul Gandhi triggered a political row after displaying a copy of former Army chief General (Retd.) MM Naravane’s memoir Four Stars of Destiny in the Lok Sabha, drawing strong objections from senior BJP leaders who said the Leader of the Opposition cannot quote in Parliament from an unpublished book.\nLatest Blogs",
        "link": "https://www.news18.com/india/book-considered-published-only-when-on-sale-penguins-fresh-clarification-in-naravane-row-ws-l-9892577.html",
        "date": "Tue, 10 Feb 2026 15:52:14 +0530",
        "fetched_at": "2026-02-11 03:14:28.487589"
    },
    {
        "title": "NHRC Slams Tamil Nadu Govt's Response In Migrant Worker Attack Case, Seeks Clarification",
        "content": "Over a month after a migrant worker from Odisha was assaulted in Tamil Nadu, the National Human Rights Commission (NHRC) has issued a show cause notice to Tamil Nadu Chief Secretary and has directed to ensure all necessary medical treatment, post-trauma counselling, and reimbursement of any treatment costs for the victim.\nNHRC further noted the delayed FIR registration and the sudden disappearance of the victim from the hospital without follow-up searches. In regards to this, the commission asked the Tamil Nadu Director General of Police to submit an explanation within seven days and to trace the victim at the earliest.\nThe Tamil Nadu government has been informed about the migrant worker Suraj, who was brutally attacked with sharp weapons, left the hospital in an injured condition and has since gone missing, with no current information available about him.\nThe incident reportedly took place on December 27 last year, and the victim’s statement was recorded on the same day. However, the FIR was registered the next day after pressure was built up on social media.\nNDRC has accused the state authorities of not making effective efforts to trace the injured victim or identify his family members.\nThe Commission has termed this a serious lapse of the state machinery and a violation of the victim’s right to life and dignity under Article 21 of the Constitution.\nThe Chief Secretary has been directed to submit a detailed explanation and action-taken report on the negligence and lapses on the part of the police and administration.\nLatest Blogs",
        "link": "https://www.news18.com/india/nhrc-slams-tamil-nadu-govts-response-in-migrant-worker-attack-case-seeks-clarification-ws-de-9891831.html",
        "date": "Tue, 10 Feb 2026 13:10:21 +0530",
        "fetched_at": "2026-02-11 03:14:29.109325"
    },
    {
        "title": "India Weighs Role In Trump’s Gaza Peace Board, May Skip Inaugural Summit On February 19",
        "content": "India is yet to take a final decision on joining the Board of Peace for Gaza proposed by US President Donald Trump and is unlikely to attend its inaugural summit scheduled for February 19.\nOfficials said New Delhi is still studying the proposal and assessing its broader diplomatic implications, according to The Economic Times.\nThe issue came up during the recent India–Arab League Foreign Ministers’ meeting, where Arab League members, who have agreed to be part of the board, shared their views with India. However, officials indicated that India is continuing its internal deliberations. The proposal is also expected to be discussed during Prime Minister Narendra Modi’s upcoming visit to Israel, where regional security concerns and Gaza’s future are on the agenda.\nIndia has consistently supported a two-state solution to the Israel–Palestine conflict and is evaluating how participation in the board could affect its long-standing engagement with Palestine. A key concern for New Delhi is the presence of Pakistan and Turkey on the board. Pakistan had earlier been encouraged by the Trump administration to consider deploying stabilisation forces in Gaza, adding another layer of complexity to India’s assessment.\nThe inaugural summit, to be held at the US Institute of Peace in Washington, will bring together leaders who accepted Trump’s invitation earlier this year, along with members of an executive committee tasked with overseeing Gaza’s governance, security and reconstruction.\nWho Will Attend Gaza Peace Board Meeting?\nThe Express Tribune reported, citing sources, that Pakistan has confirmed it will attend the inaugural summit, with officials saying the forum would allow Islamabad to present its position directly to major international stakeholders and push for coordinated efforts to prevent civilian casualties and regional instability.\nMore than 20 countries have joined the Gaza Peace Board so far. Participants include Pakistan, Saudi Arabia, Turkey, Qatar, the United Arab Emirates, Egypt, Jordan, Indonesia, Argentina and Hungary. Israeli Prime Minister Benjamin Netanyahu has accepted an invitation to serve on the board and is expected to be in Washington for separate talks with President Trump. Hungarian Prime Minister Viktor Orban has also confirmed his attendance.\nEight Muslim-majority countries — Saudi Arabia, Turkey, Egypt, Jordan, Indonesia, Pakistan, Qatar and the UAE — are expected to take part, with efforts to present a common position on Gaza. India’s participation remains under active consideration.\nLatest Blogs",
        "link": "https://www.news18.com/india/india-weighs-role-in-trumps-gaza-peace-board-may-skip-inaugural-summit-on-february-19-ws-l-9891928.html",
        "date": "Tue, 10 Feb 2026 12:36:35 +0530",
        "fetched_at": "2026-02-11 03:14:29.790563"
    },
    {
        "title": "‘I Believe Gen Naravane, Don’t Think He’ll Lie’: Rahul Gandhi Reacts To Penguin’s Statement On Book",
        "content": "Amid the ongoing controversy over General (Retd.) MM Naravane’s unpublished memoir, Four Stars of Destiny, Congress MP Rahul Gandhi on Tuesday said that either the former Army chief or publisher Penguin could be lying about the book release.\n\n\nReferring to a 2023 post by Naravane, Rahul Gandhi said there is a tweet in which the former Army chief wrote, “Hello friends. My book is available now. Just follow the link. Happy reading. Jai Hind.\"\nRahul said the tweet showed the book being made available and added that either Naravane is lying or the publisher is not telling the truth. “My point is either Mr Narvane is lying or it is Penguin, which is lying. I don’t think the former Army chief will lie. But both can’t be telling the truth. Penguin is saying the book is not published but it’s available on Amazon,\" said the Congress leader.\nHello friends. My book is available now. Just follow the link. Happy reading. Jai Hind pic.twitter.com/VCiLiZOWIi— Manoj Naravane (@ManojNaravane) December 15, 2023\n\nNaravane’s tweet carried a pre-order link, but two days later the publisher withdrew the book, and since then it has remained unavailable on e-commerce platforms.\n\n\nThe statement comes amid a growing controversy over the alleged circulation of unauthorised copies of the manuscript, which has also led to a political row in Parliament.\nThe Delhi Police have registered an FIR and started a probe into what they describe as suspected illegal distribution of material from a publication that has not yet been approved.\n\n\nPenguin India issued a formal clarification on X, stating that it holds the sole publishing rights for Four Stars of Destiny and that the book has not been published in any format.\nThe publisher said it was responding to recent public discussion and media reports about the alleged circulation of a pre-print version of the manuscript.\n“We wish to make it clear that the book has not gone into publication. No copies of the book, in print or digital form, have been published, distributed, sold, or otherwise made available to the public by Penguin Random House India,\" the statement said.\nStatement from the publisher. pic.twitter.com/pksacg3EeT— Penguin India (@PenguinIndia) February 9, 2026\n\nThe publisher added that any copies currently in circulation, whether in print, digital, PDF or any other format, amount to copyright infringement and must be stopped immediately.\nIt said it would exercise legal remedies against any illegal and unauthorised sharing of the book and that the statement was being issued to place the publisher’s position on record.\nLatest Blogs",
        "link": "https://www.news18.com/india/i-believe-gen-naravane-dont-think-hell-lie-rahul-gandhi-reacts-to-penguins-statement-on-book-9891867.html",
        "date": "Tue, 10 Feb 2026 12:51:36 +0530",
        "fetched_at": "2026-02-11 03:14:30.520367"
    },
    {
        "title": "AI Summit: Hotel Room Rates In Delhi Cross Rs 1 Lakh Per Night Next Week, Demand For Govt Price Ceiling",
        "content": "Hotel prices have skyrocketed in New Delhi for the weekend, as the national capital prepares to host the India AI Summit.\nThis has triggered fresh warnings of a growing crisis of excessive pricing during major international events. A comprehensive survey has brought the issue to the fore, revealing that some properties are charging as much as Rs 20 lakh per night for a suite.\nThe survey, conducted by LocalCircles, highlights a pattern of exploitative pricing that typically accompanies major sports tournaments and global summits. According to the data, there is a stark disparity between standard rates and those offered during high-demand periods.\nIn central Delhi, five-star hotels witnessed prices cross Rs 60,000 per night. Even more modest four-star accommodations, which typically cost around Rs 6,000, are being marketed for over Rs 30,000 — a five-fold increase. In some instances, rates have reportedly surged by up to 10 times their standard fees as hotels capitalise on the influx of visitors.\nThis trend mirrors previous spikes seen during the 2023 Cricket World Cup, where prices rose three to five times the regular rate and, in Navi Mumbai, where some hotels charged Rs 5 lakh for a three-night stay during a Coldplay concert.\nThe survey report revealed that 57 percent of the consumers have experienced excessive charging by hotels at least once in the last three years. Of those who have faced these steep rates, 7 percent reported paying inflated prices almost every time they booked a room.\nThe hospitality sector’s current “free market\" approach has left many feeling vulnerable. “Any time there is an international event, hotel room rates skyrocket in India with no upper limit,\" the report stated, pointing out that the ministry of tourism has no regulations to protect consumers from such spikes.\nThe survey reported that this has led to an overwhelming demand for government intervention, with 71 percent of the respondents in favour of a price ceiling. The most popular proposal, supported by 49 percent of those surveyed, is that the maximum rate charged should be restricted to no more than twice the regular rack rate to ensure fair treatment.\nTo ensure these limits are respected, 74 percent of citizens are calling for the appointment of a regulatory body or government agency to oversee compliance, with a separate regulator under the tourism ministry; using the Competition Commission to monitor compliance; and empowering the Central Consumer Protection Authority to handle grievances.\nThe report concludes that while the hospitality sector is vital for job creation and tourism, the Centre must play a “more proactive role\" to ensure the industry remains profitable without subjecting tourists and business visitors to exploitative practices.\nLatest Blogs",
        "link": "https://www.news18.com/india/ai-summit-hotel-room-rates-in-delhi-cross-rs-1-lakh-per-night-next-week-demand-for-govt-price-ceiling-ws-el-9891167.html",
        "date": "Tue, 10 Feb 2026 11:00:35 +0530",
        "fetched_at": "2026-02-11 03:14:31.161068"
    },
    {
        "title": "Gold, Cash Stolen From Congress Minister's Office On Vidhana Soudha Premises In Bengaluru",
        "content": "A theft on the high-security premises of Vidhana Soudha has triggered alarm over possible lapses in access control and monitoring at Karnataka’s seat of power.\nAccording to the complaint filed with the local police, the incident took place in the office of Congress minister Byrathi Suresh, from where a handbag containing about 300 grams of gold jewellery and Rs 1.5 lakh in cash went missing.\nPolice said the bag belonged to Naveen, who had visited the minister’s office for official work.\nHe reportedly carried the handbag with him during the visit but inadvertently left it behind on the office premises.\nNaveen realised the bag was missing only when he returned the following day and subsequently lodged a complaint at the Vidhana Soudha police station.\nDuring the preliminary investigation, officials scrutinised CCTV footage installed inside the complex.\nThe footage, police said, indicated the involvement of a D-group employee attached to the Department of Personnel and Administrative Reforms (DPAR).\nVisuals reportedly showed the employee picking up the handbag from within the office area and leaving with it.\nBased on the evidence, the suspect was identified and taken into custody.\nPolice confirmed that the accused was arrested, and further investigation was underway to establish the sequence of events and whether anyone else was involved in the theft.\nAuthorities have not yet commented on whether additional security audits will be ordered following the incident.\nPolice said further details would emerge as the probe progresses and once questioning of the arrested employee is completed.\nLatest Blogs",
        "link": "https://www.news18.com/india/bag-with-300-grams-of-gold-jewellery-lakhs-of-cash-stolen-bengaluru-vidhana-soudha-congress-byrathi-suresh-office-ws-l-9891430.html",
        "date": "Tue, 10 Feb 2026 10:04:38 +0530",
        "fetched_at": "2026-02-11 03:14:32.002016"
    },
    {
        "title": "Parliament Budget Session Live: Shashi Tharoor Addresses Lok Sabha, Calls Union Budget 'Underwhelming'",
        "content": "Parliament Budget Session Live: The Lok Sabha resumed proceedings at 2 pm on Tuesday after being adjourned twice earlier in the day. As the Budget session continues amid a deadlock, the Opposition submitted a no-confidence notice against Lok Sabha Speaker Om Birla.\nGaurav Gogoi, Deputy Leader of Congress in Lok Sabha, said the notice, signed by 118 Opposition MPs, was submitted under Article 94-C of the Constitution to the Lok Sabha Secretary-General. Notably, the Trinamool Congress (TMC) chose not to sign the notice. Meanwhile, BJP women MPs have written to Speaker Birla, urging him to take “strictest possible action” under parliamentary rules against certain Opposition MPs following disruptions in the House on February 4.\nSeparately, the Parliamentary Standing Committee on External Affairs is scheduled to meet later, with the Foreign Secretary and Commerce Secretary briefing members on the India-US trade deal. The Shashi Tharoor-led committee is expected to debate the deal’s impact on India-Russia relations amid ongoing oil sanctions. Discussions will also cover the EU trade agreement and India-Bangladesh relations. Follow for live updates.\nLeader of Opposition in Lok Sabha, Rahul Gandhi, did not sign the notice of no-confidence motion against Speaker Om Birla, as it is not proper for the LoP to sign a petition for the removal of the Speaker in a parliamentary democracy, ANI reported, citing sources on Tuesday.\nLok Sabha Speaker Om Birla on Tuesday directed the House Secretary-General to examine the no-confidence motion notice against him and take appropriate action, ANI reported, citing sources. The Congress today submitted a notice of no-confidence motion against the Speaker.\nCongress MP Shashi Tharoor on Tuesday addressed the Lok Sabha, presenting his views on the Union Budget.\nLok Sabha proceedings resumed on Tuesday following the submission of a no-confidence notice against Speaker Om Birla. The notice, signed by 118 Opposition MPs, triggered heated debates in the House, though the Trinamool Congress (TMC) chose not to support it. Lawmakers returned to the floor to continue discussions on ongoing legislative business amid heightened political tensions.\nThe Opposition has formally submitted a no‑confidence notice against Lok Sabha Speaker Om Birla to the Secretary‑General, with a total of 118 MPs signing the motion. However, the Trinamool Congress (TMC) chose not to add its support.\nUnion Parliamentary Affairs Minister Kiren Rijiju on Tuesday met senior Opposition MPs on Tuesday in an effort to break the parliamentary logjam, sources said. Congress leaders KC Venugopal and Gaurav Gogoi, Samajwadi Party chief Akhilesh Yadav, Trinamool Congress MP Abhishek Banerjee and BRS leader TR Baalu were present at the meeting. During the discussions, the Opposition insisted on key demands, including that Leader of the Opposition Rahul Gandhi be allowed to speak in the House, suspended MPs be reinstated, and remarks made against women MPs be withdrawn, sources added.\nParliamentary Affairs Minister Kiren Rijiju on Tuesday shared visuals from inside the Lok Sabha on the day Prime Minister Narendra Modi was scheduled to deliver his speech, as he backed the complaint filed by Bharatiya Janata Party (BJP) women MPs with Lok Sabha Speaker Om Birla. He alleged that the Congress MPs had crossed parliamentary limits. Read more\nUnion Parliamentary Affairs Minister Kiren Rijiju on Tuesday accused the Congress of taking pride in what he termed the most degrading conduct by its MPs inside Parliament. In a post on X, Rijiju said the behaviour had diminished the dignity of the House and provoked strong reactions from BJP members during the session.\nThe Lok Sabha has been adjourned again till 2 pm amid Opposition protest.\nLok Sabha proceedings have resumed after being adjourned earlier in the day.\nThe Opposition in the Lok Sabha is set to submit a no‑confidence notice against Speaker Om Birla to the Secretary‑General after 1 pm on Tuesday as part of a coordinated effort to challenge his handling of House proceedings amid repeated adjournments and disputes over speaking rights for Opposition leaders. The move aims to formally initiate a motion under parliamentary rules seeking the Speaker’s removal from office, reflecting deepening tensions in the Budget session between Opposition parties and the ruling side.\nAddressing reporters outside Parliament, Rahul Gandhi reacted to Penguin India’s statement on ex-Army Chief Manoj Naravane’s “unpublished” book, highlighting a contradiction. He pointed to a tweet by Naravane promoting the book’s availability online, saying, “Either Mr Naravane is lying, but I believe… I don’t think he or Penguin is lying, but both can’t be telling the truth. Penguin says the book is not published, but it is available on Amazon.”\nRajya Sabha proceedings are underway.\nThe Lok Sabha remained in deadlock on Tuesday as proceedings were disrupted by sloganeering from opposition members just four minutes after the session commenced. Unable to resume normal business, the Speaker adjourned the House until 12 noon.\nLok Sabha proceedings have begun on Tuesday.\nPrime Minister Narendra Modi arrived in the Parliament for the ongoing Budget Session.\nThe Foreign Secretary and Commerce Secretary are set to brief a parliamentary panel on the India-US trade deal, with intense debate expected in the Tharoor-led committee. Opposition members are likely to seek clarifications on the deal’s impact on India-Russia relations, particularly in light of ongoing oil sanctions. Ahead of the session, External Affairs Minister S. Jaishankar held a detailed briefing yesterday with NDA MPs who are part of the committee. The meeting will also cover discussions on the EU trade deal and India-Bangladesh relations.\nBJP women MPs have written to Lok Sabha Speaker Om Birla, demanding the “strictest possible action, under the rules,” against Opposition MPs who, they allege, disrupted proceedings by tearing papers, entering the treasury benches, and surrounding the Prime Minister. The letter describes these actions as “heinous.”\nLatest Blogs",
        "link": "https://www.news18.com/india/parliament-budget-session-2026-live-updates-lok-sabha-rajya-sabha-opposition-debate-rahul-gandhi-nirmala-pm-modi-liveblog-9891478.html",
        "date": "Tue, 10 Feb 2026 15:12:16 +0530",
        "fetched_at": "2026-02-11 03:14:33.569945"
    },
    {
        "title": "21-Year-Old Maharashtra Woman Administered Injections By Ward Boy Posing As Doctor, Dies",
        "content": "In a shocking incident from Navi Mumbai, police have arrested a ward boy who allegedly posed as a doctor and administered injections to a 21-year-old woman, resulting in her death, an official from the Vashi police station said on Monday.\nThe incident occurred on February 5 in Sector 11 of Vashi. The victim was identified as Prachiti Bhikuram Bhuvad.\nA police official told news agency PTI that the accused, Sandesh Yashwant Pashte, was contacted by the woman’s family after she complained of irregular menstrual cycles.\nAccording to the police, Pashte introduced himself as a doctor and examined the young woman at her residence.\nAs the woman narrated her health issues, the ward boy allegedly informed her that she was suffering from Polycystic Ovary Disorder (PCOD).\nThe ward boy then proposed a treatment plan involving a course of five injections, for which he charged the family Rs 15,000, assuring them that he would personally administer the medication.\nOn February 5, Pashte visited the woman’s home and gave her two injections, the police said.\nShortly after receiving the shots, her condition reportedly worsened rapidly, and she fell unconscious.\nThe Vashi police station official said that the accused appeared panicked following the woman’s collapse, and allegedly asked the woman’s father to dispose of a bag containing used syringes and other medical waste in the trash.\nFamily members then rushed the woman to a nearby hospital, where doctors declared her dead nearly two hours later.\nThe police further said that when confronted by the woman’s relatives, Pashte admitted that he was not a doctor.\nAccording to the official, he confessed to being a ward boy employed at a private nursing home in Andheri in Mumbai and acknowledged that he did not possess any recognised medical qualification or medical certificate.\nFollowing a complaint filed by the family, the police registered a case against Pashte and arrested him on February 6.\n\nThe accused was booked under the Bharatiya Nyaya Sanhita on charges including culpable homicide not amounting to murder, cheating by personation and other offences.\nPolice said an investigation was underway to determine the exact nature of the injections administered to the woman and to establish further circumstances surrounding her death.\nOfficers were also examining whether the accused had treated other people in a similar manner.\nLatest Blogs",
        "link": "https://www.news18.com/india/navi-mumbai-vashi-ward-boy-poses-as-doctor-administers-injections-to-woman-patient-dies-navi-mumbai-hospital-ward-boy-arrested-ws-l-9891401.html",
        "date": "Tue, 10 Feb 2026 09:28:24 +0530",
        "fetched_at": "2026-02-11 03:14:34.235805"
    },
    {
        "title": "'Not Satisfied With Response': Maithili Thakur Questions Minister Over Condition Of Bihar Hospitals",
        "content": "BJP MLA Maithili Thakur took on her own party’s Health Minister, Mangal Pandey, in the Bihar assembly over the condition of a government hospital in her Alinagar constituency, saying official records did not reflect what she had personally seen on the ground and urging immediate corrective action.\nDuring Question Hour, Thakur rejected the minister’s written reply that suggested the hospital building was not in a severely bad state and only required repairs.\nIn her intervention, she told the House, “I am not completely satisfied with the minister’s response, because it states that the building is not in a bad condition, it just needs to be repaired.\"\n“But I myself have gone and seen that the building is in a bad condition,\" she said.\nShe went on to describe how limited infrastructure and manpower were affecting patient care, saying, “There is a health care system running in a small room there. There is no MBBS doctor, there were two MBBS doctors there in the past, but not now.\"\nReferring to the reply’s mention of another category of doctor, she added, “It is written in the answer that there is another specialist, to which I agree, but we need two MBBS doctors there.\"\nFraming her remarks, the legislator said, “I am not ordering the minister, I am just making a request to him.\"\nShe underlined Pandey’s long association with the health department, noting, “Because I was very young, and since then I have been seeing the health minister as a minister. I have been seeing him working in the health department. So I want him to do it for the benefit of the public, because it is very important.\"\nStressing the scale of dependence on the facility, Thakur told the House, “Five to seven panchayats depend on this hospital. It is clearly believed that 40,000 to 50,000 people benefit from this hospital.\"\nShe also highlighted its strategic location within her constituency, saying, “And this hospital is in the centre of my entire committee, with which the two branches, Ghanshyampur and Alinagar, both can benefit from it.\"\nConcluding her intervention, she urged focused attention on the matter.\n“So I would like to request him to pay special attention to this. Thank you.\"\n\nThe episode drew attention because it came from a ruling-party legislator of the Bharatiya Janata Party publicly pressing a senior minister from her own side.\nIn his response placed before the House, Pandey had maintained that the government was addressing infrastructure concerns, pointing to approvals for new hospital buildings in several areas, ongoing construction at some sites, and a phased plan to repair or renovate facilities identified as extremely dilapidated.\nLatest Blogs",
        "link": "https://www.news18.com/india/maithili-thakur-questions-bihar-mangal-pandey-over-condition-of-hospitals-need-more-doctors-ws-l-9891333.html",
        "date": "Tue, 10 Feb 2026 08:41:07 +0530",
        "fetched_at": "2026-02-11 03:14:34.931051"
    },
    {
        "title": "'No Copies Published': Penguin India On Row Over Circulation Of Ex-Army Chief's Pre-Print Book",
        "content": "Penguin Random House India has issued a formal clarification on social media platform X, stating that it holds the sole publishing rights for ‘Four Stars of Destiny’, the memoir of former Army chief Manoj Mukund Naravane, and emphasising that the book has not yet been published in any format.\nIn its post, the publisher said it was responding to “recent public discourse and media reporting\" around the alleged circulation of a pre-print version of the manuscript.\n“We wish to make it clear that the book has not gone into publication. No copies of the book, in print or digital form, have been published, distributed, sold, or otherwise made available to the public by Penguin Random House India,\" the company said.\nThe statement went on to warn that any version of the book currently being circulated amounts to copyright infringement.\n“Any copies of the book currently in circulation, in whole or in part, whether in print, digital, PDF, or any other format, online or offline, on any platform, constitute an infringement of PRHI’s copyright and must immediately be ceased,\" it read.\nThe publisher added that it “shall be exercising remedies available in law against the illegal and unauthorised dissemination of the book,\" concluding that the note was being issued “to place the publisher’s position on record.\"\nStatement from the publisher. pic.twitter.com/pksacg3EeT— Penguin India (@PenguinIndia) February 9, 2026\nThe post comes amid a police investigation into claims that an unpublished version of the memoir is being shared online.\nA political fallout was also trigerred and a row erupted after Congress leader Rahul Gandhi attempted to quote from what he described as the pre-print book during his speech in the Lok Sabha on the motion of thanks to the President’s Address, drawing strong objections from treasury benches and repeated adjournments before the motion was eventually adopted by voice vote.\nGandhi was later seen flashing a purported copy of the book in the Parliament complex, and the issue led to major disruptions in the House, culminating in the suspension of eight MPs for the remainder of the Budget session.\nThe Delhi Police said it had taken cognisance of information circulating on social media platforms and news forums alleging that a pre-print copy of ‘Four Stars of Destiny’ was available without mandatory clearance from relevant authorities.\nAn official told news agency ANI that on verification, police found that “a PDF copy of a typeset book with the same title, apparently prepared by M/S Penguin Random House India Pvt. Limited, is available on certain websites,\" and that some online marketing platforms had displayed the finished book cover “as if it is available for purchase.\"\nThe Special Cell subsequently registered a case to investigate what was described as a “purported leak/breach of a yet to be approved publication.\"\n“The Delhi Police has taken cognisance of information circulating on social media platforms and online news forums claiming that a pre-print copy of a book titled ‘Four Stars of Destiny’ is being circulated without mandatory clearance from competent authorities,\" the police statement said.\nPolice reiterated that the required clearance for publication was still awaited and that the probe would examine how the material surfaced in the public domain.\nLatest Blogs",
        "link": "https://www.news18.com/india/four-stars-of-destiny-naravane-unpublished-book-penguin-random-house-india-clarification-sole-publishing-rights-rahul-gandhi-parliament-row-ws-l-9891217.html",
        "date": "Tue, 10 Feb 2026 07:01:09 +0530",
        "fetched_at": "2026-02-11 03:14:35.537503"
    },
    {
        "title": "‘Book Not Published’: MM Naravane's Memoir Publisher Reacts After Delhi Police's FIR",
        "content": "Penguin Random House India on Monday issued a statement clarifying that the memoir of former Indian Army Chief General Manoj Mukund Naravane, ‘Four Stars of Destiny‘, has not been published, following a Delhi Police FIR over the alleged circulation of the book online.\nThe publisher said it holds the sole publishing rights for the memoir and stressed that no copies—printed, digital, or otherwise—have been released to the public.\n“We wish to make it clear that the book has not gone into publication. No copies of the book – in print or digital form – have been published, distributed, sold, or otherwise made available to the public by Penguin Random House India,\" the statement said.\nStatement from the publisher. pic.twitter.com/pksacg3EeT— Penguin India (@PenguinIndia) February 9, 2026\nIt added, “Any copies of the book currently in circulation, in whole or in part, whether in print, digital, PDF, or any other format, online or offline, on any platform, constitutes an infringement of PRHI’s copyright and must immediately be ceased.\"\nThe publisher also said it would pursue all legal remedies available against unauthorised dissemination. “Penguin Random House India shall be exercising remedies available in law against the illegal and unauthorised dissemination of the book. This statement is being issued to place the publisher’s position on record,\" it added.\nALSO READ: Gen Naravane’s Memoir Not Out Yet, But What Ex-Army Chief Said About India-China Border Standoff\nThe FIR comes after reports emerged that a pre-publication version of ‘Four Stars of Destiny‘ was circulating online without the mandatory clearances. Delhi Police said they acted after information surfaced on social media and news forums suggesting the book was being shared before official approval.\nDuring verification, investigators found a PDF version of a typeset book with the same title available on certain websites. Some online platforms were also displaying the finished book cover as if it were available for purchase.\nThe memoir, written by General Naravane, who served as the 28th Chief of Army Staff from 31 December 2019 to 30 April 2022, is expected to cover his nearly four-decade-long career, from Second Lieutenant to Army Chief.\nIt reportedly offers insights into key moments, including India’s most serious military standoff with China since 1962.\nLatest Blogs",
        "link": "https://www.news18.com/india/book-not-published-mm-naravanes-memoir-publisher-reacts-after-delhi-polices-fir-ws-l-9891099.html",
        "date": "Mon, 9 Feb 2026 23:22:19 +0530",
        "fetched_at": "2026-02-11 03:14:36.259157"
    },
    {
        "title": "Heatwave Grips Kerala, Disaster Authority Issues Safety Advisory",
        "content": "The Kerala State Disaster Management Authority (KSDMA) has issued a public advisory warning residents of rising temperatures across Kerala and urging people to take precautions to avoid heat-related illnesses.\nAccording to the advisory, several parts of the state are experiencing above-normal temperatures, with conditions expected to worsen during peak daytime hours. The authority cautioned that prolonged exposure to heat could lead to dehydration, heat exhaustion and heatstroke, particularly among vulnerable groups such as children, the elderly, outdoor workers and those with pre-existing health conditions.\nThe KSDMA advised people to avoid direct sunlight between late morning and afternoon, drink plenty of water even if not feeling thirsty, and wear light, loose cotton clothing. Residents have also been asked to limit strenuous physical activity during the hottest parts of the day and ensure proper ventilation indoors.\nSpecial instructions were issued for schools, construction workers and those employed in agriculture and other outdoor occupations. Employers were urged to adjust work timings, provide shaded rest areas and ensure access to drinking water.\nThe disaster management authority also warned against leaving children or pets inside parked vehicles and advised the public to check on elderly neighbours and those living alone. In case of symptoms such as dizziness, nausea, headaches or confusion, people were asked to seek medical help immediately.\nOfficials said the situation is being closely monitored and further advisories may be issued depending on how weather conditions evolve in the coming days.\nLatest Blogs",
        "link": "https://www.news18.com/india/heatwave-grips-kerala-disaster-authority-issues-safety-advisory-ws-el-9890969.html",
        "date": "Mon, 9 Feb 2026 21:47:45 +0530",
        "fetched_at": "2026-02-11 03:14:37.047386"
    },
    {
        "title": "“Unprecedented Ghee Adulteration”: Dairy Adulterated Nearly 7 Million Kg, Says Author Ranganathan",
        "content": "| \"This dairy had adulterated close to 7 million kilograms of ghee, this is unprecedented\": @ARanganathan72 n18oc_indian18oc_politicsNews18 Mobile App - https://onelink.to/desc-youtube\nLatest Blogs",
        "link": "https://www.news18.com/videos/india/unprecedented-ghee-adulteration-dairy-adulterated-nearly-7-million-kg-says-author-ranganathan-9890776.html",
        "date": "Mon, 9 Feb 2026 19:36:15 +0530",
        "fetched_at": "2026-02-11 03:14:37.701759"
    },
    {
        "title": "Delhi Police File FIR Over Circulation Of Ex-Army Chief’s Unpublished Book Amid Parliament Row",
        "content": "Delhi Police on Monday registered a case over the alleged leak of a pre-publication copy of Four Stars of Destiny, the memoir of former Army Chief General Manoj Naravane, after reports surfaced that the book was circulating online without mandatory clearances.\nAccording to the police, they took cognisance of information found on social media platforms and news forums claiming that a pre-print version of the book was in circulation, even though official approval for its publication had not yet been granted by the competent authorities.\nDuring verification, investigators found that a PDF version of a typeset book bearing the same title, apparently prepared by publisher Penguin Random House India Pvt. Ltd., was available on certain websites.\nIn addition, some online marketing platforms were found displaying the finished book cover as if the title were available for purchase.\nIn view of the suspected breach and unauthorised circulation of an unpublished work, Delhi Police said a case has been registered with the Special Cell and a detailed investigation is underway to ascertain the source of the leak and the extent of the violation.\n\n\nFour Stars of Destiny is a memoir chronicling nearly four decades of General Naravane’s service in the Indian Army, tracing his journey from a Second Lieutenant to Chief of the Army Staff.\nThe book reportedly offers insights into key moments of his career, including India’s most serious military standoff with China since the 1962 conflict.\nPenguin Random House India is the publisher of the memoir.\n\n\nThe controversy surrounding the book gained attention during the post-Budget session of Parliament.\nAs Prime Minister Narendra Modi was set to move the Motion of Thanks on the Union Budget, Lok Sabha proceedings were disrupted after Congress leader Rahul Gandhi read out portions of a magazine article said to be based on General Naravane’s unpublished memoir.\nThough Gandhi spoke for only a few minutes, his remarks drew sharp reactions from the BJP leadership.\nUnion Home Minister Amit Shah and Defence Minister Rajnath Singh accused the Leader of the Opposition of citing material from an unpublished book.\nSingh questioned the propriety of referring to content that had not formally entered the public domain.\nWithin days, Gandhi returned to Parliament holding a copy of Four Stars of Destiny, saying he intended to “gift it to the Prime Minister\", further fuelling the political controversy.\nLatest Blogs",
        "link": "https://www.news18.com/india/delhi-police-file-case-over-alleged-leak-of-former-army-chief-naravanes-four-stars-of-destiny-9890754.html",
        "date": "Mon, 9 Feb 2026 20:04:32 +0530",
        "fetched_at": "2026-02-11 03:14:38.304507"
    },
    {
        "title": "‘More Will Get It’: DK Shivakumar Defends Cabinet Rank For Party Workers, BJP Objects",
        "content": "Karnataka Deputy Chief Minister DK Shivakumar on Monday defended the decision to give cabinet rank to party workers, saying it was a matter of status and recognition for those who helped bring the party to power.\nResponding to criticism, Shivakumar questioned what the BJP had done during its time in power and dismissed the objections raised by the opposition.\n“They have got us to power, they will get power. It’s about status. More will get it,\" he said.\nReacting to the move, BJP leader and Chief Whip in the Legislative Council, N Ravikumar criticised the government, saying that the Congress had 139 MLAs but cabinet rank had been given to 150 individuals.\n“Some of them are MLAs, some are not. Whoever complained that they did not get cabinet ranks, to appease them, the state government has given them the status. Whose money are they spending on it? It’s the people’s tax money. How can they do this?\" Ravikumar said.\nHe demanded that the Chief Minister release a list of all those given cabinet rank and disclose how much money was being spent on them.\n“There is no development in the state. Bengaluru has turned into a pothole city. Funds are not being given to MLAs for development, but they are spending people’s tax money to appease some individuals,\" he added.\nAccording to details, the Siddaramaiah government has handed out cabinet and minister of state ranks to a total of 149 individuals so far.\nThis includes 32 full-fledged ministers who are constitutionally appointed cabinet ministers, 43 MLAs granted cabinet rank as chairpersons of various corporations and boards, and 11 MLAs given minister of state status as heads of smaller corporations.\nAmong non-MLAs, cabinet rank has been granted to nine advisers and special representatives, while minister of state rank has been given to 54 Congress leaders and workers.\nRecently, 54 more people serving as heads of boards and corporations were given minister of state status, raising serious questions over the burden on the exchequer.\nThose granted cabinet or minister of state rank are entitled to a monthly salary of Rs 50,000, a hospitality allowance of Rs 3,000, daily travel allowance of Rs 2,000 within the state and Rs 2,500 outside the state, and a fuel allowance of 1,000 litres of petrol or diesel per month.\nThey are also provided house rent allowance of Rs 80,000 per month, house maintenance and staff allowance of Rs 20,000 per month, medical expense reimbursement, and staff facilities including a personal secretary, personal assistants, drivers and an attender.\nAt government programmes, they are given seating arrangements and protocol equivalent to those of state ministers.\nLatest Blogs",
        "link": "https://www.news18.com/india/more-will-get-it-dk-shivakumar-defends-cabinet-rank-for-party-workers-bjp-objects-ws-l-9890604.html",
        "date": "Mon, 9 Feb 2026 19:03:50 +0530",
        "fetched_at": "2026-02-11 03:14:39.059280"
    },
    {
        "title": "Home Minister Amit Shah To Inaugurate CBI's New Cybercrime Branch Tomorrow",
        "content": "Union Home Minister and Minister of Cooperation Amit Shah is set to deliver the keynote address at the National Conference on “Tackling Cyber-Enabled Frauds & Dismantling the Ecosystem\" on Tuesday in New Delhi.\nAccording to a PIB press release, at the event, Shah will also preside over an Investiture Ceremony of CBI officers, inaugurate the new Cybercrime Branch of the Central Bureau of Investigation (CBI), and launch the S4C Dashboard under the Indian Cyber Crime Coordination Centre (I4C), Ministry of Home Affairs.\nThe two-day conference, organised by the CBI in collaboration with I4C, Ministry of Home Affairs, will run from February 10 and 11 at Bharat Mandapam in the national capital.\n“The conference is being convened at a time when, under the leadership of Prime Minister Shri Narendra Modi, India’s rapid digital transformation has significantly improved access to banking, governance, and communication, while simultaneously creating new vulnerabilities that are being exploited by organized cybercriminal networks,\" the release noted.\nALSO READ: ‘Sahkar, Not Sarkar’: Amit Shah Launches Bharat Taxi Service, Promises Big Benefits For Drivers\nThe CBI has been investigating cybercrime since 2000 and enhanced its capabilities by setting up the Cybercrime Investigation Division in 2022. The agency serves as the nodal body for cybercrime cases affecting the Central Government and its offices, handling both cyber-dependent crimes and cyber-enabled frauds.\nThe conference aims to build a shared understanding of the scale, trends, and evolving nature of cyber-enabled fraud in India. It will examine three critical pillars of the cyber-fraud ecosystem: the financial pillar (mule accounts and money laundering), the telecom pillar (misuse of SIM/eSIM and digital infrastructure), and the human pillar (cyber slavery and trafficking into scam compounds).\nKey objectives include strengthening inter-agency and public–private collaboration among law enforcement, banks, telecom providers, regulators, and technology platforms; exploring the use of artificial intelligence and data analytics to scale investigations; and improving mechanisms for faster fraud reporting, real-time fund tracing, timely evidence preservation, and better victim protection.\nSenior officials and experts from Central and State law enforcement agencies, the Department of Telecommunications, Reserve Bank of India, public and private banks, FinTech firms, telecom and social media companies, cybersecurity experts, and international representatives are expected to participate.\nLatest Blogs",
        "link": "https://www.news18.com/india/home-minister-amit-shah-to-inaugurate-cbis-new-cybercrime-branch-tomorrow-ws-l-9890635.html",
        "date": "Mon, 9 Feb 2026 18:57:42 +0530",
        "fetched_at": "2026-02-11 03:14:39.700579"
    },
    {
        "title": "Pregnant Cat Allegedly Kidnapped, Sold To Breeders In Bengaluru: 9 Booked",
        "content": "A case has been registered by Bengaluru police after a pregnant cat was reported missing from a residential neighbourhood, prompting concern among residents and animal welfare supporters. Authorities are investigating the circumstances surrounding the animal’s disappearance and have booked several people in connection with the incident.\nThe development has drawn attention locally, as pet owners and neighbours seek clarity on what happened to the cat and its expected litter.\n\n\nThe matter came to light when a woman residing in the area filed a complaint with local police, stating that her cat, which was due to give birth shortly, had vanished from outside her home. The animal had been well-known in the neighbourhood, and its unexpected disappearance alarmed residents, who feared for its safety given its condition.\nUpon receiving the complaint, police initiated an inquiry and began gathering information from people living nearby.\n\n\nDuring the early stages of the investigation, the police examined eyewitness accounts and available surveillance footage to identify individuals who might be linked to the cat’s disappearance. Based on this evidence, authorities identified nine persons allegedly involved in taking the animal.\nA first information report was filed, and the accused were booked under relevant sections of the law. Police said the group was detained and taken into custody for questioning as part of the ongoing investigation.\nThe identities and ages of the nine individuals have not been publicly disclosed, as investigators continue to piece together details of the case.\n\n\nNews of the pregnant cat’s disappearance and the subsequent police action drew reactions from residents, particularly pet owners and animal lovers in the vicinity. Many described the situation as distressing, noting the vulnerability of the animal given its advanced pregnancy.\nSeveral neighbours expressed hope that the cat would be located unharmed and returned to its home. Some criticised the alleged act as needless and cruel, saying that the community had formed a bond with the animal over time.\nAnimal welfare groups in the city have also taken note of the case, offering to assist with efforts to find the cat and ensure it receives any veterinary care it may need. Police confirmed that they are coordinating with such organisations as part of their efforts.\n\n\nAuthorities have appealed to anyone with additional information related to the incident to come forward and assist with the investigation. Additional statements are being recorded, and police are collecting further evidence to establish the facts and determine the motive behind the alleged act.\nOfficials said the investigation is ongoing and that appropriate action will be taken based on the findings. As of the time this article is published, the police haven’t found the cat and are continuing questioning related individuals.\nThe matter came to light when a woman residing in the area filed a complaint with local police, stating that her cat, which was due to give birth shortly, had vanished from outside her home. The animal had been well-known in the neighbourhood, and its unexpected disappearance alarmed residents, who feared for its safety given its condition.\nUpon receiving the complaint, police initiated an inquiry and began gathering information from people living nearby.\nDuring the early stages of the investigation, the police examined eyewitness accounts and available surveillance footage to identify individuals who might be linked to the cat’s disappearance. Based on this evidence, authorities identified nine persons allegedly involved in taking the animal.\nA first information report was filed, and the accused were booked under relevant sections of the law. Police said the group was detained and taken into custody for questioning as part of the ongoing investigation.\nThe identities and ages of the nine individuals have not been publicly disclosed, as investigators continue to piece together details of the case.\nNews of the pregnant cat’s disappearance and the subsequent police action drew reactions from residents, particularly pet owners and animal lovers in the vicinity. Many described the situation as distressing, noting the vulnerability of the animal given its advanced pregnancy.\nSeveral neighbours expressed hope that the cat would be located unharmed and returned to its home. Some criticised the alleged act as needless and cruel, saying that the community had formed a bond with the animal over time.\nAnimal welfare groups in the city have also taken note of the case, offering to assist with efforts to find the cat and ensure it receives any veterinary care it may need. Police confirmed that they are coordinating with such organisations as part of their efforts.\nAuthorities have appealed to anyone with additional information related to the incident to come forward and assist with the investigation. Additional statements are being recorded, and police are collecting further evidence to establish the facts and determine the motive behind the alleged act.\nOfficials said the investigation is ongoing and that appropriate action will be taken based on the findings. As of the time this article is published, the police haven’t found the cat and are continuing questioning related individuals.\nScan the QR code to download the News18 app and enjoy a seamless news experience anytime, anywhere.\nLatest Blogs",
        "link": "https://www.news18.com/cities/bengaluru-news/pregnant-cat-allegedly-kidnapped-sold-to-breeders-in-bengaluru-nine-booked-skn-ws-l-9890328.html",
        "date": "Mon, 9 Feb 2026 16:55:33 +0530",
        "fetched_at": "2026-02-11 03:14:40.362973"
    },
    {
        "title": "'If This Is The Quality Of Banking...': SC Raps Banks Over Handling Of 'Digital Arrest' Fraud Cases",
        "content": "The Supreme Court on Monday strongly criticised banks for their handling of “digital arrest\" fraud cases, questioning their professionalism and asking why suspicious transactions are not flagged in time, even as customers lose their life savings.\nA bench led by Chief Justice of India Suryakant was hearing the matter after the Centre placed status reports filed by the Ministry of Home Affairs (MHA) and the Ministry of Electronics and Information Technology (MeitY) outlining steps to curb such cyber frauds.\nThe Attorney General informed the court that data on these cases is being compiled and standard operating procedures are under preparation.\nHighlighting the human cost of such crimes, the CJI observed that losses cannot be viewed merely as statistics.\nAlso Read: How One ‘Kill Switch’ Button Could Crack Down On Digital Arrest Scams\nFor elderly couples and small depositors, he noted, the amounts siphoned off often represent their entire lifetime savings.\nThe court underlined that banks have a clear duty of care towards customers and questioned why red flags are not raised when suspicious transactions occur.\n“If this is the professionalism and quality of banking they are showing, then it is serious,\" the CJI remarked, expressing concern over delays by both public and private sector banks in responding to customer complaints.\nThe bench asked why digital arrest transactions cannot be immediately frozen and alerts sent to customers as well as cybercrime police stations when unusual activity is detected.\nThe Attorney General told the court that discussions are underway to finalise SOPs specifically for handling digital arrest fraud cases and to fast-track responses.\nWhile MHA and MeitY have submitted status reports, the Reserve Bank of India has also drafted an SOP detailing the steps banks should take upon receiving complaints.\nDirecting MHA to formally adopt and implement the SOP finalised on January 2, 2026, the court stressed the need to strengthen coordination among agencies to ensure recovery of stolen funds.\nIt also said High Courts should oversee compliance to prevent multiple, overlapping proceedings.\nThe amicus curiae assisting the court flagged systemic gaps, pointing out that banks often refuse compensation by claiming victims transferred money “voluntarily\", an argument he said ignores the coercive nature of such frauds.\nHe added that while RBI’s AI-based “Mule Hunter\" tool has been rolled out in 86 banks, other mandated safeguards, such as velocity checks to detect rapid fund movements, remain largely unimplemented.\nThe Supreme Court also questioned why the RBI has not taken tougher policy measures despite reports suggesting that over ₹54,000 crore has been siphoned off abroad.\nThe CJI asked whether such massive losses stem from negligence, collusion, or a reluctance to inconvenience customers.\nLatest Blogs",
        "link": "https://www.news18.com/india/if-this-is-the-quality-of-banking-sc-raps-banks-over-handling-of-digital-arrest-fraud-cases-9890124.html",
        "date": "Mon, 9 Feb 2026 16:14:08 +0530",
        "fetched_at": "2026-02-11 03:14:41.045882"
    },
    {
        "title": "‘Won’t Create Impediments To Completion Of SIR’: Supreme Court To Bengal Govt",
        "content": "The Supreme Court on Monday told the West Bengal government that it would not create any impediments to the completion of the Special Intensive Revision (SIR) of electoral rolls, even as it assured that hurdles in the process would be addressed.\n“We will remove hurdles, but we will not create any impediments in the completion of SIR. Let us be very clear about it,\" Chief Justice of India Surya Kant said during the hearing.\nSenior advocate DS Naidu, appearing in the matter, flagged concerns over the appointment of Electoral Registration Officers (EROs), arguing that they perform quasi-judicial functions and must be adequately trained and qualified. He said only 64 officers with adjudicatory experience were appointed, while others were selected based on pay parity, despite SIR decisions being open to challenge in appellate forums.\nThe bench also discussed the role of micro observers in the process. Senior advocate Shyam Divan argued that large-scale deletion of voter names could not be carried out through micro observers.\nThe CJI, however, noted that micro observers were part of a system created to assist EROs and AEROs, and that the final decision-making authority rested with the EROs. The court observed that if additional officers joined the process, the quality of decisions could improve.\nDuring the hearing, Divan highlighted the urgency of the matter, pointing out that the SIR process is scheduled to conclude on February 14. He said the draft electoral list contains 7.08 crore voters, of which 6.75 crore are mapped, while around 32 lakh remain unmapped and 1.36 crore fall under the “logical discrepancy\" category. The court said it would continue hearing the matter.\nLatest Blogs",
        "link": "https://www.news18.com/india/wont-create-impediments-to-completion-of-sir-supreme-court-to-bengal-govt-ws-l-9890162.html",
        "date": "Mon, 9 Feb 2026 16:09:16 +0530",
        "fetched_at": "2026-02-11 03:14:41.647234"
    },
    {
        "title": "Karnataka Govt's 'Generous' Distribution Of Cabinet Ranks Puts Strain On State Exchequer",
        "content": "The Siddaramaiah-led Congress government has sparked a heated debate regarding fiscal responsibility after significantly expanding the number of individuals holding ministerial status in Karnataka. In a recent move that has drawn sharp criticism from the opposition and fiscal watchdogs, the administration granted the status of Minister of State (MoS) to 54 additional individuals. CNN-News18 has exclusively accessed the documents giving MoS rank to Congress workers. This latest round of appointments brings the total number of people enjoying either Cabinet or MoS rank in the state to a staggering 149, raising serious concerns about the burgeoning burden on the public exchequer.\nThe vast majority of these new designees are Congress party leaders and workers currently serving as heads of various state-run boards and corporations. While the constitutional limit restricts the actual Cabinet to 34 ministers, the government has bypassed these constraints by according “ministerial status\" to a wide array of functionaries. A detailed breakdown reveals that beyond the 32 constitutional ministers, Cabinet rank has been bestowed upon 43 MLAs and 9 non-MLAs, including various advisors and special representatives. Furthermore, 11 MLAs and 54 non-MLAs have been elevated to the rank of Minister of State.\nThe financial implications of these appointments are substantial, as those with ministerial status are entitled to an extensive suite of perks and allowances. Each appointee receives a monthly salary of Rs 50,000, supplemented by a hospitality allowance of Rs 3,000 and a monthly house rent allowance of Rs 80,000. Maintenance and staff allowances add another Rs 20,000 per month. Additionally, the government provides for 1,000 litres of fuel per month — valued at approximately Rs 1,00,000 at current market rates — alongside daily travel allowances ranging from Rs 2,000 to Rs 2,500.\nThe perks extend into the administrative realm, with each rank-holder entitled to a personal secretary, multiple personal assistants, drivers, and attenders.\nFurthermore, the state covers full medical expense reimbursements and ensures these individuals receive protocol honors equivalent to state ministers at official government functions. Critics argue that at a time when the state is navigating significant financial commitments for its guarantee schemes, the generous distribution of such high-ranking statuses to nearly 150 individuals represents an unnecessary and avoidable drain on taxpayer money.\nLatest Blogs",
        "link": "https://www.news18.com/india/karnataka-govts-generous-distribution-of-cabinet-ranks-puts-strain-on-state-exchequer-ws-l-9889710.html",
        "date": "Mon, 9 Feb 2026 14:06:27 +0530",
        "fetched_at": "2026-02-11 03:14:42.356633"
    },
    {
        "title": "Chandrayaan-4: ISRO Has Found Safe Landing Site On The Moon For Vikram Lander",
        "content": "In a significant development for the ambitious Chandrayaan-4 mission, scientists at the Indian Space Research Organisation (ISRO) have identified a safe and relatively flat landing area in the Moon’s southern polar region, bringing the country a step closer to its first attempt at bringing lunar samples back to Earth.\nThe potential landing site has been located near the Mons Mouton mountain and is currently considered the safest option for the mission. According to a report by The Times of India, researchers from ISRO‘s Space Applications Centre carried out a detailed analysis using high-resolution images captured by the camera aboard Chandrayaan-2’s orbiter. Their study identified a stretch of nearly 1 sq km that appears most suitable for a safe landing.\nChandrayaan-4 is being described as ISRO’s most complex lunar mission so far. The mission architecture will include a propulsion module, descender, ascender, transfer module and a re-entry module. As per the plan, the Vikram lander will touch down on the lunar surface, after which samples will be collected with the help of robotic systems similar to the Pragyan rover. These samples will then be carried by the ascender module to lunar orbit and eventually transported back to Earth.\nSelecting the landing site remains the most critical and challenging part of the mission. ISRO engineers have laid down strict criteria for the location, including a ground slope of less than 10 degrees, minimal presence of large rocks, continuous sunlight availability for 11-12 days, direct radio communication with Earth and a surface with very few craters.\nEarlier studies had identified multiple potential regions near the Moon’s south pole. In the latest phase, scientists closely examined five areas around Mons Mouton. One of these was ruled out because it remains in permanent darkness. The remaining four sites, labelled MM-1, MM-3, MM-4 and MM-5, were studied in detail.\nUsing digital elevation models created at a fine resolution of 32 centimetres, researchers assessed each area for slope, height variations, sunlight exposure and potential risks. Among them, MM-4 emerged as the safest and most balanced choice. Located at 84.289 degrees south latitude and 32.808 degrees east longitude, the site has an average slope of around 5 degrees, considered ideal for landing operations.\nThe overall risk level at MM-4 was calculated at just 9.89%, with 568 safe landing grids identified in the area. Scientists also noted that shadows from nearby hills are limited, ensuring sufficient sunlight for powering the lander’s solar panels. By comparison, MM-1 and MM-3 showed risk levels above 12%, while MM-5 had very few safe grids for landing.\nResearchers say the study demonstrates how high-resolution imaging can support extremely precise landing decisions for future lunar missions. If the site is approved by the landing selection committee, the region could become the location where India attempts its first lunar sample return.\nA successful Chandrayaan-4 mission would place India among a select group of nations that have managed to bring back samples from the Moon or other celestial bodies.\nLatest Blogs",
        "link": "https://www.news18.com/india/chandrayaan-4-isro-has-found-safe-landing-site-on-the-moon-for-vikram-lander-ws-kl-9889412.html",
        "date": "Mon, 9 Feb 2026 12:30:41 +0530",
        "fetched_at": "2026-02-11 03:14:43.088074"
    },
    {
        "title": "Unauthorised Balloon Enters Restricted Airspace, Triggers Security Scare At Bengaluru Airport",
        "content": "A safety and security breach was reported at Kempegowda International Airport in Bengaluru after an unauthorised air balloon drifted into the highly restricted airfield, triggering an immediate safety scare.\nThe balloon, which reportedly belonged to a private construction company, BCD, based in Hoskote, was initially launched from the area but veered off course after operators allegedly lost control.\nThe unexpected entry of the aerial object into the airport perimeter led to heightened activity among security agencies, given the strict aviation protocols governing the airspace.\nUnder regulations set by the Directorate General of Civil Aviation (DGCA), the operation of any unmanned aerial vehicles, including drones and balloons, is strictly prohibited in the vicinity of airports to prevent potential collisions with aircraft.\nCentral Industrial Security Force (CISF) personnel intercepted and seized the balloon after it was spotted over the airport premises. A formal complaint has been lodged at the Kempegowda International Airport Police Station against the private entity responsible for the launch.\nDevanahalli police have registered a case and are investigating possible technical failures or negligence that led to the incident.\nLatest Blogs",
        "link": "https://www.news18.com/india/unauthorized-balloon-enters-restricted-airspace-triggers-security-scare-at-bengaluru-airport-ws-l-9889376.html",
        "date": "Mon, 9 Feb 2026 12:12:33 +0530",
        "fetched_at": "2026-02-11 03:14:43.751904"
    },
    {
        "title": "PM Modi Extends Birthday Wishes To Eknath Shinde: 'Working Tirelessly Towards Maharashtra's Development'",
        "content": "Prime Minister Narendra Modi on Monday wished Maharashtra Deputy Chief Minister Eknath Shinde a happy birthday and hailed his work for the state’s development.\nPM Modi said Shinde is working diligently to advance Maharashtra’s development and realise the vision of Shiv Sena founder Bal Thackeray.\n“Birthday wishes to Shri Eknath Shinde Ji. He is working tirelessly towards furthering Maharashtra’s development and realising the dreams of Pujya Balasaheb Thackeray and Dharamveer Anand Dighe. Praying for his long life and good health,\" Modi said in a post on X.\nBirthday wishes to Shri Eknath Shinde Ji. He is working tirelessly towards furthering Maharashtra’s development and realising the dreams of Pujya Balasaheb Thackeray and Dharamveer Anand Dighe. Praying for his long life and good health.@mieknathshinde— Narendra Modi (@narendramodi) February 9, 2026\nMeanwhile, Maharashtra Chief Minister Devendra Fadnavis also took to X and extended birthday greetings to Shinde.\n“Heartiest birthday greetings to Deputy Chief Minister of Maharashtra, Shri Eknath Shinde ji Wishing you a long life and good health!,\" he wrote on X.\nHeartiest birthday greetings to Deputy Chief Minister of Maharashtra, Shri Eknath Shinde ji!Wishing you a long life and good health!महाराष्ट्राचे उपमुख्यमंत्री श्री. एकनाथ शिंदे जी यांना वाढदिवसाच्या हार्दिक शुभेच्छा!@mieknathshinde pic.twitter.com/o6uVRsrMo7\n— Devendra Fadnavis (@Dev_Fadnavis) February 9, 2026\nShinde, leader of the Shiv Sena and a member of Maharashtra’s Mahayuti government, turned 62 on Monday.\nLatest Blogs",
        "link": "https://www.news18.com/india/pm-modi-extends-birthday-wishes-to-eknath-shinde-working-tirelessly-towards-maharashtras-development-9889140.html",
        "date": "Mon, 9 Feb 2026 11:01:41 +0530",
        "fetched_at": "2026-02-11 03:14:44.360192"
    },
    {
        "title": "Parliament Budget Session 2026 Live: Lok Sabha Adjourned After Rahul Gandhi Rakes Up China Again",
        "content": "Budget Session Parliament 2026 Live Updates: Lok Sabha has been adjourned for the day and will resume proceedings on Tuesday at 11 am. On Monday, Opposition parties also announced plans to move a no-confidence motion against Lok Sabha Speaker Om Birla, citing a lack of alternatives. The development comes amid growing tensions and repeated disruptions in the Lower House.\nParliament had reconvened today following a stormy week marked by repeated disruptions over the India-US trade agreement and references to an unreleased book by former Army chief General MM Naravane on the 2020 Galwan clash with China.\nLoP Rahul Gandhi again raked up the 2020 Galwan clash today. Addressing the Lower House, he said, “The Speaker commited to us that I will be allowed before budget discussion. So I want to know from Chair if I will be allowed to make those points,” referring to an unreleased book by former Army Chief General MM Naravane on the Galwan clash with China. Speaker Om Birla replied that no such notice had been received and urged MPs to proceed with the Budget discussion. Soon after the House was adjourned for the day.\nWith much of last week’s legislative business disrupted, Opposition leaders, including Rahul Gandhi, held a coordination meeting at Rajya Sabha Leader of the Opposition Mallikarjun Kharge’s office at 10 am. The first phase of the Budget Session is scheduled to conclude on February 13, after which Parliament will break for recess before resuming on March 9. Follow for live updates.\nFinance Minister Nirmala Sitharaman addresses the Rajya Sabha amid debate on Union Budget.\nDMK MP P Wilson addressed the Rajya Sabha on Monday.\nOpposition parties on Monday announced plans to move a no-confidence motion against Lok Sabha Speaker Om Birla, citing a lack of alternatives amid repeated disruptions in the House. The Opposition has cited multiple reasons for moving a no-confidence motion against the Speaker, alleging “partisan” conduct. Read more\nAfter Rahul Gandhi claimed he was allowed to speak in the House on Monday again, Parliamentary Affairs Minister Kiren Rijiju clarified that the Speaker had taken the initiative to resolve the deadlock and that Rahul Gandhi’s remarks were “not 100 percent correct.” He added that the Speaker had assured all parties, not just the Congress MP, that if a solution was reached, Gandhi, followed by other party leaders and the Parliamentary Affairs Minister, would speak. Following the exchange, the Lok Sabha was adjourned until the next day.\nThe Lok Sabha proceedings resumed at 2 pm after being adjourned twice on Monday amid continued protests by Opposition MPs. Rahul Gandhi addressed the House, stating, “The Speaker commited to us that I will be allowed before budget discussion. So I want to know from chair if I will be allowed to make those points,” referring to an unreleased book by former Army Chief General MM Naravane on the 2020 Galwan clash with China. Speaker Om Birla replied that no such notice had been received and urged MPs to proceed with the Budget discussion.\nCongress leader and LoP Rahul Gandhi addressed the Lok Sabha on Monday.\nBoth Houses of Parliament, Lok Sabha and Rajya Sabha, congratulated the Indian Under-19 cricket team for their ICC Under-19 World Cup 2026 victory, achieved by defeating England in the final in Harare, Zimbabwe.\nLok Sabha on Monday continued to see repeated disruptions by the Opposition benches as they demanded a discussion the India-US trade framework in Parliament. Opposition MPs demanded that the Leader of Opposition, Rahul Gandhi, be allowed to speak on the India-US interim deal.\nUnion Parliamentary Affairs Minister Kiren Rijiju on Monday blamed the Congress for repeated disruptions in the Lok Sabha, saying the debate on the Motion of Thanks to the President’s Address could not be held due to the Opposition’s conduct. He said the Speaker was “hurt” by the behaviour of Congress MPs and accused Leader of Opposition Rahul Gandhi of deliberately stalling proceedings. “The House is stalled solely due to Rahul Gandhi’s stubbornness,” Rijiju said. He warned that if disruptions continue and the Budget is passed by a voice vote, Opposition MPs would lose their opportunity to speak, holding the Congress responsible for the impasse.\nThe Lok Sabha has been adjourned until 2 pm amid a walkout by Opposition MPs.\n\nOpposition MPs staged a walk out from the Rajya Sabha on Monday, alleging Leader of Opposition in Lok Sabha, Rahul Gandhi, was prevented from speaking in the lower house. The walkout was staged in protest against what the Opposition described as unfair treatment and suppression of its voice during proceedings.\nThe Opposition has cited multiple reasons for moving a no-confidence motion against Lok Sabha Speaker Om Birla, alleging “partisan” conduct. They claim the Speaker’s rulings have consistently favoured the government, leaving the Opposition with little room to influence proceedings. They further stated that women MPs in the Opposition feel slighted after the Speaker reportedly stated that he prevented Prime Minister Narendra Modi from entering the House out of concern over potential disruptions by female MPs. Additionally, the Leader of the Opposition has been repeatedly denied the opportunity to speak, and several rulings from the Chair are seen as inconsistent with previous decisions, undermining parliamentary norms and prompting calls for accountability, they added.\nOpposition parties have announced plans to move a no-confidence motion against Lok Sabha Speaker Om Birla, citing a lack of alternatives. “We are planning to bring no-confidence against Speaker….since we are left with no other option,” sources in the Opposition said. The development comes amid growing tensions and repeated disruptions in the House over key legislative issues.\nThe Lok Sabha has been adjourned until 12 noon following disruptions caused by opposition MPs, who raised slogans during the proceedings. Lawmakers from several parties staged a protest over ongoing issues, forcing the Speaker to temporarily suspend the House to restore order.\nThe Lok Sabha Proceedings have resumed on Monday.\nBoth Houses of Parliament are set to begin discussion on the Union Budget 2026-27 on Monday, which was presented by Finance Minister Nirmala Sitharaman on February 1. Sitharaman presented the Union Budget 2026-27 in Lok Sabha, for the ninth consecutive time.\nThe Lok Sabha will begin with Question Hour, after which ministers from culture, finance, education, environment, labour and other ministries will table official papers. The House will then take up issues raised under Rule 377 before continuing the general debate on the Union Budget 2026–27.\nDMK MP TR Baalu moved an Adjournment Motion notice in the Lok Sabha on Monday, seeking a discussion on the framework of the Bilateral Trade Agreement (BTA) between India and the United States.\nAfter disruptions wiped out much of last week’s agenda, Opposition leaders will meet at Rajya Sabha Leader of Opposition Mallikarjun Kharge’s office at 10 am, ahead of today’s session.\nLatest Blogs",
        "link": "https://www.news18.com/india/parliament-budget-session-2026-live-lok-sabha-rajya-sabha-rahul-gandhi-mallikarjun-kharge-pm-modi-congress-bjp-latest-news-liveblog-9888806.html",
        "date": "Mon, 9 Feb 2026 20:38:47 +0530",
        "fetched_at": "2026-02-11 03:14:45.775147"
    },
    {
        "title": "‘Kerala Will See Change’: Amit Shah Slams ‘Failed Development’ Under Communists Ahead Of Polls",
        "content": "With months left for the Kerala Assembly elections, Union Home Minister Amit Shah on Sunday criticised the communist government in the state and said India must move away from communist ideology. He said Kerala would soon see change.\n\n\nSpeaking at an event titled ‘Chhattisgarh@25: Shifting The Lens’, the Union Home Minister said the government intends to completely eliminate Maoist influence and urged people to recognise what he described as the damaging effects of communist ideology.\nAccording to him, regions under communist rule have lagged in development. He also alleged that, in the name of tribal welfare, people were pushed towards armed activity, calling the ideology destructive in nature.\nShah said, “We will uproot the Maoist problem from its roots. But the public of this country must understand this ideology. Wherever communist rule has existed, development has failed to take place. In the name of tribal welfare, people were instead handed weapons. This ideology itself is a symbol of destruction.\"\nHe added that communists barely exist today. “Today, communists have to be searched for with a telescope- they barely exist anymore. Only Kerala remains, and this time that too will come to an end. The people themselves will do it. The people of Thiruvananthapuram have already begun,\" he said.\n\n\nShah also appealed to Maoists to surrender and said the government would welcome them. He said the country needs to get rid of the “destructive\" communist ideology at the earliest.\nLatest Blogs",
        "link": "https://www.news18.com/politics/kerala-will-see-change-amit-shah-slams-failed-development-under-communists-ahead-of-polls-9888819.html",
        "date": "Mon, 9 Feb 2026 08:27:46 +0530",
        "fetched_at": "2026-02-11 03:14:46.404405"
    },
    {
        "title": "After Poll Setback, Prashant Kishor Launches ‘Bihar Navnirman Yatra’ To Rebuild Jan Suraaj",
        "content": "Jan Suraaj founder Prashant Kishor on Sunday launched the ‘Bihar Navnirman Yatra’ from West Champaran, saying the campaign aims to rebuild and strengthen the organisation across the state.\nEven after attracting significant public attention, Jan Suraaj failed to win a single seat in the 2025 Bihar Assembly elections, where it contested 238 seats.\nAfter launching the yatra, Kishor said, “The yatra will focus on rebuilding and strengthening the party’s organisation across the state to present an honest and accountable political alternative in Bihar.\"\nHe said the party has continued its engagement with the public even after the Assembly elections and that the yatra will help expand and reorganise its grassroots network at the district level.\n“To ensure that our Bihar Navnirman Abhiyan materialises seamlessly on the ground, I will spend some time in each district, and meet old associates and new aspiring ones to strengthen the party’s organisational structure,\" Kishor said.\nHe said that during his yatra, the party will address the issue of a poll promise related to financial assistance for women under the Mukhyamantri Mahila Rozgar Yojana.\nUnder the scheme, the state government transferred Rs 10,000 each to 1.56 crore women in Bihar in multiple phases, with a large number receiving the amount ahead of the elections. The government has said the beneficiaries will later be eligible to receive up to Rs 2 lakh each to expand their businesses.\n“Jan Suraj workers would reach households across the district to ensure that the benefit is delivered to women. Government’s failure to fulfil the commitment would indicate that the announcement was made only for electoral gains,\" Kishor claimed.\nThe Bihar cabinet on January 29 cleared up to Rs 2 lakh in additional assistance for selected beneficiaries of the Mukhyamantri Mahila Rozgar Yojana after a six-month review.\n“The amount will be given in phases to the women entrepreneurs who will properly utilise the Rs 10,000 fund at the end of the assessment period,\" a statement issued by the government noted.\n(With inputs from PTI)\nLatest Blogs",
        "link": "https://www.news18.com/india/after-poll-setback-prashant-kishor-launches-bihar-navnirman-yatra-to-rebuild-jan-suraaj-ws-l-9888664.html",
        "date": "Sun, 8 Feb 2026 23:09:07 +0530",
        "fetched_at": "2026-02-11 03:14:47.011558"
    },
    {
        "title": "Delhi CM Rekha Gupta Launches 500 EV Buses, DTC Fleet Touches 4,286",
        "content": "Chief Minister Rekha Gupta said that the Delhi government on Sunday launched 500 electric buses, taking the total EV fleet of the Delhi Transport Corporation (DTC) to 4,286.\nShe attended the launch of 500 EV buses and the Delhi–Panipat inter-state bus service at Ramlila Maidan.\nRekha Gupta said that Ramlila Maidan symbolises a turning point in Delhi’s political history, recalling how previous governments had “deceived the people and betrayed their trust\" at the same venue. She added that it was now through Ramlila Maidan that her government had earned the confidence of Delhi’s citizens and presented them with a promise of development.\nVIDEO | Delhi Chief Minister Rekha Gupta attends the launch of 500 EV buses and the Delhi–Panipat inter-state bus service at Ramlila Maidan. Rekha Gupta says, “This is the very Ramlila Maidan where previous governments deceived the people of Delhi and betrayed their trust. Today,… pic.twitter.com/GMZyB16L59— Press Trust of India (@PTI_News) February 8, 2026\n“This step will not only boost transportation and connectivity in the city but also help in cutting down air pollution,\" Gupta said at the launch event which was also attended by BJP president Nitin Nabin.\nShe said by 2028, the DTC plans to increase its total bus fleet to 14,000. “These EV buses will help improving the air quality and the transport needs of the city. These are AC buses, low-floor with panic buttons and several other features,\" she added.\nTransport Minister Pankaj Singh said that three inter-state bus services connecting Delhi and Panipat have also been launched.\n“Delhi government is constantly working on the transport sector. One such measure is providing last mile connectivity to residents. We have recently signed an MoU with Bharat Taxi in this regard and soon a new EV policy and an E-rickshaw policy will also be in place,\" the chief minister said.\nDelhi Minister Parvesh Verma on Sunday spoke about the launch of 500 electric buses and the Delhi–Panipat inter-state bus service at Ramlila Maidan, saying the developments marked the beginning of a larger transformation.\nHe said the initiatives were “just the trailer\" and that the “full picture is yet to come,\" recalling that exactly one year ago the people of Delhi had given the Bharatiya Janata Party 48 seats.\nThanking the public for their support, Verma added that several projects had already been initiated and many more would be rolled out in the coming months.\nLatest Blogs",
        "link": "https://www.news18.com/cities/new-delhi-news/delhi-cm-rekha-gupta-launches-500-ev-buses-dtc-fleet-touches-4000-ws-l-9888405.html",
        "date": "Sun, 8 Feb 2026 20:00:34 +0530",
        "fetched_at": "2026-02-11 03:14:47.644833"
    },
    {
        "title": "‘Not Surrender, It’s Negotiation’: Pakistani Analyst Decodes India-US Trade Agreement | Exclusive",
        "content": "Pakistani analyst Najam Sethi called the India-US interim trade agreement “a negotiation\".\n“It is not a surrender. It is a negotiation. These decisions don’t happen overnight. The negotiations must have gone on for months. PM Modi was quiet throughout,\" said Sethi.\n“It is not zero tariff on all items…It includes items that are no threat to Indian industries,\" he said\nThe analyst said PM Modi negotiated smartly while the Indian opposition is creating unnecessary fuss. Sethi said that India’s zero-tariff concessions apply only to a small, specific list of US items such as certain wines, cosmetics, soybean oil, tree nuts, and processed fruits, not a broad flood of goods These reductions cover very few products and won’t significantly hurt domestic sectors or undermine Make in India, as the deal protects sensitive areas like dairy, grains, and key agriculture, he said.\nMany in Pakistan, including analysts like Sethi, see this as a smart bargain by Modi and India gains better access without losing much, making the opposition’s noise seem unnecessary and politically motivated.\n\n\n\nUnion Commerce Minister Piyush Goyal on Saturday underlined the government’s commitment to farmers while concluding the framework of the bilateral trade agreement with the US. In his statement, the Minister said that dairy, fruits, vegetables, spices, and other grains have been protected in the India-US trade deal to safeguard the interests of domestic farmers.\nIn a post on X, Piyush Goyal said the trade deal will mark a powerful step forward in the direction of a self-reliant India.\n“Farmers Safe, Country Developed… In the India-US trade agreement, dairy, fruits, vegetables, spices, and other grains have been protected. This will safeguard the interests of domestic farmers, strengthen local agriculture through preferential access to such a large market, and mark another powerful step forward in the direction of a self-reliant India,\" he said.\nBoth India & US are working to create resilient supply chains for an uninterrupted supply of critical minerals to support industries.#IndiaUSJointStatement pic.twitter.com/urzZFtZF3S— Piyush Goyal (@PiyushGoyal) February 7, 2026\n\n\n“India is not losing anything in trade deal and even Pakistani voices have openly admitted that India lost nothing but only the Indian opposition spreading fear. Domestic political outrage is not linked from actual economic impact and the opposition is creating anxiety unnecessarily,\" said Indian government sources.\nPakistani commentators see continuity in India’s trade posture and they also feel it was India’s calculated move without losing anything.\nLatest Blogs",
        "link": "https://www.news18.com/india/not-surrender-its-negotiation-pakistani-analyst-decodes-india-us-trade-agreement-exclusive-ws-l-9888326.html",
        "date": "Sun, 8 Feb 2026 18:57:26 +0530",
        "fetched_at": "2026-02-11 03:14:48.353281"
    },
    {
        "title": "Bengaluru–Mangaluru Vande Bharat Express Soon? Here's What Railway Minister Said",
        "content": "\n\nCurrently, Karnataka is served by 22 Vande Bharat services (11 pairs), operating on both originating and terminating routes, which connect multiple cities across the state. Of these, 14 services either originate from or terminate in the Bengaluru region, highlighting the city’s role as a major rail hub.\n\n\nThe proposed new service will run on the Bengaluru–Mangaluru route and is expected to significantly cut travel time between the state capital and the coastal city.\nAddressing a press conference in Bengaluru on Saturday, Union Railway Minister Ashwini Vaishnaw said the service would be launched once key preparatory work is completed.\n“A new Vande Bharat service connecting Bengaluru and Mangaluru will be launched soon after the completion of electrification and safety certifications,\" Vaishnaw said.\nThe minister added that Karnataka is witnessing major upgrades in railway infrastructure, noting that a record ₹7,748 crore has been allocated for the state’s rail sector.\n\n\nThe upcoming Vande Bharat Express is expected to be equipped with several advanced safety and comfort features, including:\n\n\n\n\n\n\n\n\n\n\n\n\nOnce operational, the new Bengaluru–Mangaluru Vande Bharat is expected to modernise rail travel in Karnataka further and improve connectivity between the state’s interior and its coastal belt.\nLatest Blogs",
        "link": "https://www.news18.com/india/bengaluru-mangaluru-vande-bharat-express-soon-heres-what-railway-minister-said-ws-l-9888220.html",
        "date": "Sun, 8 Feb 2026 16:15:22 +0530",
        "fetched_at": "2026-02-11 03:14:49.038153"
    },
    {
        "title": "IWT Paused, Infra Fast-Tracked, Pakistan Irked: A Look At India’s Projects On Chenab",
        "content": "As India placed the Indus Waters Treaty (IWT) in abeyance in April 2025 following the Pahalgam attack, it has shifted from a policy of “restraint\" to one of “strategic execution\".\nBy treating the treaty as suspended, India is no longer following data-sharing or prior-notification requirements with Pakistan for new or existing projects on the Chenab River.\n\n\nThe IWT is a landmark water-sharing agreement signed on September 19, 1960 between India and Pakistan, brokered by the World Bank. It established a framework for managing and distributing the waters of the Indus River system, which has remained largely functional despite decades of regional conflict.\nALSO READ | Modi Govt Kicks Off Mega Dam Project On Chenab After Pausing Indus Treaty With Pakistan | Exclusive\nThe treaty divides the six major rivers of the Indus basin into two groups:\nEastern Rivers (Ravi, Beas, Sutlej): Allocated to India for unrestricted use.\nWestern Rivers (Indus, Jhelum, Chenab): Allocated to Pakistan.\nIndia is permitted limited “non-consumptive\" use of these rivers for domestic, agricultural, and run-of-the-river hydroelectric power generation, provided it follows strict design specifications to avoid harming Pakistan’s interests.\nIt provides for a Permanent Indus Commission (PIC), abilateral body with a commissioner from each country tasked with data exchange, annual meetings, and initial conflict resolution. In case of disputes, it has a three-tiered mechanism starting with the PIC, followed by a Neutral Expert for technical issues, and finally an ad-hoc Court of Arbitration for major disputes.\n\n\n\nAs India held the IWT in abeyance, it has halted meetings of the Permanent Indus Commission and fast-tracked projects on western rivers (like Ratle and Pakal Dul) without the previously required technical notifications to Pakistan.\nIt has also rejected rulings from the Court of Arbitration, which India currently labels as “illegal.\"\n\n\nSawalkote HEP (1,856 MW): This is the first major new project to receive a “green light\" post-IWT halt. On February 5, 2026, NHPC invited international tenders worth ₹5,129 crore for its construction. It has been designated a “Project of National Importance\" and will be the largest in J&K once completed (estimated 9-year timeline).\nDulhasti Stage-II (260 MW): Approved by a Ministry of Environment panel in December 2025. This project is an extension of the existing Stage-I and was cleared specifically under the logic that IWT notification requirements are currently void.\nPakal Dul HEP (1,000 MW): Being fast-tracked for a “non-negotiable\" commissioning deadline of December 2026. Crucially, this is India’s first storage project on a western river, giving it the ability to regulate water flow timing into Pakistan.\nKiru (624 MW) & Kwar (540 MW): Both are run-of-the-river projects being accelerated. Kiru is targeted for December 2026, while Kwar is now set for March 2028.\nRatle HEP (850 MW): Long-contested by Pakistan, this project’s construction is now being treated as a sovereign decision. It is being fast-tracked for a 2028 completion.\n\n\nIndia has initiated desilting and reservoir enhancement at the Salal and Baglihar projects to improve storage and power generation, activities previously restricted by the treaty.\nSince the halt, India has reportedly restricted or fluctuated water flows from existing dams like Baglihar and Salal. In May 2025, downstream flows at Pakistan’s Marala headworks reportedly dropped by up to 90% during maintenance operations.\nIn June 2025, India initiated a feasibility study for a 113-km canal to divert surplus water from the Chenab basin in J&K toward the Ravi and Beas systems in Punjab and Rajasthan.\nWith Agency Inputs\nLatest Blogs",
        "link": "https://www.news18.com/india/iwt-paused-infra-fast-tracked-pakistan-irked-a-look-at-indias-projects-on-chenab-ws-kl-9888041.html",
        "date": "Mon, 9 Feb 2026 11:03:33 +0530",
        "fetched_at": "2026-02-11 03:14:49.756343"
    },
    {
        "title": "TVK Chief Vijay Likely To Contest From These Two Seats In 2026 Tamil Nadu Elections",
        "content": "A top Tamilaga Vettri Kazhagam (TVK) source has confirmed that actor-turned-politician and party chief Vijay is likely to contest from two seats in the Tamil Nadu 2026 assembly elections.\nAccording to the sources, Vijay has finalised Virugambakkam constituency in Chennai as his electoral battleground. The actor-turned-politician is also expected to file his nomination from Trichy East, signaling a strategic push to expand his party’s presence across key urban and regional strongholds.\nThe confirmation comes amid widespread speculation about the actor’s political debut at the state level.\nEarlier, Vijay stated that his party, the TVK, has emerged as a major political force with the backing of the people and claimed it is the only party capable of defeating the DMK in the upcoming elections.\nVijay dismissed speculations of a triangular or multi-cornered contest, stating that the true electoral battle would be a straight fight between the TVK and the ruling DMK, which he confidently predicted would face defeat.\n“People talk about triangular or four-corner contests. One is represented by the TVK backed by the people, the second is DMK, and the third is BJP and its many allies. Only the TVK, which is a people’s force alone can defeat the DMK,\" he added.\nLatest Blogs",
        "link": "https://www.news18.com/politics/tvk-chief-vijay-likely-to-contest-from-these-two-seats-in-2026-tamil-nadu-elections-ws-kl-9888129.html",
        "date": "Sun, 8 Feb 2026 17:38:54 +0530",
        "fetched_at": "2026-02-11 03:14:50.388069"
    }
]