[
    {
        "title": "Piyush Goyal lost moral authority to continue as Minister, says Samyukt Kisan Morcha",
        "content": "The View From India Looking at World Affairs from the Indian perspective. First Day First Show News and reviews from the world of cinema and streaming. Today's Cache Your download of the top 5 technology stories of the day. Science For All The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point Decoding the headlines with facts, figures, and numbers Health Matters Ramya Kannan writes to you on getting to good health, and staying there The Hindu On Books Books of the week, reviews, excerpts, new titles and features. Union Minister of Commerce and Industry Piyush Goyal. File | Photo Credit: ANI Countering Union Commerce Minister Piyush Goyal’s statement in Parliament that “India’s sensitive sectors of agriculture and dairy have been excluded” in the Indo-U.S. bilateral trade deal, the Samyukt Kisan Morcha (SKM) said here on Wednesday (February 4, 2026) that the government’s stand was contradictory to the claim made by U.S. Secretary of Agriculture Brooke Rollins that the U.S. would “export more American farm products to India’s massive market, lifting prices, and pumping cash into rural America.” The umbrella body of several farmers’ organisations sought clarification from the Centre on Ms. Rollins’s claim that the deal would help to reduce the U.S.’s $1.3 billion agricultural trade deficit with India. “The Commerce Minister did not object or deny the claim of Ms. Rollins. Mr. Goyal’s statement is unscrupulous and aimed to misguide the people, especially the farmers, and hence he has no moral authority to continue in the constitutional position,” the SKM statement said. Parliament Budget Session Day 6: Follow the updates from February 4, 2026 The SKM warned Prime Minister Narendra Modi that the country would witness a repeat of farmers’ protest similar to 2020-21 (against the three farm laws) if any agricultural product or dairy was included in the U.S. trade deal. “The Prime Minister remains silent on this most serious and sensitive issue affecting the livelihood of crores of working people across India,” the SKM added. The farmers’ body said Mr. Goyal’s stand that Mr. Modi had “always protected the agriculture and dairy sectors and has never compromised on their interests” was factually wrong and dishonest. Despite a promise by Mr. Modi that he would stand with farmers, the SKM said the Centre lifted the 11% import duty on cotton in India. “The entire cotton area is the highest peasant suicide-prone region of India. The elimination of import duty on cotton further eliminated the livelihood security of lakhs of cotton farmer households. The cotton import from the U.S. surged 95.50% from $199.30 million in January-November 2024 to $377.90 million in January-November 2025. Wheat and soya bean oil imports also surged during this period,” the SKM said. “The U.S trade deal also targets government procurement and minimum support price and subsidies. The deal will help to overcome a $40 billion trade deficit and solve the glut in the U.S. crop market,” the organisation added. Citing Mr. Goyal’s statement that the deal was not yet finalised, the SKM asked why the Prime Minister was forced to announce the deal without finalising the details of the agreement, and alleged that it was done under the pressure of U.S. President Donald Trump. The SKM added that it exposed the sad plight of governance under the Modi government, the absolute compromise on protecting the sovereignty of India and abject surrender to U.S. imperialism. Agriculture / Parliament proceedings / parliament / Lok Sabha / international relations / international (foreign) trade / India-United States Copyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/piyush-goyal-lost-moral-authority-to-continue-as-minister-says-samyukt-kisan-morcha/article70592447.ece",
        "date": "Wed, 04 Feb 2026 22:29:31 +0530",
        "fetched_at": "2026-02-04 17:11:04.761404"
    }
]