[
    {
        "title": "Nellore District Science Centre curator bags award for promoting education in rural areas",
        "content": "Published - February 07, 2026 12:02 am IST - VIJAYAWADA Samagra Shiksha State Project Director B. Srinivasa Rao on Friday (February 06, 2026) said that the Nellore District Science Centre curator N. Subramanyam has bagged the “Shikshagraha Leadership Award”, presented to him in recognition of his relentless efforts to promote science education in rural areas for nearly three decades. Announcing that that award is instituted by Infosys co-founder S.D. Shibulal, Mr. Rao said that it was presented during the national educators conference “InvokED 5.0: Mission to Movement” held in Bengaluru on Friday and it comprised a national citation and a financial grant of ₹10 lakh. “The encouragement and support from Mr. Srinivasa Rao played a vital role in this achievement,” said Mr. Subrahmanyam expressing his gratitude. Mr. Rao said out of 6,500 teachers across India, only three were selected based on leadership qualities, social impact, and contributions to rural education and Mr. Subrahmanyam was one among these outstanding educators. The award was presented by S.D. Shibulal, founder, ShikshaLokam and co-founder of Infosys and his wife Kumari Shibulal, founder and Chairperson of the Shibulal Family Philanthropic Initiatives. Mr. Subrahmanyam, who is currently serving as the Curator of the District Science Centre, Chemudugunta, Nellore,has restored the Mobile Science Lab (Space on Wheels), indoor and outdoor exhibits, integrated QR codes with video explanations, implemented Astro Tourism, Cosmos Digital Learning, STEM-based experiential education and continues to lead programmes such as Budding Scientists, INSPIRE Awards and the Rural Children Research Centre. Recognising his innovative initiatives, the Samagra Shiksha has consistently encouraged and provided him financial support, including monthly transport charges for operating the Mobile Science Lab. Published - February 07, 2026 12:02 am IST Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/nellore-district-science-centre-curator-bags-award-for-promoting-education-in-rural-areas/article70601367.ece",
        "date": "Sat, 07 Feb 2026 00:02:16 +0530",
        "fetched_at": "2026-02-06 18:43:08.136271"
    }
]