[
    {
        "title": "Chief Minister Stalin announces Kalaignar Ninaivu Kalaithurai Vithagar award for film veterans M.N. Rajam and S.P. Muthuraman",
        "content": "News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Published - February 06, 2026 11:38 pm IST - CHENNAI Tamil Nadu Chief Minister M.K. Stalin on Friday announced that the Kalaignar Ninaivu Kalaithurai Vithagar Award for 2024 and 2025 will be conferred on veteran actor M.N. Rajam and veteran filmmaker S.P. Muthuraman, respectively. Rajam is one of the senior-most artistes in Tamil cinema, who began her acting career in stage plays at a young age and made her film debut as a child artiste in 1949. She rose to become a leading heroine in the 1950s and 1960s and earned wide appreciation for her performances in several successful films, including Rathakkanneer, Pennin Perumai, Pudhaiyal, Thangapathumai, Nadodi Mannan, Pasamalar, Thaali Baakiyam and Mangaiyar Thilakam. She has acted in more than 200 Tamil films, later taking on supporting roles such as mother and mother-in-law, and secured a lasting place in the hearts of the audience. Her mother roles in films, such as Arangetram and Oorukku Uzhaippavan, are particularly remembered. She is also the first woman member registered with the South Indian Artistes’ Association and has received several awards for her long service to the field of arts, an official release said. Muthuraman began his career as an assistant director with the film Kalathur Kannamma in 1960 and went on to become one of the most successful commercial directors in Tamil cinema from the 1970s through the 1990s. He has directed more than 70 Tamil films. Some of his notable films, include Aarilirunthu Arubathu Varai, Bhuvana Oru Kelvikuri (1977), Oru Oodhappoo Kan Simittugirathu (1978), Murattu Kaalai, Engeyo Ketta Kural (1982), and Sakalakala Vallavan (1985). He has received several awards for his contributions to Tamil cinema and is also well known for his simplicity, integrity, and humility. Both awardees will receive a cash prize of ₹10 lakh each along with a memento from the Chief Minister, the release added. Published - February 06, 2026 11:38 pm IST Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/chief-minister-stalin-announces-kalaignar-ninaivu-kalaithurai-vithagar-award-for-film-veterans-mn-rajam-and-sp-muthuraman/article70601513.ece",
        "date": "Fri, 06 Feb 2026 23:38:54 +0530",
        "fetched_at": "2026-02-06 18:34:48.436317"
    },
    {
        "title": "Book launch directed against CPI(M): Ragesh",
        "content": "News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Published - February 06, 2026 11:31 pm IST - KANNUR Communist Party of India (Marxist) [CPI(M)] district secretary K.K. Ragesh on Friday (February 6) alleged that the release of book authored by V. Kunhikrishnan, who was expelled from the CPI(M) Kannur district committee and its primary membership for alleging embezzlement of martyr’s fund by the party, was used as a platform by anti-CPI(M) forces. Addressing a press conference, Mr. Ragesh said several participants attended the book launch under the “Left label”, but maintained that the programme was essentially directed against the CPI(M). He criticised the speech delivered by Joseph C. Mathew at the event, saying that it resembled that of a “former CPI(M) leader,” and said the party did not require advice from him. “Anyone with basic common sense can understand the intention behind organising such a programme,” he said. Mr. Ragesh further alleged that the book released by Mr. Kunhikrishnan amounted to personal attack on MLA T.I. Madhusoodanan. He maintained that no funds had been diverted and that the party had suffered no financial loss. All figures mentioned in the book were incorrect, he alleged. Published - February 06, 2026 11:31 pm IST Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/kerala/book-launch-directed-against-cpim-ragesh/article70600193.ece",
        "date": "Fri, 06 Feb 2026 23:31:44 +0530",
        "fetched_at": "2026-02-06 18:34:49.574499"
    },
    {
        "title": "Prime Minister Narendra Modi must answer questions related to national security in Parliament, says Congress MP",
        "content": "News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Updated  - February 06, 2026 11:05 pm IST - CHENNAI Congress Member of Parliament Sudha Ramakrishnan on Friday dismissed allegations that women opposition members had intended to protest against Prime Minister Narendra Modi in an “unprecedented manner” in the Lok Sabha. She charged Mr. Modi of using these allegations as a pretext to avoid answering questions related to India’s national security. Ms. Sudha told The Hindu  that the Leader of Opposition, Rahul Gandhi, raised questions over General Naravane’s account of how Government of India responded during the Chinese incursion into Indian territory in 2020, which was published in a magazine, and about Jeffrey Epstein files linking Mr. Modi. “Why can’t we debate it? The magazine has only published what was there in General Naravane’s unpublished book. And Epstein is a child sex offender. Why can’t Mr. Modi clarify these issues in the Parliament? What does Epstein mean by Mr. Modi dancing in Israel (as claimed in Epstein’s emails)? Shouldn’t issues relating to national security be answered in the parliament?” she asked. According to her, Mr. Gandhi was prevented from raising these issues. She alleged that the Speaker (Om Birla) at the time allowed a BJP MP to slander Indira Gandhi based on some magazine. “So, we gheraoed him,” she said. Published - February 06, 2026 11:00 pm IST Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/pm-must-answer-questions-related-to-national-security-in-parliament-congress-mp/article70600787.ece",
        "date": "Fri, 06 Feb 2026 23:05:35 +0530",
        "fetched_at": "2026-02-06 18:34:50.713168"
    },
    {
        "title": "Kerala MP moves private Bill to conduct Census every ten years",
        "content": "News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Published - February 06, 2026 10:51 pm IST - NEW DELHI IUML MP Haris Beeran speaks in Rajya Sabha during the Budget Session in New Delhi on February 6, 2026. Photo: Sansad TV via ANI. Kerala MP Haris Beeran has moved a Private Member’s Bill in the Rajya Sabha to amend the Census Act, 1948 to insert a provision to conduct at least one Census in the whole of India every ten years. Mr. Beeran, who belongs to the Indian Union Muslim League (IUML), moved the Census Amendment Bill, 2024, arguing that the conduct of a Census for the entire country at a regular interval is a must, as a majority of the country’s population would otherwise be unable to access several schemes, benefits and services. “Neither the Constitution nor the Census Act, 1948 as it stands today, mandates a census to be conducted at regular intervals. However, the census on the national level has so far been conducted every ten years,” the Bill said. The last Population Census in India was conducted in 2011. The next edition, expected in 2021, was initially delayed due to the COVID-19 pandemic. The first phase of the next Census exercise will now start on April 1 and conclude in February 2027, a delay of six years from the regular schedule. The Amendment Bill said that a “periodical census is a legal imperative for the reason that constitutionally-mandated policies of social justice, which include reservations in electoral constituencies, education and public employments, cannot be pursued effectively without correct population data, particularly caste-wise data.” It added that detailed caste-wise data is necessary to avoid and correct wrongful inclusions of undeserving castes and exclusions of deserving castes, and to guard against a few dominant castes in a reserved category crowding out others. “It is also needed for sub-categorising castes within a reserved category and to determine the income/wealth criterion for the creamy layer. It is also a moral imperative for the reason that the absence of detailed caste-wise data has helped a coterie of elites, among upper castes and dominant Other Backward Classes (OBCs), to corner a disproportionate share of the nation’s assets, incomes, and positions of power,” the Bill said. The first Census of Independent India was conducted in 1951 and the Union government continued the practice of conducting a national Census every ten years after that, without any delays, until 2011. The Bill noted that te Census to be conducted in 2021 was postponed due to the pandemic and the country still awaits a nationwide data collection. Published - February 06, 2026 10:51 pm IST Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/kerala-mp-moves-private-bill-to-conduct-census-every-ten-years/article70601298.ece",
        "date": "Fri, 06 Feb 2026 22:51:40 +0530",
        "fetched_at": "2026-02-06 18:34:51.863440"
    },
    {
        "title": "Delhi Biker Dies After Crashing Into Jal Board Pit, Water Minister Announces Ex-Gratia Of Rs 10 Lakh",
        "content": "A motorcyclist was found dead inside a massive pit at a road construction site in West Delhi’s Janakpuri area on Friday morning, triggering allegations of negligence from his family. The deceased was identified as Kamal, a resident of Kailashpuri. The Delhi government later ordered a probe into the case, Urban Development Minister Ashish Sood confirmed. Water Minister Parvesh Verma has announced an ex gratia of Rs 10 lakh for the family of the deceased. The Delhi Jal Board has also set up a committee to probe the death of the motorcyclist who allegedly fell into a construction pit dug by the water agency. According to the relatives of the man, he was returning home late on Thursday from his office in the Rohini area and had remained in touch with family members during the commute. When he failed to reach home, they began searching for him, visiting several police stations through the night, including those in Janakpuri, Sagarpur, Vikas Puri and Rohini. Family members said they received a call from the police around 7.30 am informing them about an accident. When they reached the site, they found Kamal’s body inside the pit along with his motorcycle. #WATCH | Janakpuri, Delhi | A biker dies allegedly due to falling into a pit. Further details awaited. pic.twitter.com/7kja0wll1M— ANI (@ANI) February 6, 2026 They alleged negligence by the Delhi Jal Board, which was carrying out construction work at the location, and also raised the possibility of foul play, claiming someone might have killed Kamal and dumped his body in the manhole. Police said all angles were being examined. Responding to the incident, Delhi Jal Board has expressed “deep sorrow\" over the tragic accident that occurred at the pipeline rehabilitation project site in Janakpuri and conveyed its condolences to the bereaved family. A serious view has been taken of the tragic accident at the Janakpuri Line Rehabilitation Project site.Delhi Jal Board has constituted a high-level Inquiry Committee to ensure a transparent investigation into the incident. The Committee has been directed to:• Inspect the… — Parvesh Sahib Singh (@p_sahibsingh) February 6, 2026 The Board said a committee has been constituted to investigate the incident, and assured that strict action will be taken if negligence is found at any level. It added that regular inspections of safety measures are being carried out at all workplaces. The board has urged citizens to report any unsafe worksite on the toll-free helpline number 1916. According to news agency PTI, authorities received a call around 7 am about the incident in Janakpuri, following which personnel rushed to the spot. A senior officer told the agency that preliminary investigations indicated the pit was part of a Delhi Jal Board worksite and that it had been “properly barricaded.\" “We are investigating the matter to ascertain the exact sequence of events,\" the officer was quoted as saying. DELHI MAN FALLS TO DEATH IN PIT: THE POLICE’S VERSION According to the Delhi Police, the man worked at the HDFC Bank, and his daily shift usually ended at nearly 11 pm. On Thursday, as his shift ended, he called his family and informed them that he was at Janakpuri District Centre and was on his way home. As the police were informed about the family, at nearly 12.30 am, that Kamal had not reached home, a search for him began. Subsequently, the police traced his mobile phone’s location, which was nearly 200 mts away from the accident spot. The Delhi Police conducted a search operation in the area for nearly two hours during the night, with head constables searching the surroundings for any clues. Kamal’s body was found in the morning when someone reported that a man and a bike were lying in a pit. Police reached the spot, and a team from the fire brigade was called. The body was fished out at nearly 8.30 am. Saurabh Bharadwaj, Delhi unit chief of the Aam Aadmi Party, shared the pictures of the accident on his official X handle. In his post, Bharadwaj wrote, “Shocking !!! An innocent biker fell into a deep pothole on the road, got stuck, lay there all night, and died.\" “The BJP government in Delhi has learned nothing from the Noida incident. They just keep lying every day,\" he alleged. The incident comes weeks after a similar case in Noida, where 27-year-old software engineer Yuvraj Mehta died after his car fell into a waterlogged pit near a construction site. The incident had happened in Sector 150 area during the intervening night of January 16 and 17. In the recent case, authorities in Delhi said forensic teams and local officers were reconstructing the sequence of events in Kamal’s case, examining whether safety barricades were intact, checking nearby CCTV footage and recording statements from witnesses and family members. Officials stressed that no conclusion would be drawn until the probe is completed.",
        "link": "https://www.news18.com/india/dehli-man-falls-into-pit-with-motorcycle-delhi-motorcyclist-dead-janakpuri-manhole-visuals-delhi-police-delhi-jal-board-ws-l-9883515.html",
        "date": "Fri, 6 Feb 2026 23:06:48 +0530",
        "fetched_at": "2026-02-06 18:35:39.148439"
    }
]