[
    {
        "title": "IIT-Madras Research Park, Unicorn Ventures launch ₹600-crore deep tech fund",
        "content": "Indian Institute of Technology Madras Research Park (IITMRP), in collaboration with Unicorn India Ventures, on Friday announced the launch of a ₹600-crore fund to support deep tech startups across India. Called IIT Madras Unicorn Frontier Fund I, it will have ₹400 crore ‘greenshoe option’, a clause that allows underwriters sell 15 per cent more shares than planned if the demand was high. In the initial phase, it plans to invest in over 25 startups that range from robotics, space tech, defence tech, and semiconductors. Announcing this at the inauguration of Entrepreneurship Summit 2026, V. Kamakoti, Director, IIT Madras, said the fund would be operational in about three or four months after all the necessary approvals were obtained. The School of Innovation and Entrepreneurship, he said, would start offering programmes and courses soon and develop course materials so as to provide a fillip to the entrepreneurial ecosystem. Startups not only incubated within IITMRP but from across the country will be able to seek funding, Dr. Kamakoti added. The fund aims to target the ‘valley of death’ curve, the phase in the life of a startup between start of operations and generation of revenue, and convert it to ‘valley of hope’. IIT-Madras was also developing an e-plane capable of vertical take-off and landing within a 5,000-square-foot-space making it an ideal candidate for initiatives like air ambulance. The project was expected to reach the commercial stage in about a year’s time, he added. Natarajan Malupillai, Group CEO, IITMRP, said the fund would have a 10+2 years tenure and was the first step towards creating a steady stream of startups reaching IPO level. Ashwin Mahalingam, Dean, Alumni and Corporate Relations, IIT-Madras, said that the venture would attempt to draw upon the expertise of the institute’s 70,000-odd alumni. Bhaskar Majumdar, founder and managing partner, Unicorn India Ventures, said nearly two-thirds of the 50-odd companies that his company has invested in were from tier two or tier three cities. Talking about the challenges he had to overcome, Swapnil Jain, co-founder, Ather Energy, said the startup environment was looking more promising now than it was a decade ago when he started his company. He said of late, there was an observable shift in interest of investors from e-commerce to deep tech. Richa Agrawal, Faculty Advisor, Entrepreneurship Cell, IIT-Madras, Sathyanarayana N. Gummadi, Dean-Students, IIT-Madras, Atharva Kokate, Student Core, E-Summit, and Harin Raam A., Student Manager, E-Summit, spoke. Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/iit-madras-research-park-unicorn-ventures-launch-600-crore-deep-tech-fund/article70600949.ece",
        "date": "Sat, 07 Feb 2026 02:25:42 +0530",
        "fetched_at": "2026-02-07 02:29:21.346980"
    },
    {
        "title": "‘Focus on inclusive growth’: Omar tables ₹1.27-lakh-cr. budget",
        "content": "J&K Chief Minister Omar Abdullah addressing a press conference at the Convention Centre in Jammu on Friday. @CM_JnK X/ANI Photo) Highlighting the financial distress the Union Territory (UT) was facing, Jammu and Kashmir Chief Minister Omar Abdullah on Friday presented a ₹1.27-lakh-crore budget with a “special focus on the marginalised sections of the society and fresh measures to create jobs”, in a region with one of the highest unemployment rates in the country. “The budget carries a wide range of people-centric initiatives aimed at delivering immediate relief, strengthening social protection, promoting inclusive growth and ensuring equitable development across all regions of J&K,” said Mr. Abdullah, who presented the second budget of his government as the Finance Minister. Thirty-two welfare measures were rolled out for the marginalised sections, including women, orphans and persons with disabilities. Mr. Abdullah announced six free LPG cylinders for families registered under the Antyodaya Anna Yojana (AAY); free bus service for women and passengers with disabilities in smart city buses and other government transport systems; Direct Benefit Transfer-based financial reimbursement of fees for AAY students from Classes 9 to 12 as well as college students; and sponsorship support to 6,000 orphans under non-institutional care. Opposition parties expressed their unhappiness over the budget though. “The budget is hopeless and a vague document. It offers no healing or hope. The youth, who comprise 60%–65% of our population, have been ignored,” Peoples Democratic Party MLA Waheed-ur-Rehmaan Parra said. BJP MLA and Leader of Opposition Sunil Sharma termed it “a budget for National Conference MLAs”. “There is nothing for the common people in it,” he added. “The Budget carries a set of focused measures that will directly touch the lives of citizens, particularly the most vulnerable sections,” Mr. Abdullah said. Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/jammu-and-kashmir/focus-on-inclusive-growth-omar-tables-127-lakh-cr-budget/article70600948.ece",
        "date": "Sat, 07 Feb 2026 03:58:30 +0530",
        "fetched_at": "2026-02-07 02:29:22.546149"
    },
    {
        "title": "Election Commission directives ignored, disabled people made to wait in queue for SIR hearings in Bengal",
        "content": "“With the exercise now increasingly resembling a citizenship verification drive, it is apprehended that many disabled people will not only face disenfranchisement, but also be forced to prove their citizenship,” National Platform for the Rights of the Disabled said. File Thirty-nine-year-old Arpita Banerjee, a resident of Baranagar in West Bengal’s North 24 Parganas district, has been battling multiple health problems since childhood, exacerbated by neurological disorders. Born in November 1987, Ms. Banerjee had been on the earlier 2025 voter list and was included in the post-Special Intensive Revision (SIR) draft electoral rolls published in December last year. Soon after, however, she received a notice to attend a hearing over a “logical discrepancy” arising from a mismatch in the spelling of the surname “Banerjee” in her and her father’s records. Her 76-year-old father, a small-time businessman, accompanied her to the hearing, where they had to wait for a good three hours before officials clicked her photograph and accepted her disability certificate as documentary evidence, as mandated under SIR rules. The experience, however, has left her traumatised. Similar difficulties have been reported by other voters with disabilities. Lokman Sheikh, a person with visual disability from Raghunathganj Assembly Constituency under Murshidabad district, had to wait in the queue during his hearing, with no separate facility for people like him, despite being called over a “logical discrepancy” in his name. The parent of a non-verbal autistic boy from Kolkata, who did not wish to be identified, said they had to wait for nearly five hours in a queue with their son for the SIR hearing, triggering severe anxiety in the child. According to the Election Commission of India data, West Bengal had 5,07,089 registered voters with disabilities in the 2024 electoral rolls used for the Lok Sabha elections. The ECI provides a home voting facility for voters with disabilities. During the SIR of electoral rolls in West Bengal, the ECI issued directives on January 7, exempting certain categories of voters, including persons with disabilities, from physical hearings. The directive stated that disabled electors who submit specific requests to the Electoral Registration Officers (EROs) or Assistant EROs, either directly or through family members, may not be called for hearings. If notices had already been issued, officials were instructed to contact such voters by phone and conduct verification at their homes. However, activists say the situation on the ground is starkly different, largely due to the short notice period.  “Most voters are being asked to appear within two days or even the very next day. As people are already anxious and under great stress, they are not taking any chances and are rushing for hearings despite great hardships,” said Shampa Sengupta, a Kolkata-based disability rights activist. People gather during a hearing of the Special Intensive Revision (SIR) of the electoral rolls, in Balurghat, West Bengal. File A senior ECI official from West Bengal told The Hindu that it was the responsibility of Booth Level Officers (BLOs) to process and facilitate exemption requests, as they are local residents familiar with families in the area. V. Muralidharan, general secretary of the National Platform for the Rights of the Disabled (NPRD), said, “While the ECI has robustly implemented home voting for elderly and disabled voters during elections, the same groups face unnecessary harassment during voter roll revisions”. “Many disabled persons have complained of being humiliated and treated in an undignified manner. With the exercise now increasingly resembling a citizenship verification drive, it is apprehended that many disabled people will not only face disenfranchisement, but also be forced to prove their citizenship,” he said. Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/west-bengal/disabled-people-made-to-wait-in-queue-for-sir-hearings-in-bengal/article70600739.ece",
        "date": "Sat, 07 Feb 2026 02:05:13 +0530",
        "fetched_at": "2026-02-07 02:29:31.518012"
    },
    {
        "title": "Prescription For Crises: Govt May Ask Pharma Firms To Fund Free Medicines For Emergencies",
        "content": "India is examining a proposal to mandate pharmaceutical companies to set aside a share of their profits for free medicines during health emergencies, News18 learned. The proposal seeks an amendment to the Drugs Rules, 1945, to include a mandatory provision requiring pharmaceutical companies to spend “at least one per cent of their net profit for providing free medicines in medicine bank\" to be used by the central government during “health emergencies, disaster or any other circumstances considered necessary\". The proposal is still under deliberation and has been placed before the country’s top statutory decision-making body on technical matters related to drugs and cosmetics, the Drugs Technical Advisory Board. The move, according to the agenda document accessed by News18, is being examined to assess whether emergency access to free medicines can be strengthened through regulatory changes without conflicting with company law. The proposal was deliberated at DTAB’s 90th meeting held on January 25, 2024, after which the board recommended that the Ministry of Health and Family Welfare may seek the opinion of the Ministry of Corporate Affairs on the matter. Subsequently, comments were received from the corporate affairs ministry, which flagged legal constraints. The agenda document notes that “the broad framework for CSR is laid down under Section 135 of the Companies Act, 2013\", along with Schedule VII of the Act and the Companies (CSR Policy) Rules, 2014. It further clarifies that “the Government does not issue specific direction or intervention in the manner or geographical area in which companies choose to spend their CSR funds\", highlighting limits on directing CSR expenditure through sector-specific rules. The corporate affairs ministry has indicated that any attempt to mandate CSR-linked spending through drug regulations would need to be legally aligned with company law. The document states that “CSR is governed by Companies Act, 2013,\" and therefore suggests that “the authority for CSR activity may be quoted from Schedule VII, Companies Act, 2013 and Companies (CSR Policy) Rules, 2014 and proposed amendment in Drugs Rules, 1945 need to be in sync\". More significantly, it cautions that “any amendment in the CSR framework would require an amendment to the Companies Act\", suggesting that changes through the Drugs Rules alone may not be sufficient. The matter has now been placed back before DTAB, with the agenda concluding that “DTAB may kindly deliberate and give its recommendations in the matter\". The matter continues to be reviewed, with regulators weighing public health needs against existing corporate law provisions.",
        "link": "https://www.news18.com/india/prescription-for-crises-govt-may-ask-pharma-firms-to-fund-free-medicines-for-emergencies-9885630.html",
        "date": "Sat, 7 Feb 2026 07:00:34 +0530",
        "fetched_at": "2026-02-07 02:29:55.611689"
    }
]