[
    {
        "title": "Roundtable on Kerala’s future development to be held in Thiruvananthapuram",
        "content": "A roundtable discussion on the next phase of Kerala’s development will be held at the C. Achutha Menon Centre here on Wednesday.\nOrganised by the C. Achutha Menon Foundation, the discussion will be inaugurated by Finance Minister K.N. Balagopal. K. Ravi Raman, member of the State Planning Board, will moderate the discussion.\nThe roundtable aims to create a blueprint for the State’s development in areas such as health, education, agriculture, industry, science and technology, gender justice, research, climate change, environment, food security, knowledge-based economy, etc., according to a press release.\nHistorian Rajan Gurukkal, chairman of the Seventh State Finance Commission K.N. Harilal, CPI State secretary and Achutha Menon Foundation president Binoy Viswam will participate in the discussion.",
        "link": "https://www.thehindu.com/news/national/kerala/roundtable-on-keralas-future-development-to-be-held-in-thiruvananthapuram/article70644463.ece",
        "date": "Wed, 18 Feb 2026 08:14:37 +0530",
        "fetched_at": "2026-02-18 04:02:05.116856"
    },
    {
        "title": "Odisha looking to increase its contribution to national GDP from 3% to 5%: Governor",
        "content": "Odisha Governor Hari Babu Kambhampati addresses the House during the first day of the state Assembly's Budget session, in Bhubaneswar, on February 17, 2026.\n| Photo Credit: PTI\nOdisha aims to increase the State’s contribution to national Gross Domestic Product (GDP) from 3% to 5%, with average annual growth rising from 7% to 9.5% through reforms in investment, execution, and technology adoption, said Governor Hari Babu Kambhampati on Tuesday (February 17, 2026).\nDelivering his inaugural address in the budget session of Odisha Legislative Assembly, Mr. Kambhampati presented State’s strong economic fundamentals and planned massive infrastructure proposals that would give push for further momentum to economic growth.\n“The State targets raising per capita income from Rs 1.8 lakh to Rs 32 lakh by 2047, improving living standards, reducing multidimensional poverty to 5%, increasing female labour force participation to 70%, raising life expectancy beyond 80 years and eliminating anaemia and malnutrition, in alignment with India’s Vision and global best practices,” he said.\n“Under the leadership of the Prime Minister Narendra Modi, the Central government’s recent approvals for mega-projects in Odisha reflect strong confidence in the State’s future and will unlock significant socio-economic benefits. The approval of the ₹8,300 crore for Rameshwar–Paradip Coastal Highway and 6-lane access-controlled Greenfield Capital Region Ring Road (Bhubaneswar Bypass), with an investment of about ₹8,308 crore, would surely improve connectivity,” said Odisha Governor in his address.\n“The Odisha State Road Policy, 2025 has been implemented to create a high-quality road network for seamless movement of people and goods, while the Odisha State Highway Authority Act, 2025 has been promulgated to fast-track highway development through a dedicated institutional mechanism,” Mr. Kambhampati pointed out.\nHighlighting State’s mineral wealth, he said, “with the efforts of government, Odisha continues to occupy a pre-eminent position in the national mining and steel landscape. The State is endowed with nearly one third of India’s total iron ore reserves and contributed over 61% of the country’s total iron ore production in 2024–25. Odisha also holds the first position in the production of Steel and Stainless Steel in the country.”\n“At present, Odisha has 55 operational steel plants with a total installed capacity of around 45.62 Million Tonnes Per Annum (MTPA), accounting for nearly 23% of the country’s total installed steel capacity. With rising per-capita steel consumption, Odisha is positioning itself to contribute 100 million tonnes of steel towards the national target of 300 million tonnes by 2030,” Governor emphasised.\nOn the anti-Maoist operation front, Mr. Kambhampati said, “The government has achieved significant success on the anti-Left Wing Extremism through sustained and proactive operational and administrative action, leading to a marked improvement in the situation in the State.”\n“In the last 5 years, 48 Maoist cadres were neutralised, 78 were arrested and 82 surrendered. Notably, in 2025 alone, 25 Maoist cadres were neutralised, including 17 in joint operations with Chhattisgarh Police, CRPF and CoBRA at the Nuapada-Gariyabandh border, 9 cadres were arrested, and 29 surrendered. Large quantities of arms, ammunition, explosives and other incriminating materials were also recovered,” he informed.\nOrissa\n/\nBhubaneswar\n/\nIndia",
        "link": "https://www.thehindu.com/news/national/odisha/odisha-looking-to-increase-its-contribution-to-national-gdp-from-3-to-5-governor/article70643506.ece",
        "date": "Wed, 18 Feb 2026 03:59:45 +0530",
        "fetched_at": "2026-02-18 04:02:05.718340"
    },
    {
        "title": "Village headman among 27 persons booked after seven persons get injured at Mayana Kollai festival in Vellore",
        "content": "The police said that during the procession, one of the chariots tilted sideways and from the impact seven persons were injured\n| Photo Credit: Special Arrangement\nThe headman of Viruthampattu village panchayat near Katpadi in Vellore was among 27 persons booked by Vellore North police on Tuesday over the injury of seven persons after a 60-foot temple chariot toppled during the annual Mayana Kollai festival held on the banks of Palar River on Monday.\nPolice said the village headman K. Sridhar, 52, of Viruthampattu village was one of the organisers of the annual festival held on the  riverbed near the new bus terminus, off the Chennai - Bengaluru Highway (NH 48).\nThe police said that as per norms, temple chariots should not exceed 12 feet in height. However, during the Mayana Kollai festival in Vellore, chariots from Virudhambattu, Kazhinjur, and Mottur were reportedly around 60 feet tall, resulting in the collapse. “Strict action will be taken against those who violate laws and traffic rules. Cases have been registered against those responsible for the incident,” said N.U. Sivaraman, SP (Vellore).\nPolice said that based on a complaint from D. Kasi, village administrative officer (VAO), Viruthampattu village, cases were registered against 27 persons under Section 125 (a) of the Bharatiya Nyaya Sanhita (BNS), 2023, that punishes any person who acts rashly or negligently in a way that endangers human life or personal safety of others. The punishment can be imprisonment of up to three months, a fine up to ₹2,500, or both even if no actual harm is caused.\nInitial inquiry revealed that the Mayana Kollai festival, one of the prominent annual events in the region, was held on the Palar riverbank on Monday. As part of the celebrations, deities from 10 villages were decorated, placed on temple chariots, and taken in procession to the riverbed where devotees performed traditional rituals and offerings.\nPolice said that during the procession, one of the chariots tilted sideways. In the impact, seven persons were injured. The incident happened around 11.30 p.m on Monday. The police and devotees rescued the injured and rushed them to Government Medical College Hospital in Vellore.\nOn being informed, V.R. Subbulaxmi and SP Mr. Sivaraman inspected the spot. Later, Ms. Subbulaxmi also met the injured persons at the hospital before she ordered an inquiry into the incident.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/village-headman-among-27-persons-booked-after-seven-persons-get-injured-at-mayana-kollai-festival-in-vellore/article70642321.ece",
        "date": "Wed, 18 Feb 2026 00:58:06 +0530",
        "fetched_at": "2026-02-18 04:02:06.346444"
    },
    {
        "title": "BSL-3 animal vaccine unit, GCC, Innovation Hub projects announced in Telangana",
        "content": "Delegates checking out products on display at the inaugural ceremony of BioAsia 2026 in Hyderabad on Tuesday.\n| Photo Credit: NAGARA GOPAL\nDay One of BioAsia 2026 saw a clutch of firms announcing projects in Telangana, from an animal vaccine manufacturing facility to expansion of an innovation hub focussed on AI driven health and Life Sciences analytics.\nTogether, the projects announced in the presence of Chief Minister A.Revanth Reddy are expected to generate several thousand jobs. The investments proposed on the facilities were not, however, specified by most of the firms.\nFrench global consumer healthcare company Opella Healthcare, spun off from Sanofi, said it is expanding its Hyderabad GCC operations in a 42,000 sq. ft. facility. The move will create up to 500 jobs within the next year, it said.\nVaksindo Animal Health, a division of Indonesian multinational JAPFA, said it is establishing a BSL-3 vaccine manufacturing facility in Genome Valley. The facility will focus on producing vaccines for poultry, cattle, swine, and aquaculture and generate about 300 jobs.\nAI and data science company Tredence Inc said it is expanding its India operations with the launch of a new 20,000 sq. ft. delivery and innovation centre in Nanakramguda, Hyderabad. It will be a dedicated innovation hub focused on AI-driven healthcare and life sciences analytics and support its global operations.\nTredence said more than 400 employees are already working in Telangana and that it plans to grow the workforce to over 2,200 by 2027. The hiring push will see about 700 new roles added in 2026, followed by another 1,100 positions the year after. Chief Technology Officer and co-founder Sumit Mehra said “our expansion announcement represents a strategic investment in the city’s robust data and AI talent landscape and as well as its rapidly evolving retail, CPG and consumer GCC ecosystem.”\nAnother project, announced at BioAsia, was by Rx Propellant to develop a new, large-format Life Sciences campus in Genome Valley. The project will comprise over 1 million sq ft of advanced laboratory infrastructure across 12 acres of site delivered in phases over next six years. The estimated investment will be ₹1,000 crore and 5,000 jobs are likely to be generated.",
        "link": "https://www.thehindu.com/news/cities/Hyderabad/bsl-3-animal-vaccine-unit-gcc-innovation-hub-projects-announced-in-telangana/article70643578.ece",
        "date": "Wed, 18 Feb 2026 01:17:26 +0530",
        "fetched_at": "2026-02-18 04:02:06.948744"
    },
    {
        "title": "31 govt. plots ‘illegally’ allocated at 5% of market value for Congress Bhavans in Karnataka: Chalavadi",
        "content": "Chalavadi Narayanaswamy\nLeader of the Opposition in the Legislative Council Chalavadi Narayanaswamy has accused the Congress government of illegally sanctioning government land at throwaway prices in 31 locations to build Congress Bhavans.\nAddressing a press conference in Bengaluru on Tuesday, Mr. Narayanaswamy alleged that five sites from the Revenue Department and 26 from local bodies had been sanctioned for the construction of Congress Bhavans.\nMost of these lands were civic amenities (CA) sites that were not supposed to be allocated for the construction of political party offices, he alleged, and said that the State Cabinet had approved the allocation of such sites as the officials concerned had raised objection to their allotment, citing procedural issues.\nWhile the allotment of these lands for political purposes itself was against the norms, the government had indulged in one more irregularity by allotting them at just 5% of their market value, he alleged.\nCiting an example, he said a CA site measujring 4,404 square metres worth ₹4.08 crore in Chickballapur had been allocated at a mere ₹20.42 lakh. Similarly 613 square metres of government land worth ₹24.52 lakh in Badami had been sanctioned for just ₹1.22 lakh. In Mandya, land worth ₹1.45 crore had been sanctioned for ₹7.28 lakh, he alleged.\nHe urged the government authorities to take back the land allotted. Mr. Narayanaswamy said his party would take up a legal fight if the allotment was not withdrawn.\nResponding to the BJP leader’s allegation, Deputy Chief Minister D.K. Shivakumar, also president of the KPCC, said the party was constructing 100 Congress Bhavans as part of the centenary of Mahatma Gandhi’s presidency of the Congress. “Yes, we are using government land for Congress Bhavans. We are allotting 5,000 to 10,000 sq. ft. plots,” he said.\nHe pointed out that during the BJP’s tenure, land had been allotted to various trusts in Bengaluru at concessional rates. “The land given to Chanakya University is worth ₹10 crore per acre, but it was allotted at ₹50 lakh per acre for 100 acres.”\nHe further asked, “If land was not allotted by the BJP government, how was the RSS office constructed?”",
        "link": "https://www.thehindu.com/news/national/karnataka/31-govt-plots-illegally-allocated-at-5-of-market-value-for-congress-bhavans-in-karnataka-chalavadi/article70643802.ece",
        "date": "Wed, 18 Feb 2026 00:44:50 +0530",
        "fetched_at": "2026-02-18 04:02:07.565396"
    },
    {
        "title": "A.P. MLAs laud ‘people’s budget’, say it reflects government’s vision",
        "content": "Highlighting the major allocations and policy directions in the ₹3.32 lakh crore budget for 2026–27 presented recently, members in the Assembly lauded the government for its well-conceived budgetary provisions and forward-looking vision reflected in the comprehensive planning, on Tuesday (February 17, 2026).\nAmadalavalasa MLA Koona Ravi Kumar slammed the previous YSRCP government, alleging that it had derailed the governance and became synonymous with exploitation. He said that the TDP-led coalition government, that inherited ₹9,75,000 crore in debt and ₹1,35,000 crore in pending liabilities, gave top priority to SC, ST and BC welfare.\nMLA K. Murali Mohan from Puthalapadu in Chittoor district said that the credit for allocation of significant funds to mango farmers goes to Chief Minister N. Chandrababu Naidu. Citing increasing funding to transform Rayalaseema into a horticulture hub, he said multiple schemes were introduced to ensure inclusive development.\nFormer Minister Prathipati Pullarao said that the State was moving towards long-term growth and development. He said farmers were being encouraged and supported and old-age pensions had been increased to ₹4,000 per month, which cost around ₹27,000 crore annually to the State exchequer.\nAdireddy Srinivas from Rajamahendravaram described the budget as the foundation for a State’s future. He said allocation of ₹6,000 crore for Amaravati project reflected the seriousness of the government to develop the new capital with global standards.\nMLA Lokam Madhavi from Nellimarla in Vizianagaram district referred to the ‘Palle Panduga’ initiative for laying roads in villages and said allocations across departments were satisfactory.\nMember B.V. Jaya Nageswara Reddy from Emmiganur criticised the Opposition members for showing scant regard for the Assembly proceedings. Calling it a ‘People’s Budget”, she said allocation for irrigation projects was thoughtful.\nP.G.V.R. Naidu (Ganababu), MLA from Visakhapatnam West, said the State was moving from destruction towards development. He said the rapid development of Hyderabad city in the past reflected the Chief Minister’s vision and emphasised the need to bring companies to the State to generate employment for the youth.\nKandula Narayana Reddy from Markapuram accused the YCP of weakening the agriculture sector, while MLA V.M. Thomas from Gangadhara Nellore suggested establishment of IVF and test tube centres in villages as part of populatin policy, in line with the Chief Minister’s vision.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/ap-mlas-laud-peoples-budget-say-it-reflects-governments-vision/article70644494.ece",
        "date": "Wed, 18 Feb 2026 00:17:26 +0530",
        "fetched_at": "2026-02-18 04:02:08.187890"
    },
    {
        "title": "AI can revolutionise healthcare, says Union Minister Anupriya Patel",
        "content": "Minister of State for Health and Family Welfare Anupriya Patel, along with  HRD Minister N. Lokesh and university authorities, presenting a certificate to a student, during the second convocation ceremony of the AIIMS, Mangalagiri, on Tuesday.\n| Photo Credit: BY ARRANGEMENT\nArtificial intelligence is a powerful enabler that can transform disease surveillance, diagnosis, treatment, and healthcare delivery, and act as an assistive force that strengthens doctors, not replace them, said Minister of State for Health and Family Welfare Anupriya Patel.\nParticipating as the chief guest in the second convocation ceremony of AIIMS, Mangalagiri, on Tuesday (February 17, 2026), Ms. Anupriya Patel said that when aligned with public purpose, technology can expand access, improve efficiency, and save lives.\nShe told the students that a convocation does not mark the end of learning, but the beginning of a lifelong journey of continuous growth, discovery, and service to humanity.\nLater, Minister for Human Resources and Development N. Lokesh, who participated in the event as the Guest of Honour, recalled the growth of the institute from a modest beginning in 2015 to comprehensive tertiary care institution with nearly 650 functional beds, over 1,300 students, and advanced services including open-heart surgeries, kidney transplants, robotic knee replacements, advanced oncology care, and Cath lab facilities.\nPaying tribute to the selfless service of doctors during the COVID-19 pandemic, he said that while technology and AI will continue to advance healthcare, the healing power of human touch, empathy, and humility remain irreplaceable.\nDegrees were conferred on 49 MBBS students, five postgraduate students, and four PDCC graduates during the ceremony.  Executive Director and CEO Ahanthem Santa Singh presented the institute’s project report, outlining the progress achieved in academics, patient care, infrastructure expansion, research, and super-specialty services. He congratulated the graduating students on successfully completing their rigorous training.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/ai-can-revolutionise-healthcare-says-union-minister-anupriya-patel/article70644456.ece",
        "date": "Tue, 17 Feb 2026 23:31:35 +0530",
        "fetched_at": "2026-02-18 04:02:08.796441"
    },
    {
        "title": "IT Minister apologises for AI summit troubles; Kharge slams ‘mismanagement’",
        "content": "Congress President Mallikarjun Kharge. File. Photo Credits: AICC via PTI Photo\nUnion Minister Ashwini Vaishnaw on Tuesday (February 17, 2026) apologised for the difficulties faced by attendees on the opening day of the India AI Impact Summit, even as Congress president Mallikarjun Kharge criticised the Modi Government for the “utter chaos and rank mismanagement”.\nAddressing a press conference at Bharat Mandapam, the summit venue, Mr. Vaishnaw said the turnout on Monday (February 16, 2026) was “phenomenal”, and assured participants that corrective steps had been taken to ensure a smoother experience in the coming days.\nMore than 70,000 people attended the summit on the first day, he said. “This is the biggest AI summit in the entire world. The response is phenomenal. The energy is palpable. We can see the organisation is very smooth now. If anybody faced any problems yesterday, we apologise for that,” Mr. Vaishnaw said. A “war room” had been set up to address grievances and operational issues, he added.\nEarlier, in a post on X, Mr. Kharge said that what could have been a global showcase of India’s digital capabilities had turned into “utter chaos” due to mismanagement.\n“What could have been a showpiece AI Summit for the entire world demonstrating the digital & AI capabilities of India, has reportedly turned into utter chaos and rank mismanagement by this “PR hungry” government!” Mr. Kharge said on X.\nWhat could have been a showpiece AI Summit for the entire world demonstrating the digital & AI capabilities of India, has reportedly turned into utter chaos and rank mismanagement by this \"PR hungry\" government!Founders, exhibitors and visitors - all face extreme distress due…\nHe claimed that founders, exhibitors and visitors faced distress because of security restrictions ahead of Prime Minister Narendra Modi’s visit (for the inauguration), and alleged that basic facilities such as food and water were lacking. He also cited reports of stolen products, failed digital systems, and restrictions on personal electronic devices.\n“It is extremely unfortunate that our country has to suffer this global embarrassment due to the incompetence of our own government. Perhaps the Modi Government should learn from the Bengaluru Tech Summit (BTS), which is an annual feature in smoothly organising such large-scale digital & tech congregations,” the Congress chief posted.\nThe opening day of the summit saw packed halls, long queues and confusion over entry instructions, with mobile data connectivity also proving unreliable at the venue. Heavy footfall led to overlapping security checks and the temporary evacuation of some exhibitor stalls ahead of the Prime Minister’s visit to the expo.\nAmid the disruption, some participants reported misplaced or stolen items. Dhananjay Yadav, CEO of NeoSapien, said on X that security personnel asked exhibitors to vacate their stalls ahead of the Prime Minister’s visit and assured them their belongings would be safe. He later claimed that some of the company’s AI wearables were stolen.\n“Think about this: We paid for flights, accommodation, logistics and even the booth. Only to see our wearables disappear inside a high-security zone. If only security and official entourage had access, how did this happen? This is extremely disappointing,” Mr. Yadav wrote.\nPunit Jain, founder of Reskill, initially criticised the arrangements, saying exhibitors and delegates were left outside without water or clarity on access.\n“Exhibitors, delegates, start-up founders were left outside. No water. No clarity. The media shows celebration. Ground reality was chaos. If access was limited to select high-value guests, just say it upfront. Don’t mobilize the ecosystem and then displace them. This is not how we build India’s AI future,” Mr. Jain wrote on X on Monday (February 16, 2026).\nHowever, he acknowledged that coordination improved significantly on Tuesday (February 17, 2026), the second day of the summit.\nEntrepreneur Priyanshu Ratnakar also pointed to long queues, exhibitors being locked out of stalls, patchy connectivity and repeated registration glitches, calling the experience “optics over execution”.\nOrganisers said corrective measures were taken through the day to ease congestion and improve coordination, and assured participants that the remaining days of the summit would run more smoothly. The summit will conclude on February 20.\n(With PTI inputs)\npolitics\n/\nArtificial Intelligence\n/\nministers (government)",
        "link": "https://www.thehindu.com/news/national/it-minister-apologises-for-ai-summit-troubles-global-embarrassment-says-kharge/article70643571.ece",
        "date": "Wed, 18 Feb 2026 02:11:07 +0530",
        "fetched_at": "2026-02-18 04:02:09.419386"
    },
    {
        "title": "India’s first private sector helicopter final assembly line inaugurated near Kolar in Karnataka",
        "content": "Tata Advanced Systems Limited (TASL) inaugurated India’s first private-sector helicopter Final Assembly Line (FAL) for the Airbus H125 at Vemagal in Karnataka on February 17, 2026. The production line was inaugurated virtually by PM Narendra Modi, and French President Emmanuel Macron. Present at Vemagal were Defence Minister Rajnath Singh, France’s Minister of the Armed Forces and Veterans Affairs Catherine Vautrin, along with the senior leadership teams from Tata Advanced Systems and Airbus. Photo: Special Arrangement\nPrime Minister Narendra Modi and French President Emmanuel Macron on Tuesday (February 17, 2026) virtually inaugurated the Tata Advanced Systems’ Final Assembly Line for the Airbus H125 helicopter.\nThe facility in Vemagal in Kolar district of Karnataka, is India’s first private-sector helicopter Final Assembly Line for the Airbus H125. This is the first time the Indian private sector will undertake the manufacturing, integration, testing and maintenance of a sophisticated rotary-wing platform in India.\nTo start off with, the civil H125 will be built at this facility and in future the military variant of the helicopter could also be built.\nThe first ‘Made in India’ H125 is expected to be delivered early 2027 and will also be available for export across the South Asian region.\nTata Advanced Systems Limited and Airbus said that the H125M is optimised to serve as a high-altitude force multiplier across a spectrum of critical missions.\nDefence Minister Rajnath Singh who was present on the occasion said that the H-125 programme investment is anticipated to exceed ₹1,000 crore.\n“The H-125 programme is likely to create direct and indirect employment opportunities for our skilled and hard working younger generation,” Mr. Singh said.\nMinister of the Armed Forces and Veterans Affairs of France Catherine Vautrin said the inauguration of the facility is a testament to French-Indian defense cooperation.\nKarnataka Large and Medium Industries Minister M B Patil said 500 H125 light helicopters will be manufactured over the next 20 years at this facility. Mr. Patil said that 17 acres of land had been allotted for the project.\n“After France, the United States and Brazil, Karnataka has now become home to the world’s fourth H125 helicopter manufacturing and Final Assembly Line (FAL) facility, a development that will further strengthen the aerospace ecosystem in the State,” he said.\ndefence contract\n/\ndefence equipment\n/\nFrance\n/\ninternational relations",
        "link": "https://www.thehindu.com/business/Industry/indias-first-private-sector-helicopter-final-assembly-line-inaugurated-near-kolar-in-karnataka/article70643474.ece",
        "date": "Tue, 17 Feb 2026 23:10:22 +0530",
        "fetched_at": "2026-02-18 04:02:10.027934"
    },
    {
        "title": "Budget will be planned to integrate climate action in schemes across departments: Stalin",
        "content": "Chief Minister M.K. Stalin laying the foundation for the dugong conservation centre at the Tamil Nadu Climate Summit 4.0.\n| Photo Credit: B. VELANKANNI RAJ\nThe Tamil Nadu State Budget will be formulated to integrate climate action across schemes implemented by all departments to ensure climate considerations are embedded in governance at every level, said Chief Minister M.K. Stalin at the Tamil Nadu Climate Summit 4.0 on Tuesday.\nMr. Stalin said Tamil Nadu would formulate State-level determined contributions to cut its carbon emissions by 2030, just as India had committed to nationally determined contributions under the Paris Agreement to reduce carbon emissions. These would serve as clear targets, with concrete measures undertaken to achieve them, he said.\nHe also declared that five lakh sandalwood saplings would be distributed for planting across Tamil Nadu to enhance green cover. Additionally, he said industries and government institutions would jointly invest in green technologies to reduce emissions. Mr. Stalin laid the foundation for the International Dugong Conservation Centre in Thanjavur.\nAt the summit, Mr. Stalin launched the Tamil Nadu Sustainably Harnessing Ocean Resources and Blue Economy (TN-SHORE) scheme. Under this initiative, ₹1.7 crore had been earmarked as revolving funds and micro-credit support for 34 mangrove conservation committees. From this allocation, ₹5 lakh each was distributed to three mangrove forest protection committees from Killai, Cuddalore district.\nFurther, under the Tamil Nadu Green Climate Fund, financial assistance was extended to Kannabiran Polymers Ltd (₹20 crores), Ooru Cabs (₹25 crores), and Esygo Power (₹75 crore) to promote environmentally sustainable industrial practices.\nIn the presence of Mr. Stalin, a Memorandum of Understanding (MoU) was signed between IIT Madras, the United Nations Environment Programme (UNEP), and the Tamil Nadu Green Climate Company for establishing a Centre for Circular Economy at IIT Madras.\nFinance and Environment Minister Thangam Thennarasu, Forests Minister R.S. Rajakannappan, Environment & Forests Secretary Supriya Sahu, Dena Umali-Deininger, Regional Director for South Asia, World Bank and others were present.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/budget-will-be-planned-to-integrate-climate-action-in-schemes-across-departments-stalin/article70644209.ece",
        "date": "Tue, 17 Feb 2026 23:09:28 +0530",
        "fetched_at": "2026-02-18 04:02:10.634544"
    },
    {
        "title": "DMK regime has let down government employees, alleges Palaniswami",
        "content": "AIADMK general secretary and Leader of the Opposition Edappadi K. Palaniswami addressing the media after attending the Interim Budget session at the Secretariat in Chennai on Tuesday.\n| Photo Credit: B. JOTHI RAMALINGAM\nAIADMK general secretary Edappadi K. Palaniswami on Tuesday reiterated his charge that the DMK regime had “let down” employees of the State government.\nGiving his reaction to the Interim Budget presented in the Assembly earlier in the day, Mr. Palaniswami, in an interaction with reporters, contended that not even one-fourth of the DMK’s electoral promises, made in the run-up to the 2021 Assembly polls, had been fulfilled. Be it with respect to the old pension scheme for the government employees or issues concerning noon meal staff, government nurses and farmers, the government had not done anything to translate into action its assurances. “Like in the last five years, this Budget too is a deceptive address and full of jugglery of words,” Mr. Palaniswami alleged.\nHe also argued that the burden of loan and taxes had risen. Though Finance and Agriculture Ministers had delivered Budget speeches for a total of five hours, there was “nothing concrete” in them, he added.\nIn a post on his social media handle, Amma Makkal Munnetra Kazhagam (AMMK) general secretary T.T.V. Dhinakaran criticised the DMK regime for “not taking up productive schemes” and “only increasing the loan.” In a statement, former interim general secretary of the AIADMK V.K. Sasikala wanted to know from the government how many buses had been procured for the public transport system as in the last five years, there had been announcements that 12,087 would be purchased at a cost of ₹6,121 crore.\nAll India Anna Dravida Munnetra Kazhagam\n/\nAmma Makkal Munnetra Kazhagam\n/\nstate politics\n/\nbudgets and budgeting\n/\nTamil Nadu",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/dmk-regime-has-let-down-government-employees-alleges-palaniswami/article70644180.ece",
        "date": "Tue, 17 Feb 2026 22:57:08 +0530",
        "fetched_at": "2026-02-18 04:02:11.250551"
    },
    {
        "title": "India, France renew defence cooperation for 10 years, call to boost military partnership",
        "content": "In this image posted on February 17, 2026, Defence Minister Rajnath Singh with France Minister of the Armed Forces and Veterans Catherine Vautrin during the 6th India-France Annual Defence Dialogue, in Bengaluru. Photo: X/@SpokespersonMoD via PTI\nIndia and France renewed the defence cooperation agreement for another 10 years on Tuesday (February 17, 2026) at the 6th India-France Annual Defence Dialogue in Bengaluru.\nIn the meeting, co-chaired by Defence Minister Rajnath Singh and Minister of the Armed Forces and Veterans Affairs of France Catherine Vautrin, India asked France to increase “indigenous content” in the Rafale by up to 50%, and also expand the Rafale’s maintenance, repair and overhaul facility in India.\nThe cooperation agreement was signed by India’s Defence Secretary and France’s Deputy Director General for International Relations and Strategy. Besides, both countries announced Reciprocal Deployment Officers at Indian Army and French Land Forces establishments.\nThe two Ministers discussed a range of bilateral security and defence issues, including priority areas for co-development and co-production of equipment.\nThe Defence Ministry said the two leaders emphasised on the need for a closer defence partnership, connecting industries of both nations, especially in the field of niche technology. It said the two Ministers reaffirmed the commitment to enhance military-to-military cooperation as a key pillar of the strategic partnership.\nMr. Singh said the recent India-EU Security and Defence Partnership marked a significant step in deepening the collective engagement. “Both Ministers agreed to leverage this framework, both bilaterally and in the wider European context for tangible outcomes that will strengthen regional stability, enhance joint capabilities, and reinforce the enduring Indo-French strategic alignment,” the Ministry said.\nAn MoU on Joint Venture was also signed for the manufacturing of Hammer missiles in India between the Chairman and Managing Director of Bharat Electronics Limited and Executive Vice President, Safran Electronics and Defence.\nMr. Singh emphasised that India has been the first responder and net security provider for countries in the Indian Ocean Region and always extends assistance to them in the defence, security and maritime domains to augment their capabilities and ward off any adversary.\nOn terrorism, he said Pakistan has a long history of nurturing cross-border terrorism to create disturbance and violence in India. “This has created a serious threat to peace in the region,” he said.\ndefence\n/\narmed Forces\n/\ndefence contract\n/\nFrance\n/\ninternational relations",
        "link": "https://www.thehindu.com/news/national/india-france-renew-defence-cooperation-for-10-years/article70644242.ece",
        "date": "Wed, 18 Feb 2026 01:48:08 +0530",
        "fetched_at": "2026-02-18 04:02:11.886856"
    },
    {
        "title": "Tamil Nadu Interim Budget: Thangam Thennarasu avoids populism, flags fiscal strain",
        "content": "Tamil Nadu Finance Minister Thangam Thennarasu on Tuesday presented the Interim Budget for 2026-27, steering clear of any last-minute populist announcement in the poll-bound State, while highlighting the achievements of the DMK government in the last five years.\nIn his 142-minute speech, Mr. Thennarasu also outlined the challenges faced by the State from the Centre, including the denial of major infrastructure projects, the withholding of funds, curtailment of tax revenues without consultation, and the unfair imposition of conditions mandating expenditure.\nHe said that in the last five years, the DMK government had deftly managed several floods and cyclones. It had sought ₹50,922 crore in relief assistance from the Centre, which, however, sanctioned a meagre ₹1,151 crore. The Centre had allocated only ₹6,013 crore to Tamil Nadu under the State Disaster Response Fund in the last five years. However, the State had allocated ₹15,173 crore during this period, incurring an additional expenditure of ₹9,160 crore for disaster management.\nHe also listed the flagship schemes implemented by the M.K. Stalin government. Among the schemes were Kalaignar Magalir Urimai  Thittam, the Chief Minister’s Breakfast Scheme for school students, Pudhumai Penn, Tamil Pudhalvan, Naan Mudhalvan, Magalir Vidiyal Payanam, and Makkalai Thedi Maruthuvam.\nAccording to the Interim Budget estimates, the State’s outstanding debt is put at ₹10.71 lakh crore, compared with ₹9.52 lakh crore in the Revised Estimates for 2025-26. Total revenue receipts are expected to stand at ₹3.44 lakh crore, an increase of 11.26% over the Revised Estimates for 2025-26, while total revenue expenditure is projected to rise to ₹3.93 lakh crore, 3.79% higher than the Revised Estimates for 2025-26.\nbudgets and budgeting\n/\nmoney and monetary policy\n/\npoverty\n/\nwelfare",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/thangam-thennarasu-avoids-populist-announcements-in-interim-budget-flags-fiscal-strain/article70643398.ece",
        "date": "Wed, 18 Feb 2026 01:34:00 +0530",
        "fetched_at": "2026-02-18 04:02:12.502023"
    },
    {
        "title": "AI summit: More halls opened, crowd flow improves",
        "content": "People visit the India AI Impact Summit 2026 at Bharat Mandapam, on February 17, 2026.\n| Photo Credit: ANI\nAfter a relatively chaotic first day on Monday (February 16, 2026), the AI Impact Summit saw smoother operations on Tuesday (February 17, 2026), with more areas opened to attendees and fewer surges of crowding, even as turnout remained strong. Students bused in from local colleges, schools, and corporates queued up outside multiple gates, but the lines moved steadily.\nAll sections of the government’s flagship AI event—promoted for months—were opened to the public, helping ease congestion. Unlike on the opening day, there were no security-led evacuations of large areas. In fact, additional hall space at the 100-acre Bharat Mandapam complex was formally opened, allowing visitors to spread out evenly.\nThe three-day gap before the gathering of heads of State allowed organisers to address the initial glitches. At food courts, freshly printed banners now announced the acceptance of digital payments. On Monday (February 16), attendees had complained that some cash counters were refusing UPI and card payments.\n“Less crowd today (February 17, 2026), smoother movement, and big banners outside meeting rooms for better visibility,” Vijay S., an attendee, posted on X, calling it a “good recovery after yesterday’s chaos.” Visitors had also flagged inadequate clear signage on the opening day.\nHowever, technical issues persisted. Many sessions continued to experience problems with livestreams, with the IndiaAI YouTube channel’s broadcasts constantly starting late, skipping speaker introductions, and audio going silent on several sessions.\nPublic transport\nLogistical challenges continued outside the main venue. While most events were held within the sprawling complex—which already requires several minutes of walking to attend sessions tightly packed into each day’s schedules—some programmes were conducted at Sushma Swaraj Bhawan, with side events organised by third-party organisations across central Delhi.\nThe two nearest metro stations are a several-minute walk from the venue, making it difficult for attendees to quickly travel to different sessions. Two speakers were unable to make it to their sessions owing to traffic and long, albeit moving, queues at entry gates. While it is common for conventions spread across such a large area to have fixed-schedule shuttle services that ply regardless of occupancy, the organisers opted for only demand-based runs, leaving many attendees with limited transport options.\ntechnology (general)\n/\nscience and technology\n/\nArtificial Intelligence",
        "link": "https://www.thehindu.com/news/national/ai-summit-sees-smoother-second-day-after-chaotic-start/article70644068.ece",
        "date": "Wed, 18 Feb 2026 02:12:52 +0530",
        "fetched_at": "2026-02-18 04:02:13.103898"
    },
    {
        "title": "Vigilance unearths corruption, irregularities in implementation of DDU-GKY scheme in Kerala",
        "content": "In surprise inspections conducted State-wide, under the code name Operation Skill Guard, the Vigilance and Anti-Corruption Bureau has detected widespread corruption as well as serious irregularities in the implementation of the Deen Dayal Upadhyaya Grameen Kaushalya Yojana (DDU-GKY) scheme in the State.\nPreliminary investigations pointed to rampant corruption and irregularities indulged in by the project implementing agencies, in collusion with officials.\nThe surprise inspections were carried out on Monday from 10.30 a.m. onwards at 62 locations, including 47 selected project-implementing agencies, the State Project Office responsible for DDU-GKY, and 14 district implementation offices.\nThe Vigilance had received information that there were serious lapses and fraud in the execution of the scheme, including fake claims about trainee admissions even though they were not imparted any training, and producing fake salary certificates and forged bank statements to falsely show that the trainees had secured employment.\nThe Vigilance also had information on the misappropriation of project funds by implementing agencies, in collusion with district-level and State-level officials who were responsible for verification and monitoring.\nProjects were being approved without even verifying availability of basic infrastructure at training centres. Some implementing agencies were forging records to claim money for training people. Some trainees had not participated in any training.\nThe clause that implementing agencies should mandatorily have three years’ experience was being observed more in the breach.\nThe Vigilance also found that funds were collected fully without ensuring that the trainees had found placements. Project funds were utilised to pay salaries to staff who did not have any connection with the project.\nVerification through telephonic contact with trainees revealed that many had not received their post-placement allowances whereas in some cases, agencies had used forged records to claim post placement allowance.\nSeveral agencies had also failed to renew mandatory bank guarantees required for project execution. Despite this, funds were released even to agencies that had not properly recorded placement details in the online portal.\nIn some cases, agencies collected one or two instalments of project funds and abandoned training midway.\nThe Vigilance has also given out the details of specific irregularities it found in districts.\nIt has recommended detailed investigation into the irregularities and corruption in the implementation of the scheme and said that follow-up inspections will be conducted in the coming days.\nThe Director of Vigilance, Manoj Abraham, said in a statement that a detailed scrutiny of bank account statements of the implementing agencies, staff, trainees, and concerned officials was in order and that all project-related files would be re-examined. He also requested the public to share any information they may have on corruption related to the scheme through the Vigilance’s toll-free number 1064 or the phone number: 85929 00900 or on WhatsApp number 9447789100.",
        "link": "https://www.thehindu.com/news/national/kerala/vigilance-unearths-corruption-irregularities-in-implementation-of-ddu-gky-scheme-in-kerala/article70644063.ece",
        "date": "Tue, 17 Feb 2026 22:46:43 +0530",
        "fetched_at": "2026-02-18 04:02:13.713201"
    },
    {
        "title": "Agriculture Credit Outreach Campaign in Hubballi",
        "content": "As part of its nationwide initiative to enhance sustainable agriculture credit, the Central Bank of India, Regional Office, Hubballi, organised a Mega Agriculture Credit Outreach Campaign recently.\nInaugurating the campaign, Regional Head of the bank Dodda Rangappa said that the Mega Agri Credit Outreach Campaign reflects the bank’s commitment and unwavering support to strengthen the agriculture sector and uplift farming.\nThe campaign also provided a platform for direct interaction between bank officials and farmers, making them aware of various agriculture loan products, government-linked schemes and sustainable farming practices, he added.\nHe also highlighted the importance of social security schemes such as PMJJBY, PMSBY, APY and SSY.\nBranch Managers from Kerekalmatti, Navanagar and Kalghatgi branches along with agriculture customers were present.",
        "link": "https://www.thehindu.com/news/national/karnataka/agriculture-credit-outreach-campaign-held/article70643710.ece",
        "date": "Tue, 17 Feb 2026 21:59:58 +0530",
        "fetched_at": "2026-02-18 04:02:14.317624"
    },
    {
        "title": "Campaign for Rohith Act demands enactment of Bill in upcoming Budget session",
        "content": "Mavalli Shankar, State Convenor, Dalit Sangharsh Samiti, addressing a press meet at the press club in Bengaluru on Tuesday.\n| Photo Credit: J. ALLEN EGENUSE\nMembers of civil society group Campaign for Rohith Act have urged the State government to enact the Karnataka’s Rohith Vemula (Protection of SC/STs from Caste Discrimination in Higher Educational Institutions) Bill 2025, which aims to safeguard the right to education and dignity of the Scheduled Castes (SC), Scheduled Tribes (ST) students in universities and higher educational institutions, in the upcoming Budget session.\nThey also urged the government to release the draft Rohith Vemula Act for public consultation and announce a clear timeline for its introduction and passage in the Legislative Assembly.\nSpeaking at a press conference on Tuesday, Mavalli Shankar, State Convenor, Dalit Sangharsh Samiti said,\n“On January 17, 2026, Rahul Gandhi, Leader of the Opposition of Lok Sabha, publicly stated that the Karnataka government was in the process of implementing the Rohith Vemula Act. However, no draft has yet been released for public consultation, nor has a clear legislative timeline been announced. This delay has caused growing anxiety among SC/ST students across the State.”\n“The Campaign reiterates that existing regulatory measures, including the UGC Equity Regulations, 2026, are insufficient to address structural caste-based discrimination in higher education. A dedicated Rohith Vemula Act remains urgently necessary. The enactment of the Rohith Vemula Act would mark a historic step toward ensuring dignity, equality, and justice in Karnataka’s universities and colleges,” he added.",
        "link": "https://www.thehindu.com/news/national/karnataka/campaign-for-rohith-act-demands-enactment-of-bill-in-upcoming-budget-session/article70644008.ece",
        "date": "Tue, 17 Feb 2026 21:36:49 +0530",
        "fetched_at": "2026-02-18 04:02:14.916439"
    },
    {
        "title": "100 BUDS institutions to be raised to model status: Minister",
        "content": "A hundred BUDS institutions will be upgraded to model institutions this year, Minister for Local Self-Government M.B. Rajesh has said.\nHe was speaking after performing the State-level inauguration of Kudumbashree model BUDS institutions, the Chirakukal scheme for adolescents in BUDS institutions, a get-together of BUDS staff, release of revised guidelines for these institutions, and a study on their condition, here on Tuesday.\nThe Minister said 10 select institutions from Malappuram, Palakkad, Thrissur, and Alappuzha districts were being announced as model institutions in the first phase. Forty-one institutions have been selected as part of the second phase. A project was being prepared for each of them in association with the National Institute of Physical Medicine and Rehabilitation, Thrissur.\nThe government had given approval for spending ₹4.7 crore on infrastructure development and providing equipment for children in 29 select BUDS institutions functioning under the Kudumbashree, Mr. Rajesh said.\nHe also announced that a health/life insurance scheme would be launched for BUDS staff, including teachers and ayahs, from this year.\nThe Minister said ₹2 lakh each had been sanctioned for all BUDS institutions launched in the first phase for infrastructure development, while ₹25 lakh would be given to newly opened ones. An amount of ₹15 lakh each had also been sanctioned to 30 BUDS schools for purchasing vehicles.\nAs many as 187 BUDS schools and 218 BUDS rehabilitation centres function in the State.\nAccording to the revised guidelines, a unified training model would be implemented under the umbrella of the Kudumbashree for teachers and ayahs in these institutions. The Chirakukal scheme would help in development of practical knowledge and skills of adolescents in these institutions, the Minister said.\nKudumbashree Executive Director H. Dineshan said activities according to the new guidelines would help improve the quality of BUDS institutions.\nDistrict panchayat president V. Priyadarshini presided over the event. Ward councillor Rakhi Ravikumar was present.",
        "link": "https://www.thehindu.com/news/national/kerala/100-buds-institutions-to-be-raised-to-model-status-minister/article70644305.ece",
        "date": "Tue, 17 Feb 2026 21:33:18 +0530",
        "fetched_at": "2026-02-18 04:02:15.522804"
    },
    {
        "title": "State govt. delaying recruitment due to funds crunch, says Shashil Namoshi",
        "content": "BJP MLC Shashil G. Namoshi addressing a press conference in Kalaburagi on Tuesday.\n| Photo Credit: ARUN KULKARNI\nMember of the Legislative Council Shashil G. Namoshi on Tuesday launched a scathing attack on the Congress-led State government saying that its claims of “1,000 days of achievement” ring hollow in the face of 2.84 lakh vacant posts across 43 departments in the State.\nAddressing a press conference in Kalaburagi on Tuesday, Mr. Namoshi accused the State government of failing to address mounting vacancies and delaying recruitment on the pretext of internal reservation.\nHe said that 2,84,881 posts are lying vacant in 43 departments. Of these, 1.02 lakh posts are vacant in various Boards and Corporations, while around 40,000 posts remain unfilled in the seven districts of the Kalyana Karnataka region.\nProviding a department-wise break-up, he said that 93,293 posts are vacant in the Education sector, including 79,694 in Primary and Secondary Education and 13,599 in Higher Education.\nAs many as 37,572 posts are vacant in the Health and Family Welfare and Medical Education Departments, 28,188 in the Department of Personnel and Administrative Reforms, 10,867 posts in the Revenue Department and 10,504 posts in the Rural Development and Panchayat Raj Department.\nMr. Namoshi said that the State government is delaying appointments due to a lack of funds and its inability to bear the salary burden. In the last two-and-a-half years of governance under Chief Minister Siddaramaiah, he said, only 11,238 posts have been notified and 8,157 candidates recruited.\nHe, however, said that even these 8,157 appointments are now embroiled in litigation due to issues related to internal reservation with cases pending before courts.\nHe clarified that the BJP is not opposed to internal reservation but it has advised the State government to proceed with recruitment as per the earlier roster system until legal hurdles are resolved, instead of citing internal reservation as a reason for delay.\nHe contended that the State government has made an attempt to mask financial constraints by postponing recruitment and is now embarrassed after the High Court directed it to proceed with the appointment process by implementing the earlier 50% reservation roster system.\nHe demanded that the State government draw up a time-bound action plan to fill all vacant posts as per the earlier roster system and particularly, expedite recruitment to posts in the Kalyana Karnataka region in accordance with Article 371(J) without citing the need for Finance Department approval.\nHe urged the State government to prioritise immediate appointments to improve the quality of public services and provide employment opportunities to youth, instead of attributing delays to internal reservation issues.",
        "link": "https://www.thehindu.com/news/national/karnataka/state-govt-delaying-recruitment-due-to-funds-crunch-says-shashil-namoshi/article70643948.ece",
        "date": "Tue, 17 Feb 2026 21:22:47 +0530",
        "fetched_at": "2026-02-18 04:02:16.137673"
    },
    {
        "title": "No State has privatised government medical colleges, says CPI leader",
        "content": "Communist Party of India national secretary K. Ramakrishna on Tuesday alleged that no State in the country has privatised government medical colleges, but the State government has chosen to involve private stakeholders under the Public Private Partnership (PPP) policy.\nAddressing a joint press conference on the sidelines of the CPI State-level party meeting, Mr. Ramakrishna demanded that the government develop all necessary infrastructure in the newly sanctioned medical colleges on its own, without handing over responsibilities to private partners.\nCPI State secretary G. Eswarayya urged Chief Minister N. Chandrababu Naidu to revive discussions with the neighbouring Odisha government on the long-pending irrigation projects to safeguard the interests of farmers in the border districts.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/no-state-has-privatised-government-medical-colleges-says-cpi-leader/article70643580.ece",
        "date": "Tue, 17 Feb 2026 21:10:14 +0530",
        "fetched_at": "2026-02-18 04:02:16.747354"
    },
    {
        "title": "DRDO Chairman calls for collaborative defence research ecosystem in India",
        "content": "Secretary of Defence R&D and DRDO Chairman Samir V. Kamat emphasised the need for India to quickly establish a collaborative ecosystem where academia focuses on early development, while laboratories, start-ups, and MSMEs drive product deployment, aiming to develop new technologies within three to five years instead of lengthy cycles.\nMr. Kamat Interacted with the leadership and faculty members of SRM University-A.P. as part of his visit to the campus to strengthen research participation of emerging educational institutes in India towards national defence technology and research. He appreciated the ongoing research on Accelerated Materials Development using Integrated Computational Materials Engineering (ICME) led by Dean-Research of SRM University-A.P.Ranjit Thapa.\nMr. Kamat said that universities and private institutions had a strong role to play in strengthening defence innovation and research. “The growing engagement of universities is seen as critical to achieving national technology leadership and self-reliance,” he said. The DRDO Chairman advised SRM University-A.P. to collaborate closely with scientists from specialised DRDO laboratories to advance its research initiatives.\nSRM Group of Institutions Research Executive Director D. Narayana Rao presented a comprehensive overview of the university, highlighting multi-disciplinary programmes and research-intensive curriculum.\nFaculty members discussed current research pursuits in the emerging areas of AI, quantum technologies and computing, and green hydrogen. The research on Development of Quantum Navigation System (QNS) without GPS and fabrication of Quantum Sensors, led by Jatis Kumar Dash from the Department of Physics and colleagues, was lauded.\nSRM University-A.P. Pro-Chancellor P. Sathyanarayanan said the management’s vision was to transform the university into a world-class institution, distinguished for its excellence in emerging domains such as Artificial Intelligence, Quantum Technologies, Green Hydrogen, and Health Engineering, while actively contributing to the nation’s defence research ecosystem.\nAssistant Dean-Research Mahesh Kumar Ravva, Associate Dean-Technology Transfer Cell G.S. Vinodkumar and  Associate Professors Pardha Saradhi Maram and Sujith Kalluri from SRM University-A.P. also participated in the interaction.\nAndhra Pradesh\n/\nVijayawada",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/drdo-chairman-calls-for-collaborative-defence-research-ecosystem-in-india/article70644128.ece",
        "date": "Tue, 17 Feb 2026 21:05:58 +0530",
        "fetched_at": "2026-02-18 04:02:17.354970"
    },
    {
        "title": "T.N. government has not implemented any scheme to generate jobs: Annamalai",
        "content": "Tamil Nadu has not implemented any scheme for increasing job generation in the State, alleged K. Annamalai, former State president of the Bharatiya Janata Party (BJP) in Coimbatore on February 17, 2026, (Tuesday).\nHe told the media that according to the Interim Budget of the State, which was presented on Tuesday, the debt GDP ratio of the State has not reduced. Instead, the debt of the State in 2025-2026 is ₹9.29 lakh crore and it is projected to increase to ₹10.62 lakh crore next fiscal.\nTamil Nadu government will borrow ₹1.33 lakh crore in one year. According to the revenue receipt projection of the Budget last year, the State was expected to generate ₹3.31 lakh crore revenue. But, the actual realisation is ₹3.09 lakh crore. So there is ₹21,871 crore shortfall. “This is a government that does not generate revenue and spends by borrowing,” he said.\nThe gross enrolment ratio in higher education was 49 % when the DMK came to power four years ago. It has reduced by two percentage points to 47 % this year. The allocation for Higher Education Department is increased by just ₹11 crore. But, the government has announced that it will renovate Anna University at ₹1,380 crore. The allocation for the VB-G RAM G (rural employment scheme) has been reduced and just 23,879 people have submitted applications for the ‘Kalaignar Kaivinai Thittam’. The Central government implements the Vishwakarma scheme and though it is not implemented in Tamil Nadu, nearly eight lakh people had registered for it from the State.\nThe DMK government has said it spent ₹8,100 crore for temple renovation. But, it spent just about ₹82 crore. It should release a white paper on the amount spent for temples. The agriculture sector grew just 3 % in the State, while it grew at CAGR 10 % in Gujarat when Prime Minister Narendra Modi was the Chief Minister of Gujarat for 10 years, he claimed.\nThe PLI scheme of the Central government is instrumental for development of electronic clusters in the State. The DMK government has not implemented any scheme to generate jobs in Tamil Nadu, he said.",
        "link": "https://www.thehindu.com/news/cities/Coimbatore/tn-government-has-not-implemented-any-scheme-to-generate-jobs-annamalai/article70644079.ece",
        "date": "Tue, 17 Feb 2026 21:00:19 +0530",
        "fetched_at": "2026-02-18 04:02:17.966854"
    },
    {
        "title": "Antimicrobial resistance awareness drive launched in Kottayam",
        "content": "The Kottayam District Legal Services Authority (DLSA), in association with the Drugs Control department, Kerala, has launched a series of awareness programmes across the district on the theme antimicrobial resistance.\nDLSA chairperson and principal district judge Manoj M. inaugurated the initiative on Tuesday at a function held at the Kottayam Collectorate compound. DLSA secretary and senior division civil judge Praveen Kumar G. presided over the function.\nDistrict judges Lilly K. and Satheesh Kumar V., chief judicial magistrate Tejomayi Thampuratti, and assistant drugs controller Aju Kurian were present, along with district drugs inspectors Tara S. Pillai and Babita K. Vazhiyil.\nA flash mob performed by students of the Centre for Professional and Advanced Studies and a skit staged by students of Caritas College of Pharmacy were also part of the programme.",
        "link": "https://www.thehindu.com/news/national/kerala/antimicrobial-resistance-awareness-drive-launched-in-kottayam/article70643747.ece",
        "date": "Tue, 17 Feb 2026 21:00:08 +0530",
        "fetched_at": "2026-02-18 04:02:18.570402"
    },
    {
        "title": "All Cong. leaders will accept high command’s decision on leadership change: Minister",
        "content": "Minister Laxmi Hebbalkar.\n| Photo Credit: File photo\n“All members of the Congress, including Ministers, legislators, leaders and workers, will accept the decision of the party high command on leadership change,” Minister and Congress leader Laxmi Hebbalkar said in Belagavi on Tuesday.\n“We are all committed to adhering to the high command’s decision on the issue. However, we have been asked not to talk about it. It will not only be wrong to talk about it but also an unforgivable crime to do so,” she told reporters.\nShe was speaking at the launch of Akka Pade, an all-women police team aimed at protecting women and girls.\nMs. Hebbalkar said that she has asked officers to find a permanent solution to the problems of water scarcity in some of the areas in Belagavi, the district that has higher rain days than other districts.\n“We will implement them in such a way that the people do not suffer any inconvenience this summer,” she said.\nShe said that she is requesting the State government to create a Belagavi rural taluk. She added that she is working towards building a bus stand in Hire Bagevadi village, which has now been upgraded from a gram panchayat to a town panchayat.",
        "link": "https://www.thehindu.com/news/national/karnataka/all-cong-leaders-will-accept-high-commands-decision-on-leadership-change-minister/article70643022.ece",
        "date": "Tue, 17 Feb 2026 20:56:29 +0530",
        "fetched_at": "2026-02-18 04:02:19.207937"
    },
    {
        "title": "Forum for Good Governance urges State government to expedite 2010 liquor scam cases",
        "content": "The Forum for Good Governance has urged the Telangana government to expedite action in the long-pending 2010 liquor scam cases, alleging prolonged delays and lack of clarity on proceedings against several officials.\nIn a representation to Chief Minister A. Revanth Reddy, Forum president M. Padmanabha Reddy stated that though a Special Investigation Team (SIT) was initially constituted in undivided Andhra Pradesh to probe the scam, it was abruptly wound up and the inquiry was later entrusted to the Anti-Corruption Bureau (ACB).\nAs per submissions made earlier before the High Court, 48 cases were registered involving 1,118 officials and 174 private individuals, with prosecution orders reportedly issued against 929 officials in 2012. However, the Forum alleged that after State bifurcation, there has been little visible progress.\nCiting information obtained through RTI response on February 5, the Forum claimed that while prosecution permission was granted in 316 cases relating to the Prohibition and Excise Department, 211 were referred to tribunals for disciplinary proceedings, 75 were sent to Commissioner of Inquiries and 20 were sent for department inquiries and none have reached final disposal. It also sought clarity on action taken against 132 police officials who were reportedly ordered to be prosecuted.\n“During last 16 years, some tainted officials got promotion and some retired.  In case of Home department, 132 police officials were ordered to be prosecuted. The delay in disposal of liquor scam cases is sending wrong signal to corrupt officials, especially in Prohibition and Excise department and in Police department,” the letter read.",
        "link": "https://www.thehindu.com/news/cities/Hyderabad/forum-for-good-governance-urges-state-government-to-expedite-2010-liquor-scam-cases/article70643230.ece",
        "date": "Tue, 17 Feb 2026 20:54:05 +0530",
        "fetched_at": "2026-02-18 04:02:19.815586"
    },
    {
        "title": "₹150 crore sanctioned for replacing Dowleswaram Barrage gates, says A.P. Minister",
        "content": "The gates of Dowleswaram Barrage will be replaced in phases, using stop-log gates to ensure an uninterrupted irrigation water supply.\n| Photo Credit: File Photo\nThe Andhra Pradesh government has sanctioned ₹150.09 crore for replacing the gates of the Dowleswaram Barrage on the Godavari, Water Resources Minister Nimmala Ramanaidu informed the Legislative Assembly on Tuesday.\nReplying to a question by Anaparthi MLA Nallamilli Ramakrishna Reddy during the Question Hour, the Minister described the Dowleswaram Barrage as the ‘lifeline’ of the Godavari delta system, irrigating about 10.13 lakh acres in the undivided twin Godavari districts and meeting drinking water and industrial needs.\nMr. Ramanaidu recalled that in 2014, the Telugu Desam Party government had replaced 58 of the 175 gates of the Dowleswaram Barrage at a cost of ₹31.77 crore. After assuming office in 2024, the coalition government sanctioned funds to replace the remaining 117 gates.\nMr. Ramanaidu alleged that warnings from the Central Water Commission (CWC) during the previous YSR Congress Party’s (YSRCP) tenure were not adequately addressed.\nHe credited Chief Minister N. Chandrababu Naidu for prioritising the barrage’s safety and modernisation. The works will be executed in phases, using stop-log gates to ensure an uninterrupted irrigation water supply.\nAdditionally, ₹13.4 crore has been allocated for preparing a Detailed Project Report (DPR) and conducting an aerial LiDAR survey to address flood management and structural concerns in the Godavari Delta.\nThe Minister also responded to queries by Kandukur MLA Inturi Nageswara Rao on the Rallapadu Reservoir in Prakasam district. He informed the House that the reservoir, with a storage capacity of 1.10 tmc ft, irrigates nearly 16,000 acres and supplies drinking water to 116 villages. Of this, 14,500 acres are served through the right canal and 1,500 acres through the left main canal.\nHe stated that ₹36.50 crore had earlier been sanctioned for the expansion of the left main canal, but the works were cancelled later. In December 2024, technical issues prevented the lifting of stop-log gates, affecting water release despite the reservoir being full. Motors were subsequently installed to restore supply.\nThe government has undertaken repairs and canal works at a cost of ₹2.54 crore and is taking up 190 minor irrigation works in Kandukur constituency at an estimated cost of ₹10.86 crore to strengthen irrigation infrastructure, he added.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/150-crore-sanctioned-for-replacing-dowleswaram-barrage-gates-says-ap-minister/article70643727.ece",
        "date": "Tue, 17 Feb 2026 20:51:26 +0530",
        "fetched_at": "2026-02-18 04:02:20.430651"
    },
    {
        "title": "PM Modi Shares Serbia President’s Article As India’s AI Growth Wins Global Praise",
        "content": "Prime Minister Narendra Modi shared and welcomed Serbia President Aleksandar Vucic’s praise for India’s artificial intelligence progress and its growing global influence, posting his remarks on social media platform X (formerly Twitter).\n“A fine article by President Aleksandar Vucic of the Republic of Serbia, in which he talks about AI, of course, but at the same time highlights his fondness for India, India’s strides in AI and strong India-Serbia relations!\" PM Modi wrote while sharing the Serbian leader’s opinion piece.\nIn his article published in The Indian Express, Vucic praised India’s technological ambitions and described the country as being at the centre of global conversations on artificial intelligence.\nHe said India’s approach to AI focuses on “real-world deployment, ethical standards and inclusive innovation\" with applications spanning healthcare, agriculture, education and financial inclusion. He noted that this pragmatic model reflects India’s aspiration to become a trailblazer in using technology for societal good.\nVucic also said the India AI Impact Summit places the country “firmly at the centre of the global discourse on artificial intelligence,\" and credited PM Modi’s vision to democratise access to technology so that its benefits reach everyone, not just a privileged few.\nReflecting on India’s broader trajectory, the Serbian President said India possesses qualities such as “grit, equanimity and self-belief\" in abundance and declared that those who underestimate India’s potential would be proven wrong.\n“India is not arriving at the future. It is helping to define it,\" he wrote.\nWorld And Tech Leaders Praise India’s AI Growth\nGlobal leaders and technology executives also voiced strong support for India’s growing leadership in artificial intelligence. UN Secretary-General Antonio Guterres praised India as the ideal host for the AI Impact Summit, calling the country “a very successful emerging economy\" with an increasingly important role in global affairs.\n“I see India in the centre of those emerging economies,\" Guterres said, adding that he has “a lot of hope for the role that India can play in shaping this multipolar world.\" He also congratulated India for organising the summit and emphasised the importance of ensuring AI benefits all countries, particularly in the Global South.\nSundar Pichai, CEO of Google and Alphabet, described the current moment as an “extraordinary time of hyper progress\" and reaffirmed the company’s commitment to partnering with India across the entire AI ecosystem.\nOpenAI CEO Sam Altman also backed India’s ambitions, saying the country could emerge as a “full-stack AI leader\" capable of building core AI systems, infrastructure and applications.\nLatest Blogs",
        "link": "https://www.news18.com/india/pm-modi-shares-serbia-presidents-article-as-indias-ai-growth-wins-global-praise-ws-l-9911514.html",
        "date": "Wed, 18 Feb 2026 09:27:44 +0530",
        "fetched_at": "2026-02-18 04:02:26.471535"
    },
    {
        "title": "AI Summit 2026 India LIVE Updates: PM Modi Says India Must Be A Top Three AI Superpower By 2047",
        "content": "Emmanuel Macron India AI Summit 2026 LIVE Updates: French President Emmanuel Macron will attend the AI Impact Summit hosted by India in Delhi on Wednesday.\nMacron and France’s First Lady Brigitte Macron arrived in Mumbai on Tuesday for an official three-day visit to India from 17 to 19 February 2026. This is his fourth official visit to India.\nAt a joint press meet with Prime Minister Narendra Modi, Macron thanked him for the welcome and spoke about attending the AI summit.\nPrime Minister Narendra Modi and President Macron inaugurated the India-France Year of Innovation 2026 at the Gateway of India.\nSpeaking at the India-France Innovation Forum, Macron said the question is no longer whether India innovates, but who will innovate with India. He said France wants to be that partner and added, “We are here. We want to be here with you. And we are not leaving.”\nHe also announced an Innovation Day to be held before the G7, led by Franco-Indian initiatives and bringing together students and researchers. Macron said France wants to be a trusted partner so that both countries’ industries can deliver unique cooperation.\nThe India AI Impact Summit 2026 is being held from 16 to 20 February at Bharat Mandapam in New Delhi. It is the first major global AI event hosted in the Global South.\nThe summit, organised under the IndiaAI Mission, focuses on People, Planet and Progress. It features 12 indigenous foundation models in 22 Indian languages and pavilions from France, Japan, the UK and others.\nFrance has the largest international pavilion, covering 436 square metres, with 29 companies showcasing AI across several sectors.\nPM Modi praised Serbian President Aleksandar Vučić for his insightful article on AI and his admiration for India.\nSharing it on X, the Prime Minister highlighted Vučić’s recognition of India’s progress in artificial intelligence and the deep, growing partnership between India and Serbia.\nA fine article by President Aleksandar Vučić of the Republic of Serbia, in which he talks about AI, of course, but at the same time highlights his fondness for India, India’s strides in AI and strong India-Serbia relations! @predsednikrs https://t.co/5k4yAEUMwI\n— Narendra Modi (@narendramodi) February 18, 2026\nPM Modi said India must become one of the world’s top three AI superpowers by 2047, outlining an ambitious national tech vision.\nIndia is hosting the AI Impact Summit 2026 for the first time in the Global South. The motto is “Sarvajan Hitay, Sarvajan Sukhaye” – Welfare for All, Happiness of All.\nPrime Minister Narendra Modi said AI stands at a civilisational turning point. It can expand human capability but may also test social foundations if left unguided. The summit focuses on impact that ensures fair and meaningful outcomes, not just innovation. Technology must serve humanity, not replace it.\nThe summit centres on People, Planet and Progress, aiming to spread AI’s benefits widely and support global development in a human-centric way, he added.\nAs India hosts the AI Impact Summit in Delhi, I’ve shared my thoughts on the transformative potential of AI, the role India can play in the AI revolution and more in this interview with ANI. https://t.co/0rYOGdm1AX\n— Narendra Modi (@narendramodi) February 18, 2026\nGoogle and Alphabet CEO Sundar Pichai will also be attenting the AI Summit today.\nHe posted on X, “Nice to be back in India for the AI Impact Summit – a very warm welcome as always and the papers looked great too:)”\nNice to be back in India for the AI Impact Summit – a very warm welcome as always and the papers looked great too:) pic.twitter.com/szM9g2wB4d\n— Sundar Pichai (@sundarpichai) February 18, 2026\nWelcome to our blog, bringing you live updates as French President Emmanuel Macron attends the AI Impact Summit in Delhi today.\nLatest Blogs",
        "link": "https://www.news18.com/india/ai-summit-2026-live-updates-emmanuel-macron-pm-modi-india-ai-impact-summit-day-3-delhi-bharat-mandapam-latest-news-liveblog-9911393.html",
        "date": "Wed, 18 Feb 2026 09:27:01 +0530",
        "fetched_at": "2026-02-18 04:02:27.249470"
    },
    {
        "title": "India Considering Age-Based Restrictions With Social Media Platforms, Says IT Minister",
        "content": "After Australia, India is now considering age-based restrictions with social media companies, Information Technology Minister Ashwini Vaishnaw said on Tuesday.\n“This is something which has now been accepted by many countries, that age-based [restrictions] … has to be there,\" Vaishnaw said during a press conference at the AI Impact Summit in the national capital.\n“Right now we are in conversation regarding deepfakes, regarding age-based restrictions, with the various social media platforms,\" Vaishnaw said, adding that the government is discussing “the right way\" to enforce the regulation.\nHowever, the minister did not name any specific platforms or companies that are in conversation with the central government.\nAny restrictions in India — a country with around 1.4 billion population — could have a major impact on social media firms including Meta and Google, which enjoy an enormous user base in the country.\nAUSTRALIA BANS SOCIAL MEDIA FOR UNDER-16s\nThe move comes as several governments are considering age-based restrictions with social media platforms, given the rising cases of deepfakes, digital arrests, and online blackmailing.\nRecently, in December, the Australian government banned users under 16 from accessing major social media platforms. Australia emerged as the first nation in the world to enact such a rule.\nDenmark last year approved a new rule to bar users under 15 from social media. In addition, Spain this month announced it would ban under-16s from social media.\nMeta’s Facebook and Instagram are two of the most popular social media platforms in India, while Google’s YouTube also boasts a huge audience.\nLatest Blogs",
        "link": "https://www.news18.com/india/india-considering-age-based-restrictions-with-social-media-platforms-says-it-minister-ws-l-9911263.html",
        "date": "Wed, 18 Feb 2026 07:28:03 +0530",
        "fetched_at": "2026-02-18 04:02:28.672881"
    },
    {
        "title": "Emmanuel Macron Extends Invite To PM Modi To Attend 52nd G7 Summit In France",
        "content": "French President Emmanuel Macron on Tuesday invited Prime Minister Narendra Modi to the 52nd G7 Summit, which will be presided over by France in 2026.\nMacron, who is currently on a three-day visit to India, called for an ad hoc meeting between India and France to reach an agreement on the international agenda ahead of the G7 Summit in Evian.\n“This year, 2026, is a year of acceleration for our partnership, of translating much of this agenda into action. It is also the year in which the Prime Minister, you, will chair the BRICS group, and France will chair the G7 group. In this spirit, I have invited Prime Minister Modi as a very special guest to the G7 Summit in Evian,\" the French President said.\n“It is also to this end that we have together decided to have, as part of a bilateral segment that the Prime Minister will hold, a moment for innovation, our youth, bringing together Indian youth from the best universities and research centres, our youth in France, Europe, and the G7, so that we can continue to mobilise in the service of innovation and the resolution of the major problems we face,\" he added.\nMacron further called for an effective partnership between New Delhi and Paris over research, student exchanges, and trade.\nThe Group of Seven (G7) is an intergovernmental political and economic forum consisting of United States, the United Kingdom, France, Germany, Japan, Italy, Canada, and the European Union (EU).\nLast year, Prime Minister Narendra Modi attended the summit on Canadian Prime Minister Mark Carney’s invitation.\nMeanwhile, BRICS is an international group of eleven countries comprising India, Brazil, China, Egypt, Ethiopia, Indonesia, Iran, Russia, Saudi Arabia, South Africa, and the UAE.\nAccording to the joint statement released by India and France, Prime Minister Modi has welcomed the invitation, noting India’s longstanding partnership with the G7 and its commitment.\nBoth leaders further expressed confidence that India’s participation would further strengthen collective efforts to address global challenges and promote a more balanced, inclusive, and resilient international order.\n(With agency inputs)\nLatest Blogs",
        "link": "https://www.news18.com/india/emmanuel-macron-extends-invite-to-pm-modi-to-attend-52nd-g7-summit-in-france-9911241.html",
        "date": "Wed, 18 Feb 2026 06:21:31 +0530",
        "fetched_at": "2026-02-18 04:02:29.695291"
    },
    {
        "title": "‘We Never Claimed’: Galgotias University Clarifies Robodog Displayed At AI Summit Was Chinese-Made",
        "content": "Galgotias University on Tuesday issued a clarification after facing criticism over the display of a robotic dog at the ongoing AI summit in the national capital, saying it “never claimed to have built the device\" and that it was procured from a Chinese manufacturer for academic purposes.\nIn a statement, the university said the robotic dog was acquired from Unitree, a global robotics company based in China, and is being used as a learning tool for students.\n“Let us be clear, Galgotias has not built this robodog, nor have we claimed to do so. What we are building are minds that will soon design, engineer and manufacture such technologies in Bharat,\" the university said.\nThe clarification followed a social media backlash after reports claimed that the university showcased the Unitree Go2 robotic dog, an AI-powered device available on Chinese platforms for Rs 2–3 lakh, under the name “Orion\" at the AI summit in New Delhi.\nSeveral users accused the institution of presenting imported technology as indigenously developed.\nResponding to the controversy, the university said its focus has always been on exposing students to cutting-edge global technologies to prepare them for future innovation.\n“From the US to China and Singapore, we bring advanced technologies to campus because exposure creates vision, and vision creates creators,\" the statement said, adding that the robodog is actively being used by students to test capabilities and explore real-world applications.\nEmphasising its academic intent, Galgotias University said innovation should not be limited by borders and learning must remain global in outlook.\n“This is not about importing technology, but about inspiring transformation. Our students study, challenge and improve upon global innovations so they can eventually build world-class solutions from India for the world,\" it added.\nThe university said it would continue to source advanced technologies internationally to support hands-on learning and foster an ecosystem that empowers young innovators to develop indigenous solutions in the long run.\nLatest Blogs",
        "link": "https://www.news18.com/india/we-never-claimed-galgotia-university-clarifies-robodog-displayed-at-ai-summit-was-chinese-made-9911059.html",
        "date": "Tue, 17 Feb 2026 22:20:59 +0530",
        "fetched_at": "2026-02-18 04:02:30.326942"
    },
    {
        "title": "Delhi Police Register FIR Over Alleged Product Theft At AI Impact Summit",
        "content": "Delhi Police has registered a First Information Report (FIR) in connection with the alleged theft of AI wearable devices during the ongoing India AI Impact Summit at Bharat Mandapam in the national capital.\nThe action came after a Bengaluru-based startup founder claimed that his company’s AI wearable product went missing from a exhibition stall during a security evacuation ahead of Prime Minister Narendra Modi’s visit on the opening day of the summit.\nDhananjay Yadav, co-founder and CEO of NeoSapien, claimed that the company’s AI wearable went missing from its booth at the summit venue after exhibitors were asked to vacate the area ahead of PM Modi’s visit.\nIn a post on X, Yadav described the incident as “shocking\" and said Day 1 of the summit “turned out to be a pain\" for the company. According to him, security personnel began clearing the exhibition area around noon to sanitise the venue ahead of the Prime Minister’s scheduled visit.\nYadav said that he tried to explain that NeoSapien had developed what he described as India’s first patented AI wearable, capable of tracking conversations and analysing emotions, and requested permission to stay back briefly to showcase it.\n“Day 1 of the AI Impact Summit turned to be a pain for us. At 12 noon, security personnel arrived to sanitise and cordon off the area ahead of the visit by PM Modi visit at 2pm. I explained that we’re building India’s first patented AI wearable at NeoSapien and requested a chance to showcase it,\" he said in a post on X.\nWhile one officer initially allowed him to remain, he alleged that another security team later instructed all exhibitors to vacate the area immediately.\nHe said that he specifically asked whether he should carry the wearable devices along, but was told that even laptops were being left behind and that security would ensure the safety of items kept inside the booths.\n“Trusting them, I left,\" Yadav wrote, adding that the exhibition zone remained sealed for nearly six hours. When access was restored, he claimed the AI wearables were missing. He later shared images on social media showing empty boxes at the NeoSapien stall.\nHe questioned that how the theft could have taken place when, according to him, only security personnel were allowed inside the exhibition zone at the time.\n“If only security and official entourage had access, how did this happen? This is extremely disappointing,\" he added.\nMeanwhile, Union Electronics and IT Minister Ashwini Vaishnaw on Tuesday issued a formal apology for logistical challenges and overcrowding that marked the opening day of the summit. Addressing a press conference at Bharat Mandapam, he attributed the disruptions to an “unprecedented\" surge in attendance, with more than 70,000 people arriving at the venue on the first day alone.\nVaishnaw said registrations for the five-day event have crossed 300,000 and acknowledged that “pockets of confusion\" emerged due to the scale of participation and security arrangements for the Prime Minister’s inauguration. He said a dedicated war room has since been set up to streamline operations and prevent further inconvenience to exhibitors and delegates.\nThe India AI Impact Summit, being held at Bharat Mandapam, is among the most high-profile technology events hosted in the country this year. The five-day summit, inaugurated on 16 February, has drawn global attention with attendees including Sundar Pichai and Sam Altman.\nLatest Blogs",
        "link": "https://www.news18.com/cities/new-delhi-news/delhi-police-register-fir-over-alleged-product-theft-at-ai-impact-summit-ws-l-9910967.html",
        "date": "Tue, 17 Feb 2026 21:23:47 +0530",
        "fetched_at": "2026-02-18 04:02:30.940633"
    },
    {
        "title": "Telangana Allows Muslim Govt Employees To Leave Office Early During Ramzan",
        "content": "The Telangana government permitted Muslim employees working in government offices to leave work an hour early during the month of Ramzan to offer prayers.\nChief Secretary K Ramakrishna Rao issued an official memorandum allowing Muslim government employees, including teachers, contract and outsourcing staff, employees of boards and corporations, and those working in public sector undertakings, to leave their offices or schools at 4 pm during the fasting period.\nThe relaxation will be in effect from February 19 to March 20, except in cases where employees are required to remain on duty due to service exigencies.\nIn a related move, the state’s Director of School Education has approved revised school timings for Ramzan.\nFrom February 19 to March 20, all Urdu-medium government and aided schools, Urdu-medium sections in parallel-medium schools, and DIET colleges will function from 8 am to 1.30 pm.\nTo compensate for the reduced instructional hours, upper primary and secondary schools will be required to operate for one additional working day, while primary schools will extend their daily schedule by 30 minutes on two working days.\nRegional and district education officers have been directed to ensure strict implementation of the revised timings and compensatory arrangements, in line with established practices.\nMeanwhile, the Andhra Pradesh government has also issued similar orders allowing Muslim employees in government offices and educational institutions to leave work an hour early during Ramzan.\nMinister for Minority Welfare NMD Farooq said the concession in Andhra Pradesh will be applicable from February 18 to March 19.\nOfficials said the measure is intended to facilitate the observance of religious practices during the fasting month, and departments have been instructed to ensure uniform implementation, barring emergency situations.\nLatest Blogs",
        "link": "https://www.news18.com/india/telangana-allows-muslim-govt-employees-to-leave-office-early-during-ramzan-9910837.html",
        "date": "Tue, 17 Feb 2026 19:49:31 +0530",
        "fetched_at": "2026-02-18 04:02:31.608191"
    },
    {
        "title": "‘Tech To Serve Humanity...’: PM Modi Explains Vision Of India’s AI Summit, Motto Meaning",
        "content": "Prime Minister Narendra Modi on Tuesday said that technology exists to serve humanity, not replace it.\nIn an exclusive interview with news agency ANI, the Prime Minister explained the vision behind India’s AI Impact Summit 2026 and its motto, “Sarvajan Hitay, Sarvajan Sukhaye,\" saying that the guiding spirit of the summit reflects India’s civilisational philosophy.\n“The guiding spirit, “Sarvajan Hitay, Sarvajan Sukhaye“, reflects India’s civilisational philosophy. The end goal of technology should be ‘Welfare for All, Happiness of All’. Technology exists to serve humanity, not replace it,\" he said.\nPM Modi further said that artificial intelligence stands at a “civilisational inflection point,\" capable of expanding human capability in unprecedented ways but also posing challenges if left unguided. “That is why we have deliberately framed this Summit around Impact that ensures meaningful and equitable outcomes, not just innovation,\" he said.\nThe Prime Minister emphasised that while AI may enhance human capabilities, the ultimate responsibility for decision-making must always remain with human beings.\nHis remarks came amid the ongoing AI Impact Summit 2026 in the national capital- the first time a global artificial intelligence gathering of this scale is being hosted in the Global South.\nThe Prime Minister said that the summit is structured around three pillars — People, Planet and Progress — and emphasised that AI systems draw upon knowledge and data generated across societies worldwide.\n“AI systems draw upon knowledge and data generated across societies worldwide. Therefore, we want AI’s benefits to be diffused to everyone and not just hoarded by early adopters,\" he said.\nHe further said that as the first global AI summit hosted in the Global South, India is creating a platform that amplifies under-represented voices and development priorities.\nHighlighting India’s priorities, PM Modi said AI governance, inclusive datasets, climate applications, agricultural productivity, public health and multilingual access are central to the country’s approach.\n“Our vision is clear: AI must accelerate global development while remaining deeply human-centric,\" he said.\nIndia is hosting the AI Impact Summit 2026 at Bharat Mandapam in New Delhi from February 16-20, bringing together global policymakers, technology leaders and AI innovators. The event marks the first major global AI summit to be held in the Global South. Prime Minister Narendra Modi inaugurated the India AI Impact Expo on Monday.\nThe summit, which features over 300 pavilions and delegates from 60 countries, continues to host high-profile discussions on responsible AI, sovereign models like BharatGen, and the inevitable role of AI in national defence.\nThe summit, positioned as one of the world’s largest gatherings dedicated to artificial intelligence, initially struggled to cope with the sheer scale of global interest. With total registrations already surpassing 300,000, the first day saw long queues and significant delays at entry points. Participants, including startup founders, international delegates, and researchers, reported being stranded for hours as security protocols for VVIP movements—including the inauguration by Prime Minister Narendra Modi—clashed with the massive public footfall.\nLatest Blogs",
        "link": "https://www.news18.com/india/tech-to-serve-humanity-pm-modi-explains-vision-of-indias-ai-summit-motto-meaning-ws-l-9910587.html",
        "date": "Tue, 17 Feb 2026 20:45:20 +0530",
        "fetched_at": "2026-02-18 04:02:32.249606"
    },
    {
        "title": "'Conduct Yourselves With Dignity': Court Asks Sunjay Kapur's Wife, Sister To Exercise Restraint",
        "content": "The Delhi High Court on Tuesday ordered late industrialist Sunjay Kapur’s wife, Priya Kapur, and sister Mandhira Kapur Smith to refrain from making public statements against each other amid an escalating defamation dispute.\nWhile hearing a civil suit filed by Priya Kapur, who has accused her sister-in-law of running a continuous and defamatory campaign against her through podcasts, interviews, social media posts and other public statements, Justice Mini Pushkarna emphasised the need for dignity and decorum given the nature of the dispute, and said, “Both parties are directed to exercise restraint in making statements on each other, directly or indirectly,\" news agency PTI reported.\nThe high court also issued summons to Mandhira Kapur Smith and podcast host Pooja Chaudhri in the matter and listed the case for further hearing in May.\nIn her lawsuit, Priya Kapur alleged that within days of Sunjay Kapur’s death, his sister “embarked upon a systematic and organised course of conduct\" to malign and socially discredit her.\nAccording to the suit, the alleged defamatory statements falsely accused her of dishonesty, moral impropriety, professional incompetence, concealment of assets and illegitimate assumption of corporate control. The plea further claimed that such content was deliberately published and amplified through the podcast ‘InControversial with Pooja Chaudhri’, causing serious harm to her reputation, dignity, privacy and mental peace.\nSenior counsel appearing for Priya Kapur argued that Mandhira had uploaded and circulated content on social media with the intent to tarnish her reputation. The suit sought a permanent injunction restraining the defendants from publishing any further content against her, removal of existing material, an unconditional public apology and damages of Rs 20 crore.\nOn the other hand, counsel for Mandhira Kapur Smith told the court that there was a “concerted media vilification campaign\" against her as well.\nSunjay Kapur passed away on June 12 last year after collapsing during a polo match in England. He reportedly suffered a sudden cardiac arrest.\nPriya Kapur has also filed a criminal defamation case against Mandhira Smith before a trial court.\n(With inputs from agencies)\nLatest Blogs",
        "link": "https://www.news18.com/india/conduct-yourselves-with-dignity-court-asks-sunjay-kapurs-wife-sister-to-exercise-restraint-9910297.html",
        "date": "Tue, 17 Feb 2026 18:27:20 +0530",
        "fetched_at": "2026-02-18 04:02:32.937692"
    },
    {
        "title": "AI Summit Snarl: Ashwini Vaishnaw Apologises, Says Massive Youth Turnout Behind Day-One Disruptions",
        "content": "Union Electronics and IT Minister Ashwini Vaishnaw issued a formal apology on Tuesday for the logistical hurdles and overcrowding that marred the opening day of the India AI Impact Summit. Speaking at a press conference at New Delhi’s Bharat Mandapam, the minister attributed the disruptions to a “phenomenal\" and unprecedented surge in attendance, which saw more than 70,000 people arrive at the venue on the first day alone.\nThe summit, positioned as one of the world’s largest gatherings dedicated to artificial intelligence, initially struggled to cope with the sheer scale of global interest. With total registrations already surpassing 300,000, the first day saw long queues and significant delays at entry points. Participants, including startup founders, international delegates, and researchers, reported being stranded for hours as security protocols for VVIP movements—including the inauguration by Prime Minister Narendra Modi—clashed with the massive public footfall.\n“The response was phenomenal. The energy is palpable,\" Vaishnaw remarked, acknowledging the enthusiasm of the youth and the tech community. He admitted that the intensity of the crowd had caused “pockets of confusion\", but assured stakeholders that a dedicated war room has been operational since Monday to streamline the experience for the remainder of the five-day event.\nThe first day was not without specific controversies. Several exhibitors and startup founders voiced their disappointment on social media over overlapping security directives. Most notably, Dhananjay Yadav, CEO of Neo Sapien, alleged that AI wearables intended for display were stolen from his stall during a mandatory security evacuation for the Prime Minister’s visit. Other attendees flagged “patchy\" Wi-Fi connectivity and registration glitches that prevented even pre-registered delegates from accessing certain sessions.\nResponding to these criticisms, Vaishnaw emphasised that the government is “open-minded\" and actively seeking feedback to ensure the organisation remains smooth. He noted that seating capacities and help desks have been increased, and communication regarding security sweeps has been improved to prevent a repeat of the opening-day chaos.\nBeyond the apologies, the minister utilised the platform to outline India’s ambitious AI roadmap. He projected that the country is poised to receive over $200 billion in investments across the “AI stack\" over the next two years. He highlighted India’s unique position in the Global South, leveraging its Digital Public Infrastructure (DPI) to democratise AI access.\nThe summit, which features over 300 pavilions and delegates from 60 countries, continues to host high-profile discussions on responsible AI, sovereign models like BharatGen, and the inevitable role of AI in national defence. Despite the initial friction, the minister maintained that the event’s scale proves India has arrived as a central pillar of the global AI map.\nLatest Blogs",
        "link": "https://www.news18.com/tech/ai-summit-snarl-vaishnaw-apologises-says-massive-youth-turnout-behind-day-one-disruptions-9910194.html",
        "date": "Tue, 17 Feb 2026 17:28:49 +0530",
        "fetched_at": "2026-02-18 04:02:33.551435"
    },
    {
        "title": "‘Broken Seats, Non-Functional Screens’: Punjab MP Writes To Aviation Minister Over Air India Flights",
        "content": "Gurjeet Singh Aujla, the Congress MP from Amritsar, has written to Union Civil Aviation Minister Kinjarapu Rammohan Naidu raising concerns over the condition of Air India’s long-haul aircraft operating to destinations such as Vancouver, Toronto and Australia.\nIn his communication, Aujla said passengers on ultra-long-haul routes are paying high fares but travelling on aircraft with non-functional seat-back screens, broken or loose seats, damaged armrests, worn upholstery and poor cabin maintenance. He termed the situation “unacceptable\" and urged the minister to ensure immediate upgradation of the long-haul fleet, improved ground support and modern facilities for international passengers, particularly from Punjab. “Our diaspora deserves world-class service,\" he said.\nPassengers on long-haul flights to Vancouver, Toronto & Australia are paying very high fares but travelling on aircraft with non-functional screens, broken seats, worn upholstery & poor cleanliness. This is unacceptable.Urge Hon’ble Civil Aviation Minister Mr Ram Mohan Naidu to… pic.twitter.com/69KOFZs2Ov\n— Gurjeet Singh Aujla (@GurjeetSAujla) February 16, 2026\nThe MP stated that he has been receiving growing complaints, especially from travellers belonging to Punjab and the North Indian diaspora, regarding the condition and passenger facilities on these flights. He noted that many travellers have reported malfunctioning in-flight entertainment systems and overall unsatisfactory onboard conditions on journeys often exceeding 12 to 15 hours.\nWhile acknowledging that Air India has initiated a fleet retrofit and modernisation programme to upgrade interiors, seating and entertainment systems, Aujla pointed out that the completion timeline for wide-body aircraft stretches into 2027-28. He said that until the upgrades are fully implemented, passengers — including students, families and working professionals — continue to face avoidable discomfort despite paying premium fares, and called for interim measures to ensure acceptable standards of comfort and service.\nLatest Blogs",
        "link": "https://www.news18.com/india/broken-seats-non-functional-screens-punjab-mp-writes-to-aviation-minister-over-air-india-flights-ws-l-9909631.html",
        "date": "Tue, 17 Feb 2026 14:55:30 +0530",
        "fetched_at": "2026-02-18 04:02:34.193477"
    },
    {
        "title": "News18 Afternoon Digest: French President Emmanuel Macron’s India Visit, Bill Gates To Attend AI Summit & Other Top Stories",
        "content": "In today’s afternoon digest, News18 brings you the latest updates on the Delhi hit-and-run case, French President Emmanuel Macron’s India visit, Bill Gates attending the AI Summit, cricket legends writing to the Pakistan government over Imran Khan’s treatment, and other top stories.\nLatest Blogs",
        "link": "https://www.news18.com/india/news18-afternoon-digest-french-president-emmanuel-macrons-india-visit-bill-gates-to-attend-ai-summit-other-top-stories-9909523.html",
        "date": "Tue, 17 Feb 2026 14:57:22 +0530",
        "fetched_at": "2026-02-18 04:02:34.978082"
    },
    {
        "title": "All About Bharat Mandapan, The Venue Hosting AI Impact Summit In Delhi",
        "content": "Bharat Mandapam, India’s state-of-the-art International Exhibition and Convention Centre (IECC) at Pragati Maidan in New Delhi, is hosting the ongoing India AI Impact Summit 2026. The venue that now stages global gatherings once stood on what many saw as wasteland. Today, it can seat more people than the Sydney Opera House. Here is what you may not know.\n1. Built on historic ground\nBharat Mandapam stands on the 123-acre Pragati Maidan site in central New Delhi. The land hosted an international agriculture fair in 1959, attended by US President Dwight Eisenhower and Soviet leader Nikita Khrushchev during the Cold War.\nIt was also home to the Hall of Nations, considered the world’s first large-span cast-in-situ concrete space frame. The structure was demolished overnight in April 2017 despite protests and court cases.\n2. A name with meaning\n“Bharat\" means India. “Mandapam\" refers to a pillared pavilion in ancient temple architecture used for public rituals and ceremonies.\nThe name draws inspiration from the Anubhav Mandapam, a 12th-century concept promoted by Lord Basaveshwara as a space for open public discussion. The venue is intended to serve as a forum for dialogue.\n3. Inspired by a river\nThe design competition in 2016 was won by Sanjay Singh of Arcop Associates (Delhi) and Simon Nunez of Aedas (Singapore). Their concept was inspired by the Yamuna River, which once flowed close to the site.\nThe building’s elliptical form mirrors the river’s movement and is shaped like a shankha, or conch shell, a symbol in Hindu tradition. It has no designated front or rear entrance and appears the same from every side, reflecting equality and inclusivity.\n4. Larger than the Sydney Opera House\nThe main convention hall can seat up to 7,000 people in a single format. The Sydney Opera House has a combined seating capacity of about 5,500 across its venues.\nThe complex also includes a 3,000-seat open-air amphitheatre, six exhibition halls covering 150,000 square metres, and a total built-up area of 390,000 square metres. It was built at a cost of around Rs 2,700 crore, or about $325 million.\n5. A ‘window to Delhi’\nOn the fourth floor is a 120-metre-long lobby with floor-to-ceiling glass offering views of Kartavya Path, the India Gate canopy, and the domes of Rashtrapati Bhawan.\nThe feature was designed as a tribute to its location near Lutyens’ Delhi. Delegates can view one of the capital’s most recognised skylines from this space.\n6. From inauguration to G20\nPrime Minister Narendra Modi inaugurated Bharat Mandapam on July 26, 2023, marking Kargil Vijay Diwas.\nJust 45 days later, it hosted the 19th G20 Summit on September 9 and 10, welcoming leaders including US President Joe Biden, UK Prime Minister Rishi Sunak and French President Emmanuel Macron.\n7. Hosting AI Impact Summit\nFrom February 16 to 20, 2026, Bharat Mandapam is hosting the India AI Impact Summit. More than 250,000 visitors, over 100 countries and global technology leaders such as Google CEO Sundar Pichai and OpenAI CEO Sam Altman are attending.\nIn less than three years since its inauguration, the venue has hosted both a G20 Summit and a major global AI gathering.\nLatest Blogs",
        "link": "https://www.news18.com/india/all-about-bharat-mandapan-the-venue-hosting-ai-impact-summit-in-delhi-ws-l-9909259.html",
        "date": "Tue, 17 Feb 2026 14:23:44 +0530",
        "fetched_at": "2026-02-18 04:02:35.585284"
    },
    {
        "title": "India May Attract USD 200 Billion In AI Investments In Next Two Years: Ashwini Vaishnaw",
        "content": "Union Minister for Electronics and IT Ashwini Vaishnaw on Tuesday said India is expecting more than USD 200 billion in investments over the next two years, underscoring growing global interest in the country’s artificial intelligence and deep tech ecosystem.\n“There are two types of interest. The first type is investment. There is an expectation of more than 200 billion dollars in investment over the next two years. The second type is deep tech funding by VC. And the third type is India’s innovativeness and India’s digital public infrastructure,\" Vaishnaw told ANI on the sidelines of the India AI Impact Summit at Bharat Mandapam in New Delhi.\nElaborating on how India’s digital framework is accelerating adoption, he said, “Because of the digital public infrastructure, there is a very good technology framework under the leadership of the Prime Minister. Because of this framework, the diffusion of AI in India can be accelerated. This is what everyone believes.\"\nThe minister noted strong interest from global CEOs, particularly in deep tech startups and infrastructure projects. “A lot of interest in investing in India, especially in the Indian deep tech startups, in the infra, also in finding new solutions at population scale. Because the way our Honorable Prime Minister Narendra Modi has created this digital public infrastructure in our country, that brings out a huge advantage for any solution which needs to be brought at a population scale,\" he said.\nHighlighting the enthusiasm around the summit, Vaishnaw said participation has been overwhelming, especially among youth and researchers. “There is a lot of excitement in AI Summit. More than 300,000 youth and researchers and students have registered. And all the sessions are going full. They are houseful. There is a lot of excitement, And especially among the youth. Through this summit, there is a new energy all over the country. By using AI, how to solve big problems on a population scale, such excitement is seen here among the youth,\" he said.\nHe also emphasised the need to balance innovation with safeguards. “By balancing these two, we have to move forward with this new technology,\" he noted, referring to solving large-scale economic and social challenges while mitigating risks.\nThe India AI Impact Summit has brought together policymakers, industry leaders, investors and innovators to discuss leveraging artificial intelligence for economic growth and social transformation. Prime Minister Narendra Modi is scheduled to deliver the inaugural address on Thursday, setting the tone for enhanced global cooperation and India’s vision for inclusive and development-focused AI.\nLatest Blogs",
        "link": "https://www.news18.com/india/over-200-billion-investment-expected-vaishnaw-on-indias-ai-push-ws-l-9909439.html",
        "date": "Tue, 17 Feb 2026 15:47:34 +0530",
        "fetched_at": "2026-02-18 04:02:36.188910"
    },
    {
        "title": "When Dues Go Unpaid: Court Locks Railway Office Over Farmer Compensation",
        "content": "In a striking display of judicial enforcement, the Senior Section Engineer’s (SSE) office of the Railway Department in Srirangapatna, Karnataka was seized on Wednesday after officials failed to settle a long-standing compensation debt owed to a local farmer.\nThe dispute dates back to the land acquisition process for the Bengaluru-Mysuru double-track railway project. During the expansion, the Railway Department acquired agricultural land belonging to Mahadevaiah, a resident of Baburayanakoppal village.\nWhile the land was taken for public infrastructure, the compensation provided was far below the market value. As per the then prices of land in the area, the compensation agreed upon to be paid by Railway Department was Rs 50 lakh but it was never paid in full.\nSeeking fair treatment, Mahadevaiah moved the court to demand enhanced compensation. Following a prolonged legal battle, the court ruled in his favour, ordering the Railway Department to pay the remaining balance along with accrued interest, totaling several lakhs of rupees.\nThe Seizure: Furniture and Computers Confiscated\nDespite the clear judicial mandate and multiple follow-up notices, the railway authorities failed to release the funds. Exhausting his options, the farmer filed an Execution Petition (EP), prompting the court to authorize the attachment of the department’s movable property.\nOn Wednesday, court bailiffs arrived at the SSE office located near the Srirangapatna railway station. When officials were unable to produce the payment, the staff began clearing the office of its essential assets. The confiscated items included:\nThe Aftermath\nThe seized assets were loaded into vehicles and transported to the court premises. Court officials have made it clear that if the compensation is not disbursed immediately, they will proceed with the next phase of legal attachment, which could include more significant departmental assets.\nThe incident has resonated strongly with the local farming community, serving as a rare example of a common citizen successfully holding a major government entity accountable through the power of the judiciary.\nWhile the land was taken for public infrastructure, the compensation provided was far below the market value. As per the then prices of land in the area, the compensation agreed upon to be paid by Railway Department was Rs 50 lakh but it was never paid in full.\nSeeking fair treatment, Mahadevaiah moved the court to demand enhanced compensation. Following a prolonged legal battle, the court ruled in his favour, ordering the Railway Department to pay the remaining balance along with accrued interest, totaling several lakhs of rupees.\nThe Seizure: Furniture and Computers Confiscated\nDespite the clear judicial mandate and multiple follow-up notices, the railway authorities failed to release the funds. Exhausting his options, the farmer filed an Execution Petition (EP), prompting the court to authorize the attachment of the department’s movable property.\nOn Wednesday, court bailiffs arrived at the SSE office located near the Srirangapatna railway station. When officials were unable to produce the payment, the staff began clearing the office of its essential assets. The confiscated items included:\nThe Aftermath\nThe seized assets were loaded into vehicles and transported to the court premises. Court officials have made it clear that if the compensation is not disbursed immediately, they will proceed with the next phase of legal attachment, which could include more significant departmental assets.\nThe incident has resonated strongly with the local farming community, serving as a rare example of a common citizen successfully holding a major government entity accountable through the power of the judiciary.\nScan the QR code to download the News18 app and enjoy a seamless news experience anytime, anywhere.\nLatest Blogs",
        "link": "https://www.news18.com/india/when-dues-go-unpaid-court-locks-railway-office-over-farmer-compensation-skn-ws-l-9909383.html",
        "date": "Tue, 17 Feb 2026 13:55:08 +0530",
        "fetched_at": "2026-02-18 04:02:36.793282"
    },
    {
        "title": "AI Impact Summit Opens To Packed Halls, Heavy Footfall Leads To Crowding, Delays On Day 1",
        "content": "With a global assembly of Presidents, Prime Ministers, technology pioneers and thousands of attendees from global tech firms in attendance, Day 1 of the India AI Impact Summit 2026 in New Delhi saw unprecedented energy.\nBut the bevvy of world leaders, industry experts, policymakers and dignitaries for the world’s largest artificial intelligence summit at the Bharat Mandapam also means large crowds and some delays which the attendees should account for.\nAmong the issues attendees need to brace for are security sweeps for high-level arrivals. Also, with the heightened interest, certain sessions saw more than expected participants, causing disappointment among those who couldn’t join.\nSteps have been taken to ease congestion and improve coordination for better crowd flow and access management, organisers were reported as saying.\nOne such instance was reported by Maitreya Wagh, CEO and one of the founders of Bolna AI, who couldn’t access his booth at the summit owing to the gates being shut.\nWagh wrote on X: “Gates are closed so could not access my own booth at the AI Summit. If you’re also stuck outside and wanted to visit the @bolna_dev team, dm me. We may set up a mini-booth at some Connaught Place café.\"\nGates are closed so could not access my own booth at the AI Summit. If you’re also stuck outside and wanted to visit the @bolna_dev team, dm me.We may set up a mini-booth at some Connaught Place cafe 😂 pic.twitter.com/YVIdWagxKM— Maitreya Wagh (@maitreya_wagh) February 16, 2026\nThe sudden evacuation stumped Dhananjay Yadav, co-founder and CEO of Neo Sapien. He also complained of confusing directions.\n“We paid for flights, accommodation, logistics and even the booth. Only to see our wearables disappear inside a high-security zone. If only security and official entourage had access, how did this happen? This is extremely disappointing,\" he wrote on X.\nDay 1 of the AI Impact Summit turned to be a pain for us.I came genuinely excited, it was the first time the summit was being hosted in India, and I wanted to show up personally to support the ecosystem and the government’s push.\nBut what happened next was shocking.\nAt 12… pic.twitter.com/9gVygparq0\n— Dhananjay Yadav (@imDhananjay) February 16, 2026\nKritika Kapoor, a content creator, highlighted some of the logistical challenges. “Too crowded…sitting on the floor,\" she wrote on X.\nBrooooooo it’s too crowded here at AI SUMMIT Delhi like you can’t even navigate properly plus other than AI posters there’s nothing AI and future here 😭 just another well marketed event pic.twitter.com/msWSy6KKNv— Kritika Kapoor (@Kritikaaaa_10) February 16, 2026\nPunit Jain, founder of Reskill, complained of the limited access.\n“If access was limited to select guests, it should have been communicated upfront,\" he said.\nAn AI Summit that sidelines its own builders?• 7 AM queues• 9 AM entry• 12 PM full evacuation• Hours of sanitization• PM visit at 5 PM. Day 1 Ends here\nMeanwhile — exhibitors, delegates, startup founders left outside. No water. No clarity.\nMedia shows celebration.… pic.twitter.com/u6hXBbiDG6\n— Punit Jain (@punit__jain) February 16, 2026\nA Reuters report said some journalists covering the summit spent much of Monday seeking clarity on entry procedures, with confusion over separate digital QR codes and physical passes for access, according to messages in a WhatsApp group for the event.\nSeveral exhibitors at the summit, however, called these logistical issues teething problems, which would be resolved soon.\nSpread across 10 arenas covering more than 70,000 square metres, the Expo brings together global technology firms, start-ups, academia, research institutions, Union Ministries, State Governments, and international partners.The event features 13 country pavilions showcasing international collaboration from nations including Australia, Japan, Russia, the United Kingdom, France, Germany, Italy, the Netherlands, Switzerland, Serbia, Estonia, Tajikistan, and Africa.\nExpecting 2.5 lakh visitors, the Expo hosts over 300 curated exhibition pavilions and live demonstrations, organised into three thematic chakras: People, Planet, and Progress.\nIn addition, it features over 600 high-potential start-ups, many of which are building globally relevant and population-scale solutions already deployed in real-world settings.\nThe massive scale of the event is further highlighted by over 500 sessions featuring more than 3,250 visionary speakers and panel members.\nRunning until February 20, the Impact Summit and Expo showcase New Delhi’s ambition to shape an AI future that is inclusive, responsible, and impactful, anchored in the Prime Minister’s broader vision for sovereign AI that benefits every global citizen.\nFinal two days of the Summit — February 19 and 20 — will see more than 20 heads of state and government, including France’s Emmanuel Macron and Brazil’s Luiz Inácio Lula da Silva, along with Indian Prime Minister Narendra Modi, talking about the future of AI alongside business leaders and investors.\nWith Agency inputs\nLatest Blogs",
        "link": "https://www.news18.com/india/ai-impact-summit-opens-to-packed-halls-heavy-footfall-leads-to-crowding-delays-on-day-1-ws-l-9908859.html",
        "date": "Tue, 17 Feb 2026 14:26:32 +0530",
        "fetched_at": "2026-02-18 04:02:37.427307"
    },
    {
        "title": "Macron’s India Itinerary: From Mumbai Talks With PM Modi To AI Summit In Delhi",
        "content": "French President Emmanuel Macron arrived in India for a multi-day visit focused on strengthening bilateral ties, attending the AI Impact Summit and holding key engagements with Prime Minister Narendra Modi. Macron’s visit, which includes stops in Mumbai and New Delhi, marks his fourth trip to India and his first official visit to the country’s financial capital.\n“President Emmanuel Macron will be on an official visit to India from 17-19 February 2026 at the invitation of Prime Minister Narendra Modi to participate in the AI Impact Summit hosted by India, as well as hold a bilateral summit with the Prime Minister in Mumbai,\" according to a press statement issued by the government.\nHere’s What Macron’s Visit To India Entails\nFebruary 17: Bilateral Talks With PM Modi, Innovation Events\nOn February 17, Macron will hold bilateral talks with Prime Minister Modi at Lok Bhavan in Mumbai at 3:15 pm, where both leaders are expected to review the progress of the India-France strategic partnership and discuss regional and global issues. This will be followed by the exchange of Memoranda of Understanding and a joint press statement at Raj Bhavan. Later in the evening, Macron will attend the India-France Innovation Forum at the Taj Mahal Palace Hotel. He will also participate in the India-France Year of Innovation and Cultural Commemoration event at the Gateway of India.\nEmmanuel Macron India Visit LIVE Updates here\nFebruary 18: Travel To New Delhi, Summit Engagements\nMacron will arrive in New Delhi on February 18 and head to Bharat Mandapam, where he will participate in events related to the AI Impact Summit hosted by India.\nFebruary 19: AI Summit, Departure For Paris\nOn February 19, Macron will attend the summit’s opening ceremony, join other global leaders for plenary discussions and a working lunch, and visit country pavilions. Following the conclusion of his engagements, he will depart for Paris later that afternoon.\nLatest Blogs",
        "link": "https://www.news18.com/india/macrons-india-itinerary-from-mumbai-talks-with-pm-modi-to-ai-summit-in-delhi-ws-l-9909042.html",
        "date": "Tue, 17 Feb 2026 12:14:51 +0530",
        "fetched_at": "2026-02-18 04:02:38.062441"
    },
    {
        "title": "Bill Gates Will Attend India AI Summit, Spokesperson Clarifies",
        "content": "Billionaire Microsoft co-founder Bill Gates will attend the AI Impact Summit and deliver his keynote address as scheduled, his spokesperson clarified on Tuesday, putting to rest speculation over his participation.\nThe clarification comes after reports suggested that Gates was not attending the ongoing AI Summit in Delhi, following his name reportedly missing from the event’s ‘Global Visionaries’ list. Government sources had earlier told News18 that Gates was not part of the summit due to “unavoidable reasons\" amid the fallout related to the Epstein files.\n“India is a global leader in artificial intelligence, powered by one of the world’s largest AI talent pools, rapid adoption across sectors, and innovation at a population scale. Under the leadership of Prime Minister Narendra Modi, AI has become central to India’s vision of Viksit Bharat, driving inclusive growth and responsible innovation,\" the Gates Foundation mentioned in X.\n“India’s distinctive public-private model, bringing together government, startups, academia, and industry, is proving that AI can be built for impact, for inclusion, and for the world,\" it further added.\nLate last week, Nvidia said its CEO Jensen Huang will not travel to India to attend the Summit. Huang was one of the biggest attractions at the Summit.\nThe development coincides with Gates’ visit to India. He had earlier travelled to Andhra Pradesh, where he lauded the state’s growth driven by AI and technology. Following his visit to Amaravati, Gates expressed admiration for the southern state’s innovations in health, agriculture and education.\nThe AI Impact Summit 2026 at Bharat Mandapam was inaugurated by Prime Minister Narendra Modi, highlighting India’s commitment to responsible and inclusive Artificial Intelligence. The summit brings together policymakers, technology companies, innovators, academia and industry leaders, aiming to translate global AI discussions into actionable development outcomes under the IndiaAI Mission and the Digital India initiative.\nLatest Blogs",
        "link": "https://www.news18.com/india/bill-gates-not-to-attend-ai-summit-amid-epstein-files-row-name-goes-missing-from-global-visionaries-list-9908989.html",
        "date": "Tue, 17 Feb 2026 13:24:58 +0530",
        "fetched_at": "2026-02-18 04:02:38.694488"
    },
    {
        "title": "Eknath Shinde Directs PMC To Fast-Track Appointment Of Pahalgam Victim Santosh Jagdale’s Daughter",
        "content": "The Maharashtra government has directed the Pune Municipal Corporation (PMC) to offer a permanent post of Class 2 officer to Asawari Jagdale, daughter of Santosh Jagdale who was killed in the Pahalgam terror attack last year.\nSources said the Chief Minister’s office called twice to speed up her appointment. Chief Minister Devendra Fadanavis was personally tracking the matter. Deputy Chief Minister Eknath Shinde later directed the civic administration to appoint her at the earliest.\nDeputy Chief Minister Eknath Shinde had earlier met the Jagdale family in Pune and assured them of government employment for Asawari. On Monday, He spoke to Pune Municipal Commissioner Naval Kishore Ram and directed that a post equivalent to her education be created. He also spoke to Asawari and said the appointment would be approved as a special matter.\nThe process to induct her into government service will be completed soon.\nThe move came after reports of financial distress and disappointment due to a delay of around 10 months in providing the government job promised on February 15.\nTwenty-six-year-old Asawari Jagdale approached the Union government seeking intervention. She said the family has been facing hardship since her father was killed by terrorists on April 22 last year. She said she left her private sector job to support her mother.\nIn a letter to the Modi government, she wrote that her family was struggling financially and was being made to run around for a job.\nAfter the attack, efforts were made to provide employment to Asawari. To avoid delays in government procedures, she was offered an option at a private university. The Chief Minister personally spoke to the university, but the family declined, said sources.\nShe was later offered a job at PMRDM, though her preference was the Pune Municipal Corporation.\nThe PMC can provide Class 3 or Class 4 posts at its level. As a special case, it sent a proposal to the state government to grant her a Class 2 post. Action on the proposal is under way.\nCongress leader Supriya Shrinate criticised the BJP government. In a post on X, she said that although the state had promised a job after Santosh Jagdale was martyred in the Pahalgam attack, it had now turned its face away.\n“Santosh Jagdale’s daughter wrote a letter to the Modi government describing the situation. In the terrorist attack in Pahalgam, Maharashtra’s Jagdale ji was martyred, the state government had promised his daughter a government job. But, as always, they have now turned their face away,\" read her post on X.\nOn November 26, 2008, during the terrorist attacks in Mumbai, Police Sub-Inspector Prakash Pandurang More was martyred while confronting terrorists. His daughter, Anushka More, was appointed on compassionate grounds.\nLatest Blogs",
        "link": "https://www.news18.com/india/eknath-shinde-directs-pmc-to-fast-track-appointment-of-pahalgam-victim-santosh-jagdales-daughter-9908595.html",
        "date": "Tue, 17 Feb 2026 09:22:25 +0530",
        "fetched_at": "2026-02-18 04:02:39.300837"
    },
    {
        "title": "AI Summit: Cyber Threat Triggers Nationwide Alert As India Activates G20-Grade Shield | Exclusive",
        "content": "The India AI Impact Summit 2026 is facing multiple waves of cyber threats from foreign-based attackers prompting a serious alert across Indian security agencies.\nOwing to this, a senior cyber security officer overseeing summit operations said a G20-grade shield has been activated till the event ends on February 20.\nAccording to the authorities, one of the most serious risks is the misuse of social media and deepfake technology to manipulate or fabricate statements by world leaders, potentially spreading false narratives within minutes.\nThe authorities said cyber teams are closely monitoring online platforms to prevent disinformation campaigns linked to the summit, which was inaugurated by Prime Minister Narendra Modi on Monday (February 16). As per sources, the alert states that government websites are under threat and can be targeted through “watering hole attacks\" in which hackers attempt to exploit vulnerabilities to silently plant malware.\nOfficials said summit communications also face threats from session and token hijacking, rogue “Evil Twin\" WiFi hotspots, and data theft operations aimed at delegates and affiliated social media accounts. As per the inputs, cybercriminals are simultaneously preparing ransomware attacks against critical infrastructure, while distributed denial-of-service (DDoS) strikes are intended to overwhelm digital public platforms and disrupt services.\nInvestigators suspect high-powered brute-force attempts could be executed by advanced computing capabilities, targeting network hardware such as video conferencing systems, routers and switches. Security agencies have also warned of infected USB storage devices being used to infiltrate computers and quietly spread malware across organisations.\nIn a further escalation, foreign-based threat actors are exploiting outdated or vulnerable routers used by internet service providers turning them into proxy networks to launch attacks on Indian IT infrastructure.\nA G20-grade, multi-layered, defence framework is fully operational now, with the system engineered to withstand thousands of attack attempts per minute.\nThis cyber shield includes mandatory multi-factor authentication, real-time patch management, disabled USB autorun, restricted user privileges, continuous backups and ongoing vulnerability and penetration testing audits across summit systems.\nThe umbrella system has multiple cyber security experts, teams of private players and groups of analysts. Officials indicated India’s experience hosting the G20 Summit, during which agencies neutralised more than 1.6 million cyberattack attempts without a breach. That infrastructure and operational playbook have now been expanded to safeguard the AI summit.\nLatest Blogs",
        "link": "https://www.news18.com/india/ai-summit-cyber-threat-triggers-nationwide-alert-as-india-activates-g20-grade-shield-ws-l-9908402.html",
        "date": "Tue, 17 Feb 2026 09:01:26 +0530",
        "fetched_at": "2026-02-18 04:02:39.937234"
    },
    {
        "title": "Emmanuel Macron's India Visit Updates: PM Modi, Macron Inaugurate India–France Innovation Forum",
        "content": "Macron India Visit, PM Modi Meeting, AI Summit Updates: French President Emmanuel Macron arrived in Mumbai on Monday night along with First Lady Brigitte Macron on a three-day official visit to India. The French President and the First Lady were received by Maharashtra Governor Acharya Devvrat and Chief Minister Devendra Fadnavis at the Mumbai airport.\nMacron met Prime Minister Narendra Modi at Lok Bhavan where he discussed artificial intelligence and strategic cooperation. A key focus was renewed push for bilateral defence cooperation, including joint manufacturing of helicopters and HAMMER precision-guided missiles.\nNotably, this visit marks Macron’s fourth visit to the country at the invitation of PM Modi, signaling sustained momentum in the India-France strategic partnership, with a particular focus on Artificial Intelligence (AI) cooperation and emerging technologies.\nPrime Minister Narendra Modi on Tuesday announced that 2026 will be celebrated as the India-France Year of Innovation, following discussions with French President Emmanuel Macron at the inauguration of the India–France Innovation Forum.\nPrime Minister Narendra Modi and French President  Emmanuel Macron inaugurate the India–France Innovation Forum.\nPresident Macron said, “In the past eight years, India and France have collaborated in several sectors, and we are happy turn this partnership into a special strategic partnership.”\nHe said that apart from defence, there are several other sectors where India and France can collaborate, such as the space program.\nPM Narendra Modi said, “India and France both believe in democratic values, the rule of law, and a multipolar world. We are unanimous that reform of global institutions will solve global challenges. We will continue to support all efforts for peace in every region, be it Ukraine, West Asia, or the Indo-Pacific. We share a common commitment to eradicate terrorism in all its forms and manifestations.”\nPrime Minister Narendra Modi said, “Today we are strengthening our cooperation in critical minerals, biotechnology, and advanced materials. We are launching the Indo-French Centre for AI in Health, the Indo-French Centre for Digital Science and Technology, and the National Centre of Alliance for Skilling in Aeronautics. These are not just institutes, they are future-building platforms. Friends, the world is facing a period of uncertainty. In this environment, the India-France partnership is a force for global stability. We are combining France’s expertise and India’s scale. We are developing trusted technologies. We will ensure human development through the International Solar Alliance, the India-Middle East-Europe Economic Corridor, and joint development projects, and will continue to strengthen efforts for stability and prosperity through multilateralism, dialogue, and diplomacy.”\nPrime Minister Narendra Modi said, “I am delighted to welcome my dear friend, President Macron, to Mumbai. Last year, he invited me to the AI ​​Action Committee Summit in France. At that time, we visited Marseille, France’s largest port and a major gateway to France and all of Europe. Marseille is the city from where our Indian soldiers set foot in Europe during World War I. Their saga of bravery is still remembered in many parts of Europe, and it is the same city where freedom fighter Veer Savarkar jumped into the sea to escape the British. His action symbolised his unwavering resolve for India’s independence. I had the opportunity to remember and pay my respects to him in Marseille last year. This time, when President Macron is in India for the AI ​​Impact Summit, we are fortunate to welcome him in Mumbai, the gateway to India.”\nIndia and France have also signed an agreement to promote mutual investment and avoid double taxation. PM Modi also announced the launch of the India–France Year of Innovation. He said innovation grows through collaboration and stronger people-to-people ties.\nThe goal, he added, is to transform the strategic partnership into a true “Partnership of the People,” paving the way for shared prosperity.\nIn a major announcement, PM Modi said India and France will jointly manufacture in India the world’s only helicopter capable of flying to the heights of Mount Everest.\nThe helicopter will be made in India and exported worldwide.\nPrime Minister Narendra Modi has said that India and France share a “very special relationship,” calling France one of India’s oldest and most trusted strategic partners. He said that both leaders have worked together to give the partnership “unprecedented depth and energy.”\nHe announced that India and France are now elevating their ties to a Special Global Strategic Partnership.\nWhile addressing a joint press conference With Macron, PM Modi said that 2026 is a landmark year in the evolution of India’s engagement with Europe. According to him, this year marks a decisive shift—from steady cooperation to transformative partnership.\nPrime Minister Narendra Modi and French President Emmanuel Macron virtually inaugurate the H125 Light Utility Helicopter Final Assembly of Tata Airbus at Vemagal, Karnataka.\nPrime Minister Narendra Modi addresses joint press conference with France’s Macron, says India-France ties are “special”.\n#WATCH | Prime Minister Narendra Modi holds delegation-level talks with French President Emmanuel Macron at the Lok Bhavan in Mumbai\n(Source: DD/ANI) pic.twitter.com/1zEltBFxRb\n— ANI (@ANI) February 17, 2026\nPrime Minister Narendra Modi on Tuesday held wide-ranging talks with French President Emmanuel Macron to boost ties in key sectors such as trade, defence, energy and critical technologies.\nAfter the talks with Modi, Macron will attend a ceremony to launch the India-France Year of Innovation.\nHis visit comes days after India cleared a long-pending proposal to procure 114 Rafale fighter jets under a government-to-government framework with France.\nIt has been billed as one of the world’s biggest military procurement programmes in recent years.\nThe leaders will also inaugurate the India-France Year of Innovation 2026 and address a gathering of business leaders, start-ups, researchers, and other innovators from both countries.\nThe meeting is aimed at reviewing the progress of the India-France strategic partnership and exploring avenues to deepen cooperation across key sectors. The meeting between Prime Minister Modi and President Macron is expected to further strengthen bilateral ties between India and France, with discussions likely to focus on strategic cooperation, trade, defence collaboration, and global issues of mutual interest.\nPrime Minister Narendra Modi on Tuesday said in a post on X it was a delight to meet his “friend”, French President Emmanuel Macron, in Mumbai. In a post on X, PM Modi said that Macron expressed his fondness for Mumbai and had also enjoyed a morning run earlier in the day.\nIt’s a delight to meet my friend, President Macron in Mumbai! He told me he really likes the city and also enjoyed his run earlier in the day! @EmmanuelMacron pic.twitter.com/edPKuLdn0f\n— Narendra Modi (@narendramodi) February 17, 2026\nPrime Minister Narendra Modi holds a bilateral meeting with French President Emmanuel Macron at the Lok Bhavan in Mumbai.\nAux côtés de légendes du cinéma indien. La culture nous rassemble. pic.twitter.com/rYDm1Ni9qz\n— Emmanuel Macron (@EmmanuelMacron) February 17, 2026\nAt the Taj Mahal Palace in Mumbai, we paid tribute to the victims of the 2008 attacks. To their families and loved ones, and to India: France stands with you. In the face of terrorism, unity and determination. pic.twitter.com/rcQ5fb93ZC\n— Emmanuel Macron (@EmmanuelMacron) February 17, 2026\nPrime Minister Narendra Modi meets French President Emmanuel Macron at Lok Bhavan in Mumbai.\n#WATCH | Prime Minister Narendra Modi meets French President Emmanuel Macron in Mumbai\n(Source: DD) pic.twitter.com/1eR61g3QUr\n— ANI (@ANI) February 17, 2026\nFrench President Emmanuel Macron arrived in Mumbai early on Tuesday and began his day by jogging at the iconic Marine Drive near the Coastal Road.\nHe and First Lady Brigitte Macron later also paid floral tributes to those killed in the November 2008 terror attack at the Taj Mahal Palace Hotel in south Mumbai.\nThe French president is scheduled to meet Prime Minister Narendra Modi at the Lok Bhavan in south Mumbai, where the two leaders will review the progress made in the India-France strategic partnership.\nFrench President Emmanuel Macron stepped out of his hotel, avoiding the media, and went for a run along Mumbai’s iconic Marine Drive, drawing attention from morning walkers and security personnel.\nOn French President Emmanuel Macron’s India visit, Shiv Sena (UBT) MP Sanjay Raut said it was good that Macron was visiting Mumbai with Prime Minister Narendra Modi and would be shown places including the Gateway of India. He said earlier foreign guests were usually taken to Ahmedabad. Raut criticised the Shinde-faction for putting up posters welcoming Macron, saying foreign guests are welcomed by the government, not political parties, and protocol should be followed.\nFrench President Emmanuel Macron left the Taj Mahal Palace under tight security on Tuesday. He arrived in Mumbai ahead of his meeting with Prime Minister Narendra Modi. The two leaders are set to review progress in the India–France strategic partnership.\nVIDEO | Mumbai: French President Emmanuel Macron leaves fromTaj Mahal Palace under tight security.\nFrench President Emmanuel Macron arrived in Mumbai on Tuesday, ahead of his meeting with Prime Minister Narendra Modi, where the two leaders will review the progress made in the… pic.twitter.com/7AjTfwtS4R\n— Press Trust of India (@PTI_News) February 17, 2026\nPrime Minister Narendra Modi and French President Emmanuel Macron are expected to discuss global economic uncertainty linked to tariff policies under US President Donald Trump, as well as China’s regional influence, according to reports. The Prime Minister’s Office said talks will focus on cementing the strategic partnership and diversifying it into new areas. Bilateral trade stands at about $18 billion annually, with strong defence and aerospace ties. French investment in India totals nearly $15 billion.\nIn a post ahead of his arrival in Mumbai, French President Emmanuel Macron said, business leaders and key economic, industrial, cultural and digital figures are travelling with him to deepen ties between the two nations. He added that both sides will go even further in cooperation and addressed Prime Minister Narendra Modi as “my dear friend”.\nEn route to India!\nThree days from Mumbai to New Delhi to take our strategic partnership even further.\nOn board with me: business leaders and the economic, industrial, cultural and digital players who give real, tangible life to the ties between India and France.… pic.twitter.com/k3Q9fSckWs\n— Emmanuel Macron (@EmmanuelMacron) February 16, 2026\nPrime Minister Narendra Modi and French President Emmanuel Macron will meet today in Mumbai for key discussions. The city marked their arrival with a grand welcome. The Bandra–Worli Sea Link has been specially illuminated, with decorative lighting installed to honour both leaders. The sea-facing stretch glowed through the evening, reflecting the importance of the high-level meeting taking place in Mumbai.\nPM Modi welcomed French President Emmanuel Macron in India.\nHe post on X reads, “Welcome to India! India looks forward to your visit and to advancing our bilateral ties to new heights. I am confident that our discussions will further strengthen cooperation across sectors and contribute to global progress. See you in Mumbai and later in Delhi, my dear friend Emmanuel Macron.”\nWelcome to India!\nIndia looks forward to your visit and to advancing our bilateral ties to new heights. I am confident that our discussions will further strengthen cooperation across sectors and contribute to global progress.\nSee you in Mumbai and later in Delhi, my dear friend… https://t.co/5gDTDt6llp\n— Narendra Modi (@narendramodi) February 17, 2026\nPrime Minister Narendra Modi and President Emmanuel Macron will on Tuesday also inaugurate India’s first helicopter final assembly line through a videoconference from Mumbai. The facility, a joint venture between Tata Group and Airbus, is located in Vemagal in Karnataka near Bengaluru. It will manufacture the Airbus H125, the company’s best-selling single-engine helicopter. Macron’s office said the visit aims to strengthen cooperation with India and diversify France’s economic and trade partnerships.\nFrance is seeking to deepen its defence partnership with India as President Emmanuel Macron begins a three-day visit to New Delhi, reports France 24. Talks are expected to include cooperation in artificial intelligence and a possible multibillion-dollar deal for 114 additional Dassault Rafale fighter jets. The visit comes after India confirmed plans to place a major Rafale order and follows the signing of a landmark free trade agreement between India and the European Union in January.\nOn Tuesday afternoon, French President Emmanuel Macron and PM Modi will hold bilateral engagements at Lok Bhavan in South Mumbai.\nLater, they will inaugurate the India-France Year of Innovation 2026 and address a gathering of business leaders, start-ups, researchers and other innovators from both countries.\nPresident Macron is on an official visit to India from February 17 to 19 at the invitation of PM Modi to participate in the AI Impact Summit hosted by India, as well as hold a bilateral summit with the latter in Mumbai.\nTaking to X, External Affairs Ministry Spokesperson Randhir Jaiswal wrote, “Towards a stronger India-France strategic partnership! Warm welcome to President Emmanuel Macron of the French Republic. He was warmly received by the Governor of Maharashtra and Gujarat, Acharya Devvrat, at the Mumbai airport.”\n“During the visit, PM Narendra Modi will hold bilateral meeting with President Emmanuel Macron. Both leaders will launch Year of Innovation 2026. The visit will impart further momentum to the vibrant India-France strategic partnership,” he added.\nVers un partenariat stratégique renforcé entre l’Inde et la France\nChaleureuse bienvenue au Président @EmmanuelMacron de la République française. Il a été chaleureusement accueilli par le gouverneur du Maharashtra et du Gujarat, Shri Acharya Devvrat @adevvrat à l’aéroport de… pic.twitter.com/1A4e3BsmEv\n— Randhir Jaiswal (@MEAIndia) February 16, 2026\nFrench President Emmanuel Macron and First Lady Brigitte Macron arrived in Maharashtra’s Mumbai on Tuesday for their scheduled three-day to India until February 19.\nLatest Blogs",
        "link": "https://www.news18.com/india/emmanuel-macron-india-visit-live-updates-meet-with-pm-modi-in-mumbai-artificial-intelligence-defence-boost-on-agenda-liveblog-9908398.html",
        "date": "Wed, 18 Feb 2026 00:02:05 +0530",
        "fetched_at": "2026-02-18 04:02:41.076263"
    },
    {
        "title": "'Submit 2-Page Note, Cite Apps For Department Use': Ministry Officials Asked To Attend AI Summit | Exclusive",
        "content": "The cabinet secretariat has asked officials from across ministries to attend the ongoing India AI Impact Summit 2026 and follow this up by submitting brief notes on their experience and observations, which will then be compiled by the respective secretaries.\nThe office memorandum was issued on Monday, directing all officers at and above the level of deputy secretary in ministries and departments to visit the summit that was inaugurated by Prime Minister Narendra Modi at New Delhi’s Bharat Mandapam.\nAccording to the memorandum, officers are required to observe artificial intelligence-based innovations, use cases showcased at the event, and identify applications relevant to their ministries, departments, and organisations. Each officer must submit a brief note, not exceeding two pages, highlighting significant ideas and potential departmental use cases, it stated.\nThe memorandum stated that secretaries of the ministries and departments will compile these submissions and forward a consolidated report to the cabinet secretariat by February 27, a week after the summit ends on February 20. It stressed on strict adherence to these instructions.\nWith this landmark summit, the Centre is pitching AI as a key enabler of India’s development journey, strengthening governance and transforming public service delivery in alignment with the vision of ‘Viksit Bharat 2047’. It also aligns with India’s commitment to responsible and inclusive AI.\n“The summit, the first global AI gathering to be hosted in the Global South, has witnessed unprecedented participation with over 20 heads of state, 60 ministers, and 500 global AI leaders. Bringing together policymakers, technology companies, innovators, academia, and industry leaders, the summit seeks to translate global AI deliberations into actionable development outcomes under the IndiaAI Mission and the Digital India initiative,\" stated an official government release.\nOn February 19, Modi is scheduled to deliver the inaugural address setting the tone for enhanced global cooperation and advancing India’s vision for inclusive, trusted, and development-oriented AI.\nLatest Blogs",
        "link": "https://www.news18.com/india/submit-2-page-note-cite-apps-for-department-use-ministry-officials-asked-to-attend-ai-summit-ws-l-9908337.html",
        "date": "Tue, 17 Feb 2026 09:02:03 +0530",
        "fetched_at": "2026-02-18 04:02:41.718268"
    },
    {
        "title": "'Shaping Solutions For The World': PM Modi, Experts Hail India As Global AI Leader At Landmark Summit",
        "content": "India was hailed as a global leader in artificial intelligence at the ‘India AI Impact Summit 2026’, which was inaugurated by Prime Minister Narendra Modi on Monday.\nThe landmark summit, which will end on February 20, signals India’s commitment to shaping AI solutions for the global stage.\nAfter the inauguration at New Delhi’s Bharat Mandapam, Modi shared moments from the event on his social media and said being amongst researchers and tech enthusiasts provided a “glimpse of the extraordinary potential of AI, Indian talent and innovation\". He said India’s efforts will “shape solutions not just for India but for the world\" as the nation advances its vision of Viksit Bharat.\n“Inaugurated the India AI Impact Expo 2026 at Bharat Mandapam. Being here among innovators, researchers and tech enthusiasts gives a glimpse of the extraordinary potential of AI, Indian talent and innovation. Together, we will shape solutions not just for India but for the world!\"\nInaugurated the India AI Impact Expo 2026 at Bharat Mandapam. Being here among innovators, researchers and tech enthusiasts gives a glimpse of the extraordinary potential of AI, Indian talent and innovation. Together, we will shape solutions not just for India but for the… pic.twitter.com/G370iXYAXm— Narendra Modi (@narendramodi) February 16, 2026\nThe India AI Impact Summit garnered widespread praise from international experts, who view India as a global leader dedicated to using AI as a transformative force for public good and economic development.\nGabriela Ramos, former UNESCO assistant director general, lauded the summit’s focus on tangible results. She said while technology is evolving daily, the real question lies in its impact on sectors like education and healthcare.\n“I feel that the AI Impact Summit is putting the emphasis on the impact. I’m very glad because we have been focusing too much on the technologies, which is great, because these technologies have capacities that are evolving by the day, either generative or agentic. Each time they do more cognitive tasks that were just reserved for humans. But this time we’re looking at the impacts.  And that’s what we need to do,\" Ramos said.\n#WATCH | Delhi: India AI Impact Summit 2026 | Gabriela Ramos, Former UNESCO Assistant Director General, says, \"I feel that as the AI Impact Summit is putting the emphasis on the impact. I'm very glad because we have been focusing too much on the technologies, which is great,… pic.twitter.com/IX0cz11ssQ— ANI (@ANI) February 16, 2026\nPraising the shift towards a human-based approach, she added: “If we apply these technologies for school, are the students learning? If we apply it for health, are the patients recovering better? I feel that this is the real question that we are now to answer here. It’s not about how we develop these technologies in a more human-based approach, but also how we deploy it and how we use it to solve our problems…\"\nOther experts stressed that AI must be “safe by default\". Cynthia McCaffrey, UNICEF India representative, said while it offers a “tremendous opportunity\" to expand horizons for children and educators, protections and guardrails must be built in from the design phase rather than as an afterthought.\n“The way that UNICEF is looking at AI, and I believe the Government of India is seeing this as well, is that AI is a tremendous opportunity to expand horizons, to open opportunities about how children can learn the type of knowledge that teachers and parents and others can have access to. At the same time, to also look at how you have to build in the protections from the beginning,\" McCaffrey said.\n#WATCH | Delhi: | India AI Impact Summit 2026: Cynthia McCaffrey, UNICEF India Representative says, \"The way that UNICEF is looking at AI, and I believe the Government of India is seeing this as well, is that AI is a tremendous opportunity to expand horizons, to open… pic.twitter.com/Bej7KmpimO— ANI (@ANI) February 16, 2026\nShe said this sentiment aligns with India’s broader strategy of ensuring AI improves the quality of life while remaining anchored in ethical principles.\n“It’s important to identify those guardrails and those regulations that governments can put in place that industry can think about as they design AI because the opportunities are huge but you have to think about the protections at the beginning… One of the things that  UNICEF is saying and advocating for with many others is that AI should be safe by default, shouldn’t be an afterthought…\" she added.\nAccording to an official release, the India AI Impact Summit 2026 is defined by several key developments that position the country at the centre of the global technological discourse.\nHere’s all you need to know:\nWith an AI market projected to surpass $17 billion by 2027, India is using this summit to declare its intent to bridge the gap between innovation and global impact. As the event continues, the focus will firmly remain on harnessing AI to solve human challenges across both rural and urban landscapes.\n(With agency inputs)\nLatest Blogs",
        "link": "https://www.news18.com/india/india-ai-impact-summit-modi-experts-hail-india-global-leader-ai-solutionss-for-world-ws-l-9908127.html",
        "date": "Mon, 16 Feb 2026 22:47:59 +0530",
        "fetched_at": "2026-02-18 04:02:42.432815"
    },
    {
        "title": "'AI For All' Vision: Akash Ambani Showcases Jio Pavilion To PM Modi At India AI Impact Summit",
        "content": "Prime Minister Narendra Modi on Monday visited the Jio pavilion at the India AI Impact Summit, where Reliance Jio Infocomm Ltd chairman Akash Ambani showcased the company’s AI ecosystem and next-generation solutions.\nModi reviewed applications spanning intelligence, healthcare, education, culture, and smart homes powered by AI models and solutions, at the Jio Intelligence Pavilion.\nWatch the video here:\nDuring the visit, he saw the live demonstrations of Jio AI Stack, Jio Sanskriti AI, Jio Arogya AI, Jio Shiksha, and Jio AI Home. These platforms are designed to drive enterprise intelligence, promote Indian languages and cultural content, enhance healthcare delivery, strengthen education systems, and enable AI-powered smart living. Akash Ambani briefed him on Jio’s comprehensive AI ecosystem and its role in accelerating digital transformation across sectors.\nReiterating Jio’s vision of “AI for All\", the company highlighted its commitment to making advanced technologies accessible and inclusive at scale. Reliance Industries chairman Mukesh Ambani has previously stressed that the true value of technology lies in its ability to benefit people widely and equitably.\nThe India AI Impact Summit has brought together leading technology firms, innovators, and policymakers from India and around the world to explore the future of artificial intelligence. The Prime Minister’s visit to the Jio Pavilion underscored the growing role of India’s private sector in shaping the country’s AI landscape.\nLatest Blogs",
        "link": "https://www.news18.com/india/ai-india-summit-akash-ambani-reliance-jio-modi-ai-for-all-vision-ws-l-9908060.html",
        "date": "Mon, 16 Feb 2026 21:03:19 +0530",
        "fetched_at": "2026-02-18 04:02:43.164046"
    },
    {
        "title": "ED Slaps Rs 184 Crore Fine On NewsClick, Editor Prabir Purkayastha Over Foreign Funding Violations",
        "content": "The Enforcement Directorate has imposed a Rs 184 crore fine against news portal NewsClick, and its editor-in-chief, Prabir Purkayastha, under the Foreign Exchange Management Act (FEMA), news agency PTI reported, citing official sources.\nAs per the order, PPK NewsClick Studio Private Limited, the company that owns the portal, has been fined Rs 120 crore, while Purkayastha has been issued a separate penalty of Rs 64 crore for alleged violations.\nThe entities have been found “contravening\" FEMA provisions on two counts — alleged misrepresentation of foreign direct investment (FDI) funds and misdeclaration of services and exports, sources told the news agency.\nA response from NewsClick on the development is awaited.\nThe ED had first conducted searches at the portal’s premises in the Saidulajab area of the national capital in September 2021 in connection with a money laundering probe. The agency has since recorded statements of more than 25 individuals, including Purkayastha.\nIn 2023, the BJP cited a report by The New York Times to allege wrongdoing by the portal and its promoters. The report had claimed that NewsClick was part of a global network that received funding from American billionaire Neville Roy Singham, who allegedly has links with Chinese government media entities.\nFounded in 2009, NewsClick describes itself on its website as an independent media organisation focusing on news coverage from India and abroad, particularly progressive movements.\n(With inputs from agencies)\nLatest Blogs",
        "link": "https://www.news18.com/india/ed-slaps-rs-184-crore-fine-on-newsclick-editor-prabir-purkayastha-over-foreign-funding-violations-ws-l-9907948.html",
        "date": "Mon, 16 Feb 2026 20:37:55 +0530",
        "fetched_at": "2026-02-18 04:02:44.017241"
    },
    {
        "title": "Centre To Soon Launch 'Create In India' Mission To Boost Jobs: Ashwini Vaishnaw At AI Summit",
        "content": "Minister for Electronics and Information Technology Ashwini Vaishnaw on Monday announced the plan to launch ‘Create in India’ mission, with aim to enhancing industry, creating jobs, and preparing a future-ready talent pipeline.\nSpeaking during a fireside chat with Charles Rivkin, chairman of the Motion Picture Association (MPA), at an official satellite event of the AI Impact Summit 2026, Vaishnaw said: “Very soon, the govt will launch ‘Create in India’ mission, which will be an industry, employment and future-oriented mission. It will look at strengthening what we have, making sure we become the most preferred platform for the world and create a future-ready talent pipeline which keeps that growth that we need to have for the next 25 years.\"\n#WATCH | Delhi | At India AI Impact Summit, Union Railway Minister Ashwini Vaishnaw says, “Very soon, the govt will launch ‘Create in India’ mission, which will be an industry, employment and future-oriented mission. It will look at strengthening what we have, making sure we… pic.twitter.com/IvqsBXButI— ANI (@ANI) February 16, 2026\n“There should not be a diluting effect, but a complementing effect of AI into our lives. Many of the developed countries are looking at it as the benchmark,\" he added.\nOn how the government can work with industry to provide guardrails fight deepfakes and disinformation, the Union Minister said, “Deep fakes and disinformation are attacking the foundation of our society and the root of trust between institutions created by society. AI models, creators will have to take responsibility for making sure that the new technology is strengthening the trust rather than belittling it…\"\nThe minister also addressed the ongoing fears of AI replacing human roles. Pointing out the impact of AI on jobs and its adoption in India, he said: “The talent pipeline which is getting created in India is high. Natural growth is happening, and we are promoting this.\"\n“In the next few days of the AI summit, we are looking at the impact of AI on human society. There are positive impacts of AI, including weather forecasting, climate change, agriculture, the discovery of new materials, and productivity gains. There are potential negative impacts. We are looking at how to balance these impacts so we can capture the benefits while containing the harms. We will come out with a good outcome from this summit,\" he said.\nVaishnaw reiterated the announcement made in the Budget 2026 around content creator labs and said: “In the Budget 2026, we announced the content creator labs in 15000 schools. Throughout the country, we are opening these labs with the help of the industry. We have the world’s best students in 350 universities in the semiconductors sector; similarly, we will have more students in AI.\"\nLatest Blogs",
        "link": "https://www.news18.com/tech/centre-to-soon-launch-create-in-india-mission-to-boost-jobs-ashwini-vaishnaw-at-ai-summit-ws-l-9908035.html",
        "date": "Mon, 16 Feb 2026 20:28:39 +0530",
        "fetched_at": "2026-02-18 04:02:44.736813"
    },
    {
        "title": "Drunk Man Snoozes On Mumbai Railway Tracks As Train Approaches, Case Filed | Video",
        "content": "A man, who appeared to be intoxicated, was caught sleeping on railway tracks at Chhatrapati Shivaji Maharaj Terminus (CSMT) in Mumbai on Monday afternoon, briefly disrupting Harbour Line train services.\nThe incident took place around 3.30 pm just as a train was pulling into the Harbour Line track. Avinash Prakash Kardile (19), who collects trash on the tracks, suddenly lay down and covered himself with a white cloth, apparently expecting the train to run him over, an official said.\nCommuters shouted and waved to alert him as the train slowed and honked repeatedly. The man remained unfazed and continued sleeping. A video of the incident has gone viral on social media.\nA drunk man was found sleeping right on the tracks at CSMT, bringing Harbour Line local train services to a halt. pic.twitter.com/0k3sgcMIYY— Truth On Track (@truth_on_track) February 16, 2026\nOfficers from the Government Railway Police (GRP) and Railway Protection Force (RPF) quickly rushed in and lifted him off the tracks, allowing train services to resume safely.\nMeanwhile, authorities later vacated the man from the tracks, and normal train operations resumed. A case has been registered against him under Section 147 (trespass) and other relevant provisions of the Indian Railway Act.\n(With inputs from agencies)\nLatest Blogs",
        "link": "https://www.news18.com/viral/drunk-man-snoozes-on-mumbai-railway-tracks-as-train-approaches-case-filed-video-ws-l-9907965.html",
        "date": "Mon, 16 Feb 2026 20:17:17 +0530",
        "fetched_at": "2026-02-18 04:02:45.381392"
    },
    {
        "title": "HC Declares Karnataka MLA Subba Reddy’s Election Invalid Over Nomination Irregularities",
        "content": "The Karnataka High Court on Monday declared the election of Congress MLA SN Subbareddy in 2023 from the Bagepalli constituency invalid and void.\nThe verdict came on a petition filed by BJP candidate C Muniraju, who had approached the court alleging that Subbareddy indulged in election malpractices.\nAccording to the petition, Subbareddy filed incorrect nomination papers and concealed details regarding his assets and liabilities during the filing process. The High Court accepted the arguments and ruled in favour of the petitioner.\nThe court has also issued notices to the Election Commission of India and the Vidhan Soudha secretary in connection with the matter. Further proceedings are expected based on their responses.\nA Bench headed by Justice M.G.S. Kamal passed the order after hearing detailed arguments from both sides and examining reports submitted by the authorities. The court directed that a copy of the order be sent to the Election Commission and the Secretary of the Karnataka Legislative Assembly.\nThe case was heard over nearly two years. In his petition, Muniraju sought two remedies — the annulment of Subba Reddy’s election and a declaration naming himself as the winner from Bagepalli. The High Court partly allowed the plea by setting aside Subba Reddy’s election but refused to recognise Muniraju as the returned candidate.\nSubba Reddy maintained that the case was politically motivated and claimed there was a conspiracy against him. After the verdict, his counsel sought a stay on the order to allow them to approach the Supreme Court in appeal, but the High Court declined to grant any relief.\nReacting to the judgment, Muniraju said he had approached the court with full faith in the judiciary and described the order as a victory for justice. He stated that the verdict had strengthened public confidence in the judicial system and was the result of effective presentation of arguments before the court.\nApart from the affidavit-related allegations, Muniraju also cited claims that Subba Reddy was facing accusations in connection with an alleged scam.\nLatest Blogs",
        "link": "https://www.news18.com/india/hc-declares-karnataka-mla-subba-reddys-election-invalid-over-nomination-irregularities-ws-l-9907372.html",
        "date": "Mon, 16 Feb 2026 17:23:45 +0530",
        "fetched_at": "2026-02-18 04:02:46.216955"
    },
    {
        "title": "‘No Good Ground To Interfere’: NGT Clears Great Nicobar Project, Cites Strategic Importance",
        "content": "A six-member special bench of the National Green Tribunal (NGT) on Monday cleared the way for the Great Nicobar Island mega infrastructure project, holding that it found “no good ground to interfere\" with the project’s Environment Clearance.\nThe Rs 80,000 crore project involves an international container transshipment terminal, an international airport, a power plant, and a township over an area of 166.10 sq km, of which 130.75 sq km is forest and 84.10 sq km tribal land.\nThe Eastern Zone Bench in Kolkata, headed by Justice Prakash Shrivastava, disposed of a batch of petitions challenging the environment clearance granted in November 2022. The NGT also directed authorities and regulatory agencies to ensure “full and strict compliance\" with the environment clearance conditions.\n“We find that adequate safeguards have been provided in the EC conditions and in the first round of litigation the Tribunal had refused to interfere in the EC and remaining issues noted by the Tribunal in the first round of litigation have been dealt with by the High-Powered Committee and considering the strategic importance of the Project and taking into account the other relevant considerations, we do not find any good ground to interfere,\" the tribunal said in its order.\n“The project is very important for India from the strategic point of view,\" the Tribunal observed, noting that development at such a location must be considered in a balanced manner while ensuring adherence to environmental regulations, including the Island Coastal Regulation Zone (ICRZ) Notification, 2019.\nThe project was accorded environmental clearance in November 2022, and in-principle forest clearance was granted in October 2022.\nThe EC was challenged on several environmental grounds. The petition had challenged environmental and Coastal Regulation Zone (CRZ) clearances granted to the integrated development project, alleging violations of the Island Coastal Regulation Zone (ICRZ) Notification, 2019, including alleged destruction of corals, reliance on single-season Environmental Impact Assessment (EIA) data, as well as some part of the project located in the ICRZ-IA area, classified as ecologically-sensitive.\nSenior environmental activist Ashish Kothari had filed two main pleas before NGT. Kothari argued that 57 hectares of port area, 60 hectares of airport area, 81 hectares of township for defence, and 503 hectares of other township should be excluded from the project plans because they fell within ICRZ areas, where development was prohibited.\nPetitioners argued that the terms of reference given to the HPC were “truncated and factually incorrect,\" and that broader environmental issues had not been properly examined. They also sought public disclosure of the HPC’s report.\nIn 2023, the NGT had constituted a High-Powered Committee under the Union Environment Ministry Secretary to revisit certain aspects of the clearance, particularly relating to–Protection of coral colonies, Nesting sites of leatherback turtles, and Allegations that parts of the project fell within ecologically protected zones.\nHowever, the tribunal held that the committee had adequately dealt with the issues and found no error in its terms of reference. It also accepted the Union government’s submission that the HPC report contained “strategic, defence and national importance\" information and therefore could not be made public.\nOn concerns relating to coral reefs, the NGT held that no major coral reefs exist within the direct project site, as per the reports of the Zoological Survey of India and the High-Powered Committee. It also accepted the committee’s finding that one-season (non-monsoon) Environmental Impact Assessment (EIA) data was sufficient for port projects, and stated that no construction falls within ecologically sensitive ICRZ-IA areas, based on the ground verification by the National Centre for Sustainable Coastal Management (NCSCM).\nIt noted that plans were underway for translocation of coral colonies as recommended by the Zoological Survey of India.\nThe Tribunal directed the Environment Ministry to prepare and approve an implementation plan for coral protection and regeneration, suggesting the involvement of scientific agencies such as the Zoological Survey of India and the National Institute of Oceanography.\nEnvironmentalists have consistently raised concerns over the project, which lies in one of India’s most ecologically fragile ecosystems, and is a key biodiversity site.\nLatest Blogs",
        "link": "https://www.news18.com/india/no-good-ground-to-interfere-ngt-clears-great-nicobar-project-cites-strategic-importance-ws-l-9907414.html",
        "date": "Mon, 16 Feb 2026 20:36:42 +0530",
        "fetched_at": "2026-02-18 04:02:46.963903"
    },
    {
        "title": "Ajit Pawar Air Crash: Recovered Black Box May Be Sent Abroad For Analysis, Says Govt Source",
        "content": "The damaged black box has been recovered from the January 28 plane crash that killed Maharashtra Deputy Chief Minister and NCP leader Ajit Pawar and four others, sources told CNN-News18 on Monday.\nTop sources in the Ministry of Civil Aviation (MoCA) said that, unlike the Air India crash, the aircraft involved in Pawar’s case has yielded its black box. However, it was found in a burnt condition and will need further technical examination.\nSources said the government is expected to take a decision within the next one or two days, and it is likely that the damaged black box will be sent overseas for specialised data recovery.\nMeanwhile, the Directorate General of Civil Aviation (DGCA) has begun a parallel investigation into the aircraft’s airworthiness and operational condition. The probe is expected to take 10 to 15 days, as investigators review a large number of documents recovered from the operating company.\nOfficials said the findings of both the black box analysis and the DGCA inquiry will be crucial in determining the cause of the crash and the next course of action.\nPawar died in the plane crash on January 28 near Baramati in Pune district, along with Captain Sumit Kapoor, co-pilot Captain Shambhavi Pathak, Personal Security Officer Vidip Jadhav, and flight attendant Pinky Mali. The chartered Learjet 45 crashed while attempting to land at Baramati airport.\nThe Aircraft Accident Investigation Bureau (AAIB) and the DGCA are probing the incident. Authorities have not yet released details about the cause of the crash, and officials said the investigation is ongoing.\nLatest Blogs",
        "link": "https://www.news18.com/india/ajit-pawar-air-crash-recovered-black-box-may-be-sent-abroad-for-analysis-says-govt-source-ws-l-9907162.html",
        "date": "Mon, 16 Feb 2026 16:42:45 +0530",
        "fetched_at": "2026-02-18 04:02:47.564429"
    },
    {
        "title": "Indian Railways New Plan: AI To Monitor Train Toilets, Staff To Face Fines If Standards Aren't Met",
        "content": "Cleanliness has long been one of the biggest complaints during train journeys. Now, Indian Railways is turning to Artificial Intelligence (AI) to tackle this issue more systematically and transparently.\nSpeaking to News18 India, Chief Project Engineer Lakshman Jain said that AI will now supervise cleanliness work inside trains. As part of a pilot project, AI-based cleaning monitoring has already begun in 100 trains across the country.\nRecently, Railway Minister Ashwini Vaishnaw stated that the level of cleanliness usually seen in AC First Class coaches will now be ensured in general class coaches as well.\nLakshman Jain explained the process in detail. When cleaning staff board a train, they must first upload their photograph on a designated mobile application to mark their presence.\nBefore starting the cleaning work, the staff are required to take a photograph of the toilet and upload it on the app. After completing the cleaning, they must click another photograph and upload it again.\nOnce the images are uploaded, the AI system analyses both the ‘before’ and ‘after’ photographs to assess whether the toilet has been cleaned according to the required standards.\nIf the AI system finds that the cleaning does not meet the prescribed quality benchmarks, it can issue a warning to the concerned staff. In serious cases, it also has the authority to recommend or impose a fine.\nThrough this AI-driven monitoring mechanism, Indian Railways aims to bring greater accountability and ensure improved cleanliness standards across all classes of travel.\nLatest Blogs",
        "link": "https://www.news18.com/india/indian-railways-new-plan-ai-to-monitor-train-toilets-staff-to-face-fines-if-standards-arent-met-ws-ekl-9907229.html",
        "date": "Mon, 16 Feb 2026 16:29:01 +0530",
        "fetched_at": "2026-02-18 04:02:48.207036"
    },
    {
        "title": "5 Months Into Marriage, HDFC Bank Staffer Found Murdered On Way To Gurugram; Husband Main Suspect",
        "content": "A young bank employee from Haryana was found murdered late Sunday night after her throat was allegedly slit while she was travelling with her husband, prompting a police investigation into the circumstances surrounding her death.\nThe victim, identified as Mahak, was a resident of Hansi and worked at HDFC Bank in Gurugram. According to initial reports, she was travelling to Gurugram by car with her husband, Anshul, on Sunday evening when the incident occurred between Hansi and Badli. Police said the husband himself informed authorities about the killing around 11 pm on February 15.\nMahak, who was reportedly pregnant, is suspected to have been attacked on the neck with a pair of scissors. Her body was later taken to Bahadurgarh Civil Hospital for post-mortem examination. Police are currently probing the case, and her husband is being treated as the prime suspect at this stage, though officials say all angles are being examined.\nThe couple had an arranged marriage in September last year and were both working in Gurugram, with Anshul employed as a chartered accountant. On February 14, they had visited Hisar for Valentine’s Day and left for Gurugram by car at around 7 pm on Sunday. A few hours later, the incident was reported to the police.\nMahak was the youngest among three siblings. Her father, Krishna Kathuria, runs a vegetable business in Hansi’s local market. Anshul is a resident of Sector 14 in Hisar, and his father, Ramesh Dhawan, works as an accountant in the city’s cloth market. It was Anshul’s father who informed Mahak’s family about the incident late at night.\nPolice teams reached the spot soon after receiving the call and have launched an investigation to ascertain the exact sequence of events and the motive behind the killing.\nLatest Blogs",
        "link": "https://www.news18.com/india/5-months-into-marriage-hdfc-bank-staffer-found-murdered-on-way-to-gurugram-husband-main-suspect-ws-kl-9907069.html",
        "date": "Mon, 16 Feb 2026 15:43:09 +0530",
        "fetched_at": "2026-02-18 04:02:48.810780"
    },
    {
        "title": "Over 600 Start-Ups, 100 CEOs & Big Tech Titans: What Makes India's AI Summit The World's Largest",
        "content": "According to the World Bank, unlike previous AI events that were concentrated in Western capitals, the Delhi summit aims to blend innovation with inclusivity, drawing governments, global tech firms, start-ups, investors, researchers and civil society leaders to deliberate AI’s role in inclusive economic growth, governance and societal impact. Indian policymakers want responsible AI deployment that benefits all segments of society and are using the platform to advocate collaboration between advanced and developing economies.\nHere are the key highlights that make the India summit the world’s largest:\n• Five-day event: February 16-20, 2026, at Bharat Mandapam in New Delhi.\n• Global participation: Leaders from over 20 countries, including heads of state expected to attend.\n• Tech titan turnout: Over 40 global CEOs and industry chiefs such as Sundar Pichai (Google), Sam Altman (OpenAI), Demis Hassabis (DeepMind) and more.\n• Industry reach: 100+ global CEOs and leaders from major tech firms expected.\n• Start-up engagement: 600+ start-ups from around the world showcasing innovations.\n• Scale of participation: Anticipated 2,50,000+ visitors, including policymakers, delegates, researchers and investors.\n• Sessions & speakers: More than 700 sessions with 3,000+ speakers and panelists across policy, tech and industry tracks.\n• Exhibition footprint: Spread over approximately 70,000 sq m with 300+ curated exhibitor pavilions.\n• Thematic focus: Summit pillars include People, Planet, and Progress, emphasising AI for inclusive growth, ethical frameworks, sustainability, and economic impact.\nUnlike earlier summits focused mainly on AI safety or governance, India’s AI Impact Summit blends practical innovation, policymaking, and international cooperation under one roof. With a record turnout of leaders and innovators, New Delhi has momentarily become the epicentre of the AI world, reflecting India’s rising strategic role in global technology discourse and its aspiration to democratise AI benefits for both developed and developing nations.\nLatest Blogs",
        "link": "https://www.news18.com/india/over-600-start-ups-100-ceos-big-tech-titans-what-makes-indias-ai-summit-the-worlds-largest-ws-kl-9906579.html",
        "date": "Mon, 16 Feb 2026 14:55:06 +0530",
        "fetched_at": "2026-02-18 04:02:50.135348"
    },
    {
        "title": "AI Boost For Farmers: Govt Set To Launch Bharat-VISTAAR To Transform Farm Support Tomorrow",
        "content": "The Centre will roll out Bharat-VISTAAR (Virtually Integrated System to Access Agricultural Resources), an AI-driven multilingual platform aimed at delivering farm-related information directly to farmers through mobile phones or a simple voice call, on Tuesday. The initiative will be formally launched in Jaipur by Union Agriculture Minister Shivraj Singh Chauhan and Rajasthan Chief Minister Bhajanlal Sharma.\nDesigned as a round-the-clock “digital agriculture expert,\" Bharat-VISTAAR can be accessed in two modes, including via a dedicated helpline number, 155261. Its conversational AI assistant, named Bharati, will guide farmers on crop planning, recommended agricultural practices, pest management, weather updates, market prices, and government schemes. It will also provide details on eligibility, application processes, and grievance redressal, according to a report in The Indian Express.\nFarmers will be able to access information on 10 key Central schemes such as PM-KISAN, PM Fasal Bima Yojana, Soil Health Card, Kisan Credit Card, Agriculture Infrastructure Fund and PM Krishi Sinchayee Yojana, among others. Real-time alerts related to weather and pest outbreaks will also be available.\nFinance Minister Nirmala Sitharaman had announced the initiative in the Union Budget 2026-27, allocating Rs 150 crore for its implementation in the upcoming financial year. She said the platform would integrate AgriStack portals and ICAR’s agricultural practice packages with AI systems to improve productivity, support better decision-making and reduce risks through customised advisory services.\nInitially available in Hindi and English, the platform will gradually expand to regional languages. Officials described Bharat-VISTAAR as more than just an application, calling it a “national digital backbone\" linking Central and State systems while maintaining state autonomy. The system will collaborate with non-profits, AI startups and Centres of Excellence, leveraging the broader India AI Mission and BHASHINI ecosystem. Farmer feedback will also feed into policymaking and research planning, the report stated.\nLatest Blogs",
        "link": "https://www.news18.com/india/ai-boost-for-farmers-govt-set-to-launch-bharat-vistaar-to-transform-farm-support-tomorrow-ws-l-9906668.html",
        "date": "Mon, 16 Feb 2026 14:00:01 +0530",
        "fetched_at": "2026-02-18 04:02:50.737166"
    },
    {
        "title": "Ex-Assam Congress Chief Bhupen Borah Resigns, Blames Gaurav Gogoi’s 'High-Handedness'",
        "content": "In a major setback to the Congress ahead of the Assembly polls in Assam, former state unit chief Bhupen Kumar Borah has resigned, according to sources.\nSources said Borah sent his resignation letter to Congress president Mallikarjun Kharge. He also wrote to Rahul Gandhi.\nIn his letter, Borah said he was being ignored by the party leadership and was not given his due in the state unit. He said he had informed the high command about how the party was functioning in the state and that the situation had affected his self-esteem and dignity.\nAfter his resignation, Borah said, “I sent my resignation to the Congress High Command at 8 am this morning and explained in detail why I was compelled to take this stand. This is not a personal decision. I have given 32 years to the party and joined it in 1994. This principle is not merely personal; it is driven by concern for the party’s future. That is why I conveyed everything in detail to the Congress High Command.\"\nMeanwhile, Gaurav Gogoi has reached Bhupen Borah’s house after the latter tendered his resignation.\nBorah blamed the policies, high-handedness and favouritism of Gaurav Gogoi for his decision.\nHe was president of the Assam Congress from 2021 to 2025 and was replaced by Gogoi last year. Borah is a two-time legislator in Assam.\nHe was expected to contest from the newly formed Ranganodi constituency. He was also likely to hold talks with Opposition parties to form an alliance. However, the inclusion of MP Rockybul Hussain in the team reportedly caused discontent.\nBora, who previously served as president of the Assam Pradesh Congress Committee, has been one of the most prominent faces of the Congress in the state. His departure is widely seen as a major setback for the party’s prospects, particularly in Upper Assam, where he holds considerable influence. Political observers describe the timing of his resignation, well ahead of candidate announcements, as a calculated move that underscores growing internal dissatisfaction within the Congress ranks.\nSources indicate that Bora is likely to formally join the Bharatiya Janata Party in the coming days, potentially in the presence of Union Home Minister Amit Shah. Such a high-profile induction would signal the BJP’s intent to consolidate its position further by absorbing influential leaders from the opposition camp.\nBora is expected to contest the upcoming Assembly elections from the Ranganadi constituency on a BJP ticket. The move is being viewed as a strategic recalibration, as Ranganadi is considered a politically significant seat where Bora’s personal network combined with BJP’s organizational strength could pose a formidable challenge to rivals.\nAssam Chief Minister Himanta Biswa Sarma publicly welcomed Bora’s decision, stating that the BJP’s doors are open to leaders who believe in development and strong governance. Sarma further assured that the party would extend full support to ensure Bora’s victory from Ranganadi if he joins, a clear indication that the BJP leadership has already factored him into its electoral strategy.\nWith this development, the political landscape in Assam appears poised for a fresh realignment. Bora’s exit not only weakens the Congress structurally but also reinforces the narrative of momentum shifting toward the BJP ahead of the high-stakes Assembly battle.\nLatest Blogs",
        "link": "https://www.news18.com/india/ex-assam-congress-chief-bhupen-borah-resigns-blames-gaurav-gogois-high-handedness-9906154.html",
        "date": "Mon, 16 Feb 2026 13:45:18 +0530",
        "fetched_at": "2026-02-18 04:02:51.343415"
    },
    {
        "title": "Karnataka Minister Priyank Kharge Accuses RSS Of Indulging In Money Laundering",
        "content": "Karnataka Minister Priyank Kharge on Sunday accused the RSS of indulging in “money laundering\", and also questioned its source of income.\nHe said that he wants the law and Constitution that is applicable to everyone in the country, should apply to RSS too.\n“RSS did not hoist the national flag in their office for 52 years. They teach us about patriotism,\" Kharge said.\nAddressing a gathering at an event here, he said, “It (RSS) has a network of more than 2,500 organisations, they are from America, England. They take money from them. I am telling — that these people are into money laundering.\"\nQuestioning as to where the RSS is getting money from and how, he said, “they want us to be good citizens, pay income tax, but they want to remain free. How is it possible. We will have to question this.\" Later speaking to reporters, while pointing out that RSS is an unregistered organisation, Kharge asked, whether “they are above law or Constitution.\"\n“It is good that all organisations should come under the ambit of law and constitution, whether it is RSS or any other organisations. Are they above law and constitution. Mohan Bhagwat (RSS chief) says it (RSS) is a body of individuals. So is Bangalore Club, have they not registered? Are they not paying taxes?\" he further asked.\nStating that his question is why the RSS was unregistered, he said, “Where is their Guru Dakshina (donation) coming from.\" “Who is paying it? Why is it (RSS) not paying tax? When every rupee of others is being accounted for, why is there no accountability for their (RSS) money,\" he asked.\nLatest Blogs",
        "link": "https://www.news18.com/india/karnataka-minister-priyank-kharge-accuses-rss-of-indulging-in-money-laundering-ws-l-9906102.html",
        "date": "Mon, 16 Feb 2026 11:05:43 +0530",
        "fetched_at": "2026-02-18 04:02:51.993448"
    },
    {
        "title": "Mahashivratri At Isha: Rajnath Singh, Sadhguru Celebrate Nation-Builders With Bhavya Bharat Awards",
        "content": "At the Mahashivratri celebrations at the Isha Yoga Center, spirituality and nation-building converged in a powerful display of devotion, cultural pride and national service. The night-long event on February 15-16, 2026, witnessed the presence of Union Defence Minister Rajnath Singh, who joined hundreds of thousands of seekers in celebrating what has become one of the world’s largest spiritual gatherings for Mahashivratri.\nAddressing the massive congregation, Singh drew a connection between India’s spiritual ethos and its armed forces. Referring to Operation Sindoor, he said, “On one hand, our armed forces provide humanitarian assistance during times of crisis with the spirit of Shiva. On the other, when duty demands, they execute operations like Operation Sindoor with the intensity of Rudra. The spirit within our soldiers comes from our culture, from the inspiration of Lord Shiva.\" Deeply moved by the atmosphere, he added, “The divinity I am experiencing here makes it clear, even without anyone telling me, that this place is blessed by Mahadeva, the Lord of Lords.\"\nThe evening also marked the launch of the Bhavya Bharat Bhushan Awards, instituted by Sadhguru to honour individuals shaping India’s future across diverse fields. Presenting the inaugural awards alongside the Defence Minister, Sadhguru said, “A nation is not just land; a nation is its people. Only when people are truly inspired and committed can we build a great nation – a Bhavya Bharat.\"\nThis year’s awardees reflected excellence across disciplines. In Science and Technology, honours went to Nambi Narayanan and K Radhakrishnan for advancing India’s technological frontiers. Classical dancer Alarmel Valli was recognised for preserving India’s artistic heritage, while legendary violinist N Rajam was honoured for enriching the nation’s musical landscape. Historian Vikram Sampath was awarded for illuminating India’s past through scholarship, and badminton icon Saina Nehwal for elevating India’s global sporting stature.\nA special Defence category paid tribute to Operation Sindoor, recognising senior officers representing the Air Force, Army and Navy for their service and leadership.\nBeyond the awards, Mahashivratri 2026 unfolded as a vibrant blend of meditation, music and cultural celebration under the theme “Ganga,\" highlighting the sacred river’s spiritual and ecological significance. Millions participated both in person and online. For the first time, Sadhguru performed the Yogeshwara Linga Maha Abhishekam, with over five million people registering globally for the free offering.\nReflecting on the timeless relevance of yogic sciences, Sadhguru said, “Adiyogi is not of the past. Adiyogi is of the future because what he gave are not belief systems, philosophies, ideologies or teachings, they’re technologies for wellbeing.\" He added, “Not looking up. Looking in. In is the only way out.\"\nThe event was broadcast live in 25 languages, reaching an estimated 150 million viewers worldwide. On the auspicious night, Sadhguru also announced a free Inner Engineering Online offering available until February 18 and revealed that the consecration of Kala Bhairava will take place later this year at the Isha Yoga Center.\nAs chants of “Shambho\" resonated at midnight, Mahashivratri once again stood as a testament to India’s living spiritual traditions—where devotion, culture and national service meet in a shared vision of a Bhavya Bharat.\nLatest Blogs",
        "link": "https://www.news18.com/india/mahashivratri-at-isha-rajnath-singh-sadhguru-celebrate-nation-builders-with-bhavya-bharat-awards-ws-l-9906093.html",
        "date": "Mon, 16 Feb 2026 11:00:12 +0530",
        "fetched_at": "2026-02-18 04:02:52.602746"
    },
    {
        "title": "'A Progressive, Innovative Future': PM Modi Welcomes Global Delegates To India AI Impact Summit",
        "content": "Prime Minister Narendra Modi on Monday said that the India AI Impact Summit has drawn global attention to the country’s growing technological capabilities, calling it a moment of pride for the nation and a reflection of the potential of India’s youth.\nIn a series of posts on social media platform X, the Prime Minister highlighted the significance of the Summit being hosted in New Delhi and emphasised India’s expanding role in shaping global conversations around Artificial Intelligence (AI).\n“It is a matter of immense pride for us that people from all over the world are coming to India for the India AI Impact Summit. This also shows the capability of our country’s youth,\" PM Modi said.\nHe added that the gathering demonstrates the rapid strides India is making in science and technology.\n“This occasion is further proof that our country is progressing rapidly in the field of science and technology and is making an important contribution to global development,\" he noted.\nयह हमारे लिए अत्यंत गर्व की बात है कि India AI Impact Summit के लिए दुनियाभर से लोग भारत आ रहे हैं। इससे हमारे देश के युवाओं के सामर्थ्य का भी पता चलता है। यह अवसर इस बात का भी प्रमाण है कि हमारा देश विज्ञान और टेक्नोलॉजी के क्षेत्र में तेजी से प्रगति कर रहा है और वैश्विक विकास… pic.twitter.com/7gxXJEtpOz— Narendra Modi (@narendramodi) February 16, 2026\nWelcoming international delegates, policymakers, innovators and industry leaders attending the event at Bharat Mandapam, PM Modi said the Summit aims to bring the global community together to deliberate on the future of AI.\n“Bringing the world together to discuss AI! Starting today, India hosts the AI Impact Summit at Bharat Mandapam in Delhi. I warmly welcome world leaders, captains of industry, innovators, policymakers, researchers and tech enthusiasts from across the world for this Summit,\" he wrote.\nThe Prime Minister also underlined the theme of the Summit, Sarvajana Hitaya, Sarvajana Sukhaya, meaning welfare for all and happiness for all, describing it as a reflection of a shared commitment to harness AI for human-centric progress.\nHighlighting the growing impact of AI across sectors, PM Modi said, “AI today is transforming several sectors, including healthcare, education, agriculture, governance and enterprise.\"\nHe expressed confidence that deliberations during the summit would enrich global discourse on innovation, collaboration and responsible use of the technology, adding that the outcomes would help shape a progressive and opportunity-driven future.\nHe further credited citizens for India’s rapid advancement in the field.\n“Thanks to the 1.4 billion people of India, our nation stands at the forefront of the AI transformation. From digital public infrastructure to a vibrant Startup ecosystem and cutting-edge research, our strides in AI reflect both ambition and responsibility,\" the Prime Minister said.\nThanks to the 1.4 billion people of India, our nation stands at the forefront of the AI transformation. From digital public infrastructure to a vibrant StartUp ecosystem and cutting-edge research, our strides in AI reflect both ambition and responsibility.— Narendra Modi (@narendramodi) February 16, 2026\nPM Modi is also scheduled to inaugurate the India AI Impact Expo 2026 at Bharat Mandapam.\nThe Expo, being held from February 16 to 20 alongside the Summit, spans more than 70,000 square metres across 10 arenas and brings together global technology firms, startups, academia, research institutions, union ministries, state governments and international partners.\nThe event will feature 13 country pavilions showcasing international collaboration in the AI ecosystem and more than 300 curated exhibition spaces, along with live demonstrations.\nOver 600 startups are expected to present population-scale solutions already deployed in real-world settings.\nOfficials cited by news agency PTI said more than two lakh participants are expected to attend the summit, prompting extensive logistical arrangements, including traffic management measures and coordination with schools due to ongoing board examinations in the national capital.\nRegistration for the event has been kept free, with entry facilitated through QR-based systems and digital platforms.\nThe Summit and expo will also host over 500 sessions featuring more than 3,250 speakers and panellists discussing AI’s transformative role and future policy directions, with organisers aiming to ensure that advancements in artificial intelligence benefit citizens globally.\nLatest Blogs",
        "link": "https://www.news18.com/india/pm-modi-hails-india-ai-impact-summit-pride-for-country-artificial-intelligence-bharat-mandapam-delhi-ws-l-9905840.html",
        "date": "Mon, 16 Feb 2026 10:05:33 +0530",
        "fetched_at": "2026-02-18 04:02:53.215470"
    },
    {
        "title": "AI Summit India 2026 Updates: PM Modi Inaugurates India AI Impact Expo At Bharat Mandapam",
        "content": "AI Impact Summit India 2026 Updates From Delhi: India is hosting the AI Impact Summit 2026 at Bharat Mandapam in New Delhi, bringing together global policymakers, technology leaders and AI innovators. The event marks the first major global AI summit to be held in the Global South. Prime Minister Narendra Modi inaugurated the India AI Impact Expo today.\nAlso See: Emmanuel Macron India Visit Live Updates\nOn Sunday, the Ministry of Information and Broadcasting issued a traffic advisory, urging delegates travelling to Bharat Mandapam and Sushma Swaraj Bhawan to use public transport due to limited parking and revised entry arrangements.\nAlso See: Delhi Traffic Advisory Today\nAccording to the Ministry of External Affairs, 20 world leaders will attend the summit, alongside ministerial delegations from more than 45 countries. UN Secretary-General Antonio Guterres and senior representatives from several international organisations are also expected to participate.\nAlso See: How India Plans To Emerge As A Key Player In The Age Of AI\nAt the invitation of Prime Minister Narendra Modi, several Heads of State and Government will be present. Confirmed attendees include Bhutan’s Prime Minister Tshering Tobgay, Brazilian President Luiz Inacio Lula da Silva, French President Emmanuel Macron, Spanish President Pedro Sanchez, Sri Lankan President Anura Kumara Disanayaka and Switzerland’s President Guy Parmelin.\nMumbai’s Bandra-Worli Sea Link lit up to welcome French President Emmanuel Macron in Mumbai. Macron and First Lady Brigitte Macron are visiting Mumbai and Delhi during their visit to India from February 16-19.\nPresident Macron will arrive in Mumbai today and meet with PM Modi here on February 17. Later, they will travel to Delhi to attend the India AI ​​Impact Summit 2026.\n#WATCH | Maharashtra: Mumbai’s Bandra-Worli Sea Link lit up to welcome French President Emmanuel Macron in Mumbai.\nFrench President Emmanuel Macron and First Lady Brigitte Macron are visiting Mumbai and Delhi during their visit to India from February 16-19. President Macron… pic.twitter.com/T2FppGPLxb\n— ANI (@ANI) February 16, 2026\nNational Commission for Women Chairperson Vijaya Kishore Rahatkar said, “We had a very good discussion at the summit about how we can use AI to protect women. Based on our discussions today, we can connect women in villages, remote areas, and both rural and urban areas. We provide training for women to become AI-enabled for ‘Viksit Bharat’ under our ‘Yashodha AI’ campaign. This helps women learn how they can use AI to progress in their careers. We will soon join the farmers and rural women with us.”\nThe Government of Odisha will showcase its vision and preparedness in Artificial Intelligence at the India AI Impact Summit 2026 through a dedicated Odisha Pavilion at Bharat Mandapam in New Delhi.\nPrime Minister Narendra Modi said that the India AI Impact Expo 2026 reflected the immense potential of artificial intelligence powered by Indian talent and innovation.\nInaugurated the India AI Impact Expo 2026 at Bharat Mandapam.\nBeing here among innovators, researchers and tech enthusiasts gives a glimpse of the extraordinary potential of AI, Indian talent and innovation. Together, we will shape solutions not just for India but for the… pic.twitter.com/G370iXYAXm\n— Narendra Modi (@narendramodi) February 16, 2026\nAt the India AI Impact Summit 2026, the Indian Army is highlighting its shift towards becoming a data-centric, AI-enabled force in line with the national vision of technological self-reliance and secure digital capability. The Army is showcasing a range of indigenous AI applications currently in use, demonstrating their potential for dual-use across sectors such as education, disaster response, cybersecurity, transportation safety and digital infrastructure protection.\n#WATCH | India-AI Impact Summit 2026 | The Indian Army is accelerating its transformation into a data-centric, AI-enabled force aligned with the national vision of technological self-reliance and secure digital capability. At the India AI Summit, the Indian Army is presenting a… pic.twitter.com/ribCBMqXno\n— ANI (@ANI) February 16, 2026\nThe India AI Impact Summit 2026 will bring together over 20 Heads of State, 60 ministers and more than 500 global AI leaders in New Delhi to discuss the future of artificial intelligence. The summit is anchored around three core pillars, or ‘Sutras’ — People, Planet and Progress. Alongside the summit, the India AI Impact Expo is set to feature over 300 exhibitors from 30 countries across more than 10 thematic pavilions.\nAkash Ambani, Chairman of Jio, showcased the company’s AI-driven transformation across healthcare, education, culture and smart home solutions to PM Narendra Modi at the Jio AI Pavilion during the India AI Impact Summit 2026.\n#WATCH | India AI Impact Summit 2026 | Akash Ambani, Chairman, Jio, showcases the company’s AI-led transformation across healthcare, education, culture, and smart home solutions to honourable Prime Minister Narendra Modi at Jio AI Pavilion during the India AI Impact Summit 2026. pic.twitter.com/k2BqvZc3uB\n— ANI (@ANI) February 16, 2026\nPrime Minister Narendra Modi inaugurated the India AI Impact Expo 2026, at Bharat Mandapam.\nThe India AI Impact Expo 2026 is being held from February 16 to 20, 2026, alongside the India AI Impact Summit. The theme of the Summit is Sarvajana Hitaya, Sarvajana Sukhaya.\n#WATCH | Delhi: Prime Minister Narendra Modi to inaugurate the India AI Impact Expo 2026, at Bharat Mandapam.\nThe India AI Impact Expo 2026 is being held from 16th to 20th February 2026, alongside the India AI Impact Summit. The theme of the Summit is Sarvajana Hitaya, Sarvajana… pic.twitter.com/QElKXW1KCr\n— ANI (@ANI) February 16, 2026\nUnion Railway Minister Ashwini Vaishnaw said, “In the next few days of the AI summit, we are looking at the impact of AI on human society. There are positive impacts of AI, including weather forecasting, climate change, agriculture, the discovery of new materials, and productivity gains. There are potential negative impacts. We are looking at how to balance these impacts so we can capture the benefits while containing the harms. We will come out with a good outcome from this summit.”\nUnion Minister Ashwini Vaishnaw on Monday announced that Prime Minister Narendra Modi will soon inaugurate the India AI Impact Expo 2026, which he described as the biggest artificial intelligence expo in the country.\nPM @narendramodi Ji to inaugurate the biggest AI Expo shortly.\n????India AI Impact Expo 2026 pic.twitter.com/nTqaCstCit\n— Ashwini Vaishnaw (@AshwiniVaishnaw) February 16, 2026\nDepartment for Promotion of Industries and Internal Trade (DPIIT) Joint Secretary, Sanjiv Singh, said, “The programme organised by CII for AI based startups on the sideline of the Summit is great. India’s top AI startups are participating in it. AI is a necessity for the country. We are the best in the analytical part of AI in the world… When Excel was first launched, people thought that it would be disruptive. AI will help humankind…”\nManaging Director of the Alt Group, Tyrone Estephan, said, “Many people talk about AI’s role in many different industries, and how it can help the economy. But one often overlooked industry is the creative industry, which people relate to most… This is a great opportunity for the creative industry.”\nOn India AI Impact Summit 2026, Firuzjon Sodiqov, Deputy Chair, AI Council Tajikistan, told ANI, “We have really high expectations because we have been following India’s progress on AI and plus its initiatives gathering everyone in this great Summit. We are looking forward to these kinds of discussions, meetings and new announcements that will be made during the Summit.”\n#WATCH | Delhi: On India AI Impact Summit 2026, Firuzjon Sodiqov, Deputy Chair, AI Council Tajikistan, says, “We have really high expectations because we have been following India’s progress on AI and plus its initiatives gathering everyone in this great Summit. We are looking… pic.twitter.com/CoHgjgxlVp\n— ANI (@ANI) February 16, 2026\nAt the India AI Impact Summit 2026, Harish Krishnan, Managing Director of Cisco Systems India, highlighted AI’s transformative role in driving social good and enhancing human capabilities. Speaking on the theme ‘Democratising AI Resources for Economic Growth and Social Good,’ he stressed the importance of human skills while noting AI’s effective support. Krishnan also highlighted industry-government collaboration at Cisco, prioritising secure frameworks. He showcased the impact of AI in agriculture through the Krishi Mangal programme, which uses Sovereign AI in multiple languages to assist 44,000 women farmers, boosting incomes and improving livelihoods.\nMukesh Aghi, President and CEO of the US-India Strategic Partnership Forum, said the true impact of the AI Summit will be measured over the long term, given the strategic nature of artificial intelligence. He cautioned that if not managed properly, AI could have negative consequences, stressing the need for governments and companies to work together to define and implement responsible AI frameworks.\nVice President CP Radhakrishnan on Monday said the India AI Impact Summit underscores India’s leadership in promoting a people-first and democratic AI future. Referring to the theme Sarvajana Hitaya, Sarvajana Sukhaya, he highlighted India’s commitment to public good, accessibility and global cooperation, aiming to bridge the technological strengths of the Global North with the potential of the Global South. Citing Prime Minister Narendra Modi’s earlier remarks that humanity alone shapes its collective destiny, he stressed that AI must remain human-centric and responsibly guided.\nAt the India AI Impact Summit 2026, New Zealand’s Minister for Science, Innovation and Technology, Dr Shane Reti, described the event as global recognition of India’s growing influence in the AI space. He said New Zealand views India as a major player not only because of its scale but also due to its strong policy work, and expressed interest in deeper collaboration. Reti added that both countries understand the need to build public trust and earn a “social license” to fully realise AI’s benefits, stressing the importance of addressing risks transparently while engaging in international dialogue.\nPrime Minister Narendra Modi will inaugurate the India AI Impact Expo at 5 pm on Monday, bringing together innovators, startups, industry leaders and public institutions on a single platform. Keynote sessions, panel discussions and roundtables will be held at Bharat Mandapam, Sushma Swaraj Bhawan and Ambedkar Bhawan. The opening day aims to outline national priorities, encourage collaborations and shape the strategic AI dialogue for the summit.\nInfo Edge Founder and Executive Vice Chairman Sanjeev Bikhchandani on Monday highlighted that Artificial Intelligence (AI) is not eliminating jobs but significantly enhancing productivity, urging young professionals to adopt AI tools or risk being left behind, ANI reported.\nSpeaking on the AI Summit, Vineet Nayar, Founder-Chairman of Sampark Foundation, highlighted the transformative impact of artificial intelligence on employment, noting that while 50% of jobs may be automated, an equal number of new jobs will be created through technology, ANI reported. He praised India for taking a leadership role in shaping AI for social impact, moving from a technology follower to a global innovator.\nPosters and banners welcoming French President Emmanuel Macron have appeared across Mumbai ahead of his visit to India from February 16–19, accompanied by First Lady Brigitte Macron. President Macron will arrive in Mumbai today and meet Prime Minister Narendra Modi on February 17, before traveling to Delhi to participate in the India AI Impact Summit 2026.\n#WATCH | Mumbai: Posters and banners welcoming French President Emmanuel Macron put up across Mumbai.\nFrench President Emmanuel Macron and First Lady Brigitte Macron are visiting Mumbai and Delhi during their visit to India from February 16-19. President Macron will arrive in… pic.twitter.com/aMqrS1VwAK\n— ANI (@ANI) February 16, 2026\nThe summit will focus on developmental aspects of artificial intelligence, emphasising human-centered and democratic approaches, while also highlighting the perspectives of developing nations, according to the Ministry of External Affairs. Representatives from over 100 countries have been invited to participate, and an outcome document will be released following the discussions. After previous editions in the UK, South Korea, and France, India is taking the lead in shaping the global AI dialogue.\nThe AI Summit kicked off on Monday, bringing together global policymakers, technology leaders and AI innovators.\nIndia AI Impact Summit 2026 Live Updates From Delhi: Prime Minister Narendra Modi credited India’s 1.4 billion citizens for the country’s leadership in artificial intelligence (AI). In a post on X, he highlighted India’s progress in digital public infrastructure, a thriving startup ecosystem, and advanced research, emphasising that the nation’s AI journey reflects both ambition and responsibility.\nThanks to the 1.4 billion people of India, our nation stands at the forefront of the AI transformation. From digital public infrastructure to a vibrant StartUp ecosystem and cutting-edge research, our strides in AI reflect both ambition and responsibility.\n— Narendra Modi (@narendramodi) February 16, 2026\nIndia AI Impact Summit 2026 Live Updates From Delhi: As the AI Summit kicks off today, Prime Minister Narendra Modi highlighted the transformative role of artificial intelligence across sectors like healthcare, education, agriculture, governance, and enterprise. In a tweet, he said the AI Impact Summit will foster global discussions on innovation, collaboration, and responsible AI use, expressing confidence that the summit’s outcomes will help build a progressive, innovative, and opportunity-driven future.\nAI today is transforming several sectors, including healthcare, education, agriculture, governance and enterprise. The AI Impact Summit will enrich global discourse on diverse aspects of AI, such as innovation, collaboration, responsible use and more. I am confident that the…\n— Narendra Modi (@narendramodi) February 16, 2026\nIndia AI Impact Summit 2026 Live Updates From Delhi: Prime Minister Narendra Modi welcomed global leaders, industry experts, innovators, and tech enthusiasts to the AI Impact Summit, which begins today at Bharat Mandapam in New Delhi. In a tweet, he highlighted the summit’s theme, Sarvajana Hitaya, Sarvajana Sukhaya — welfare and happiness for all — emphasising the shared goal of using artificial intelligence to drive human-centered progress.\nPrime Minister Narendra Modi expressed pride as India prepares to host the AI Impact Summit 2026 from February 16–20 at Bharat Mandapam in New Delhi, calling the global participation a testament to the talent and capability of the country’s youth. In a post on X, he said the summit reflects India’s rapid progress in science and technology and highlights its growing contribution to global development. The event will be the first major international AI summit hosted in the Global South.\nयह हमारे लिए अत्यंत गर्व की बात है कि India AI Impact Summit के लिए दुनियाभर से लोग भारत आ रहे हैं। इससे हमारे देश के युवाओं के सामर्थ्य का भी पता चलता है। यह अवसर इस बात का भी प्रमाण है कि हमारा देश विज्ञान और टेक्नोलॉजी के क्षेत्र में तेजी से प्रगति कर रहा है और वैश्विक विकास… pic.twitter.com/7gxXJEtpOz\n— Narendra Modi (@narendramodi) February 16, 2026\nThe Ministry of Information and Broadcasting on Sunday released a traffic advisory ahead of the India AI Impact Summit 2026. In a post on X, the Ministry advised delegates attending events at Bharat Mandapam and Sushma Swaraj Bhawan to opt for public transportation, citing limited parking facilities and changes to entry gate arrangements.\nIndia will host the Artificial Intelligence Impact Summit 2026 starting Monday in New Delhi, bringing together global stakeholders to chart the course for inclusive, responsible and resilient AI development. Prime Minister Narendra Modi is scheduled to inaugurate the India AI Impact Expo 2026 at 5 pm today at Bharat Mandapam. The gathering will be the first major international AI summit hosted in the Global South.\nLatest Blogs",
        "link": "https://www.news18.com/india/india-ai-summit-2026-live-updates-ai-impact-summit-delhi-bharat-mandapam-huang-sundar-pichai-artificial-intelligence-latest-news-liveblog-ws-l-9905752.html",
        "date": "Tue, 17 Feb 2026 10:52:48 +0530",
        "fetched_at": "2026-02-18 04:02:54.409354"
    },
    {
        "title": "AI Impact Summit Kicks Off Monday: How India Plans To Emerge As A Key Player In The Age Of AI",
        "content": "India is set to host the AI Impact Summit from February 16 to 20 at the grand Bharat Mandapam, bringing together global leaders, policymakers and industry heavyweights in Artificial Intelligence.\nFor India, the summit is not just a high-profile gathering. It is a statement of intent. New Delhi wants to signal that it does not aim to remain merely a participant in the AI revolution, but to emerge as a key architect shaping its rules, standards and opportunities.\nPrime Minister Narendra Modi will address the summit, visit the Expo and engage with global CEOs. At his invitation, several world leaders, including French President Emmanuel Macron and Brazilian President Lula da Silva, are expected to attend.\nMinisterial delegations from over 45 countries, along with the UN Secretary General and senior international officials, will also take part in the event.\nWhy This Summit Matters\nArtificial Intelligence has moved far beyond research labs. It is reshaping healthcare delivery, transforming agriculture, recalibrating financial markets and redefining education and work. In this context, the AI Impact Summit aims to widen the global conversation.\nEarlier global meets focused strongly on AI safety and frontier risks. India is broadening the focus to highlight AI’s developmental impact — how it can drive economic growth, inclusion and sustainability. The emphasis is on “People, Planet, and Progress\".\nIndia will showcase its deep talent pool, digital public infrastructure and expanding startup ecosystem. Backed by the IndiaAI Mission’s push for compute capacity, datasets and skilling, the summit will reflect India’s strategy of balancing rapid innovation with appropriate safeguards.\nIT Secretary S Krishnan has said the key message is that AI must be human-centric and inclusive. “The key message we want to send is that whatever happens with AI needs to be human-centric and inclusive. There needs to be democratic access to AI resources, and it needs to be done in a way where people are at the centre of this process,\" he told news agency PTI.\nBig Themes To Watch\nSeven thematic working groups will present proposals on AI Commons, trusted AI tools, shared compute infrastructure and sector-specific use cases. Over 700 sessions are planned over five days, covering AI safety, governance, ethical use, data protection and sovereign AI.\nThere will be strong focus on indigenous foundation models for strategic sectors. Discussions will also explore how AI is changing industries and what new skills will be needed in the job market.\nIndia, with over 65 per cent of its population under 35, sees its young workforce as a major advantage in adapting to AI-driven industries. Reskilling and AI-focused training are likely to be key talking points.\nProminent CEOs Attending\nThe summit features a blockbuster list of global tech leaders. These include Sundar Pichai of Google, Sam Altman of OpenAI, Demis Hassabis of DeepMind Technologies, Dario Amodei of Anthropic and Brad Smith of Microsoft.\nThe presence of these influential figures places the summit at the centre of global tech deliberations. Frontier AI labs such as OpenAI and Anthropic, along with tech giants like Microsoft and Google, are expected to offer insights into the future direction of AI development.\nIndian startup founders building indigenous models will also share the stage.\nSpotlight On Sovereign AI\nAhead of the summit, 12 Indian AI startups selected under the Foundation Model Pillar presented their work to the Prime Minister. Their projects range from Indian language foundation models and multilingual tools to healthcare diagnostics, engineering simulations and generative AI applications.\nIndia’s approach is innovation-first. While acknowledging the need for regulation, the government has said it stands ready to act when required, without harming innovation.\nAs the first global AI summit hosted in the Global South, the event also aims to bring developing nations to the AI high table. A joint declaration or roadmap for responsible AI deployment could emerge as a key outcome.\n(With inputs from PTI)\nLatest Blogs",
        "link": "https://www.news18.com/india/ai-impact-summit-kicks-off-monday-how-india-plans-to-emerge-as-a-key-player-in-the-age-of-ai-ws-l-9905596.html",
        "date": "Sun, 15 Feb 2026 22:42:53 +0530",
        "fetched_at": "2026-02-18 04:02:55.294436"
    },
    {
        "title": "Chatbot To Simulation: Panchayat Ministry To Showcase Grassroots Governance At AI Impact Summit",
        "content": "From how to upload a Panchayat asset photo and its details to clarifying scheme guidelines, eGramSaathi, an AI-powered assistant developed by the Ministry of Panchayati Raj, is now positioning itself as the digital bridge between village citizens and grassroots governance.\nAnd this is not a pilot project tucked away in files. It will be live on the international stage at the India AI Impact Expo 2026 in New Delhi, starting February 16. News18 reviewed the documents prepared for the summit.\nAt a time when Artificial Intelligence (AI) is often showcased through flashy consumer apps and global tech debates, the Ministry of Panchayati Raj is quietly placing AI inside the Gram Sabha, empowering India’s grassroots governance.\nThe Ministry will present a suite of AI-enabled governance tools designed specifically for decentralised administration. Alongside eGramSaathi, there is SabhaSaar, an AI system that records, transcribes and converts Gram Sabha deliberations into structured, actionable minutes of meeting, reducing paperwork and ensuring decisions don’t dissolve into memory.\nThen comes PRAMAN (Panchayati Raj Asset Monitoring and Notification), an image analytics platform that automatically validates uploaded asset photographs, checks authenticity, flags duplication and assesses quality. In a system where physical asset verification often slows schemes, automation could prove transformative.\nBut the showcase is not confined to dashboards and screens. Visitors will be able to — Be the Sarpanch — a role-based simulation placing participants inside AI-assisted decision-making scenarios. A virtual reality Gram Sabha experience, immersive walkthroughs and live demonstrations aim to show how technology can simplify complex administrative processes without displacing human agency.\nThe larger message is unmistakable here. AI in India’s public systems is not being framed merely as efficiency software, but as an accountability tool. By embedding transcription accuracy, image verification and instant citizen responses into Panchayat workflows, the Ministry is signalling that emerging technologies can strengthen transparency at the grassroots, where governance is most immediate.\nAs India hosts what is being described as a first-of-its-kind global AI summit in the Global South, the rural Ministry’s bet is clear. The future of AI will not be defined only in boardrooms, but in village meetings, asset registers and citizen queries, answered, perhaps, by a chatbot.\nLatest Blogs",
        "link": "https://www.news18.com/india/chatbot-to-simulation-panchayat-ministry-puts-grassroots-governance-at-centre-stage-at-ai-impact-summit-ws-l-9905410.html",
        "date": "Sun, 15 Feb 2026 19:56:19 +0530",
        "fetched_at": "2026-02-18 04:02:55.920200"
    },
    {
        "title": "Top Putin Aide Maxim Oreshkin To Lead Russian Delegation For AI Impact Summit In New Delhi",
        "content": "In a significant move towards fostering international collaboration in artificial intelligence, Russian President Vladimir Putin’s senior aide, Maxim Oreshkin, will lead a substantial delegation to the AI Impact Summit in New Delhi starting Monday.\nIndia is set to host the AI Impact Summit 2026, a prestigious event that will convene global leaders and industry giants in the field of Artificial Intelligence. Scheduled to take place from February 16-20 at New Delhi’s ‘Bharat Mandapam,’ the summit aims to bring together policymakers, industry leaders, and technology innovators to discuss the future of AI.\nMaxim Oreshkin, deputy chief of the Kremlin staff and economic aide to President Putin, is designated to head the Russian delegation. A Kremlin source told PTI that this choice underscores a strategic effort to enhance AI collaboration between Russia and India. The delegation will focus on secure, trusted, and sovereign AI, engaging actively in discussions on AI governance, technology, and partnerships within BRICS and other international platforms, the source added.\nIn an interview to BRICS TV Network on February 9, Russian Foreign Minister Sergei Lavrov said: “India also emphasises ICT security, which we actively support, contributing to the agenda. This is significant, as norms regulating AI use between states, and AI applications by individual states, are only now being established.\" Lavrov said these norms will regulate behaviours that affect security.\n“Some countries are actively introducing AI into military applications. While each state has the right to determine its own approach, certain countries are already attempting to centralise control, subordinating what states can and may do with AI in the military sphere,\" he added.\nBRICS members will not accept infringements on their sovereignty, yet transparency remains crucial, the minister added.\nIndia’s Ambassador to Russia, Vinay Kumar, in an article published by the state-run news agency TASS on Friday, elaborated on the promising prospects for AI cooperation between India and Russia. He underscored the growing strategic and technological partnership, asserting that the collaboration in AI would serve as a catalyst for mutual growth and technological advancement for both nations.\nLatest Blogs",
        "link": "https://www.news18.com/world/top-putin-aide-maxim-oreshkin-to-lead-russian-delegation-for-ai-impact-summit-in-new-delhi-ws-l-9905379.html",
        "date": "Sun, 15 Feb 2026 20:14:50 +0530",
        "fetched_at": "2026-02-18 04:02:56.565710"
    },
    {
        "title": "'Budget 2026 Reflects India's Yearning To Become A Developed Nation': PM Modi",
        "content": "Prime Minister Narendra Modi on Sunday said that the Union Budget 2026-27, which was presented by Finance Minister Nirmala Sitharaman on February 1, reflects “India’s yearning to become a developed nation\".\nIn an exclusive interview with news agency PTI, the Prime Minister described the budget as a “we are ready\" moment, born out of preparation and inspiration, rather than a “now or never\" moment forced by compulsion.\n“None of our budgets are run-of-the-mill ‘bahi-khata’ documents; that’s not our approach,\" he added.\nPM Modi pointed out that India is witnessing the most expansive infrastructure push in its history, built with future readiness in mind. He said, “India has to be strong and prepared at all times, and that is what we are doing,\" referring to the defence budget and modernisation plans.\nThe Union Budget 2026 has unveiled a series of measures aimed at accelerating growth across infrastructure, power, renewable energy and technology, offering a significant demand boost for the capital goods sector.\nThe proposals are expected to benefit engineering, procurement, and construction (EPC) companies as well as domestic manufacturers by lowering production costs and enhancing competitiveness.\nOn the economic front, PM Modi said that restored “political stability and predictability\" have strengthened investor confidence in India, enabling the country to negotiate trade agreements from a position of strength.\nSpeaking on free trade agreements (FTAs), he said the deals are designed to expand market access for micro, small, and medium enterprises (MSMEs) in sectors such as textiles, leather, chemicals, handicrafts, and gems.\n“Stronger manufacturing, services, MSMEs enable India to negotiate trade pacts from a position of strength,\" the Prime Minister said.\nThe Prime Minister also criticised previous Congress-led UPA governments over their economic management, saying India was then unable to negotiate trade pacts with confidence. “During UPA rule, talks would begin and then breakdown; a little real substance achieved despite long negotiations.\" he noted.\nLatest Blogs",
        "link": "https://www.news18.com/india/budget-2026-reflects-indias-aspiration-to-become-a-developed-nation-pm-modi-9905252.html",
        "date": "Sun, 15 Feb 2026 18:52:56 +0530",
        "fetched_at": "2026-02-18 04:02:57.210840"
    },
    {
        "title": "Weeks After Ajit Pawar's Deadly Plane Crash, Govt Conducts Thorough Study Of Non-Scheduled Operators",
        "content": "Civil Aviation Minister K Rammohan Naidu has said the government is conducting a “very thorough study\" of flight operations by non-scheduled operators and uncontrolled airfields to survey areas where steps need to be taken.\nThe flight operations by Non-Scheduled Operators (NSOPs) came under increased scrutiny after the fatal crash of a VSR Ventures-owned LearJet 45 plane that killed Maharashtra Deputy Chief Minister Ajit Pawar and four others near the Baramati airport on January 28.\nEarlier this month, the Directorate General of Civil Aviation (DGCA) had initiated a special safety audit of NSOPs.\nPTI quoted Naidu saying that the civil aviation ministry is doing a “thorough study\" of the NSOPs, as well as the uncontrolled airfields.\nNSOPs are entities which do not have a fixed schedule for operators and mostly operate chartered flights. Baramati, where January 28 incident took place, is an uncontrolled airfield wherein traffic information is provided by instructors/pilots from the flying training organisations.\nThe civil aviation minister said areas where something needs to be done with respect to NSOPs and uncontrolled airfields will be looked into.\nIn reply to a question on whether the ministry would be looking at having a ‘too big to fail’ concept for the airlines, PTI quoted minister Rammohan Naidu saying the focus will be to boost airlines with smaller operations.\nThe Aircraft Accident Investigation Bureau (AAIB) will likely release its preliminary report on the fatal accident soon.\nFollowing the crash, the ministry in its statement said the “aircraft was cleared to land on runway 11 at 0843IST; however, they did not give a readback of the landing clearance\".\n“Next, the ATC saw the flames around the threshold of runway 11 at 0844 IST. The emergency services then rushed to the crash site,\" it had said.\nLatest Blogs",
        "link": "https://www.news18.com/auto/after-ajit-pawar-plane-crash-govt-carrying-out-thorough-study-of-non-scheduled-operators-ws-l-9905150.html",
        "date": "Sun, 15 Feb 2026 17:11:44 +0530",
        "fetched_at": "2026-02-18 04:02:57.911887"
    },
    {
        "title": "PM Modi To Inaugurate India AI Impact Expo 2026 At Bharat Mandapam",
        "content": "Prime Minister Narendra Modi will inaugurate India AI Impact Expo 2026 on February 16 at Bharat Mandapam, New Delhi.\nThe India AI Impact Expo 2026 will be held from February 16 to 20, alongside the India AI Impact Summit, at Bharat Mandapam. The Expo will serve as a national demonstration of AI in action, where policy meets practice, innovation meets scale, and technology meets the everyday citizen, a statement from the Prime Minister’s Office said.\nSpread across 10 arenas covering more than 70,000 square metres, the Expo will bring together global technology firms, startups, academia and research institutions, Union Ministries, State Governments, and international partners.\nThe Expo will also feature 13 country pavilions, showcasing international collaboration in the AI ecosystem. These include pavilions from Australia, Japan, Russia, United Kingdom, France, Germany, Italy, Netherlands, Switzerland, Serbia, Estonia, Tajikistan and Africa.\nIt will host over 300 curated exhibition pavilions and live demonstrations, structured across three thematic chakras – People, Planet and Progress. In addition, the Expo will feature over 600 high-potential startups, many of them building globally relevant and population-scale solutions.\nThese startups will demonstrate working solutions that are already deployed in real-world settings.\nThe India AI Impact Expo 2026 is expected to witness participation of over 2.5 lakh visitors, including international delegates. The event aims to foster new partnerships and create business opportunities within the global AI ecosystem.\nOver 500 sessions will be organised, featuring more than 3250 visionary speakers and panel members. These sessions will focus on acknowledging the transformative impact of AI across sectors and deliberating on future actions to ensure that AI benefits every global citizen.\nFor India, a nation projected to see its AI market surge past USD 17 billion by 2027, this summit is more than a diplomatic triumph – it’s a declaration of intent.\nWith 800 million internet users, a booming startup scene, and world-class digital public infrastructure, India is positioning itself as the bridge between innovation and impact.\nLatest Blogs",
        "link": "https://www.news18.com/cities/new-delhi-news/pm-modi-to-inaugurate-india-ai-impact-expo-2026-at-bharat-mandapam-ws-l-9905141.html",
        "date": "Sun, 15 Feb 2026 16:43:26 +0530",
        "fetched_at": "2026-02-18 04:02:58.790604"
    }
]