[
    {
        "title": "Strike: Banking may be hit; transport and schools to function as usual",
        "content": "Bank employees associated with the All India Bank Employees’ Association and Bank Employees’ Federation of Indiain Karnataka are expected to stay away from work. File image.\n| Photo Credit: The Hindu\nThe impact of nationwide general strike on Thursday called by various trade union organisations is likely to be minimal in Karnataka. While the banking services are likely to be affected in the State, public transport operations are expected to continue without major disruption. Schools are also set to function as usual, though the supply of midday meals may be impacted.\nThe strike, called by central trade unions and supported by organisations representing agricultural, rural, and informal sector workers, is expected to witness participation across sectors in several States.\nBank employees associated with the All India Bank Employees Association (AIBEA) and Bank Employees Federation of India (BEFI) in Karnataka are expected to stay away from work. However, in Karnataka, major transport utilities have indicated that commuter services are unlikely to be disrupted.\nThe KSRTC Staff and Workers’ Federation in Karnataka said it would extend moral support to the strike. “We are supporting the nationwide general strike in solidarity with workers’ demands. However, we do not anticipate large-scale disruption of bus services in the State,” a senior member of the federation said.\nA senior official of the Karnataka State Road Transport Corporation (KSRTC) clarified that operations would continue as scheduled. “There will be no impact of the strike on KSRTC services. Buses will operate as usual across all divisions,” the official said.\nSimilarly, a senior official of the Bangalore Metropolitan Transport Corporation (BMTC) confirmed that city bus services in Bengaluru would run normally on Thursday.\nAt the Kempegowda International Airport, official sources from Bangalore International Airport Limited (BIAL) said no advisory had been issued so far. “We have not received any advisory regarding the strike. If there is any likely impact on flight movements or airport operations, we will issue passenger advisories. As of now, there is no issue anticipated,” an official said.\nThe Bangalore Metro Rail Corporation Limited (BMRCL)official  also stated that Namma Metro services would operate as per the regular schedule.",
        "link": "https://www.thehindu.com/news/national/karnataka/strike-banking-may-be-hit-transport-and-schools-to-function-as-usual/article70621117.ece",
        "date": "Thu, 12 Feb 2026 09:20:03 +0530",
        "fetched_at": "2026-02-12 04:05:45.702380"
    },
    {
        "title": "Less than half of those trained under PM-DAKSH scheme for SCs, BCs, DNTs got jobs",
        "content": "States such as Rajasthan, Tripura, and Jharkhand saw less than 40% of the candidates placed.\n| Photo Credit: VectorMine\nLess than half of the students trained under the PM-DAKSH scheme between 2021 and 2024 were placed, as per data released in the Lok Sabha on February 3. Under the Scheme, training institutes are required to provide employment (which includes wage and/or self-employment) to at least 70% of the trained candidates after completion of training under Short Term Training Courses. If these institutes fail to do so, the release of 30% of the training cost per candidate is forfeited. About 1.5 lakh candidates were trained between 2021 and 2024, of which 44% were provided job opportunities.\nThe Pradhan Mantri Dakshata Aur Kushalata Sampanna Hitgrahi (PM-DAKSH) Yojana, is a Central Sector Scheme that was launched during 2020-21. The programme was intended to provide skills through good quality institutions so that candidates from its target group can find employment. The target group includes members of Scheduled Castes, Other Backward Castes, Economically Weaker Sections, and the De-notified Tribes in India (DNTs), including those who are ‘Safai Karamcharis’ or waste pickers.\nThere are three Corporations under this Department, the National Scheduled Castes Finance and Development Corporation (NSFDC), National Backward Classes Finance & Development Corporation (NBCFDC), and National Safai Karamcharis Finance & Development Corporation (NSKFDC). These corporations extend loan facilities and assistance to the eligible youth in setting up their projects, training, and financial assistance for employability and entrepreneurship after pursuing education.\nData show that all three corporations fell short of their required placement rate. Only 49.8% of the trained candidates were placed under the NSFDC, meant to assist members of the Scheduled Castes. States such as Rajasthan, Tripura, and Jharkhand saw less than 40% of the candidates placed.\nSimilarly, the NBCFDC for Backward classes managed to place 48.9% of the trained candidates between 2021 and 2024.\nOnly 23% of the candidates who trained under the NSKFDC, meant for DNTs including Safai Karamcharis, were placed. As per the data released in the Lok Sabha, 16 out of 25 States trained no candidates under NSKFDC in 2023-24.\nFrom 2024–25 onwards, PM-DAKSH has been merged with the Pradhan Mantri Kaushal Vikas Yojana (PMKVY) of the Ministry of Skill Development and Entrepreneurship.\n/\nIndia\n/\nIndia",
        "link": "https://www.thehindu.com/data/less-than-half-of-those-trained-under-pm-daksh-scheme-for-scs-bcs-dnts-got-jobs/article70620661.ece",
        "date": "Thu, 12 Feb 2026 08:24:42 +0530",
        "fetched_at": "2026-02-12 04:05:46.317252"
    },
    {
        "title": "Union Minister Shivraj Singh Chauhan attends Janpratinidhi Sammelan in Agartala",
        "content": "Tripura Chief Minister Manik Saha and Union Minister of Agriculture & Farmers’ Welfare and Rural Development, Shivraj Singh Chouhan during the Representative Conference held at Swami Vivekananda Maidan, in Agartala on Wednesday (February 12, 2026). Photo: @DrManikSaha2 X/ANI\nUnion Minister Shivraj Singh Chauhan attended Janpratinidhi Sammelan (People’s Representative Conference) held in Agartala on Wednesday (February 11, 2026) to mark the launch of the ‘Viksit Bharat – Guarantee for Rozgar and Ajeevika Mission (Gramin)’ or VB–G RAM G. The event saw inauguration of various rural development projects and beneficiary felicitation programmes.\nUnion Minister for Rural Development and Agriculture Chouhan was the chief guest of the event at the Vivekananda Mini Stadium. Attendees included Tripura Chief Minister Dr. Manik Saha along with several of his Cabinet colleagues holding portfolios for finance, higher education, industries, tourism, social welfare and fisheries.\nSpeaking on the occasion, Union Minister Chouhan recalled Swami Vivekananda’s vision of India becoming a world leader, stating that this aspiration is being fulfilled under Prime Minister Narendra Modi’s leadership. He stressed the designation of the North-East as ‘Ashtalakshmi’ and described Tripura as a ‘Dhanalakshmi’ hub, indicating the State’s importance in rural development.\nMr. Chouhan also criticised Opposition parties, specifically the Congress and Left Front, for their past administrations which he claimed only changed project names without substantial contributions contrasting this with the current initiative aimed at guiding rural development effectively.\nChief Minister Dr. Manik Saha highlighted the central government’s commitment to strengthening the rural economy and emphasised the need for judicious use of funds to achieve genuine development.\nDuring the event, several projects  were inaugurated.  Certificates were distributed to beneficiaries of various projects.\nSome departments, including the Department of Agriculture and Farmers Welfare, established exhibition stalls, facilitating interaction between visitors and officials present.\nTripura\n/\nIndia",
        "link": "https://www.thehindu.com/news/national/union-minister-shivraj-singh-chauhan-graces-janpratinidhi-sammelan-in-agartala/article70622369.ece",
        "date": "Thu, 12 Feb 2026 09:07:58 +0530",
        "fetched_at": "2026-02-12 04:05:46.927481"
    },
    {
        "title": "Villagers skip meeting convened by Odisha govt over Anganwadi boycott row",
        "content": "The Anganwadi in Odisha’s Kendrapara district has not been functioning for nearly three months.\n| Photo Credit: Special Arrangement\nThe nationwide outrage triggered by the three-month boycott of an Anganwadi centre following the appointment of a Dalit woman appears to have had little impact on the villagers, who skipped a meeting convened by the Kendrapara district administration in Odisha to resolve the crisis amicably on Wednesday (February 11, 2026).\nA team of district level officials led by Kendrapara Sub-Collector had visited Nuagaon village under Ghadiamal gram panchayat in Rajnagar block where villagers had stopped sending their kids to Anganwadi centre after Sharmista Sethy, a 20-year-old graduate from the Dalit community, was given appointment as helper-cum-cook.\n“We want villagers to send their children to Anganwadi centre as the absence is affecting their pre-school learning as well as healthy diets, as the government provides free of cost. However, only Sarpanch and ward member (elected representatives) and two villagers turned up for meeting,” said Deepali Mishra, Child Development Project Officer (CDPO).\nAccording to sources, villagers are not attributing any reason for their boycott as they think it could attract legal complication. However, casteism was said to be root cause for the boycott, said a senior officer involved in mobilising villagers for amicable solution.\nMs. Misrha said, “we have asked Sarpanch and ward members to hold discussions with villagers and persuade them not to boycott Anganwadi. It was emphasised that normalcy should return to Anganwadi at the earliest.”\nMs. Sethy who was the lone candidate for helper-cum-cook in Anganwadi centre was appointed on November 20, 2025. To her utter surprise, parents stopped sending to Centre subsequent to her appointment. The 20-year-old woman pleaded before villagers to send their kids, but nobody paid heed. It needs to be mentioned that the woman hails from the same Nuagaon village.\nThe district administration had made it clear that under no circumstances the appointment would be withdrawn.\nOrissa",
        "link": "https://www.thehindu.com/news/national/odisha/villagers-skip-meeting-convened-by-odisha-govt-over-anganwadi-boycott-row/article70620490.ece",
        "date": "Thu, 12 Feb 2026 06:51:32 +0530",
        "fetched_at": "2026-02-12 04:05:47.541272"
    },
    {
        "title": "Antimicrobial resistance: Charles Darwin was right; India’s drug policy isn’t",
        "content": "In settings where rapid, affordable diagnostics are unavailable, antibiotics often substitute for testing instead of complementing it.\n| Photo Credit: Volodymyr Hryshchenko/Unsplash\nCharles Darwin’s central insight wasn’t just that species evolve but that they can’t but adapt in the presence of selection pressures. In practical terms, organisms don’t choose to change: they respond to the environments in which they’re trying to live. This insight should trouble us when we consider antimicrobial resistance (AMR): because resistance isn’t an anomaly of the antibiotic era — it is a logical consequence.\nFor many decades, we have governed antibiotics as static medical tools: prescribed to individuals, regulated largely by access and volume, and evaluated using short-term clinical outcomes. So when resistance emerged, we treated it as a breakdown of stewardship, compliance, and/or enforcement. Yet in the biological sense, resistance is not a failure of use. It’s the expected outcome of using antibiotics at scale.\nAntibiotics aren’t only pharmacological agents: they are evolutionary interventions that reshape microbial populations wherever they’re deployed. Every antibiotic dose is a selective event. It means each time you take an antibiotic, you create a strong evolutionary pressure in your body and its surroundings. Bacteria that are susceptible are killed or suppressed while those that can resist survive and multiply. Repeating the antibiotic doses amplifies this selection, increasing the share of resistant strains.\nEvery clinic, hospital, farm, and wastewater outlet becomes a place where microbial populations are shaped by survival advantage. The problem is not that evolution is surprising but that our health systems continue to behave as though it can be ignored.\nBacteria also adapt on timescales that governance does not. Mutations arise within hours. Resistant strains circulate within days. Surveillance updates, treatment guidelines, and regulatory responses unfold over years. This structural lag ensures resistance becomes visible only after it has become widespread.\nIn India, this lag is most evident in everyday care, including crowded outpatient clinics, district hospitals with limited laboratory support, and private practices under pressure to act quickly. In settings where rapid, affordable diagnostics are unavailable, antibiotics often substitute for testing instead of complementing it.\nBut from a systems perspective, the dynamics of how resistance arises and becomes visible means stewardship guidelines alone can’t counter it if they are not anchored in diagnostic capacity and real-time feedback. In fact, AMR is a failure of system design more than that of compliance. It’s particularly difficult to govern because it doesn’t belong to any single sector. Human health, animal husbandry, pharmaceutical manufacturing, sanitation, and environmental regulation all shape the microbial landscape, often without coordination.\nAntibiotic residues entering water bodies create environmental reservoirs of resistance genes. Sub-therapeutic dosing in livestock selects for traits that later spill into human infections. Incomplete dose regimes in humans can increase the selection of AMR. Fragmented surveillance and uneven infection control further accelerate spread. No single actor drives this process, which also means no single intervention can reverse it.\nIndia’s National Action Plan on Antimicrobial Resistance correctly recognises this complexity through a ‘One Health’ framework. However, the Plan needs to be more strongly embedded in routine healthcare delivery, especially outside tertiary institutions.\nAntibiotics also reshape microbial populations inside patients’ bodies and in communities. Yet clinicians are rarely trained to think in terms of selection pressure, population dynamics, and the long-term efficacy of antibiotics yet are expected to manage patient outcomes. Likewise, while there’s renewed optimism around  discoveries driven by artificial intelligence and novel antimicrobial platforms, they won’t fall in place if the way we use antibiotics doesn’t change.\nPreserving the efficacy of antibiotics  therefore depends on how diagnostics, surveillance, procurement, stewardship, and environmental controls are aligned. Market incentives that reward volume will undermine this goal. There is an opportunity for India here, not only as a manufacturer of medicines but as a country that builds public systems to treat antibiotics as a shared resource rather than just as a consumable.\nCharles Darwin’s insight that adapting to one’s environs is not optional endures because it’s a question of survival. The question AMR poses is whether our health systems and policies can adapt with the same persistence as the organisms they seek to ‘treat’, or if they will continue to treat evolution as an administrative inconvenience and risk obsolescence.\nAnu Raghunathan is a scientist at the CSIR-National Chemical Laboratory, Pune. Views are personal.\nprescription drugs\n/\nmedicine",
        "link": "https://www.thehindu.com/sci-tech/science/darwin-day-antimicrobial-resistance-adaptation-india-drug-policy/article70607352.ece",
        "date": "Sun, 08 Feb 2026 17:32:27 +0530",
        "fetched_at": "2026-02-12 04:05:48.147110"
    },
    {
        "title": "Anna University inaugurates state-of-the-art AI lab",
        "content": "A state-of-the-art Artificial Intelligence-based research and innovation laboratory was inaugurated at the Anna University on Wednesday.\nThe lab is equipped with advanced computing systems and high-performance workstations worth Rs. 1 crore to support research and practical learning of Artificial Intelligence (AI), Machine Learning, Deep Learning, Data Science, Computer Vision, Natural Language Processing, and Robotics.\nHoused at the Technology Research Park at the University, the lab will serve as a hub for research projects, internships, workshops, hackathons, and industry-driven certification programmes and is expected to enhance students’ technical competencies and prepare them for global career opportunities in AI-driven domains.\nThe Vaidharma Laboratory, as it is named, was formally donated to the Electronics and Communications Engineering (ECE) Department of College of Engineering, Guindy (CEG) by its 1990-batch alumnus Sundar Vaidhiyanathan, CEO and Co-founder, Karsun Solutions.\nV. Kumaresan, Registrar-in-charge, Anna University, P. Hariharan, Dean, CEG, and M.A. Bhagyaveni, Head, Department of ECE, CEG were present.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/anna-university-inaugurates-state-of-the-art-ai-lab/article70620137.ece",
        "date": "Thu, 12 Feb 2026 00:06:01 +0530",
        "fetched_at": "2026-02-12 04:05:48.761272"
    },
    {
        "title": "U.P. budget 2026: BJP’s farewell budget, lacks focus, says Opposition",
        "content": "Samajwadi Party National president Akhilesh Yadav addresses a press conference on the U.P. Budget 2026–27 at the party office in Lucknow on February 11, 2026.\n| Photo Credit: ANI\nOpposition parties in Uttar Pradesh on Wednesday (February 11, 2026) hit out at the State Government, describing the budget as a farewell budget with no focus on common people, adding the departure of the Bharatiya Janata Party (BJP) is certain in the upcoming 2027 assembly poll. Congress president Ajay Rai demanded a white paper on the projects and proposals that were sanctioned and implemented in the previous budgets.\n“This is the last and farewell budget of the BJP government. The BJP has forgotten the promises made to the people. It is misleading the public only with figures and propaganda. There is nothing in the budget for the poor, for the farmers, for the youth. If the size of the budget is big, why hasn’t inflation come down? Why didn’t unemployment end?” asked the Samajwadi Party (SP) president, Akhilesh Yadav, in Lucknow.\nMr. Yadav alleged that the government has not been able to spend even 50% of the previous budget so far. “The per capita income of U.P. is second from bottom to second as compared to other states of the country. The government should tell what the capital income is of the poor who are being given rations,” he said.\nU.P. Congress president Ajay Rai demanded a white paper on the projects and proposals that were sanctioned and implemented in the previous budgets. “We demand a white paper on the projects and proposals sanctioned and implemented in the previous budgets. The whole budget is a bogus exercise under the BJP government; most departments fail to spend the sanctioned amount of the last budget allocated to their departments. In 60 districts, medical colleges have been established but they lack basic infrastructure. We all know the districts numbering 37 in Purvanchal and Bundelkhand are backward in all indicators, but the government hasn’t given any special package to these regions,” Mr. Rai told The Hindu.\nUttar Pradesh\n/\nIndian National Congress",
        "link": "https://www.thehindu.com/news/national/uttar-pradesh/up-budget-2026-bjps-farewell-budget-lacks-focus-says-opposition/article70620603.ece",
        "date": "Thu, 12 Feb 2026 04:03:26 +0530",
        "fetched_at": "2026-02-12 04:05:49.373434"
    },
    {
        "title": "Protest against Ken-Betwa river link project turns violent in M.P.; 3 cases lodged",
        "content": "Stones scattered on the road as a police vehicle moves in after Ken-Betwa protesters pelt stones at the SDM office in Chhatarpur on February 11, 2026.\n| Photo Credit: ANI\nThree cases have been filed in Madhya Pradesh’s Chhatarpur against a group of people after a protest they were carrying out against the Ken-Betwa river linking project and the arrest of a local activist turned violent, officers said on Wednesday (February 11, 2026).\nAccording to the police, locals from various villages under the Bijawar tehsil were on Tuesday evening (February 10, 2026) protesting for various demands, including the release of Amit Bhatnagar, who is also a leader of the Aam Aadmi Party (AAP) and better compensation and rehabilitation for those affected by the ambitious project. The demonstration, however, turned violent late in the night, leading to stone pelting by protestors and blockading of the tehsil premises, which resulted in sub-divisional magistrate (SDM) Vijay Dwivedi and various officials getting stuck inside.\nThe protestors included tribals, women and workers of Opposition parties such as the Congress, AAP and the Samajwadi Party.\nChhatarpur Superintendent of Police Agam Jain told The Hindu that while the protests were going on peacefully in the evening, a group of drunk men tried to create a nuisance in the night, which led to a tense situation for some time.\n“We have identified about 10 people who tried to create a nuisance and are working to detain them. Some people also misbehaved with a baraat (wedding procession) that was passing by and assaulted the people in it. One of the FIRs has been filed based on a complaint from them,” he said, adding that one FIR has been lodged for manhandling government officials while another for blockading.\nThe FIRs have been filed against more than 40 unidentified people.\nWhile local reports claim that the police resorted to lathi charges, Mr. Jain denied the allegation and said that only mild force such as water cannons was used to disperse the crowd.\nMr. Jain said that senior officials also held meetings with the representatives of the protestors on Wednesday (February 11, 2026) and addressed their concerns.\n“The situation is peaceful now. There is no heavy deployment in the area but the police are keeping a vigil to maintain peace,” he added.\nA district administration official, who requested anonymity, said that Mr. Bhatnagar was arrested on the “apprehension that he may disturb the peace in the area” under Section 170 of the Bharatiya Nagarik Suraksha Sanhita (BNSS).\nFlagged off by Prime Minister Narendra Modi on December 25, 2024, the Ken-Betwa link project (KBLP) is the first of 30 such link projects under a National Perspective Plan (NPP) for water resources development and interlinking of rivers with ‘surplus water’ to those with ‘deficit water’. The KBLP plans to transfer excess water from the Ken river basin to the Betwa river basin in the Bundelkhand region that covers parts of Madhya Pradesh and Uttar Pradesh.\nHowever, residents of several villages in Chhatarpur and Panna districts have long been protesting the project over fears of displacement and demanding better rehabilitation and improved compensation. Various environmentalists, including Former Union Environment Minister and Congress general secretary Jairam Ramesh, have also expressed concerns over its potential impact on the environment, local ecology and wildlife, as a large part of the project falls inside the Panna National Park and Tiger Reserve.\nMadhya Pradesh",
        "link": "https://www.thehindu.com/news/national/madhya-pradesh/protest-against-ken-betwa-river-link-project-turns-violent-in-mp/article70620687.ece",
        "date": "Thu, 12 Feb 2026 03:05:11 +0530",
        "fetched_at": "2026-02-12 04:05:49.975661"
    },
    {
        "title": "Haryana citizens send 11,000 suggestions to govt.’s AI-based portal for State budget",
        "content": "Haryana Chief Minister Nayab Singh Saini launching the AI-based government portal in Gurugram on January 6.\n| Photo Credit: Special Arrangement\nThe Haryana government’s Voice Feedback Portal has received over 11,000 suggestions from citizens across the State for the budget slated to be presented later this month.\nChief Minister Nayab Singh Saini had launched the Artificial Intelligence (AI)-based initiative on January 6 to invite suggestions from citizens with the objective of making the State budget for 2026-27 a “People’s Budget”. It marks the first ever use of AI in such a manner within India’s administrative and democratic framework, according to the State government.\n“Suggestions concerning local self-governance or municipalities and panchayats topped the list at 750, followed by 450 on infrastructure development, and 200 on education, skill development, and employment,” Raj Nehru, Director General of the Swarna Jayanti Haryana Institute for Fiscal Management, told The Hindu.\nHe said 20% of respondents were women and other suggestions were related to fiscal resilience, innovation, public finance, ease of doing business, energy, cost rationalisation, digital security, future-ready governance, labour, women, child safety, start-ups, industrial growth, and economic drivers.\nAs part of the consultation process, the Chief Minister also conducted 12 pre-budget meetings in January, including with sarpanches and councillors for the first time. The process concluded on January 27 after a meeting with MLAs and MPs. Suggestions were also invited through the National Informatics Centre’s portal.\n“More than 15,000 suggestions were received from all these mediums for sectors such as agriculture, education, health, finance, infrastructure, panchayati raj, urban development, health, and women and child development,” said Mr. Nehru, who also serves as Officer Special Duty to the Chief Minister.\nAll suggestions were collected and analysed by the Swarna Jayanti Haryana Institute for Fiscal Management. Over 2,000 shortlisted suggestions were sent to the heads of various government departments and their final proposals will be presented to the Chief Minister for inclusion in the budget, he said.\nMr. Nehru added that some “very relevant and important suggestions” were received pertaining to women and child development: CCTV cameras and dedicated helplines for women at workplaces, crèches in industries, mandatory Prevention of Sexual Harassment Act audits at all workplaces, and increasing the participation of women in the manufacturing sector. He said 300 such suggestions were shortlisted and the Chief Minister has issued directions to examine them for inclusion in the budget.\nThe budget will be guided by the State government’s ‘Vision-2047’ document unveiled by Union Home Minister Amit Shah in Panchkula on December 24 last year.\n“To align the targets of the State budget with the ‘Vision-2047’ document, the Chief Minister held a day-long brainstorming session in Gurugram on January 6 that was attended by secretaries of various government departments, representatives from the industry, and experts,” Mr. Nehru said.",
        "link": "https://www.thehindu.com/news/national/haryana/haryana-citizens-send-11000-suggestions-to-govts-ai-based-portal-for-state-budget/article70621372.ece",
        "date": "Thu, 12 Feb 2026 01:48:04 +0530",
        "fetched_at": "2026-02-12 04:05:50.575332"
    },
    {
        "title": "KMRL gets nod to seek ₹1016-cr. loan for Kochi metro phase-2",
        "content": "Work on the Kakkanad extension of the Kochi metro is expected to be completed by December 2026, according to KMRL.\n| Photo Credit: FILE PHOTO\nThe State Cabinet on Wednesday permitted Kochi Metro Rail Limited (KMRL) to seek a loan of ₹1,016.24 crore from the Asian Infrastructure Investment Bank (AIIB) for the second phase of the Kochi metro.\nMinister for Industries P. Rajeeve said in a communication that the second phase of the Kochi metro would be completed in a time-bound manner. A memorandum of understanding was signed involving the Centre, State government, and KMRL in 2023 for implementing the second phase of the project from Jawaharlal Nehru International Stadium to Infopark via Kakkanad.\nThe process of seeking loan to the tune of ₹1016.24 crore was initiated after the signing of the agreement. The authorities held talks with five international funding agencies including AIIB, which agreed to provide the assistance. The loan has to be repaid in 25 years, including a five-year repayment moratorium, it said.\nThe State Cabinet had accorded administrative sanction for the revised estimate of ₹1,957.05 crore for the 11.2-km Kochi metro extension from Jawaharlal Nehru stadium to Kakkanad in March 2023. The Union government had approved the second phase of the metro in September 2022.\nAccording to the funding plan, the Centre and State governments will provide ₹274.90 crore each as equity for the project. It will have a 16.23% contribution through this fund infusion. The Centre and the State will provide ₹63.85 crore each (3.77%) as subordinate debt of Central taxes for the Phase-II work.\nLoan from bilateral/multilateral agencies forms ₹1,016.24 crore (60%). The total cost excluding land, resettlement, and rehabilitation and public-private partnership component will come to ₹1,693.74 crore.\nWork on the second phase of the metro is expected to be completed by December 2026, according to KMRL.",
        "link": "https://www.thehindu.com/news/national/kerala/kmrl-gets-nod-to-seek-1016-cr-loan-for-kochi-metro-phase-2/article70620388.ece",
        "date": "Thu, 12 Feb 2026 00:42:29 +0530",
        "fetched_at": "2026-02-12 04:05:51.191510"
    },
    {
        "title": "Over 13 crore disbursed for students under VIT’s scholarship scheme: Chancellor",
        "content": "VIT Chancellor G. Viswanathan and Deputy Speaker of Tamil Nadu Legislative Assembly K. Pitchandi handing over scholarships at the event.\n| Photo Credit: Special Arrangement\nThe founder and chancellor of Vellore Institute of Technology (VIT) G. Viswanathan said that more than 11,000  students were given scholarships worth over ₹13 crore under its various flagship schemes like Support the Advancement of Rural Students (STARS) and Higher Education for All for more than 15 years.\nIn his presidential address at the STARS event, which was organised by VIT’s Universal Higher Education Trust (UHET) for the first time in Tiruvannamalai, he said that despite the Gross Enrollment Ratio (GER) of Tamil Nadu being 47%, which is above the national average of 28%, the enrollment ratio in northern districts of the State remained low.\nAs a result, economic growth of the region suffered. “The VIT has established Higher Education for All Foundation to bridge the gap in enrollment ratio between northern districts and the rest of the State. Schemes like STARS program have been implemented to uplift rural students in erstwhile North Arcot districts, which are economically and educationally backwards,” he said.\nOn the occasion, Deputy Speaker of Tamil Nadu Legislative Assembly and chief guest K. Pitchandi distributed scholarships worth ₹28 lakh to 242 meritorious students.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/over-13-crore-disbursed-for-students-under-vits-scholarship-scheme-chancellor/article70619834.ece",
        "date": "Wed, 11 Feb 2026 23:57:38 +0530",
        "fetched_at": "2026-02-12 04:05:51.797244"
    },
    {
        "title": "Three bridges across Cheyyar river near Chengam, Polur towns inaugurated",
        "content": "Minister for Public Works E.V. Velu inaugurated the bridges in the presence of Deputy Speaker of Tamil Nadu Legislative Assembly, K. Pitchandi, and Collector K. Tharpagaraj.\n| Photo Credit: Special Arrangement\nThree new high-level bridges across Cheyyar, a tributary of Then Pennai, near Kalasapakkam and Chengam towns in Tiruvannamalai were opened on Wednesday, fulfilling the long-standing demand of residents in at least 45 surrounding villages.\nOfficials of State Highways, which built the new facility, said that three new bridges were constructed between Kalur - Kuruvimalai villages; Poondi - Pazhakovil villages near Kalasapakkam town; and Thekavadi - Kezha Kollai Kottai villages near Chengam town in the district. “We have to walk on the dry riverbed to reach the nearest health centre. Ambulances take detours to help victims. The new bridges have ended our ordeal,” said G. Pandi, a motorist.\nThe new bridges will end a detour of at least 20 kms for residents in surrounding farming villages to reach nearest towns like Polur, Arani, Chengam, and Tiruvannamalai. “The new facility will facilitate easy transport of farm produce by farmers from villages along the river. Buses can also be operated in these villages, using the new facility. The new bridges were built to withstand massive floods during monsoon,” T. Murugan, Assistant Executive Engineer (AEE), State Highways (Rural Roads), Tiruvannamalai, told The Hindu.\nMinister for Public Works E.V. Velu inaugurated the bridges in the presence of Deputy Speaker of Tamil Nadu Legislative Assembly, K. Pitchandi, and Collector K. Tharpagaraj.\nFunded by NABARD under the Rural Infrastructure Development Fund (RIDF) 2022-23, the three new bridges, which cost ₹36.11 crore together, are 167.44 metres long and 8.40 metres wide each — enough for two buses to use it at a time.\nAs the Cheyyar and Then Pennai rivers witness flow of excess rainwater during monsoon, the new bridges were built at a height of 4.93 metres from the riverbed to prevent inundation of the carriageway and damage to its structure. The bridges have tiled footpaths, LED lights, inlets to discharge rainwater into the river, reflectors, sign boards, and hand railings.\nThe bridges are a lifeline for surrounding villages including Annaivadi, Kalur, Seethmpatty, Pathiyavadi, Salaianur, Annilai, and Kovur.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/three-bridges-across-cheyyar-river-near-chengam-polur-towns-inaugurated/article70619869.ece",
        "date": "Wed, 11 Feb 2026 23:41:11 +0530",
        "fetched_at": "2026-02-12 04:05:52.397574"
    },
    {
        "title": "A.P. Bar Council elections on February 13",
        "content": "The election of the members of the Bar Council of Andhra Pradesh is scheduled to be held from 10.30 a.m. to 5 p.m. on February 13, according to the Bar Council Secretary B. Padmalatha.\nShe said that the election would be held at 149 polling stations across the State under the supervision of a high-power committee constituted by the Supreme Court. The committee appointed Andhra Pradesh High Court retired judge A.V. Sesha Sai as the Returning Officer.\nAfter the State bifurcation, separate elections for the Bar Council of Andhra Pradesh were held in Hyderabad in 2018. The present election is the second one after that.\nAbout 40,000 advocates are eligible to exercise their franchise, and 146 nominations have been filed by the candidates, out of which 143 have been found valid after due scrutiny.\nUpon completion of the polling process, the counting of votes will commence at the HC at 10.30 a.m. of February 16.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/ap-bar-council-elections-tomorrow/article70621102.ece",
        "date": "Wed, 11 Feb 2026 23:11:57 +0530",
        "fetched_at": "2026-02-12 04:05:53.028112"
    },
    {
        "title": "Praja Arogya Vedika seeks higher health outlay in 2026-27 Budget",
        "content": "A delegation of Praja Arogya Vedika met Finance Minister Payyavula Keshav and Health, Medical Education and Family Welfare Minister Satya Kumar Yadav in Amaravati on February 11(Wednesday) and submitted a memorandum seeking a substantial increase in allocations to the health sector in the 2026-27 Budget.\nIn a press statement, PAV president M. V. Ramanaiah and general secretary T. Kameswar Rao said the memorandum underscored what they described as persistently low public health spending in Andhra Pradesh. They stated that the 2025-26 Budget provided ₹19,264 crore for health, which works out to about 1.05% of the GSDP and is significantly lower than the benchmarks suggested in the National Health Policy 2017 and by the World Health Organisation.\nThey said inadequate funding had resulted in gaps in primary and preventive healthcare, shortage of human resources, weak rural and tribal infrastructure, and insufficient measures to address malnutrition and anaemia among women and children.\nAmong the key demands, the organisation sought an increase in health allocation to at least 2.5% of the GSDP, which would require an additional ₹20,000 to ₹25,000 crore over the previous outlay. It also called for prioritising primary and preventive healthcare, introducing a special health package for tribal areas, strengthening the Public Distribution System to tackle high levels of malnutrition, filling vacancies and bridging infrastructure gaps, upgrading 104 and 108 emergency services, and clearing pending payments under NTR Vaidya Seva.\nThe delegation expressed concern over what it termed excessive dependence on privatisation and public private partnership models in the health sector. It demanded development of RCD Hospital in Visakhapatnam into a super specialty children’s hospital, strengthening of AIIMS at Mangalagiri, expansion of the Kakani Cancer Data Centre, and upgrading VIMS into a postgraduate and research centre.\nThe members urged the government to focus on publicly funded and equitable healthcare rather than medical tourism or high-end public private partnerships, which they cautioned could widen inequalities. They also appealed to Opposition MLAs to highlight these issues during the discussion on the State Budget in the ongoing Assembly session.\nAndhra Pradesh\n/\nVijayawada\n/\nhealth",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/praja-arogya-vedika-seeks-higher-health-outlay-in-2026-27-budget/article70620578.ece",
        "date": "Wed, 11 Feb 2026 23:04:23 +0530",
        "fetched_at": "2026-02-12 04:05:53.629820"
    },
    {
        "title": "Opposition targets Centre over inequality of income, ‘atmosphere of fear’ in Budget discussion",
        "content": "Congress MP KC Venugopal speaks in the Lok Sabha. File\n| Photo Credit: PTI\nOpposition members in the Lok Sabha expressed their concerns over low per capita income, growing inequality, and unemployment while speaking on the Union Budget. “No economy can grow in an atmosphere of fear and hatred,” Congress MP K.C. Venugopal said, taking part in the debate on the Union Budget.\nMr. Venugopal claimed that as many as 80 churches had been attacked during the 2025 Christmas season, and referred to a controversial statement by a Chief Minister targeting a minority group in his State. The name of the CM was removed from the record of the proceedings.\nMr. Venugopal also flagged the issue of the Indian rupee crossing the ₹91 mark against the U.S. dollar, unemployment rate among urban youth reaching 18%, and the top 10% of the population controlling 58% of the country’s resources. The rights-based approach of the United Progressive Alliance (UPA), reflected in laws, including the erstwhile Mahatma Gandhi National Rural Employment Guarantee Act (MGNREGA), Right to Information (RTI) Act, and the Forest Rights Act, are being diluted or taken away.\n“The Finance Minister will proudly speak of growth and development. But behind these claims lie these harsh realities,” he said. The Congress member from Kerala’s Alappuzha constituency asked why his State did not yet have an All India Institute of Medical Sciences (AIIMS), despite having been promised one back in 2014.\nThe Bharatiya Janata Party’s (BJP) Anurag Thakur, speaking soon after the Leader of the Opposition in the Lok Sabha, Rahul Gandhi, targeted the latter. “The electoral losses have filled him with hatred. He hates parliamentary rules, he hates the Speaker, he hates Constitutional institutions, he hates the Prime Minister, and now he has started hating India,” Mr. Thakur said.\nIn the Rajya Sabha, Opposition members flagged concerns over growing income inequality. Rashtriya Janata Dal (RJD) MP Sanjay Yadav noted that while India is now the world’s fourth-largest economy, it ranks much lower on the per capita income scale.\nCommunist Party of India-Marxist (CPI-M) MP V. Sivadasan sought to counter the government’s claims of India being a high‑growth economy, arguing that wages for ASHA and anganwadi workers had not been revised for a decade. Social welfare pensions, he said, had also remained unchanged for more than 10 years.\n“The government likes to tell us we are the world’s fourth‑largest economy. But what it doesn’t tell people is that in terms of per capita GDP, our economy ranks 123rd,” Trinamool Congress (TMC) MP Saket Gokhale, citing official data, said. “The problem with the BJP is that one leg is in 1947 and the other in 2047. There is nothing in the present,” Mr. Gokhale, taking a swipe at the ruling party.\nThe Union Budget had become “personality‑oriented” rather than policy‑driven, he alleged, claiming that urban Indian youth now had lower purchasing power than young people in several conflict‑hit countries.\nCongress MP Rajeev Shukla criticised the India-U.S. interim trade deal, questioning the government’s portrayal of it as a success. “Now they are saying an 18% tariff is an achievement,” he said, adding that economists had warned the agreement was tilted in favour of the U.S.\nRestrictions on Russian oil imports could push up fuel prices, Mr. Shukla said. Economic growth alone is insufficient, former Prime Minister H.D. Deve Gowda said, stressing that employment must be central to policy-making. Was success being measured by investment announcements or by the creation of dignified jobs, especially in smaller towns and rural areas, Mr. Gowda said.\nUnion Budget\n/\nBharatiya Janata Party\n/\nIndian National Congress\n/\npolitics\n/\npolitics (general)\n/\nnational politics",
        "link": "https://www.thehindu.com/news/national/opposition-targets-centre-over-inequality-of-income-atmosphere-of-fear-in-budget-discussion/article70620991.ece",
        "date": "Wed, 11 Feb 2026 22:53:45 +0530",
        "fetched_at": "2026-02-12 04:05:54.228700"
    },
    {
        "title": "Ahead of March 31 deadline, Odisha revises surrender and rehabilitation scheme for surrendering Maoists",
        "content": "Making the sixth revision to its ‘Surrender and Rehabilitation of Left-Wing Extremists’ scheme in the past two decades, the Odisha Government has announced financial incentives for mainstreaming of persons native to the State who are involved in Maoist activities irrespective of where they surrender to the authorities.\nAfter substantially increasing reward money for surrendered left-wing extremists (LWEs) in November last year, the Mohan Majhi Government has relaxed the eligibility criteria for surrendering Maoist cadres. The State police, in coordination with Central security forces, have stepped up their efforts to bring Maoist activities down to zero by March 31, a deadline set by the Union Home Ministry.\n“Persons native to Odisha State, who are active in the activities of the above organisations outside the State of Odisha, will be considered eligible for surrender if their involvement is certified by the concerned Superintendent of Police,” says the notification issued on February 9.\n“It will be necessary to obtain a no objection certificate from the concerned State that such surrendered person has not been provided rehabilitation facilities in concerned State,” the Odisha Government elaborated explaining the condition.\nThe rehabilitation scheme for surrendered LWEs will, however, be applicable to persons who may or may not be a native of Odisha but are involved in activities of the banned CPI (Maoist) in the State.\nIn November last year, Odisha revised upwards the reward money to ₹1.10 crore for Central Committee Member, Politburo Member or Central Military Commission Member laying down arms as per Surrender and Rehabilitation of Left Wing Extremists. It is said to be financially better than the scheme run by Chhattisgarh, currently the worst LWE-impacted State in India.\nSimilarly, a State Committee Member (SCM) or Special Zonal Committee Member (SZCM) or Regional Committee Member is entitled to receive ₹55 lakh and Divisional Committee Secretary will get ₹33 lakh in the event of surrender.\nIf the surrendered Maoists are a couple, the husband and wife will be considered as separate units, and both will be given the benefits of the rehabilitation scheme. Earlier this month, State Committee Members Nikhil alias Niranjan Rout and his wife, Ankita alias Rashmita Lenka, had surrendered before security forces. They would get ₹55 lakh each for mainstreaming as they have been treated as separate units.\nThere have been elaborate financial rewards for giving up firearms depending on their degree of fire power. The government has announced it would pay ₹4.95 lakh for light machine gun while ₹3.30 lakh has been fixed for AK-47.\nIn order to wean away the misguided youth who joined CPI (Maoist) and its frontal organisations, the government had first approved the scheme back in 2006. It was further improved with revisions in 2012 and 2014.\nAfter revisions in November last year, 45 LWEs have surrendered before security forces, while there are still 40 cadres, including a State Committee Member, active in the State. Movements of LWEs have been noticed in Kandhamal, Kalahandi, and Rayagada districts, said a senior officer involved in ant-Maoist operations.\nApart from the State’s own policy, the MHA had in 2022 issued revised guidelines for surrender and rehabilitation of LWEs with financial assistance and provision for employment and entrepreneurial opportunity.\nministers (government)\n/\ncrime, law and justice\n/\nAmit Shah",
        "link": "https://www.thehindu.com/news/national/odisha/ahead-of-march-31-deadline-odisha-revises-surrender-and-rehabilitation-scheme-for-surrendering-maoists/article70620211.ece",
        "date": "Wed, 11 Feb 2026 22:42:51 +0530",
        "fetched_at": "2026-02-12 04:05:54.831076"
    },
    {
        "title": "Two-day tech summit to explore how enterprises can boost their resilience",
        "content": "Government officials, academicians, and industry leaders will come together at the The Hindu Group’s Tech Summit 2026 on February 12 and 13 to deliberate on various issues at the intersection of technology and governance, building resilience in industry, and the challenges and opportunities from Artificial Intelligence.\nTitled ‘Continuity Unbroken: Building the Architecture of Resilience in a Connected World’, the summit’s first day will focus on enterprise resilience and governance with key features being data privacy in biometric platforms, technology-led disaster recovery, evolution of next-generation governance and compliance frameworks, and cyber resilience in an AI-driven world. The second day will examine topics like AI-first digital transformation, integrated data security management, state perspectives on technology-driven economic growth, and the development of industry-ready talent for an AI-driven future.\nThe event will be inaugurated by G. Viswanathan, Founder and Chancellor, Vellore Institute of Technology. He will also deliver the keynote address. Raju Vegesna, Chairman and Managing Director, Sify Technologies, will deliver a special address.\nIndustry leaders, policymakers, technology architects, and academicians will engage in conversations, panel discussions, and strategic dialogues exploring resilience not merely as risk mitigation but as a structural capability embedded within organisational DNA.\nDr. Viswanathan said that India had long excelled in theoretical knowledge but had often fallen short in practical knowledge. “A leading model we can draw inspiration from is Germany,” he said, adding that, in Germany, candidates seeking to teach in universities of applied sciences are required to have at least five years of professional experience. Stating that VIT was one of the first institutions to have mandated that a part of every course was to be delivered by industry experts, Dr. Viswanathan pointed out that the institution had ensured that industry professionals and senior leaders actively participated at various levels, including the Academic Council and the curriculum design committee.\nThe summit is supported by Skylar Information Technologies, KBR, Tally, and Virtusa as associate partners; G Square as realty partner; CIO as knowledge partner; MMA as industry partner: Startup Singam as ecosystem partner; Nexus as gift partner; and the Government of Karnataka as State partner.\nThe event will be live streamed on https://newsth.live/THTSYT1.\nTamil Nadu",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/the-hindu-group-to-host-two-day-tech-summit-on-feb-12-13/article70620579.ece",
        "date": "Thu, 12 Feb 2026 02:16:18 +0530",
        "fetched_at": "2026-02-12 04:05:55.429768"
    },
    {
        "title": "Vande Mataram to be played before Jana Gana Mana, says Centre to States and government bodies",
        "content": "The MHA said the instructions are being issued for general information and guidance on the official version of the song, the occasions on which it is to be played or sung, and the need for paying respect to the song by observance of proper decorum on such occasions. File\nThe Union government has said in a set of instructions to States and other government bodies that the national song Vande Mataram should be sung or played before the national anthem Jana Gana Mana when both the songs are played at an event.\nThe fresh set of guidelines were uploaded on the Ministry of Home Affairs (MHA) website on February 6 but no formal announcement or a statement was issued.\nIt states that whenever the official version of the national song, around 3.10 minutes long, is sung or played, the audience shall stand to attention. “However, when in the course of a newsreel or documentary, the national song is played as a part of the film, it is not expected of the audience to stand as standing is bound to interrupt the exhibition of the film and would create disorder and confusion rather than add to the dignity of the national song,” it said.\nThe MHA said the instructions are being issued for general information and guidance on the official version of the song, the occasions on which it is to be played or sung, and the need for paying respect to the song by observance of proper decorum on such occasions.\nIt said that the song Vande Mataram written by Bankim Chandra Chatterjee is known as the “national song which is to be sung on arrival and departure of the President at formal State functions and other functions organised by the government, immediately before and after the President addresses the nation over All India Radio and television, on arrival and departure of the Governor/Lieutenant Governor at formal State functions, when the national flag is brought on parade, any other occasion for which special orders are issued by the Government of India”.\n“When the national song is played by a band, the song will be preceded by a roll of drums to assist the audience to know that it is going to be played, unless there is some other specific indication that the national song is about to be played,” the Ministry said in the guideline.\nThe official version shall be played accompanied by mass singing on the unfurling of the national flag, on cultural occasions or ceremonial functions other than parades. The mass singing could be arranged by having a choir of adequate size, suitably stationed, which would be trained to coordinate its singing with the band, etc. There should be an adequate public audition system so that the gathering in various enclosures can sing in unison with the choir while printed lyrics of the official version of the song may be circulated amongst the participants, wherever required, the MHA said.\nIt may be sung on occasions which, although not strictly ceremonial, are nevertheless invested with significance because of the presence of Ministers, etc., the Ministry stated.\n“It is not possible to give an exhaustive list of occasions on which the singing (as distinct from playing) of official version of the national song can be permitted. But there is no objection to the singing of the national song accompanied by mass singing so long as it is done with due respect as a salutation to the motherland and proper decorum is maintained,” the MHA said.\n“In all schools, the day’s work may begin with community singing of the national song. School authorities should make adequate provision in their programmes for popularising the singing of the national song, national anthem and promoting respect for the national flag among students,” the MHA added.\nmusic\n/\nIndia",
        "link": "https://www.thehindu.com/news/national/vande-mataram-to-be-played-before-jana-gana-mana-says-centre-to-states-and-government-bodies/article70620756.ece",
        "date": "Wed, 11 Feb 2026 22:16:15 +0530",
        "fetched_at": "2026-02-12 04:05:56.039469"
    },
    {
        "title": "HYDRAA secures government land",
        "content": "The Hyderabad Disaster Response and Asset Protection Agency (HYDRAA) removed encroachments into government lands in Jubilee Hills and Khanamet on Wednesday.\nIn Jubilee Hills, 150 square yards of a two acre park land was encroached upon by a tenant running a ladies’ hostel at a house nearby. A statement from the HYDRAA said that the person has constructed rooms in 50 square yards of land, abutting the existing building. A 100 square yards more was fenced off and used as a private park.\nFollowing complaints from local residents in Prajavani, officials, after a field inspection along with GHMC authorities, confirmed the encroachment, demolished the structure and erected fencing. A police case was registered.\nIn a separate case, five acres allotted by the government to the All India Velama Association near Hitec Exhibition Grounds in Khanamet was secured from encroachments. After the High Court granted a stay on the allotment following objections, association representatives complained of attempts by locals to encroach upon the land. HYDRAA conducted an inspection and fenced the five-acre parcel, installing signboards to prevent encroachment pending the court’s decision.",
        "link": "https://www.thehindu.com/news/national/telangana/hydraa-secures-government-land/article70620666.ece",
        "date": "Wed, 11 Feb 2026 21:39:00 +0530",
        "fetched_at": "2026-02-12 04:05:56.644884"
    },
    {
        "title": "62.98% voters exercise their franchise in Karimnagar",
        "content": "The Karimnagar Municipal Corporation (MCK) recorded a voter turnout of 62.98% in the municipal elections held on Wednesday. Around 2,14,486 voters of the total electorate of 3,40,580 had cast their votes.\nThe keenly fought election to the MCK, where the ruling Congress, BJP and BRS are locked in a high-stakes electoral battle, witnessed a moderate voter turnout. Union Minister of State for Home Affairs Bandi Sanjay exercised his franchise in the elections.\nAmong the municipalities in Karimnagar district, Jammikunta, Huzurabad and Choppadandi recorded a voter turnout of 79.81%, 81.47% and 78.76% respectively. A voter turnout of around 69.32% was recorded in the Ramagundam Municipal Corporation in Peddapalli district. The officials, however, could not confirm the final polling percentage figures as of 7 p.m.\nIn Jagtial district, Dharmapuri municipality recorded the highest voter turnout at 75.16% followed by Raikal (74.96%), Jagtial (69.60), Korutla (69.47) and Metpalli (69.21). Sircilla and Vemulawada municipalities recorded 77.55% and 77.99% respectively.\nIn Khammam district, the voter turnout stood at Yedulapuram (85.35), Wyra (83.6), Sathupalli (77.44), Kalluru (86.97), and Madhira (77.88). Deputy Chief Minister M. Bhatti Vikramarka cast his vote in Madhira town. The Kothagudem Municipal Corporation in Bhadradri Kothagudem district, recorded a voter turnout of 74.53%.\nThe ruling Congress party, CPI and BRS are locked in a keen battle to clinch the key civic body in the State’s coal belt.\nThe turnout in Aswaraopeta and Yellandu urban local bodies stood at 76.26% and 68.56% respectively.",
        "link": "https://www.thehindu.com/news/national/telangana/6298-voters-exercise-their-franchise-in-karimnagar/article70620811.ece",
        "date": "Wed, 11 Feb 2026 21:34:49 +0530",
        "fetched_at": "2026-02-12 04:05:57.244709"
    },
    {
        "title": "Drug-free Karnataka is our aim: Home Minister Parameshwara",
        "content": "G. Parameshwar\nHome Minister G. Parameshwara on Wednesday vowed to make Karnataka drug-free and said, “We will not let Karnataka become another Punjab in terms of drugs. The public should not allow this either. Everyone should come together to build a drug-free Karnataka”.\nSpeaking at the Narcotics Control Bureau’s ‘Narcotics-Free India, Narcotics-Free Karnataka, Narcotics-Free Campus and Organ Donation’ campaign, organised by Rajiv Gandhi University of Health Sciences (RGUHS) in collaboration with Dishabodh Foundation on Wednesday, he said the government has seriously considered making the State drug-free. “The Higher Education Minister will be instructed to take necessary steps to curb this at the government level,” he added.\nAppreciating the efforts by the university, the Home Minister stated that to build a drug-free State, college campuses must be drug-free. “The campaign by RGUHS is an important one, and the State government will support it completely,” Dr. Parameshwara said\nFurther, Dr. Parameshwara directed the University to instruct all affiliated colleges under it to constitute Anti-Drug Committees. “There are over 1500 colleges under RGUHS and if any college fail to constitute anti-drug committee, then measures should be taken to withdraw their affiliation,” He stated.\nTaking part in the event, Health and Family Welfare Minister Dinesh Gundu Rao shared that the government is seriously thinking of increasing number of Organ Retrieval centres at government hospitals.\nDr. Bhagawan B.C., Vice-Chancellor of RGUHS, requested the government to establish Organ Retrieval centres at all government medical college hospitals and strengthen the already established centres.",
        "link": "https://www.thehindu.com/news/national/karnataka/drug-free-karnataka-is-our-aim-home-minister-parameshwara/article70620453.ece",
        "date": "Wed, 11 Feb 2026 21:33:23 +0530",
        "fetched_at": "2026-02-12 04:05:57.849656"
    },
    {
        "title": "Sharmila terms Governor’s Budget address hollow and directionless",
        "content": "APCC president Y.S. Sharmila\n| Photo Credit: File photo\nAndhra Pradesh Congress president Y. S. Sharmila on Wednesday launched a sharp attack on the Governor’s Budget address, describing it as hollow, directionless and replete with exaggerated and misleading claims.\nIn a post on X, she said the address offered no concrete roadmap for the State’s development and was largely a reiteration of the ruling coalition’s election promises, while glossing over what she termed 19 months of administrative failures. She alleged that the coalition government lacked vision, prudence and balance in governance.\nMs. Sharmila questioned the government’s claims on poverty eradication under P4, proposed investments worth ₹13 lakh crore and generation of 20 lakh jobs, terming them inflated. She further alleged that the Universal Health Policy had diluted the Aarogyasri scheme, thereby affecting healthcare access for 1.43 crore families. She also faulted the government over the reduction of the Polavaram project height to 41.15 metres and accused it of neglecting several pending irrigation projects.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/sharmila-terms-governors-budget-address-hollow-and-directionless/article70620822.ece",
        "date": "Wed, 11 Feb 2026 21:31:52 +0530",
        "fetched_at": "2026-02-12 04:05:58.453282"
    },
    {
        "title": "Union Minister Hardeep Puri acknowledges Epstein meetings, says Rahul Gandhi indulging in ‘innuendo, smear campaign’",
        "content": "Union Minister Hardeep Singh Puri with BJP National Spokesperson Sardar R.P. Singh, addressing at a press conference at BJP HQ in New Delhi on February 11, 2026.\n| Photo Credit: Shiv Kumar Pushpakar\nUnion Minister Hardeep Singh Puri on Wednesday (February 11, 2026) slammed Congress leader Rahul Gandhi for \"passing innuendo\" against him, asserting that he had met Jeffery Epstein on a \"few occasions\" but his interactions with him had nothing to do with the crimes the convicted American sex offender was involved in.\nMr. Puri's clarification came after Mr. Gandhi claimed that the Union Minister's name has also figured in 'Epstein Files' released in the U.S.\nAddressing a press conference in New Delhi, Mr. Puri said, \"After I resigned as India's ambassador to the UN, I was invited to join the International Peace Institute (IPI) a few months later. I was not part of the IPI per se. I was secretary general of the Independent Commission (ICM) on Multilateralism, set up in the IPI as a project.\"\n\"My boss in the IPI, Terje Rod-Larsen, was the person who knew this particular infamous person Mr. Epstein and it is as part of a delegation of the IPI or the ICM that I met Mr. Epstein on a few occasions, three or maximum four,\" he added.\nMr. Puri said the ICM was dealing with international and thematic issues and Epstein was not part of it.\nHe said Epstein was alleged to have committed several criminal offences and there were charges that he had an island where he used to take people to indulge in \"their sexual fantasies\".\n\"There are victims of this. These victims have brought cases against the people in authority,\" he said asserting that his interactions with Epstein had \"nothing to do with this\".\nMr. Puri said that he had apprised Mr. Gandhi about this by sending him a \"note\" last year.\n\"On the Samvidhan Divas on November 26 last year, I was there at the central hall of the old Parliament building. After the event [organised to mark Samvidhan Divas] concluded, he [Rahul Gandhi] came up to me and winked at me in his style,\" Mr. Puri said.\n\"I was also amused... He said 'your name is in interesting places'. I asked him do you want to know what the facts are? Do you want a note on it? So I sent him a note,\" the Minister added.\nMr. Puri accused Mr. Gandhi of indulging in \"buffoonery\" now and told the reporters, \"This innuendo and smear campaign has given me a privilege and the opportunity to talk to you and place the facts before you.\"\nMr. Puri also said he had sent an e-mail to LinkedIn founder Reid Hoffman with a copy to Epstein on November 13, 2014, conveying his view that India presents a \"terrific opportunity\" for internet-based economic activity.\nReading out the excerpts of his email, the Union Minister said that he also suggested Mr. Hoffman to visit to India to see the changes happening.\n\"It's a long email. Anybody wants its copy, it's available on the internet, the DOJ...This is the only substantive e-mail. There are one or two also. I will give you,\" he said.\nMr. Puri cited another email between Mr. Larsen and Jeffrey Epstein and said, \"Epstein here refers to me as two-faced... I was certainly not good in their value system because they were dealing in something else.\" \t\"Rahul should have read it,\" he added.\nIndia\n/\nWorld\n/\nministers (government)",
        "link": "https://www.thehindu.com/news/national/hardeep-singh-puri-epstein-meetings-us/article70620934.ece",
        "date": "Wed, 11 Feb 2026 22:55:22 +0530",
        "fetched_at": "2026-02-12 04:05:59.056901"
    },
    {
        "title": "BRS alleges intimidation, irregularities in municipal elections",
        "content": "HYDERABAD\nBharat Rashtra Samithi (BRS) working president K.T. Rama Rao on Wednesday sharply criticised the ruling Congress, alleging large-scale misuse of power and intimidation during the municipal elections. He accused Chief Minister A. Revanth Reddy of resorting to ‘excesses and atrocities’ out of fear of electoral defeat.\nIn a press statement, Mr. Rao said the Congress government had created obstacles for voters and attempted to influence them through inducements. Despite these alleged pressures, he praised BRS workers for displaying remarkable courage and determination throughout the polling process. “My heartfelt congratulations to every party worker for their fighting spirit and commitment,” he said.\nHe added that the resilience shown by the cadres had infused new energy and confidence into the party during the municipal battle.\nMr. Rao claimed that the Congress leadership, rattled by the setback in the recent Gram Panchayat polls, feared similar losses in urban areas and therefore misused administrative machinery at various stages of the elections. He also alleged that the ruling party was attempting to sway public opinion using thousands of crores of ill-gotten money.\nHe warned that people would not remain silent in the face of such actions. Accusing the government of targeting BRS cadre, he said the police system was being misused to harass and attack party workers. Mr. Rao predicted that the Chief Minister would soon face the consequences for these alleged violations.",
        "link": "https://www.thehindu.com/news/national/telangana/brs-alleges-intimidation-irregularities-in-municipal-elections/article70620702.ece",
        "date": "Wed, 11 Feb 2026 20:55:27 +0530",
        "fetched_at": "2026-02-12 04:05:59.684982"
    },
    {
        "title": "Ravi Pillai academic scholarship will pave the way for academic development: CM",
        "content": "Chief Minister Pinarayi Vijayan and industrialist Ravi Pillai distributing scholarship cheque to a beneficiary during 'Dr. Ravi Pillai Academic Excellence Scholarship' programme held at Nishagandhi auditorium in Thiruvananthapuram on Wednesday.\n| Photo Credit: NIRMAL HARINDRAN\n“Dr. Ravi Pillai Academic Excellence Scholarship” will provide wide opportunities for academic achievements, Chief Minister Pinarayi Vijayan has said.\nHe was speaking after inaugurating a function for distribution of the scholarships at Nishangandhi auditorium here on Wednesday.\nThe Chief Minister said today the education sector in Kerala was a model for the country. However, the State had a dark phase where the education right was denied to many. The struggles by social reformers and national, progressive, and political movements led to the formation of a united Kerala in which the first government led by E.M.S. Namboodiripad scrapped fee to make education free up to upper primary. The second EMS government made secondary education free too. Government interventions in the higher education sector also paved the way for development of education in the State. Continuing these efforts, the government decided to make education free up to the graduate level, the Chief Minister said.\nHe urged students to be vigilant against attempts to promote caste-religious enmity. Students should retain their humanity to work for the good of society. They must resist drugs and pledge not to engage in substance abuse, he said.\nIn the first phase, scholarships to the tune of ₹10 crore will be distributed to 1,501 students. An amount of ₹525 crore for the next 50 years had been set aside for the scheme, being implemented by industrialist Ravi Pillai as part of social responsibility.\nThe Chief Minister noted that though Mr. Pillai was a prominent name globally, the scholarship scheme for students was a testimony to his ties with the State. The scholarships would help students from economically weak backgrounds to reach for higher education opportunities, he said.\nThe scholarship will be given by the Dr.Ravi Pillai Foundation in association with NoRKA Roots to students from secondary school level to professional colleges. At the higher secondary level, 1,100 students will get ₹50,000 each. As many as 200 undergraduate students will get ₹1 lakh each, and 200 postgraduate students will get ₹1.25 lakh each.\nMinister for Revenue K. Rajan presided over the function. Mr. Pillai, who is also the NoRKA director, and NoRKA executive vice-chairperson P. Sreeramakrishnan were present.",
        "link": "https://www.thehindu.com/news/national/kerala/ravi-pillai-academic-scholarship-will-pave-the-way-for-academic-development-cm/article70620743.ece",
        "date": "Wed, 11 Feb 2026 21:12:56 +0530",
        "fetched_at": "2026-02-12 04:06:00.320909"
    },
    {
        "title": "Let routine policing work not suffer because of impending elections in Tamil Nadu, cautions Madras High Court",
        "content": "The judge called for a status report from the police by February 25, 2026.\nThe Madras High Court on Wednesday  cautioned that the regular policing work in the State should not suffer because of the impending Legislative Assembly election and that the police should not end up citing elections as a reason for every other delay in performing their routine work.\nJustice N. Anand Venkatesh sent across the message during the hearing of a 2024 case. He embarked on a venture to find a  solution to prevent youngsters from indulging in reckless riding and driving of motorcycles and cars on public roads, by roping in the police as well as counsellors for reforming the youth.\nAfter finding that not much had happened after the Schizophrenia Research Foundation (SCARF) in Chennai conducted a study in collaboration with SAMVAD, an initiative of the Union Ministry of Women and Child Development, in 2025, the judge called for a status report from the police by February 25\n“The problem now is that all the police officials will be focused on elections. The entire State will come to a standstill. The executive and everybody will be looking after elections. So, what will happen to others? What will happen to bike racing, what will happen to people who die?” the judge asked a government advocate.\n“The police department need not be completely immersed in the election process. Their job is only supportive. They only need to maintain law and order. Now the complaint is that the study report of SCARF and SAMVAD is not being followed up by the police. So, you file a status report by [February] 25,” the judge said.\nIt was in March 2024, while dealing with a petition filed by two youngsters to quash a criminal case booked against them for rash riding, the judge had sought the assistance of the Greater Chennai Traffic Police (GCTP) and State Public Prosecutor Hasan Mohamed Jinnah to reform youngsters aged between 18 and 25.\nThe then Additional Commissioner of Police (Traffic), R. Sudhakar, had told the court that the GCTP regularly stations three interceptor vehicles mounted with Automatic Number Plate Recognition cameras on ECR, Old Mahabalipuram Road or Kamarajar Salai, and Koyambedu-Maduravoyal Road to detect and catch vehicles that indulge in stunts or racing.\nStating that the GCTP also maintains a database of old offenders involved in racing since 2022, the Additional Commissioner said 107 bonds had so far been executed by the violators for keeping good behaviour, and since most of them were teenagers, their parents had been informed of the violations.\nAfter taking note of the submissions, the court initiated a scientific study by SCARF and SAMVAD to understand the psyche of the youngsters indulging in dangerous behaviour on public roads since 1.68 lakh people had lost their lives and 4.43 lakh had suffered injuries in 4.61 lakh road accidents reported in the country in 2022 alone.\nThe study titled ‘Development of Risk-Reduction & Related Behaviours Change Interventions for Youth Traffic Offenders’ was conducted by both the organisations together, and a detailed report was submitted in April 2025 for the police department to prepare a module to deal with young traffic offenders.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/let-routine-policing-work-not-suffer-because-of-impending-elections-in-tamil-nadu-cautions-madras-high-court/article70619259.ece",
        "date": "Wed, 11 Feb 2026 20:37:54 +0530",
        "fetched_at": "2026-02-12 04:06:00.922976"
    },
    {
        "title": "Green signal for Beypore port’s development in PPP mode",
        "content": "The Kerala State Maritime Board will implement the project.\n| Photo Credit: file photo\nThe State government has decided to develop the Beypore port in Kozhikode in the public-private-partnership (PPP) mode.\nThe decision was taken at the State Cabinet meeting held in Thiruvananthapuram on Wednesday (February 11, 2026). A release quoting the office of P.A. Mohamed Riyas, Minister for Public Works and Tourism, who is also the MLA for Beypore, said the step would help Beypore develop as a port city. The proposal is to spend over ₹2,000 crore for various works. The Kerala State Maritime Board will implement the project.\nSources said that meeting involving residents would be held in the coming days to ensure their participation. Tender procedures would commence soon, they added. The project is expected to create jobs both for local residents and others. Mr. Riyas also held a meeting with V.N. Vasavan, Minister for Ports, to discuss its possibilities.\nMeanwhile, Mr. Riyas said in a release that the project would boost the movement of goods through large containers, and that related businesses would get a fillip. New jobs would be created, and existing labourers would also get benefited. Mr. Riyas added new roads and bridges would be constructed, and Beypore would soon become a ‘designed city’.",
        "link": "https://www.thehindu.com/news/national/kerala/green-signal-for-beypore-ports-development-in-ppp-mode/article70620601.ece",
        "date": "Wed, 11 Feb 2026 20:36:19 +0530",
        "fetched_at": "2026-02-12 04:06:01.842056"
    },
    {
        "title": "Municipal elections pass off peacefully in Cyberabad",
        "content": "Cyberabad Police Commissioner M. Ramesh at a polling station to assess security deployment and preparedness on Wednesday.\n| Photo Credit: Special Arrangement\nPolling for the municipal elections concluded peacefully across the Cyberabad commissionerate on Wednesday, with senior officers reviewing security arrangements at various locations.\nCyberabad Police Commissioner M. Ramesh inspected polling stations to assess security deployment and preparedness. He first visited Zilla Parishad High Schools (ZPHS) in Ravalkole, Yellampet under Medchal police station limits in the Quthbullapur zone. He later inspected arrangements at ZPHS in Lalgadi Malakpet and Aliabad MPPS polling stations in Aliabad Municipality under Genome Valley police station.\nThe Commissioner also visited Indresham Mandal Parishad Upper Primary School, Isnapur ZPHS and Chitkul Mandal Parishad Upper Primary School (MPPS) in Indresham and Isnapur municipalities under Patancheru police station limits in the Serilingampally zone. During his visits, he interacted with police personnel on election duty and instructed them to remain vigilant and discharge their responsibilities without any security lapses.\nCyberabad Police Commissioner M. Ramesh interacting with police personnel on election duty\n| Photo Credit:\nBy Arrangement\nThe official said all necessary measures had been taken to ensure that polling was conducted in a free, fair and peaceful way. He also encouraged citizens to exercise their franchise without fear and said strict arrangements were in place to maintain law and order throughout the polling process.\nHe was accompanied by Serilingampally DCP Ch. Srinivas, Quthbullapur zone in-charge DCP Sai Manohar, SB DCP Sudhindra, Crimes DCP Mutyam Reddy, Women and Child Safety Wing DCP Srujana Karanam and several other officials.",
        "link": "https://www.thehindu.com/news/cities/Hyderabad/municipal-elections-pass-off-peacefully-in-cyberabad/article70620466.ece",
        "date": "Thu, 12 Feb 2026 06:28:01 +0530",
        "fetched_at": "2026-02-12 04:06:02.458255"
    },
    {
        "title": "RT mission sets a global model of women empowerment in tourism, says Kerala Tourism Minister",
        "content": "Kerala’s Responsible Tourism (RT) has been recognised globally for strengthening women empowerment and supporting rural economy through sustainable and inclusive initiatives, Tourism Minister P.A. Mohamed Riyas said here on Wednesday. He was speaking after inaugurating a five-day Kerala Responsible Tourism Festival on Kanakakkunnu Palace grounds in the city.\nWith 26,000 RT units across Kerala, around 1.5 lakh families are direct beneficiaries of the RT mission’s various projects across the State, said the Minister.\nThe fact that 80% of the RT units are led by women shows the success of Kerala’s gender-inclusive tourism and the State’s commitment towards UN’s Gender Inclusive Tourism policy, said Mr. Riyas. In 2025-26, the State Budget earmarked an amount of ₹4 crore rupees for women entrepreneurs for providing loans up to 15 lakhs at an interest rate of 4%, he said. Also, 50% of the total Budget allocated for RT mission is set apart for women, he added.\nResponsible tourism had also been an integral component of Kerala Tourism’s accelerated growth in recent years. Kerala Tourism has received around 14 awards in national and international level for its initiatives in RT, added Mr. Riyas. The RT mission has made possible diverse experiences for travellers such as agri farm tourism, food tourism and projects that link tourism with cultural and ecological conservation that elevate rural destinations like Kanthalloor and Beypore to global level, the Minister noted.\nThe five-day festival aims to give a strong market support to RT units, facilitating them to sell their products and also seek new business opportunities by collaborating with tour operators, vloggers, resort owners etc.\nAt the event, a memorandum of understanding for implementing interest subvention scheme for women in RT units was exchanged by Women Development Corporation managing director Bindu V.C. and Rupeshkumar K., CEO, Kerala Responsible Tourism Mission Society. The festival serves as a venue for RT units from across Kerala to showcase their initiatives that took tourism to the grassroot-levels as a sustainable and inclusive economic activity with active participation of local communities.\nA range of traditional products and artifacts, bearing the imprint of RT units from different parts of Kerala, are exhibited at the festival, which has around 120 stalls selling products made by members and artisans of RT units. Food stalls dishing out full-course meals and delicacies from different parts of Kerala at the festival promises visitors a rare opportunity to relish authentic cuisine from up north Kasaragod to the State capital.",
        "link": "https://www.thehindu.com/news/national/kerala/rt-mission-sets-a-global-model-of-women-empowerment-in-tourism-says-kerala-tourism-minister/article70620486.ece",
        "date": "Wed, 11 Feb 2026 20:31:36 +0530",
        "fetched_at": "2026-02-12 04:06:03.069435"
    },
    {
        "title": "Naravane's book 'leak' bid to bypass defence clearance: Police",
        "content": "Raj Shekhar Jha is a journalist for the Times of India with over a decade of experience in reporting on national security, terrorism, crime and prisons.",
        "link": "https://timesofindia.indiatimes.com/india/naravanes-book-leak-bid-to-bypass-defence-clearance-police/articleshow/128230077.cms",
        "date": "2026-02-12T05:06:08+05:30",
        "fetched_at": "2026-02-12 04:06:04.624121"
    },
    {
        "title": "'Conspiracy, Clearance Bypassed’: FIR In Ex-Army Chief’s Book Leak Puts Focus On Overseas Sales",
        "content": "The controversy surrounding the former Army Chief’s book has deepened, with sources indicating that the publication was allegedly released without mandatory clearance from the Ministry of Defence (MoD) and first sold on online platforms in Canada, Australia, Germany and the United States.\nAccording to sources, the initial investigation following the registration of a case points to a “well-planned conspiracy\". It is learnt that the book was leaked in a coordinated manner, bypassing the MoD’s mandatory clearance process for publications involving serving or former defence personnel.\nInvestigators have found that copies of the book began circulating on online platforms in Canada, Australia, Germany and the US before surfacing elsewhere. Sales are said to have started in these countries first, raising questions about the publishing and distribution chain.\nThe Special Cell has registered an FIR under sections pertaining to criminal conspiracy. The scope of the probe has now been expanded internationally, covering the US, Canada, Germany and Australia.\nA thorough investigation into the digital trail, publishing network and possible international links is currently underway. Sources said the probe is intensifying, with agencies examining overseas connections and coordination in the alleged leak and distribution of the book.\nAmid the row, Penguin Random House India, which holds the publishing rights to Four Stars of Destiny, issued a clarification stating that the book has not been published in any format.\nThe publisher said that an announced title, a pre-order listing and a published book are distinct stages, and that a book is considered published only when it is available for purchase across retail channels.\nThe entire row over the book erupted in Parliament when Leader of the Opposition Rahul Gandhi referred to alleged contents of General (Retd.) MM Naravane’s unpublished memoir and displayed what he claimed was a copy of the book in the Lok Sabha.\nHis remarks triggered strong objections from treasury benches, with BJP leaders questioning how an unpublished manuscript was accessed and cited in the House. The episode led to heated exchanges, walkouts and demands for clarification, bringing the status of the book’s publication and its alleged leak into sharp political focus.\nLatest Blogs",
        "link": "https://www.news18.com/india/conspiracy-clearance-bypassed-fir-in-ex-army-chiefs-book-leak-puts-focus-on-overseas-sales-ws-l-9897277.html",
        "date": "Thu, 12 Feb 2026 09:31:40 +0530",
        "fetched_at": "2026-02-12 04:06:06.437928"
    },
    {
        "title": "Arunachal Dam Project Gets Eco Go-Ahead After 3 Decades, At The Cost Of 23 Lakh Trees | Exclusive",
        "content": "The Centre’s expert panel has recommended environmental clearance for the Kamala hydroelectric project, a 1,720-MW storage dam proposed in the forested districts of Arunachal Pradesh.\nThree decades in the making, the dam project, however, comes with strong warnings over large-scale deforestation and the need for strict ecological safeguards as more than 23 lakh trees will have to be felled.\nThe dam project – proposed by NHPC Ltd – involves the construction of a concrete gravity dam at a height of 216 metres on Kamala River, which is a tributary of the Subansiri and part of the Brahmaputra basin.\nThe dam and its reservoir will spread across 3,858 hectares in Kamle, Kra Daadi and Kurung Kumey districts, most of which are covered by dense forests.\nAfter recently examining the proposal, the expert appraisal committee (EAC) noted that the dam project is in category ‘A’ of the Environmental Impact Assessment Notification, 2006 – this requires clearance at the central level.\nWhile recommending approval, the EAC flagged what it called a serious environmental concern: the proposed felling of over 23 lakh trees.\n“The project is located in a very dense forest area,\" the committee observed, stressing that such large-scale deforestation will require carefully planned mitigation and ecosystem restoration measures.\nIt said a detailed action plan must be prepared in consultation with state forest and wildlife departments, ecological experts and local communities before forest clearance can be considered.\nThe social footprint is also significant. According to official documents, 126 villages across three districts will be affected with at least 30,000 people living in the impacted area.\nThe broader study area covers 377 villages across four districts. The NHPC, however, has argued that the project serves strategic and economic goals.\nDesigned as a storage-based hydropower project, the Kamala dam is expected to provide daily peaking power and play a role in flood moderation in the downstream Brahmaputra basin. The design includes a 15-metre flood cushion above the full reservoir level to help manage monsoon floods.\nThe project has been in the pipeline for nearly three decades with initial investigations carried out by the Brahmaputra Board in 1996. This was followed by feasibility and detailed project reports by NHPC in 2004. Several alternative dam sites and designs were examined before the current alignment was finalised, with engineers citing better geology and safety as key reasons for the final choice.\nThe estimated cost of the Kamala hydroelectric project is Rs 23,764 crore. While the EAC’s recommendation clears a key regulatory hurdle, final forest clearance remains pending.\nEnvironmental groups and local residents are expected to closely monitor the next steps, as the project moves from paper approvals to decisions that will reshape large swathes of Arunachal Pradesh’s forest landscape.\nLatest Blogs",
        "link": "https://www.news18.com/india/arunachal-dam-project-gets-eco-go-ahead-after-3-decades-at-the-cost-of-23-lakh-trees-exclusive-ws-l-9897076.html",
        "date": "Thu, 12 Feb 2026 08:30:16 +0530",
        "fetched_at": "2026-02-12 04:06:07.087083"
    },
    {
        "title": "Bharat Bandh Today Live Updates: Bank, Transport Services Likely To Be Hit As 30 Crore Workers To Join Protests",
        "content": "Bharat Bandh on 12th February 2026 live updates: A nationwide ‘bandh’ has been called by a joint forum of 10 trade unions on Thursday, February 12, to protest against the economic policies of the central government.\nThe ‘bandh’ is expected to be joined by around 30 crore workers, which is likely to disrupt multiple facilities, including banks, transportation, and other services.\nAddressing the media, All India Trade Union Congress (AITUC) General Secretary Amarjeet Kaur said the scale of participation is expected to surpass previous mobilisations.\n“Not less than 30 crore workers will join the strike on February 12. During the July 9, 2025 protest, around 25 crore workers took part,” she said.\nProtests Over India-US Trade Deal\nThe ‘bandh’ has also been backed by farmer organisations. Samyukt Kisan Morcha (SMK) has criticised the recent trade deal between India and the United States, alleging the Narendra Modi-led government surrendered before the “shrewdness of the US”.\n“Agreement will be a betrayal against farmers… We are surrendering before the shrewdness of US. The Governmet has surrendered. Piyush Goyal should resign. He betrayed Indian farmers. On this basis, we have started a campaign, from 4th February to 11th February SKM will go to farmers. On 12th, Bharat Bandh has been called over this,” SKM Convenor Hannan Mollah told news agency ANI.\nThe nationwide strike called by trade unions against the Centre’s Labour Codes threw normal life out of gear across Kerala on Thursday, with transport services being hit and attendance in government offices expected to be low.\nAlthough no official circular has issue in regard to the closure of banks in Delhi in view of the nationwide strikes, customers are advised to contact their bank branch for updates.\nIn Odisha’s Bhubaneswar, the Odisha State Committee of the Trade Union Co-Ordination Centre participated in the nationwide strike called by several trade unions.\nThe Samyukt Kisan Morcha has backed the strike, and agricultural workers’ unions are joining the protests with demands including restoration of MGNREGA and rollback of the Viksit Bharat – Guarantee for Rozgar and Ajeevika Mission (Gramin) Act, 2025, also referred to as G RAM G.\nLoP and Congress MP Rahul Gandhi on Thursday backed the nationwide call for ‘Bharat Bandh’, asserting his support to the protesting farmers and trade unions.\nआज देशभर में लाखों मजदूर और किसान अपने हक़ की आवाज़ बुलंद करने सड़कों पर हैं।\nमजदूरों को डर है कि चार श्रम संहिताएँ उनके अधिकारों को कमजोर कर देंगी।\nकिसानों को आशंका है कि व्यापार समझौता उनकी आजीविका पर चोट करेगा।\nऔर मनरेगा को कमजोर या खत्म करने से गांवों का आख़िरी सहारा भी…\n— Rahul Gandhi (@RahulGandhi) February 12, 2026\nAmid the call for a nationwide strike by trade and farmer unions to protest against the centre’s policies and the India-US trade deal, visuals from Kolkata emerge.\n#WATCH | West Bengal: A nationwide strike has been called by several trade unions to protest against various policies of the central government.\nVisuals from several locations in Kolkata. pic.twitter.com/uVeA67YxFy\n— ANI (@ANI) February 12, 2026\nThe Department of School Education and Literacy on Wednesday stated that schools across Karnataka will function normally today and will not be affected by the Bharat Bandh.\n“District commissioners are also allowed to take decisions in case of any untoward incidents,” said Vikas Kishor Suralkar, Commissioner for School Education.\nAfter the nationwide strike called by various trade unions against various policies of the central government and the India-US trade deal, the LDF government in Kerala has declared a no work no pay for employees, warning them against participation in the protests.\nA nationwide ‘bandh’ is expected to cause disruptions in several regions. Citizens are advised to analyse the situation in their locality and plan their travel accordingly.\nIn view of the ‘Bharat Bandh’ today, the Mohan Charan Majhi-led Odisha Government has directed the district collectors to take preventive measures to maintain law & order.\nStates including Kerala, Odisha and Karnataka are likely to see disruptions in services as trade unions are more active in these regions.\nPunjab’s ruling party AAP has backed the nationwide strike called on February 12 by the central trade unions and farmer bodies. In a statement, the Aam Aadmi Party (AAP) announced that its cadre across Punjab and the rest of the country would join the nationwide ‘bandh’ with farmers and workers.\nThe Congress has extended its support to the nationwide call for ‘Bandh’ today, asserting they will firmly stand with the workers and farmers.\nThe Congress party will always stand firmly with our workers, farmers, and every citizen fighting for justice, dignity, and fair economic policies. We extend full solidarity to the nationwide Bharat Bandh and support this democratic voice against policies that weaken people’s… pic.twitter.com/zlfi8GGMlR\n— Partap Singh Bajwa (@Partap_Sbajwa) February 11, 2026\nMembers from multiple trade unions held a torchlight protest in Kerala, voicing their opposition to the economic policies of the union government.\n#WATCH | Kerala | Several trade unions held a torchlight protest in Thiruvananthapuram against the various policies of the central government. (11.02) pic.twitter.com/vTQMhn5BGF\n— ANI (@ANI) February 11, 2026\nAmid the call for a nationwide bandh today by trade and farmer unions to protest against the recent India-US trade deal, Punjab BJP President Sunil Jakhar asserted that farmers are protected under the deal and that they are being misled.\n#WATCH | Mohali | On farmer unions strike against US-India trade deal framework, Punjab BJP President Sunil Jakhar says, “The farmers especially of Punjab are being mislead…The farmer are totally protected under the India-US Interim Trade Agreement…The India-US Interim Trade… pic.twitter.com/TJRliXgt78\n— ANI (@ANI) February 12, 2026\nWhile the government has not made any official announcement, there might be disruptions in transport and other services.\nSchools and colleges are likely to remain closed in state, including Kerala, Karnataka, and Odisha, if local bodies back the nationwide ‘bandh’. Essential services like hospitals and ambulances are likely to function normally.\nLatest Blogs",
        "link": "https://www.news18.com/india/bharat-bandh-february-12-live-updates-india-us-trade-deal-trade-unions-strike-protest-today-school-transport-banks-latest-news-liveblog-9897092.html",
        "date": "Thu, 12 Feb 2026 09:33:40 +0530",
        "fetched_at": "2026-02-12 04:06:07.949984"
    },
    {
        "title": "'Unauthorised': BJP Assam Sacks Social Media Member After AI Video Shows Himanta Aiming Gun At Men",
        "content": "The Assam unit of the Bharatiya Janata Party (BJP) removed one of four co-conveners from its social media department following backlash over a video that depicted Chief Minister Himanta Biswa Sarma aiming a rifle at two men, one of whom bears resemblance to Congress MP Gaurav Gogoi.\nThe video, posted last Saturday on the official X (formerly Twitter) handle of Assam BJP with the caption “Point blank shot\", was deleted the following day. The post showed digitally manipulated images of the Chief Minister appearing to shoot at a photograph of the two men, concluding with an image of Himanta Biswa Sarma dressed as a cowboy wielding a gun.\nAssam BJP president Dilip Saikia confirmed the removal to The Indian Express, characterizing the post as an “immature\" and “unauthorised\" action.\n“The party is concerned about illegal immigrant Bangladeshis in Assam, and for that, there has to be a movement in the society. But the party does not support the idea of a mala fide intent of targeting Muslims with bullets. It was mishandled by an immature and unauthorised person,\" Saikia stated.\nChief Minister Himanta Biswa Sarma distanced himself from the video, claiming no prior knowledge of its creation or posting.\n“We have registered an FIR,\" he said, referring to a complaint filed by Congress MLAs, adding, “In fact, one of our BJP people has also filed a case, saying that this is a video about which we are angry because in Assam, everybody knows that we are not against Assamese Muslims. We are against Bangladeshi Muslims, whom we call Miya Muslims.\"\nThe controversy marks the second time in recent months that the Assam BJP’s X handle has faced scrutiny. In September 2025, the account posted an AI-generated video titled “Assam without BJP\", accompanied by text references to “beef legalisation\" and “illegal immigrants.\" The Supreme Court subsequently issued a notice in October on a petition seeking removal of the video.\nLatest Blogs",
        "link": "https://www.news18.com/india/unauthorised-bjp-assam-sacks-social-media-member-after-ai-video-shows-himanta-aiming-gun-at-men-ws-l-9896997.html",
        "date": "Wed, 11 Feb 2026 23:54:54 +0530",
        "fetched_at": "2026-02-12 04:06:08.828008"
    },
    {
        "title": "Drive To ‘Jai Ho’: Mumbai Melody Road Opens On Coastal Route, Fadnavis Hints At More Such Projects",
        "content": "Mumbai has unveiled India’s first musical road, where motorists driving along a designated stretch of the Coastal Road can hear the iconic Bollywood song Jai Ho through specially installed grooves in the road surface.\nThe innovative project was inaugurated on Wednesday by Maharashtra Chief Minister Devendra Fadnavis. Deputy Chief Minister Eknath Shinde, former Shiv Sena MP Rahul Shewale, who came up with the idea, Hungary’s Consul General Faren Jari, and BMC officials were present at the launch.\nFadnavis called the musical road as a “delightful experience\" for motorists and said the concept, based on Hungarian technology, could be expanded in the future.\nA post shared by News18.com (@cnnnews18)\n“In the first phase, the concept has been implemented on a 500-metre stretch of the Coastal Road, and there are plans to expand the musical road concept further,\" Fadnavis said.\nShinde also encouraged Mumbaikars to experience the musical road and suggested that the concept could also be tried on the Samruddhi Expressway as a pilot project.\nAbout The Mumbai Melody Road\nThe musical stretch has been developed on the northbound carriageway of the Coastal Road, running from Nariman Point towards Worli. Civic officials said it is located in the first lane adjoining the divider, around 500 metres after vehicles exit the Worli-bound underground tunnel.\nThe road features grooves or rumble strips of precise dimensions and spacing. When vehicles pass over them at 70 to 80 kmph, the vibrations from the tyres produce musical notes, forming the melody of Jai Ho, composed by AR Rahman with lyrics by Gulzar.\nSignboards have been placed at 500 metres, 100 metres, and 60 metres before the stretch to alert drivers about the upcoming musical section and the required speed.\nAccording to the Brihanmumbai Municipal Corporation (BMC), this is the fifth such musical road in the world and the first in India.\nThe Coastal Road, named after Dharmaveer Swarajyarakshak Chhatrapati Sambhaji Maharaj, is a major infrastructure project aimed at easing traffic congestion and enabling faster travel, now offering a unique cultural and engineering experience.\nMusical roads, also called melody roads, were first developed in Japan in 2007 and have since been implemented in countries such as Hungary, South Korea, and the UAE.\nThe BMC hailed the project as a blend of engineering innovation and cultural expression, giving Mumbaikars a patriotic and musical experience as they drive.\n(With inputs from PTI)\nLatest Blogs",
        "link": "https://www.news18.com/cities/mumbai-news/mumbai-melody-road-opens-on-coastal-route-fadnavis-hints-at-more-such-projects-ws-l-9896917.html",
        "date": "Wed, 11 Feb 2026 23:21:19 +0530",
        "fetched_at": "2026-02-12 04:06:09.505441"
    },
    {
        "title": "Rajnath Singh-Led Top Defence Body Likely To Clear Acquisition Of 114 Rafale Jets, Key Meeting Tomorrow",
        "content": "India’s Defence Acquisition Council, chaired by Defence Minister Rajnath Singh, is likely to approve 114 additional Rafale fighter jets for the Indian Air Force as it holds a key meeting on Thursday (February 12).\nThe meeting will have major decisions on critical military platforms, with the agenda including proposals that could reshape combat capabilities of the armed forces amid growing security concerns.\nAt the forefront is the likely approval of 114 additional Dassault Rafale jets for the Indian Air Force under the Medium-Role Fighter Aircraft (MRFA) programme. This proposal – cleared by the Defence Procurement Board last month – is expected to be taken up by the Defence Acquisition Council (DAC) before being forwarded to the Prime Minister-led cabinet committee on security for the final nod.\nThe planned Rafale acquisition aims to address the steep decline in the squadron strength of the air force. The number has dropped to 29 squadrons against an authorised strength of 42, the lowest in decades. Even with the additional jets, which could translate into at least six to seven new squadrons and incoming HAL Tejas Mk-1A deliveries, the gap is unlikely to close quickly without these buys.\nThe MRFA project has a long and complex lineage. It evolved from the 2007 Medium Multi-Role Combat Aircraft (MMRCA) competition, in which Rafale eventually emerged the preferred choice but negotiations over cost and industrial terms had stalled.\nThe present proposal has a stronger emphasis on ‘Make in India’, with plans for transfer of technology and local production as well as integration of future weapons systems tailored to Indian requirements. If approved, the deal – estimated to be around Rs 3.25 lakh crore – will become one of India’s largest fighter aircraft procurements.\nThe DAC is also expected to consider procurement of high-altitude pseudo-satellites (HAPS), which are long-endurance, solar-powered unmanned systems capable of stratospheric surveillance.\nThese offer persistent intelligence, surveillance and reconnaissance over wide areas at considerably lower cost than traditional satellites, and are being developed by Indian entities including Defence Research and Development Organisation (DRDO) and National Aerospace Laboratories (NAL). Their inclusion is a shift towards indigenous space-domain capability that can support frontline forces in border and maritime zones.\nWhile sources indicated that approvals are unlikely, the DAC is widely expected to take up the case of the Boeing P-8I Poseidon fleet to approve six additional aircraft for the Indian Navy.\nThe P-8I, a long-range maritime surveillance and anti-submarine warfare platform, is a critical asset for securing India’s maritime interests in the Indian Ocean. The navy presently operates 12 of these aircraft, which have amassed over 40,000 mishap-free flight hours and are central to its “eye in the sky\" capability.\nThe council will discuss some more cases for the capability boost of the armed forces, including SCALP missiles, indigenous marine engine development programme for the navy among other cases.\nDelays in the indigenous LCA Mk1A programme have compounded capability shortfalls. Although at least 180 Mk1A aircraft have been contracted, deliveries – scheduled between 2027 and 2033 – have not yet begun, slowing down efforts to offset retirements of older jets such as the MiG-21 series.\nThese delays have sharpened the focus on rapid acquisitions like the Rafale buy while highlighting the need to speed up indigenous projects.\nLatest Blogs",
        "link": "https://www.news18.com/india/rafale-fighter-jets-acquisition-iaf-rajnath-singh-top-defence-body-proposal-meeting-tomorrow-ws-l-9896850.html",
        "date": "Wed, 11 Feb 2026 21:44:19 +0530",
        "fetched_at": "2026-02-12 04:06:10.124009"
    },
    {
        "title": "Bharat Bandh Today: Transport, Banks, Schools — What’s Open, What’s Closed",
        "content": "A nationwide strike, also known as Bharat Bandh, has been called on Thursday, by over 10 central trade and farmers’ unions. The strike protests against labour reforms and other policies that unions say weaken workers’ rights and protections.\nThe bandh is likely to disrupt public sector banks, transport services, government offices, and some industries, particularly in states such as Kerala and Odisha, where union mobilisation is strong.\nThe strike has been called by a joint platform of ten central trade unions, including AITUC, INTUC, CITU, HMS, TUCC, SEWA, AIUTUC, AICCTU, LPF, and UTUC.\nUnion leaders say the bandh aims to press for stronger social security measures and protection of labour rights. They oppose the four new labour codes, arguing that these weaken workers’ rights, reduce job security, and make it easier for employers to hire and fire staff.\nOther demands include scrapping the Draft Seed Bill, the Electricity Amendment Bill, and the SHANTI Act, restoring MGNREGA, and withdrawing the Viksit Bharat – Guarantee for Rozgar and Ajeevika Mission (Gramin) Act, 2025, The Times of India reported.\nFarmers’ Support\nThe Samyukt Kisan Morcha (SKM) has also extended its support, citing concerns over the India-US interim trade agreement. The group’s convenor Hannan Mollah said the deal would flood Indian markets with cheaper US imports, harming farmers’ livelihoods.\n“SKM studied the Government’s Agreements with the US, EU and New Zealand. SKM has been against this since the beginning. Agreement is not beneficial for a weaker country. They will send their goods for free to our country and they will flood our markets with cheaper goods. Our country will not be able to compete with them and our farmers will be finished,\" Mollah noted.\nAITUC General Secretary Amarjeet Kaur said around 30 crore workers are expected to join the strike across 600 districts, surpassing last year’s mobilisation of 25 crore workers.\nWhat May Be Open And Closed\nLikely Affected: Public banks and insurance offices, state transport services, government offices, PSUs, industrial units, coal and steel sectors, and MGNREGA works in protest areas.\nLikely to Remain Open: Hospitals, ambulances, essential health services, metro services (depending on local admin), private offices and IT companies (state-dependent), schools and colleges (state-wise), and essential supply services like milk and pharmacies.\nLatest Blogs",
        "link": "https://www.news18.com/india/bharat-bandh-on-february-12-transport-banks-schools-whats-open-whats-closed-ws-l-9896671.html",
        "date": "Thu, 12 Feb 2026 07:10:03 +0530",
        "fetched_at": "2026-02-12 04:06:10.734824"
    },
    {
        "title": "Uniform Dignity: Modi Govt Gives Ex-Servicemen Status To Military Nursing Service",
        "content": "The Narendra Modi government has officially extended Ex-servicemen (ESM) status to the Military Nursing Service (MNS). This decision, notified on February 10, corrects a historic oversight by amending the Ex-servicemen (Re-employment in Central Civil Services and Posts) Rules, 1979, effectively placing nursing officers on an equal statutory footing with veterans of the Regular Army, Navy, and Air Force.\nThe amendment to Section 2(c)(i) of the service rules explicitly includes the Military Nursing Service of the Indian Union within the definition of “ex-servicemen.\" This change is not merely symbolic; it ensures that nursing personnel—who are predominantly women—receive the same post-retirement security and re-employment benefits as their combatant counterparts.\nAccording to the Defence Secretary Rajesh Kumar Singh, this reflects the government’s complete commitment to the welfare, dignity, and long-term security of women serving the nation in uniform.\nAs per the new guidelines, MNS veterans are now entitled to:\nReservation Quotas: 10% reservation in Group ‘C’ and 20% in Group ‘D’ Central Government posts.\nAge Relaxation: The ability to deduct the total years of military service plus an additional three years from their actual age for civil job eligibility.\nEmployment Priority: Equal standing in recruitment processes conducted by the Union Public Service Commission (UPSC) and the Staff Selection Commission (SSC).\nThe reform follows a 2024 Supreme Court observation that MNS personnel are an integral part of the armed forces and should not be denied veteran status. Defence Secretary Rajesh Kumar Singh noted that this move reflects the government’s “complete commitment to the welfare, dignity, and long-term security of women serving the nation in uniform\".\nFor decades, MNS officers have served in frontline military hospitals, high-altitude operational zones, and hostile environments, yet faced an “ambiguity\" regarding their status upon retirement. By formalising their identity as ex-servicemen, the government has underlined its position that the contribution of women to national security is primary, not secondary. This decision is being widely hailed as a core component of the broader push for women-led development within India’s defence ecosystem.\nLatest Blogs",
        "link": "https://www.news18.com/india/uniform-dignity-modi-govt-gives-ex-servicemen-status-to-military-nursing-service-9896652.html",
        "date": "Wed, 11 Feb 2026 19:55:47 +0530",
        "fetched_at": "2026-02-12 04:06:11.954711"
    },
    {
        "title": "Cabinet Ranks Surge As SC/ST Corporations Face Major Fund Cuts In Karnataka | Exclusive",
        "content": "There is a stark disparity in the fiscal priorities of the Karnataka government, where a surge in cabinet-rank appointments for political leaders contrasts sharply with a declining trend in funding for Scheduled Caste and Scheduled Tribe development corporations. Documents exclusively accessed by CNN-News18 reveal that at least seven key corporations dedicated to marginalised communities have seen their financial lifelines either slashed or stagnated since the Siddaramaiah-led Congress government took office. This revelation comes as the state administration faces mounting criticism for elevating over 100 party workers to cabinet status, granting them high-end perks and ministerial privileges while essential welfare programs struggle for basic liquidity.\nDefending the administration’s fiscal strategy, Congress MLA HC Balakrishna admitted to the disparity while speaking to CNN-News18, though he categorised it as a necessary adjustment for the government’s flagship guarantee schemes. “It’s a slight disparity,\" Balakrishna stated, adding that “overall allocation to SC/ST communities remains the same.\" He maintained that the funds were being utilised to ensure the broader success of social welfare guarantees that also benefit these specific communities.\nHowever, the opposition has characterised this shift as a betrayal of the very communities that helped propel the Congress to power. BJP Spokesperson GS Prashanth slammed the government for what he termed a “misuse of taxpayer money\" to fund political gratification. “There are two issues to be looked at: one, definitely BJP stood for the welfare of ST SCs and allotted a good chunk of the budget,\" Prashanth said. “What the Congress government has done is they have reduced the allocation and used the funds meant for SC/ST development for other purposes, roughly about Rs 25,000 crore in the last two years. It is very clear that Congress’s statement about standing up for SC/STs is only for the paper; in reality, they do not believe in empowering them.\"\nThe controversy is further fueled by the timing of these cuts, as the government continues to dole out ministerial ranks to its cadre despite warnings from the Chief Minister’s own economic advisor regarding the state’s dry coffers. Prashanth further added, “At this juncture, to dole out to party workers… taxpayer money is being misused. It is very shameful that Congress has resorted to appease their party workers by using taxpayer funds. Siddaramaiah and DK Shivakumar have mortgaged the interest of the people of Karnataka.\" As the debate intensifies, the government remains under pressure to explain why political perks appear to be taking precedence over the direct financial empowerment of the state’s most vulnerable populations.\nLatest Blogs",
        "link": "https://www.news18.com/india/cabinet-ranks-surge-as-sc-st-corporations-face-major-fund-cuts-in-karnataka-exclusive-ws-l-9895931.html",
        "date": "Wed, 11 Feb 2026 16:39:52 +0530",
        "fetched_at": "2026-02-12 04:06:12.588117"
    },
    {
        "title": "Drunk Father Burns Daughter’s Schoolbooks, Police Buy Her A New Set",
        "content": "In Arundi village of Nyamati taluk, a Class 10 student preparing for her SSLC examinations turned to the police after her father allegedly burned her textbooks and prevented her from attending school.\nAccording to her complaint, the girl’s father, who is reportedly addicted to alcohol, had been creating disturbances at home. As the SSLC board examinations scheduled from March 18 to April 2, 2026 approached, tensions escalated. During this period, he allegedly set fire to her textbooks and notebooks and stopped her from going to school.\nWith exams just weeks away, the loss of study materials and disruption to her routine left the student distressed. Fearing further interference with her education, she called the emergency helpline 112 and later filed a formal complaint at the Nyamati police station.\nSwift Police Response\nPolice officers Hemaraj and Ravikumar responded to the call and visited the family’s home as quickly as they could. They intervened and counselled the father, explaining the seriousness of his actions and the potential long-term impact on his daughter’s education.\nUnder the supervision of CPI Ravi of the Nyamati police station, officers ensured that the girl received new textbooks and notebooks to replace the ones that were burned. The police also contacted school authorities and requested their support to help the student continue her studies without further disruption.\nProtecting a Child’s Right to Education\nPolice officials stressed that while domestic disagreements may occur, they must not interfere with a child’s right to education. Destroying study materials, especially during board exam preparations, can severely affect a student’s confidence and academic performance.\nThe timely intervention helped stabilise the situation and ensured the girl could resume her exam preparation. The incident has drawn attention within the village, with residents expressing concern over the episode, particularly given the importance of the SSLC examinations.\nAll that the girl wanted was to study for the upcoming board exams which in a way is a turning point in her life and career. A drunken father was about to kill that future and dream but right intervention of police and the girl seeking their help, turned the tables.\nWith exams just weeks away, the loss of study materials and disruption to her routine left the student distressed. Fearing further interference with her education, she called the emergency helpline 112 and later filed a formal complaint at the Nyamati police station.\nSwift Police Response\nPolice officers Hemaraj and Ravikumar responded to the call and visited the family’s home as quickly as they could. They intervened and counselled the father, explaining the seriousness of his actions and the potential long-term impact on his daughter’s education.\nUnder the supervision of CPI Ravi of the Nyamati police station, officers ensured that the girl received new textbooks and notebooks to replace the ones that were burned. The police also contacted school authorities and requested their support to help the student continue her studies without further disruption.\nProtecting a Child’s Right to Education\nPolice officials stressed that while domestic disagreements may occur, they must not interfere with a child’s right to education. Destroying study materials, especially during board exam preparations, can severely affect a student’s confidence and academic performance.\nThe timely intervention helped stabilise the situation and ensured the girl could resume her exam preparation. The incident has drawn attention within the village, with residents expressing concern over the episode, particularly given the importance of the SSLC examinations.\nAll that the girl wanted was to study for the upcoming board exams which in a way is a turning point in her life and career. A drunken father was about to kill that future and dream but right intervention of police and the girl seeking their help, turned the tables.\nScan the QR code to download the News18 app and enjoy a seamless news experience anytime, anywhere.\nLatest Blogs",
        "link": "https://www.news18.com/india/drunk-father-burns-daughters-schoolbooks-police-buy-her-new-set-in-karnataka-skn-ws-l-9895852.html",
        "date": "Wed, 11 Feb 2026 16:19:55 +0530",
        "fetched_at": "2026-02-12 04:06:13.738795"
    },
    {
        "title": "Toll Collection Not Linked To Project Cost Recovery, Says Gadkari, Explains Factors Behind Hike",
        "content": "The toll collected from a road is not related to the recovery of project development cost, the Ministry of Road Transport and Highways informed the Rajya Sabha on Wednesday.\nUnion minister Nitin Gadkari added that the revenue collected beyond the concession period is deposited in Consolidated Fund of India (CFI) and the funds provided through budgetary allocation are utilised for further maintenance, development and augmentation of national highways.\nThe ministry, in a written reply, said the National Highways Fee (Determination of Rates and Collection) Rules, 2008, as amended, provide a transparent framework for levy and collection of user fee, with rates linked to the length of the highway and type of vehicle uniformly across the country.\nGadkari said collection of user fee (toll) at fee plazas on National Highways is done as per the provisions of National Highways Fee Rules, 2008.\n“…the fee notified as per concession agreement is collected by the concessionaire till the end of the concession period, and after the concession period is over, the fee is collected by the Central Government or the executing authority as per the fee specified…,\" he said.\nIn a separate reply, Gadkari said the increase in the amount of user fee collection at toll fee plazas on national highways depends on several factors.\n“These include the annual revision of user fee, which is linked to the wholesale price index in accordance with the National Highways Fee (Determination of Rates and Collection) Rules, 2008, increase in the length of highways under tolling, the volume of traffic plying on the stretch, and the category of vehicles using the highway,\" he said.\nIn August 2025, the Public Accounts Committee (PAC) had said that there is no institutional mechanism to independently evaluate whether toll charges are justified in relation to actual operation and maintenance costs or future service requirements.\nThe committee said it has found that toll charges on National Highways are linked to base rates first fixed in 2008 and annually revised, with a 3 per cent annual escalation, irrespective of road quality, traffic volume, or user affordability.\n“… the concept of tolling in perpetuity was first introduced through an amendment to the Fee Rules in 2008, allowing continued collection of user fees even after the recovery of project costs. This provision was further clarified and codified through the 2023 amendment to the Fee Rules, which explicitly permits tolling to continue beyond the end of the concession period, thereby formalising a regime of perpetual tolling,\" it had said.\nThe committee had desired that toll collection on any highway stretch must be rationalised and substantially reduced once capital and routine maintenance costs have been recovered.\n“Any continuation of tolls beyond this point should be permitted only if clearly justified and approved by the proposed independent oversight authority,\" the report added.\nThe committee also recommended that the ministry establish a tariff authority, on the lines of the Airports Economic Regulatory Authority (AERA) in the civil aviation sector, to ensure transparency and fairness in toll fixation, collection, and regulation.\nThis authority should be mandated to review and determine the periodicity of toll revisions based on certain parameters, it suggested.\nLatest Blogs",
        "link": "https://www.news18.com/india/toll-collection-not-linked-to-project-cost-recovery-says-gadkari-explains-factors-behind-hike-ws-kl-9895663.html",
        "date": "Wed, 11 Feb 2026 15:41:55 +0530",
        "fetched_at": "2026-02-12 04:06:14.354703"
    },
    {
        "title": "Goa Minister Atanasio Monserrate Acquitted In 2016 Rape Case",
        "content": "A special court in Goa on Wednesday acquitted BJP MLA and minister Atanasio Monserrate in a rape case registered against him nearly a decade ago.\nMonserratte, who holds the revenue portfolio, was booked in 2016 for allegedly raping a minor.\nSpecial Judge Irshad Agha has now acquitted the minister of all charges.\nAs per the FIR registered by the Goa police, a minor girl had alleged that she was sold to then St Cruz MLA Monserratte who drugged and raped her.\nInitially, the case was registered against the minister under the Goa Children’s Act. Later, the charge was dropped and sections under the Indian Penal Code were invoked after an ossification test indicated that she was above 16 years of age.\nThe case was tried before the district court after the police filed a 250-page chargesheet against him. A total of 40 witnesses were examined during the trial.\nLatest Blogs",
        "link": "https://www.news18.com/india/goa-minister-atanasio-monserrate-acquitted-in-2016-rape-case-ws-l-9895583.html",
        "date": "Wed, 11 Feb 2026 15:01:07 +0530",
        "fetched_at": "2026-02-12 04:06:15.036380"
    },
    {
        "title": "Man Survives On Leaves For 10 Years In Karnataka Forest, Sports Six-Pack Body",
        "content": "In a quiet corner of Belagavi district, Karnataka where rocky hills rise beyond fields and villages thin into scrub forest, a man has chosen a life few would imagine for themselves. He shunned the regular ‘civilized life’ and walked into forests a decade ago.\nFor 10 years, he has lived away from society, without cooked food, without routine comforts, and without the rhythms of conventional life. Meet Budan Khan Hosamani, aged 34, from Ugaragol village in Saundatti taluk of Belagavi district who is well known in the area as ‘Modern Day Tarzan’.\nA Decade in the Hills\nNearly 10 years ago, Budan Khan walked away from home and settled in the Heggolla hill region on the outskirts of his village. Since then, he has lived largely in isolation, away from regular social contact and modern conveniences.\nWhat sets him apart is not just his solitude, but his diet. Budan Khan survives entirely on raw leaves, plants and wild greens found in the forest.\nHe is said to consume nearly 80 different varieties of vegetation available in the hills. According to local accounts, he no longer eats rice, roti or any cooked food and reportedly says he cannot even look at regular meals anymore.\nReports suggest that Budan Khan began experimenting with eating leaves after observing monkeys in the forest. Over time, this practice became his only source of sustenance.\nTo support this lifestyle, he also practices yoga, which he believes helps him digest the raw vegetation and maintain balance in his body.\nWhy He Left\nAccording to those familiar with his story, Budan Khan left home after facing pressure from his family to get married and lead a settled life. Instead of following that path, he chose solitude in the hills and adopted what he considers a natural way of living.\nHe says he observed monkeys and learnt what leaves to eat and what not. He walks a great distance inside the forest everyday and does a couple of exercises that he already knew to stay in good health.\nDespite surviving solely on forest greens, Budan Khan reportedly maintains a well-built and fit physique. Observers have described him as having a six-pack body, a detail that has surprised many locals and drawn curiosity about his unusual diet and routine.\nHis parents and two brothers live in the nearby village. “We tried to convince him to come back home many times. The minute we speak about him getting married, he stops talking to us altogether. So we said, he can stay unmarried but come and live with us. He doesn’t want to come at all, he is happy in the wild. We don’t have much option when he is that stubborn, so we just left him be\" says Khan’s mother.\nIn the hills of Belagavi, away from kitchens and crowded streets, his life continues quietly, rooted in leaves, routine and isolation.\nReported By: Chandrakanth Sugandhi, News18 Kannada, Belagavi\nA Decade in the Hills\nNearly 10 years ago, Budan Khan walked away from home and settled in the Heggolla hill region on the outskirts of his village. Since then, he has lived largely in isolation, away from regular social contact and modern conveniences.\nWhat sets him apart is not just his solitude, but his diet. Budan Khan survives entirely on raw leaves, plants and wild greens found in the forest.\nHe is said to consume nearly 80 different varieties of vegetation available in the hills. According to local accounts, he no longer eats rice, roti or any cooked food and reportedly says he cannot even look at regular meals anymore.\nReports suggest that Budan Khan began experimenting with eating leaves after observing monkeys in the forest. Over time, this practice became his only source of sustenance.\nTo support this lifestyle, he also practices yoga, which he believes helps him digest the raw vegetation and maintain balance in his body.\nWhy He Left\nAccording to those familiar with his story, Budan Khan left home after facing pressure from his family to get married and lead a settled life. Instead of following that path, he chose solitude in the hills and adopted what he considers a natural way of living.\nHe says he observed monkeys and learnt what leaves to eat and what not. He walks a great distance inside the forest everyday and does a couple of exercises that he already knew to stay in good health.\nDespite surviving solely on forest greens, Budan Khan reportedly maintains a well-built and fit physique. Observers have described him as having a six-pack body, a detail that has surprised many locals and drawn curiosity about his unusual diet and routine.\nHis parents and two brothers live in the nearby village. “We tried to convince him to come back home many times. The minute we speak about him getting married, he stops talking to us altogether. So we said, he can stay unmarried but come and live with us. He doesn’t want to come at all, he is happy in the wild. We don’t have much option when he is that stubborn, so we just left him be” says Khan’s mother.\nIn the hills of Belagavi, away from kitchens and crowded streets, his life continues quietly, rooted in leaves, routine and isolation.\nReported By: Chandrakanth Sugandhi, News18 Kannada, Belagavi\nScan the QR code to download the News18 app and enjoy a seamless news experience anytime, anywhere.\nLatest Blogs",
        "link": "https://www.news18.com/buzz/man-survives-on-leaves-for-10-years-in-karnataka-forest-sports-six-pack-body-skn-ws-l-9895175.html",
        "date": "Wed, 11 Feb 2026 14:19:01 +0530",
        "fetched_at": "2026-02-12 04:06:16.157956"
    },
    {
        "title": "‘DMK Will Form Its Own Govt’: Stalin Amid Seat-Sharing Buzz With Congress Ahead Of 2026 Polls",
        "content": "Tamil Nadu Chief Minister MK Stalin expressed confidence that the DMK would form the government on its own in the 2026 Assembly elections. He said the party would contest the polls in alliance with the Congress amid talk of a rift between the allies. His remarks come as seat-sharing discussions for the elections are yet to begin with the Congress.\nSpeaking at a news channel event, Stalin, who is seeking a second consecutive term, spoke about the challenges before the DMK, the NDA factor and his equation with Rahul Gandhi.\nDismissing rumours of tension with the Congress, Stalin said he shared a “brotherly attachment\" with Rahul Gandhi. However, he did not clarify whether the DMK would share power with the Congress if the alliance returned to power.\n“The DMK will form its own government,\" Stalin said, adding that the party was confident of making “even greater inroads\" than in 2021.\n“The DMK-Congress alliance is strong in Tamil Nadu. Will fight the election together. The question of sharing of power in government does not arise now,\" he added.\nIn the 2021 Assembly elections, the DMK won 133 out of 234 seats and formed the government on its own. The Congress, which contested as its ally, won 18 out of 25 seats but was not given any ministerial post.\nThis time, friction has surfaced between the two parties. The Congress has accused the DMK of sidelining it in the state and is demanding a larger share of seats. It has also raised the issue of power sharing if the alliance wins again.\nLast month, Rahul Gandhi met DMK MP Kanimozhi. Discussions reportedly included cabinet posts, a larger share of seats and a Rajya Sabha berth. The DMK has announced that formal seat-sharing talks will begin from February 22.\nStalin launched a sharp attack on the NDA. He said the NDA was not a “double engine\" but a “dabba engine\" or an empty vessel.\nFraming the election as another phase of the Aryan-Dravidian battle, Stalin accused the NDA of spreading “falsehoods, hate and communal tension\" ahead of the polls.\n“The so-called double engine is an empty vessel. It is not a double engine, but a dabba engine,\" he said.\nStalin alleged that the NDA was trying to widen the divide among minorities in the state. He said the people of Tamil Nadu would give the NDA a “great disappointment\" for its actions and that such divisive politics had no place in the state.\nThe remarks come as the BJP is attempting to strengthen its position in Tamil Nadu. The party has brought the Edappadi K Palaniswami-led AIADMK and TTV Dhinakaran’s AMMK into the NDA. The PMK is also part of the alliance.\nLatest Blogs",
        "link": "https://www.news18.com/politics/dmk-will-form-its-own-govt-stalin-amid-seat-sharing-buzz-with-congress-ahead-of-2026-polls-9895237.html",
        "date": "Wed, 11 Feb 2026 13:29:25 +0530",
        "fetched_at": "2026-02-12 04:06:17.033220"
    },
    {
        "title": "Alwar Gets Its First Luxury High-Rise Project, Flats To Be Ready In 6 Months",
        "content": "Luxury high-rise flats have been launched in Alwar, Rajasthan, for the first time, marking a significant shift in the city’s residential landscape. Typically, buyers have to wait several years for possession after a residential or commercial project is formally launched. However, a newly introduced development in the city has generated considerable buzz for a different reason.\nBoots, a company in the infrastructure and construction sector, has formally launched Boots Heights – Aravali Apartments, described as Alwar’s first luxury high-rise residential project.\nThe development signals the beginning of organised vertical living in the city.\nLocated in Surya Nagar, Boots Heights is being presented as the city’s first premium high-rise residential offering, designed for families and professionals seeking an elevated urban lifestyle.\nThe project comprises two towers, each with 15 floors and five apartments per floor, offering a total of 150 modern 2 and 3-BHK flats. The starting price is Rs 5,500 per square foot.\nOne of the most striking aspects of the project is the promise of possession within six months, making it one of the few ready-to-move luxury developments in the region.\nThe project was originally under NBCC, a government company, which has already completed the civil structure. Boots later acquired the project through auction, enabling a faster possession timeline. Buyers are expected to receive their flats within approximately six months.\nThe project is projected to generate revenue of Rs 150 crore.\nBoots Heights is situated on the Delhi-Alwar Road (SH-25), approximately 18 kilometres from the Delhi-Mumbai Expressway. It is also close to Alwar Junction railway station, the central bus depot and the Matsya industrial area.\nIts location in the peaceful neighbourhood of Surya Nagar, combined with proximity to key commercial hubs, positions it as a viable option for both end-users and investors.\nAmong the standout features are open views of the Aravali hills, spacious balconies, large windows and an attractive façade design expected to redefine Alwar’s skyline.\nBoots Heights will offer what is described as Alwar’s largest swimming pool, along with a modern clubhouse, pickleball court, fitness and wellness zone, indoor and outdoor recreation areas, landscaped gardens and dedicated spaces for children and senior citizens.\nThe project includes 24×7 manned security, advanced surveillance systems, controlled entry and exit points, and modern fire safety infrastructure.\nDeepak Rai, Managing Director of Boots, said that the mindset of homebuyers in Alwar is evolving. “People now want not just a house, but better design, facilities and a complete lifestyle,\" he said.\nHe added that Boots Heights has been developed with the vision of bringing a luxury living experience to Alwar that was previously associated mainly with metro cities.\nLatest Blogs",
        "link": "https://www.news18.com/india/alwar-gets-its-first-luxury-high-rise-project-flats-to-be-ready-in-6-months-ws-el-9894386.html",
        "date": "Wed, 11 Feb 2026 12:12:24 +0530",
        "fetched_at": "2026-02-12 04:06:18.685022"
    },
    {
        "title": "'Gender Handbook Too Hardvard-Oriented': CJI Flags Need For Simpler Court Language In Assault Cases",
        "content": "Chief Justice of India Surya Kant on Tuesday observed that the judicial handbook detailing legal terminology was “too much Harvard-oriented\" and emphasised the urgent need for language that can be understood by victims in sexual offence cases and their families.\nHe stressed that terms used by courts in such cases must be simple, accessible, and grounded in real-world understanding, not complex and academically tilted.\nHis remark came in response to submissions in the Supreme Court’s suo moto hearing challenging a controversial March 2025 judgment of the Allahabad High Court that had triggered nationwide criticism for its narrow interpretation of the elements of sexual assault involving a minor girl.\nTHE CONTROVERSIAL ALLAHABAD HIGH COURT ORDER\nThe Supreme Court’s proceedings arise out of an order passed on March 17, 2025, by a single judge of the Allahabad High Court, which held that certain acts, including grabbing the breasts of an 11-year-old victim and breaking the string of her pyjama with the intention of dragging her beneath a culvert, did not constitute the offence of rape or attempt to rape.\nThe accused, identified as Pawan and Akash, allegedly grabbed the breasts of the 11-year-old girl.\nOne of them snapped the pyjama string and attempted to drag her under a culvert, but fled after a passerby intervened.\nThe trial court had initially summoned the accused under Section 376 of the Indian Penal Code (rape) and Section 18 of the POCSO Act (punishment for attempt to commit an offence).\nThe Allahabad High Court modified the summons, ruling that the facts did not prima facie make out an attempt to rape, and instead directed trial only under Sections 9 and 10 of the POCSO Act (aggravated and serious sexual assault) along with a minor charge under Section 354-B IPC (assault with intent to disrobe).\nThe High Court bench stated that because there was no allegation of penetrative sexual assault or sufficient evidence of a determination to commit rape, the offence could not be elevated to attempt to rape.\nTHEN THE SUPREME COURT TOOK A SUO MOTO CASE\nIn reaction to the Allahabad High Court order, the Supreme Court took up the matter on its own motion in March 2025.\nThe top court bench described the High Court’s reasoning as deeply problematic in terms of legal categorisation and criminal justice standards.\nThe bench noted that while Sections 9 and 10 of POCSO provide for punishment for serious sexual assault and that Section 354-B covers certain forms of assault, the threshold for attempt to rape had been incorrectly applied.\nThe Supreme Court agreed with submissions that the High Court’s interpretation did not appropriately reflect the severity and intention in the factual matrix of the incident.\nDuring the February 10, 2026, hearing, senior advocates highlighted that judicial language must not distort or diminish the lived reality of victims, particularly in crimes of a sexual nature.\nCounsel pointed out that terms such as “preparation\" and “forceful penetrative sexual assault\" could be confusing or misleading if applied mechanically without attention to context.\nWHAT CJI KANT SAID ON JUDICIAL LANGUAGE\nReacting to these submissions, Chief Justice Surya Kant stated that the existing judicial handbook’s terms, currently too academic or foreign in orientation, cannot serve justice unless they are translated into plain language that litigants and victims can comprehend.\nThe Chief Justice reiterated that the goal must be clarity, dignity, and accessibility, underscoring that legal terminology should not become a barrier to justice.\n“The handbook is also unfortunately too much Harvard-oriented. Dictionary assistance, we need very simple language. Common man should understand these things, even the victim’s family can understand,\" CJI Kant said.\nHe reiterated that terminology prescribed in manuals or academic texts often fails victims and their families.\n“What is the right word to be chosen is the real challenge,\" the CJI said in court.\nOn whether to frame guidelines immediately, the CJI said the court would first seek a time-bound report from the National Judicial Academy, with input from domain experts and law academics.\n“We will ask the National Judicial Academy to submit a time-bound report.\"\n“Unless we dispose of the main case, the IA (Intervention Application) cannot be entertained,\" he said.\nIn response to an intervention application by the Kerala State Legal Services Authority seeking age-appropriate language for judges, the CJI stressed that first, the substantive matter involving the victim must be resolved, after which the court would move to guideline framing.\nHe added that judicial language must be calibrated to factual scenarios and the decency owed to victims, saying:\n“Even a simplified dictionary will not be helpful. It has to be something which can even run into volumes. Work on a pan-India basis is needed.\"\nThe CJI also announced plans for periodic judicial sensitisation.\nLatest Blogs",
        "link": "https://www.news18.com/india/cji-surya-kant-gender-handbook-harvard-oriented-urges-simple-court-language-sexual-assault-cases-ws-l-9894174.html",
        "date": "Wed, 11 Feb 2026 11:07:35 +0530",
        "fetched_at": "2026-02-12 04:06:19.616374"
    },
    {
        "title": "Uttar Pradesh Budget 2026 LIVE: Employment Generation, Youth Empowerment, Key Focus Areas Of UP Govt",
        "content": "Uttar Pradesh State Budget 2026-27 LIVE Updates: Uttar Pradesh Finance Minister Suresh Khanna on Wednesday presented a Rs 9.13 lakh crore Budget for the financial year 2026-27 in the state Assembly, marking an increase of about 12.2 per cent over the previous year’s outlay.\nTabling the Budget before the House, Khanna said the state government is always fully committed to fiscal management and debt control.\nEarlier on February 9, the budget session of the Uttar Pradesh assembly began with the Governor’s address and is set to conclude on February 20.\nThe Uttar Pradesh government has highlighted employment generation, youth empowerment and large-scale recruitment across departments as key achievements and priorities in the 2026-27 state Budget.\nSamajwadi Party MP Awadhesh Prasad on Wednesday expressed scepticism regarding the Uttar Pradesh State Budget 2026-27, saying that there’s nothing in the central budget for Uttar Pradesh or Ayodhya, and this budget has nothing to do with the state’s farmers, youth, or labourers.\nUttar Pradesh Finance Minister Suresh Khanna on Wednesday presented a Rs 9.13 lakh crore Budget for the financial year 2026-27 in the state Assembly, marking an increase of about 12.2 per cent over the previous year’s outlay.\nTabling the Budget before the House, Khanna said the state government is always fully committed to fiscal management and debt control.\nPresenting the Budget, the Uttar Pradesh Finance Minister Suresh Khanna said, “During the previous and present tenure of our government, the state has witnessed all-round development, be it strengthening of law and order, expansion of infrastructure facilities, industrial investment, employment generation, women empowerment, skill development of youth, prosperity of farmers and poverty alleviation.”\n“The GSDP of the state for the year 2024-2025 has been estimated at Rs 30.25 lakh crore, which reflects an increase of 13.4 per cent compared to the previous year,” he added.\nUttar Pradesh Finance Minister Suresh Khanna on Wednesday presented the Budget 2026-27 in the State Legislative Assembly.\n#WATCH | Lucknow | Uttar Pradesh Finance Minister Suresh Khanna presents State Budget 2026-27 in State Legislative Assembly\n“During the previous and present tenure of our government, the state has witnessed all-round development, be it strengthening of law and order, expansion… pic.twitter.com/kUzBQaUxgT\n— ANI (@ANI) February 11, 2026\nThe Uttar Pradesh government will present the biggest budget in the history of the state today, Deputy Chief Minister Brajesh Pathak said.\n“This is the biggest budget in terms of figures in the history of the state. It will strengthen the state’s infrastructure, accelerate development, and improve basic services such as water, electricity, roads, schools, and hospitals. The most important thing is that this budget will prove to be a milestone in raising the standard of living of women, youth, farmers and the poor, that is, the common man, and will be a budget that will fulfil the resolve of Prime Minister Narendra Modi for a developed India,” Pathak was quoted by news agency ANI.\nAs the Uttar Pradesh government prepares to present its budget on Wednesday, Chief Minister Yogi Adityanath highlighted what he described as a transformative decade for the state under Prime Minister Narendra Modi’s leadership.\nIn a post on ‘X’, CM Yogi said, “New Uttar Pradesh in a New India” has experienced unprecedented development and prosperity over the past ten years.\nCalling the upcoming budget a “decennial testament,” the Chief Minister said it reflects his government’s sustained commitment to the aspirations of the state’s 25 crore citizens.\nLatest Blogs",
        "link": "https://www.news18.com/india/up-budget-2026-live-updates-cm-yogi-suresh-khanna-key-announcements-uttar-pradesh-state-budget-2026-27-highlights-liveblog-9894237.html",
        "date": "Wed, 11 Feb 2026 14:38:46 +0530",
        "fetched_at": "2026-02-12 04:06:20.499651"
    },
    {
        "title": "Parliament Budget Session 2026 Live Updates: Govt Says Rahul Gandhi Misled House, To File Privilege Notice Against Him",
        "content": "Budget Session Of Parliament 2026 Live Updates: Lok Sabha Leader of Opposition Rahul Gandhi on Wednesday spoke on the Union Budget and India-US trade deal in the Lower House following several days of opposition protests over his earlier remarks about former Army Chief General MM Naravane’s unpublished memoir. His remarks triggered an uproar in the House, with the government accusing him of misleading the House.\nFurther, Parliamentary Affairs Minister Kiren Rijiju has said that the government will file a privilege notice against Rahul Gandhi, alleging that he made baseless allegations.\nIt is learnt that the suspension of eight Opposition MPs will remain in force. Further, the Opposition staged a walkout from the Lok Sabha over the MP suspension issue.\nOn Tuesday, as both Houses discussed the Budget, the Opposition MPs took the opportunity to slam the Centre over the framework of the India-United States interim trade agreement.\nFurther, the Opposition has submitted a no-confidence notice against Lok Sabha Speaker Om Birla. Gaurav Gogoi, Deputy Leader of Congress in Lok Sabha, said the notice, signed by 118 Opposition MPs, was submitted under Article 94-C of the Constitution to the Lok Sabha Secretary-General. Notably, the Trinamool Congress (TMC) chose not to sign the notice. According to media reports, the discussion on the motion to remove the Speaker could take place on March 9.\nMeanwhile, BJP women MPs wrote to Speaker Birla, urging him to take “strictest possible action” under parliamentary rules against certain Opposition MPs following disruptions in the House on February 4. Follow for Live updates.\nUnion Minister Pralhad Joshi responded to Rahul Gandhi’s remarks, saying that allegations against a member of the House require proper notice. He added that if the person in question is not a member, making such claims is unacceptable. Joshi criticised Gandhi’s approach, stating, “Simply bringing a piece of paper and saying, ‘I authenticate, I authenticate,’ does not make it authentic. He should understand this. He does not understand the meaning of authentication or even the rules. That is why he says anything.”\nUnion Parliamentary Affairs Minister Kiren Rijiju accused Congress leader Rahul Gandhi of misleading the Lok Sabha on Wednesday and announced plans to file a privilege notice against him. Rijiju alleged that Gandhi’s remarks during the House proceedings contained inaccuracies that misrepresented facts.\nBJP MP Anurag Thakur described the Union Budget as driving the government’s vision of a “Viksit Bharat,” calling it the “Vikas Express” propelling the nation forward. He highlighted the wide range of sectors set to benefit, noting them from A to Z, and emphasised that the government’s fiscal plan aims to ensure inclusive growth across industries and social groups.\nBJP MP Anurag Thakur described the Union Budget as driving the government’s vision of a “Viksit Bharat,” calling it the “Vikas Express” propelling the nation forward. He highlighted the wide range of sectors set to benefit, noting them from A to Z, and emphasised that the government’s fiscal plan aims to ensure inclusive growth across industries and social groups.\nResponding to the Union Budget discussion in the Lok Sabha, BJP MP Anurag Thakur lauded Indian women for their leadership and financial skills. “Indian women are born economists with rare foresight and natural accountants by instinct,” he said, noting that the Budget not only supports the poor through welfare initiatives but also empowers women, aids farmers, and opens up opportunities for the youth.\nDuring the Budget Session 2026, IT Minister Ashwini Vaishnaw emphasised that India’s digital infrastructure and data are fully secure, dismissing Rahul Gandhi’s claims of a potential data threat. “India’s data is secure,” the Minister said.\n#WATCH | Delhi | Union Minister Ashwini Vaishnaw says, “The data in India is secured under the Data Protection Act. All sensitive sectors in the country have their own regulations. Things should be authenticated before levelling allegations.” pic.twitter.com/LjWGQOiuaw\n— ANI (@ANI) February 11, 2026\nUnion Parliamentary Affairs Minister Kiren Rijiju responded to Rahul Gandhi’s criticism, asserting that India’s sovereignty and national interests cannot be compromised. “Nobody can sell India,” Rijiju said, emphasising the government’s commitment to protecting the country’s economic and strategic interests.\nBJP MP Anurag Thakur addresses the Lok Sabha on Wednesday.\nRahul Gandhi pointed out that people generate data, and with its 1.4 billion population, India has one of the largest data reserves globally. “Everybody talks about AI, but talking about AI is like talking about an internal combustion engine without petrol. The petrol for AI is data,” he said.\nLoP Rahul Gandhi stated in the Lok Sabha that India should never be equated with Pakistan in diplomatic or strategic matters. “We will not be made equal to Pakistan,” he declared, highlighting India’s distinct global stature, economic power, and robust democratic framework.\nContinuing his speech, Rahul Gandhi stressed that India needs to focus on energy security amid a volatile global landscape. Highlighting changing geopolitical dynamics, he urged that the country’s foreign policy should be driven by national interests and strategic considerations, particularly regarding energy resources and international alliances.\nCongress leader Rahul Gandhi on Wednesday said Prime Minister Narendra Modi was mistaken in claiming that the “era of war is over.” Addressing the Lok Sabha, Gandhi contended that ongoing global conflicts and rising geopolitical tensions suggest the opposite.\nDuring the Parliament Budget Session 2026, Leader of Opposition Rahul Gandhi said that energy and finance are increasingly being used as strategic weapons in today’s world. Speaking in the Lok Sabha, he argued that global conflicts and geopolitical tensions have reshaped economic policies.\nLeader of Opposition in Lok Sabha Rahul Gandhi on Wednesday spoke on the Union Budget in the Lok Sabha.\nShortcomings have been identified in the no-confidence motion notice submitted by Opposition MPs seeking the removal of Lok Sabha Speaker Om Birla, ANI reported, citing Sources said, on Wednesday. The notice reportedly referred to events of February 2025 four times, which, under parliamentary rules, could have been grounds for its rejection.\nThe Opposition on Wednesday staged a walkout from the Lok Sabha in protest against the suspension of eight MPs, highlighting their disagreement with the decision and expressing dissent over the handling of the issue in the House.\nAccording to govt sources, the suspension of eight Lok Sabha MPs is unlikely to be revoked, suggesting that the disciplinary action against them will remain in place for the time being.\nUnion Parliamentary Affairs Minister Kiren Rijiju on Wednesday claimed that 20-25 Congress MPs entered the Lok Sabha Speaker Om Birla’s chamber and “abused him”, with senior leaders like Priyanka Gandhi Vadra and KC Venugopal present and encouraging the confrontation. He noted that the Speaker remained calm and tolerant, warning that stricter actions could have been taken otherwise.\nUnion Parliamentary Affairs Minister Kiren Rijiju on Wednesday criticised Congress leader Rahul Gandhi, saying he cannot “teach lessons” to him and questioning the ideology behind his actions. He urged senior Congress members to guide him, emphasising that Parliament should not function like a playground. Rijiju stressed that the country’s security is a serious matter and should not be misused for political purposes or to undermine anyone’s dignity.\nCommunications Minister Jyotiraditya Scindia addressed the Lok Sabha on Wednesday.\nRajya Sabha proceedings resumed at 11 am on Wednesday.\nLok Sabha proceedings resume at 11 am on Wednesday.\nLeader of Opposition in Lok Sabha, Rahul Gandhi, will intervene in the ongoing discussion on the Union Budget 2026-27 in the Lower House on Wednesday, ANI reported.\nAccording to sources, Lok Sabha Speaker Om Birla has decided, on moral grounds, not to attend House proceedings until the no-confidence motion notice against him is disposed of. Meanwhile, he has instructed the House Secretary-General to review the notice and take appropriate action, according to sources.\nThe Opposition submitted a no-confidence motion against Lok Sabha Speaker Om Birla on Tuesday. According to sources from the Lok Sabha Secretariat, the discussion on the motion is expected to take place on March 9, the first day of the second part of the Budget Session.\nLatest Blogs",
        "link": "https://www.news18.com/india/parliament-budget-session-2026-live-updates-budget-debate-lok-sabha-rajya-sabha-rahul-gandhi-narendra-modi-india-us-trade-deal-latest-news-liveblog-ws-l-9894103.html",
        "date": "Wed, 11 Feb 2026 15:27:11 +0530",
        "fetched_at": "2026-02-12 04:06:21.651922"
    },
    {
        "title": "NEW RULES: Standing Up for 'Vande Mataram' Now Mandatory | Govt Issues Guidelines | News18",
        "content": "In a historic move on February 11, 2026, the Union Home Ministry issued a 10-page directive formalizing the protocol for India's national song, 'Vande Mataram'. For the first time, the government has mandated that the audience must stand at attention whenever the official version is played or sung at government events and schools., , , , , , , n18oc_indiaNews18 Mobile App - https://onelink.to/desc-youtube\nLatest Blogs",
        "link": "https://www.news18.com/videos/india/new-rules-standing-up-for-vande-mataram-now-mandatory-govt-issues-guidelines-news18-9896003.html",
        "date": "Wed, 11 Feb 2026 09:52:15 +0530",
        "fetched_at": "2026-02-12 04:06:22.253137"
    },
    {
        "title": "Over 50% Of Global Exploitation, Racism Complaints By Indian Students Come From Russia: Govt",
        "content": "A new data from the Ministry of External Affairs shows that over half of all complaints of exploitation and racial discrimination by Indian students globally come from Russia, The Times of India reported.\nAccording to the data, Indian students across 196 countries lodged around 350 complaints of harassment, exploitation and racial discrimination in 2025. Of these, more than 200 originated in Russia, with Moscow emerging as the biggest hotspot.\nThe number of complaints from Russia has risen sharply over the past three years, from 68 in 2023 to 78 in 2024, surging to 201 in 2025.\nMost Indian students in Russia are pursuing medical courses, and hail from states including Rajasthan, Gujarat, Andhra Pradesh, Telangana, Kerala and Tamil Nadu. Russia remains a popular destination due to lower tuition fees and relatively easier admission procedures.\nThe issue came into focus following a stabbing incident at the State Medical University in Ufa, in Russia’s Bashkortostan Republic, on Saturday. A 15-year-old school student armed with a knife attacked students in a dormitory, injuring four Indian medical students and two police officers.\nThe Indian Embassy in Moscow said the four students were “stable and recovering well,\" and consular officials from Kazan visited them in hospital. The teenager pleaded guilty and has been remanded to two months’ judicial custody.\nMeanwhile, during a Rajya Sabha question hour in December last year, Minister of State for External Affairs Kirti Vardhan Singh had stressed that the government gives high priority to the welfare and safety of Indian students abroad.\nHe had noted that Indian missions regularly contact students, visit educational institutions, and provide support through the MADAD portal, emergency helplines, emails, and social media, to ensure grievances are addressed promptly.\n“Complaints related to misleading academic programmes or untoward incidents/experiences faced by Indian students abroad are promptly taken up with the concerned educational institutions and/or with the authorities of the host country for necessary action,\" Vardhan had noted.\nLatest Blogs",
        "link": "https://www.news18.com/india/over-50-of-global-exploitation-racism-complaints-by-indian-students-come-from-russia-govt-ws-l-9893802.html",
        "date": "Tue, 10 Feb 2026 22:57:56 +0530",
        "fetched_at": "2026-02-12 04:06:23.158924"
    },
    {
        "title": "No Mandatory Service Charge: Centre As Restaurants Across India Slapped With Hefty Fines",
        "content": "The Centre on Tuesday said that levying a mandatory service charge on food bills violates consumer protection laws, warning that restaurants engaging in the practice are liable to face penalties.\nThe Ministry of Consumer Affairs, Food and Public Distribution said the Central Consumer Protection Authority (CCPA) has taken action against 27 restaurants across the country for what it described as “unfair trade practices\".\nThe action was initiated suo motu under the Consumer Protection Act, 2019, which prohibits the compulsory collection of service charges.\nAccording to the CCPA, automatically adding a service charge to a customer’s bill is unlawful.\nThe authority cited violations under Section 2(47) of the Act, which defines unfair trade practices. As part of the enforcement drive, Café Blue Bottle in Patna was fined Rs 30,000, while Mumbai-based restaurant China Gate was penalised Rs 50,000 for levying a default 10 per cent service charge on customers.\nThe ministry noted that the Delhi High Court, in March 2025, upheld the CCPA’s guidelines, affirming that mandatory collection of service charges by hotels and restaurants is contrary to law.\nUnder these guidelines, hotels and restaurants are barred from automatically or compulsorily adding a service charge to food bills, or collecting it under any alternative name.\nEstablishments must clearly inform customers that payment of a service charge is voluntary and optional, and cannot deny entry or services to those who refuse to pay it. The guidelines also specify that service charges cannot be subjected to GST.\nActing on complaints received through the National Consumer Helpline, the CCPA has directed erring restaurants to refund the full amount charged to consumers, immediately discontinue the practice, and remove the default inclusion of service or similar charges from their billing systems.\nThe ministry said enforcement action will continue to ensure compliance and protect consumer rights.\nLatest Blogs",
        "link": "https://www.news18.com/india/no-mandatory-service-charge-centre-as-restaurants-across-india-slapped-with-hefty-fines-9893774.html",
        "date": "Tue, 10 Feb 2026 22:14:20 +0530",
        "fetched_at": "2026-02-12 04:06:24.031824"
    },
    {
        "title": "AI Misinfo, Deepfake Under Scanner As Govt Brings Tougher IT Rules For Social Media Platforms",
        "content": "The government has notified a new law and revised guidelines aimed at tackling deepfakes and misleading AI-generated content on the internet, requiring platforms and users to clearly disclose material that is not real and significantly tightening timelines for takedown of harmful content.\nUnder the new framework, anyone uploading AI-generated or AI-altered photos, videos or audio, including deepfakes, will be required to declare that the content has been created or modified using artificial intelligence. Social media platforms such as Facebook, Instagram, YouTube and X will also be mandated to clearly label AI-generated content so users are not misled into believing it depicts a real person or a real event.\nThe law further mandates that AI-generated files carry embedded digital tracking, or metadata, enabling experts to identify the AI tool used to create the content. Platforms have been barred from allowing the removal or suppression of such labels or associated metadata once applied, a move aimed at strengthening traceability and accountability in cases of misuse.\nTaking cognisance of the spread of AI-based deepfakes, the IT Ministry has set a strict three-hour deadline for social media intermediaries to take down AI-generated or deepfake content once it is flagged by the government or ordered by a court. Earlier, platforms had up to 36 hours to remove such content. Grievance redressal timelines have also been tightened, with platforms now required to acknowledge user complaints within two hours, down from 24, and resolve them within seven days instead of 15.\nThe revised guidelines also direct social media companies to deploy reasonable and appropriate technical measures, including automated tools, to detect and prevent the circulation of illegal, sexually exploitative or deceptive AI-generated content. Platforms must ensure that users are not allowed to create, publish or disseminate synthetically generated information that violates existing laws, including the Bharatiya Nyaya Sanhita, the POCSO Act and the Explosive Substances Act.\nAdditionally, intermediaries have been instructed to periodically inform users — at least once every three months — about the consequences of violating rules related to AI misuse through their terms of service, privacy policies or other appropriate means. Where violations are detected, platforms are required to take “expeditious and appropriate action\".\nThe changes are intended to curb the misuse of artificial intelligence, improve transparency online and ensure faster action against harmful digital content, even as social media platforms have already begun rolling out features that allow users to label content generated or modified using AI.\nLatest Blogs",
        "link": "https://www.news18.com/india/social-media-firms-asked-to-remove-harmful-content-within-3-hours-as-govt-notifies-new-it-act-rules-9893032.html",
        "date": "Tue, 10 Feb 2026 19:12:38 +0530",
        "fetched_at": "2026-02-12 04:06:25.820618"
    },
    {
        "title": "Govt Is Working On A Strategy For Real-Time Reporting Of Cybercrimes: Amit Shah",
        "content": "Union Home Minister Amit Shah on Tuesday said the Ministry of Home Affairs has put in place a comprehensive and multi-dimensional strategy to tackle cybercrime, with a strong focus on real-time reporting of cyber incidents.\nSpeaking at a national conference on ‘Tackling Cyber-Enabled Frauds and Dismantling the Ecosystem’, organised by the Central Bureau of Investigation (CBI), Shah said cybercrime has evolved beyond financial fraud and now poses serious challenges to the country’s digital security.\nThe Home Minister said the government’s strategy rests on several key pillars, including real-time reporting of cybercrime, the creation of a robust network of forensic laboratories, capacity building of enforcement agencies, research and development, promotion of cyber awareness, and ensuring cyber hygiene across cyberspace.\n“Our goal is to bring together all stakeholders to create a secure and trustworthy digital ecosystem,\" Shah said, adding that agencies such as the CBI, National Investigation Agency (NIA), Reserve Bank of India (RBI), state police forces and other investigating bodies are being integrated into a coordinated framework to combat cyber threats effectively.\nHe noted that the rapid growth of digital transactions and UPI-based payments has made cybersecurity a critical national priority.\nWhile acknowledging that cyber fraud cases have increased alongside India’s expanding digital footprint, Shah said sustained and coordinated measures are being taken to counter emerging threats.\nHighlighting institutional coordination, the Home Minister referred to platforms such as I-Force, established to facilitate real-time cooperation among enforcement agencies. He said the initiative has delivered results and will now be further strengthened with deeper inter-agency collaboration.\nProviding an update on enforcement efforts, Shah said agencies led by the Indian Cyber Crime Coordination Centre (I4C) have so far saved or frozen over Rs 8,000 crore of the nearly Rs 20,000 crore lost to cyber fraud until November 30, 2025.\nDuring this period, around 82 lakh cybercrime complaints were received, resulting in the registration of 1.84 lakh FIRs.\nHowever, Shah cautioned that cybercriminal networks are becoming increasingly organised and technologically advanced, often staying ahead of law enforcement.\nHe urged participants at the conference to intensify efforts and take the fight against cybercrime to the next level.\nThe Home Minister also said that while 62 banks and financial institutions have already been onboarded onto the secure framework, the government aims to bring all cooperative banks under its ambit by December 31 to further strengthen safeguards within the financial system.\nLatest Blogs",
        "link": "https://www.news18.com/india/data-is-being-stolen-and-sold-to-enemies-amit-shah-says-govt-stepping-up-cybersecurity-efforts-ws-l-9892983.html",
        "date": "Tue, 10 Feb 2026 21:16:10 +0530",
        "fetched_at": "2026-02-12 04:06:26.453102"
    },
    {
        "title": "Bird Flu Alert In Andhra Pradesh: High Vigilance In One District, Government Issues Advisory",
        "content": "Bird flu, also known as avian influenza, has triggered fresh concern in parts of Andhra Pradesh, prompting the state government to step up surveillance and containment measures. While officials stress that the situation remains under control, precautionary steps have been intensified not only in the affected pockets but also in neighbouring villages and districts to prevent further spread.\nDeaths of country chickens were reported from parts of Chittoor and Annamayya districts, prompting the Animal Husbandry Department to send samples to the Bhopal-based National Institute of High Security Animal Diseases for testing.\nState minister Kinjarapu Atchannaidu has urged people not to panic, stating that the outbreak is being handled through coordinated action by animal husbandry and local administrative teams. He stressed that early detection and rapid response are helping authorities keep the risk contained.\nCases Surface In Annamayya District\nThe immediate alert was issued after suspected bird flu cases emerged in Sadum mandal of Annamayya district. Unusual bird deaths were reported in villages such as Puttavaripalli and Ammagaripalli, prompting swift intervention by officials. Once the infection was suspected, special Rapid Action Teams were deployed to the area.\nThese teams are carrying out scientific culling of infected birds, disinfecting poultry farms and surrounding zones, and restricting the movement of birds and farm equipment. Such containment protocols are standard practice to stop avian influenza from spreading to healthy flocks.\nSurveillance Extended To Chittoor\nAuthorities have also widened monitoring to nearby regions after reports of unexplained bird deaths surfaced in parts of Chittoor district, including Karvetinagaram mandal. Samples from affected birds have been collected and sent to the National Institute of High Security Animal Diseases laboratory in Bhopal for confirmatory testing. Officials said further action will depend on laboratory findings.\nGuidelines For Poultry Farmers\nThe Animal Husbandry Department has issued continuous advisories to poultry farmers in and around affected zones. Farm owners have been asked to strictly follow biosecurity norms, limit entry of outsiders into poultry sheds, and immediately report any sudden or unusual bird deaths to veterinary officials. Field teams led by senior department officers are visiting villages to spread awareness and ensure compliance with safety protocols.\nNo Need To Fear Cooked Chicken Or Eggs\nAmid rising public concern, the government has clarified that bird flu primarily affects birds and does not pose a risk through properly cooked food. Citizens have been reassured that thoroughly cooked chicken and boiled eggs remain safe for consumption. However, people are advised to maintain basic hygiene, such as washing hands after handling raw meat and avoiding contact with sick or dead birds.\nOfficials remain confident that with early intervention, strict monitoring, and public cooperation, the outbreak can be contained before it spreads to other districts. The focus, they say, is on prevention without triggering unnecessary alarm.\nDeaths of country chickens were reported from parts of Chittoor and Annamayya districts, prompting the Animal Husbandry Department to send samples to the Bhopal-based National Institute of High Security Animal Diseases for testing.\nState minister Kinjarapu Atchannaidu has urged people not to panic, stating that the outbreak is being handled through coordinated action by animal husbandry and local administrative teams. He stressed that early detection and rapid response are helping authorities keep the risk contained.\nCases Surface In Annamayya District\nThe immediate alert was issued after suspected bird flu cases emerged in Sadum mandal of Annamayya district. Unusual bird deaths were reported in villages such as Puttavaripalli and Ammagaripalli, prompting swift intervention by officials. Once the infection was suspected, special Rapid Action Teams were deployed to the area.\nThese teams are carrying out scientific culling of infected birds, disinfecting poultry farms and surrounding zones, and restricting the movement of birds and farm equipment. Such containment protocols are standard practice to stop avian influenza from spreading to healthy flocks.\nSurveillance Extended To Chittoor\nAuthorities have also widened monitoring to nearby regions after reports of unexplained bird deaths surfaced in parts of Chittoor district, including Karvetinagaram mandal. Samples from affected birds have been collected and sent to the National Institute of High Security Animal Diseases laboratory in Bhopal for confirmatory testing. Officials said further action will depend on laboratory findings.\nGuidelines For Poultry Farmers\nThe Animal Husbandry Department has issued continuous advisories to poultry farmers in and around affected zones. Farm owners have been asked to strictly follow biosecurity norms, limit entry of outsiders into poultry sheds, and immediately report any sudden or unusual bird deaths to veterinary officials. Field teams led by senior department officers are visiting villages to spread awareness and ensure compliance with safety protocols.\nNo Need To Fear Cooked Chicken Or Eggs\nAmid rising public concern, the government has clarified that bird flu primarily affects birds and does not pose a risk through properly cooked food. Citizens have been reassured that thoroughly cooked chicken and boiled eggs remain safe for consumption. However, people are advised to maintain basic hygiene, such as washing hands after handling raw meat and avoiding contact with sick or dead birds.\nOfficials remain confident that with early intervention, strict monitoring, and public cooperation, the outbreak can be contained before it spreads to other districts. The focus, they say, is on prevention without triggering unnecessary alarm.\nScan the QR code to download the News18 app and enjoy a seamless news experience anytime, anywhere.\nLatest Blogs",
        "link": "https://www.news18.com/india/bird-flu-alert-in-andhra-pradesh-high-vigilance-in-one-district-government-issues-advisory-shil-ws-l-9892826.html",
        "date": "Tue, 10 Feb 2026 16:45:08 +0530",
        "fetched_at": "2026-02-12 04:06:27.316735"
    },
    {
        "title": "'How Did He Get Book?' BJP Asks Rahul Gandhi Amid Naravane's Memoir Row, Congress Responds",
        "content": "The BJP on Tuesday stepped up its attack on Congress leader Rahul Gandhi, questioning how he obtained a physical copy of former Army chief General MM Naravane’s memoir after its publisher said the book has not yet been released.\nThe controversy centres on Four Stars of Destiny, General Naravane’s memoir, after Penguin Random House India issued a clarification stating that while it holds exclusive publishing rights, the manuscript has not been published “in any form\" so far.\nThe publisher said the statement was issued in view of reports about unauthorised copies being circulated.\nDespite the clarification, Gandhi maintained that the book was publicly available, citing a social media post by General Naravane from December 2023.\nA screenshot of the post shows the former Army chief announcing that his book was “available now\" and directing readers to a link.\nAddressing reporters outside Parliament, Gandhi said the publisher’s claim was questionable. “Here is a tweet from General Naravane which says, ‘Just follow the link to my book.’ Either General Naravane is lying or Penguin is lying, and I do not believe the former Army Chief would lie,\" he said.\nHere is a tweet from Mr Naravane which says, “Just follow the link to my book.\" The point I am making is this: either Mr Naravane is lying, or Penguin is lying. I do not think the former Army Chief would lie. Penguin says the book has not been published, but the book is available… pic.twitter.com/Xtn7gygC2K— Congress (@INCIndia) February 10, 2026\nThe BJP rejected Gandhi’s argument, saying he had misunderstood the difference between a pre-order announcement and an official publication.\nBJP national spokesperson Shehzad Poonwalla accused the Congress leader of misleading Parliament and the public, calling him a “national embarrassment\".\nRahul Gandhi is a national embarrassmentDoesn’t know difference between pre-order and published\nThe tweet he quoted was a Pre-order\nNow the question remains\n— Shehzad Jai Hind (Modi Ka Parivar) (@Shehzad_Ind) February 10, 2026\nGeneral Naravane’s December 2023 post had included an image from Penguin highlighting that Four Stars of Destiny was available for pre-order, a distinction the BJP has emphasised in its response.\nHello friends. My book is available now. Just follow the link. Happy reading. Jai Hind pic.twitter.com/VCiLiZOWIi— Manoj Naravane (@ManojNaravane) December 15, 2023\nHowever, General Naravane on Tuesday himself shared Penguin Random House India’s clarification on the status of his memoir, Four Stars of Destiny, as the controversy over the book’s publication continued to trigger sharp political exchanges.\nCongress MP Karti Chidambaram also reacted to the controversy, saying that anything available in the public domain should be considered as published.\nThe row over the memoir erupted last week during a heated debate in Parliament when Gandhi sought to read excerpts from a book review published by an Indian news website, relating to the 2020 India-China standoff in eastern Ladakh that culminated in the Galwan Valley clash.\nGandhi was stopped by the Speaker, who cited House rules barring unpublished material from being read into the official record.\nAlthough Gandhi offered a personal assurance on the authenticity of the excerpts, he was prevented from reading them out again the following day, triggering sharp exchanges between ruling party and opposition MPs.\nThe disruption led to the suspension of eight opposition MPs for the remainder of the session.\nAmid continued protests, Prime Minister Narendra Modi’s scheduled Lok Sabha address was cancelled, a move the Speaker attributed to opposition members allegedly planning an “attack\" on the Prime Minister.\nSubsequently, Gandhi wrote to Lok Sabha Speaker Om Birla, describing the episode as a “blot on our democracy\" and protesting against what he termed an attempt to silence debate on national security issues.\nLatest Blogs",
        "link": "https://www.news18.com/india/how-did-he-get-the-book-bjp-asks-rahul-gandhi-as-mm-naravanes-memoir-publisher-denies-release-9892696.html",
        "date": "Tue, 10 Feb 2026 20:13:38 +0530",
        "fetched_at": "2026-02-12 04:06:28.190445"
    },
    {
        "title": "'Book Considered Published Only When On Sale': Penguin's Fresh Clarification In Naravane Row",
        "content": "Amid the ongoing controversy over General (Retd.) MM Naravane’s memoir Four Stars of Destiny, Penguin India on Tuesday issued another clarification, stating that an announced title, a pre-order listing and a published book are distinct stages, and that a book is considered published only when it is available for purchase across retail channels.\nIn its latest clarification, the publisher said the presence of a pre-order listing does not amount to publication. “A book is considered published only when it is available for purchase across retail channels,\" Penguin Random House India said, reiterating that Four Stars of Destiny has not been published in any format.\nThe renewed clarification comes after Congress MP Rahul Gandhi questioned the publisher’s stand, alleging inconsistencies over the book’s status. Citing a 2023 post by Naravane that said, “Hello friends. My book is available now. Just follow the link. Happy reading. Jai Hind,\" Rahul Gandhi claimed the tweet suggested the book had been made available. He said either Naravane or Penguin was “lying\" about the release.\nRahul Gandhi is a national embarrassmentDoesn’t know difference between pre-order and published\nThe tweet he quoted was a Pre-order\nNow the question remains\n— Shehzad Jai Hind (Modi Ka Parivar) (@Shehzad_Ind) February 10, 2026\nThe publisher has maintained that the tweet carried only a pre-order link and that the book was withdrawn two days later. Since then, Four Stars of Destiny has remained unavailable on e-commerce platforms, Penguin said.\nAfter Penguin’s second clarification, BJP leader Shehzad Poonawalla, too, attacked Congress MP Rahul Gandhi, calling him a “national embarrassment\" and accusing him of not understanding the difference between a pre-order listing and a published book.\nHe also alleged that Gandhi had misled the country, levelled “completely false\" allegations against Defence Minister Rajnath Singh, and disrupted Parliament on the basis of what he claimed was an incorrect premise.\nEarlier, Penguin India had issued a formal statement on X asserting that it holds the sole publishing rights for the book and that it has not been released. “We wish to make it clear that the book has not gone into publication. No copies of the book, in print or digital form, have been published, distributed, sold, or otherwise made available to the public by Penguin Random House India,\" the publisher said.\nCongress MP Rahul Gandhi triggered a political row after displaying a copy of former Army chief General (Retd.) MM Naravane’s memoir Four Stars of Destiny in the Lok Sabha, drawing strong objections from senior BJP leaders who said the Leader of the Opposition cannot quote in Parliament from an unpublished book.\nLatest Blogs",
        "link": "https://www.news18.com/india/book-considered-published-only-when-on-sale-penguins-fresh-clarification-in-naravane-row-ws-l-9892577.html",
        "date": "Tue, 10 Feb 2026 15:52:14 +0530",
        "fetched_at": "2026-02-12 04:06:29.041308"
    },
    {
        "title": "NHRC Slams Tamil Nadu Govt's Response In Migrant Worker Attack Case, Seeks Clarification",
        "content": "Over a month after a migrant worker from Odisha was assaulted in Tamil Nadu, the National Human Rights Commission (NHRC) has issued a show cause notice to Tamil Nadu Chief Secretary and has directed to ensure all necessary medical treatment, post-trauma counselling, and reimbursement of any treatment costs for the victim.\nNHRC further noted the delayed FIR registration and the sudden disappearance of the victim from the hospital without follow-up searches. In regards to this, the commission asked the Tamil Nadu Director General of Police to submit an explanation within seven days and to trace the victim at the earliest.\nThe Tamil Nadu government has been informed about the migrant worker Suraj, who was brutally attacked with sharp weapons, left the hospital in an injured condition and has since gone missing, with no current information available about him.\nThe incident reportedly took place on December 27 last year, and the victim’s statement was recorded on the same day. However, the FIR was registered the next day after pressure was built up on social media.\nNDRC has accused the state authorities of not making effective efforts to trace the injured victim or identify his family members.\nThe Commission has termed this a serious lapse of the state machinery and a violation of the victim’s right to life and dignity under Article 21 of the Constitution.\nThe Chief Secretary has been directed to submit a detailed explanation and action-taken report on the negligence and lapses on the part of the police and administration.\nLatest Blogs",
        "link": "https://www.news18.com/india/nhrc-slams-tamil-nadu-govts-response-in-migrant-worker-attack-case-seeks-clarification-ws-de-9891831.html",
        "date": "Tue, 10 Feb 2026 13:10:21 +0530",
        "fetched_at": "2026-02-12 04:06:29.944871"
    },
    {
        "title": "India Weighs Role In Trump’s Gaza Peace Board, May Skip Inaugural Summit On February 19",
        "content": "India is yet to take a final decision on joining the Board of Peace for Gaza proposed by US President Donald Trump and is unlikely to attend its inaugural summit scheduled for February 19.\nOfficials said New Delhi is still studying the proposal and assessing its broader diplomatic implications, according to The Economic Times.\nThe issue came up during the recent India–Arab League Foreign Ministers’ meeting, where Arab League members, who have agreed to be part of the board, shared their views with India. However, officials indicated that India is continuing its internal deliberations. The proposal is also expected to be discussed during Prime Minister Narendra Modi’s upcoming visit to Israel, where regional security concerns and Gaza’s future are on the agenda.\nIndia has consistently supported a two-state solution to the Israel–Palestine conflict and is evaluating how participation in the board could affect its long-standing engagement with Palestine. A key concern for New Delhi is the presence of Pakistan and Turkey on the board. Pakistan had earlier been encouraged by the Trump administration to consider deploying stabilisation forces in Gaza, adding another layer of complexity to India’s assessment.\nThe inaugural summit, to be held at the US Institute of Peace in Washington, will bring together leaders who accepted Trump’s invitation earlier this year, along with members of an executive committee tasked with overseeing Gaza’s governance, security and reconstruction.\nWho Will Attend Gaza Peace Board Meeting?\nThe Express Tribune reported, citing sources, that Pakistan has confirmed it will attend the inaugural summit, with officials saying the forum would allow Islamabad to present its position directly to major international stakeholders and push for coordinated efforts to prevent civilian casualties and regional instability.\nMore than 20 countries have joined the Gaza Peace Board so far. Participants include Pakistan, Saudi Arabia, Turkey, Qatar, the United Arab Emirates, Egypt, Jordan, Indonesia, Argentina and Hungary. Israeli Prime Minister Benjamin Netanyahu has accepted an invitation to serve on the board and is expected to be in Washington for separate talks with President Trump. Hungarian Prime Minister Viktor Orban has also confirmed his attendance.\nEight Muslim-majority countries — Saudi Arabia, Turkey, Egypt, Jordan, Indonesia, Pakistan, Qatar and the UAE — are expected to take part, with efforts to present a common position on Gaza. India’s participation remains under active consideration.\nLatest Blogs",
        "link": "https://www.news18.com/india/india-weighs-role-in-trumps-gaza-peace-board-may-skip-inaugural-summit-on-february-19-ws-l-9891928.html",
        "date": "Tue, 10 Feb 2026 12:36:35 +0530",
        "fetched_at": "2026-02-12 04:06:30.865275"
    },
    {
        "title": "‘I Believe Gen Naravane, Don’t Think He’ll Lie’: Rahul Gandhi Reacts To Penguin’s Statement On Book",
        "content": "Amid the ongoing controversy over General (Retd.) MM Naravane’s unpublished memoir, Four Stars of Destiny, Congress MP Rahul Gandhi on Tuesday said that either the former Army chief or publisher Penguin could be lying about the book release.\nReferring to a 2023 post by Naravane, Rahul Gandhi said there is a tweet in which the former Army chief wrote, “Hello friends. My book is available now. Just follow the link. Happy reading. Jai Hind.\"\nRahul said the tweet showed the book being made available and added that either Naravane is lying or the publisher is not telling the truth. “My point is either Mr Narvane is lying or it is Penguin, which is lying. I don’t think the former Army chief will lie. But both can’t be telling the truth. Penguin is saying the book is not published but it’s available on Amazon,\" said the Congress leader.\nHello friends. My book is available now. Just follow the link. Happy reading. Jai Hind pic.twitter.com/VCiLiZOWIi— Manoj Naravane (@ManojNaravane) December 15, 2023\nNaravane’s tweet carried a pre-order link, but two days later the publisher withdrew the book, and since then it has remained unavailable on e-commerce platforms.\nThe statement comes amid a growing controversy over the alleged circulation of unauthorised copies of the manuscript, which has also led to a political row in Parliament.\nThe Delhi Police have registered an FIR and started a probe into what they describe as suspected illegal distribution of material from a publication that has not yet been approved.\nPenguin India issued a formal clarification on X, stating that it holds the sole publishing rights for Four Stars of Destiny and that the book has not been published in any format.\nThe publisher said it was responding to recent public discussion and media reports about the alleged circulation of a pre-print version of the manuscript.\n“We wish to make it clear that the book has not gone into publication. No copies of the book, in print or digital form, have been published, distributed, sold, or otherwise made available to the public by Penguin Random House India,\" the statement said.\nStatement from the publisher. pic.twitter.com/pksacg3EeT— Penguin India (@PenguinIndia) February 9, 2026\nIt said it would exercise legal remedies against any illegal and unauthorised sharing of the book and that the statement was being issued to place the publisher’s position on record.\nLatest Blogs",
        "link": "https://www.news18.com/india/i-believe-gen-naravane-dont-think-hell-lie-rahul-gandhi-reacts-to-penguins-statement-on-book-9891867.html",
        "date": "Tue, 10 Feb 2026 12:51:36 +0530",
        "fetched_at": "2026-02-12 04:06:31.773719"
    },
    {
        "title": "AI Summit: Hotel Room Rates In Delhi Cross Rs 1 Lakh Per Night Next Week, Demand For Govt Price Ceiling",
        "content": "Hotel prices have skyrocketed in New Delhi for the weekend, as the national capital prepares to host the India AI Summit.\nThis has triggered fresh warnings of a growing crisis of excessive pricing during major international events. A comprehensive survey has brought the issue to the fore, revealing that some properties are charging as much as Rs 20 lakh per night for a suite.\nThe survey, conducted by LocalCircles, highlights a pattern of exploitative pricing that typically accompanies major sports tournaments and global summits. According to the data, there is a stark disparity between standard rates and those offered during high-demand periods.\nIn central Delhi, five-star hotels witnessed prices cross Rs 60,000 per night. Even more modest four-star accommodations, which typically cost around Rs 6,000, are being marketed for over Rs 30,000 — a five-fold increase. In some instances, rates have reportedly surged by up to 10 times their standard fees as hotels capitalise on the influx of visitors.\nThis trend mirrors previous spikes seen during the 2023 Cricket World Cup, where prices rose three to five times the regular rate and, in Navi Mumbai, where some hotels charged Rs 5 lakh for a three-night stay during a Coldplay concert.\nThe survey report revealed that 57 percent of the consumers have experienced excessive charging by hotels at least once in the last three years. Of those who have faced these steep rates, 7 percent reported paying inflated prices almost every time they booked a room.\nThe hospitality sector’s current “free market\" approach has left many feeling vulnerable. “Any time there is an international event, hotel room rates skyrocket in India with no upper limit,\" the report stated, pointing out that the ministry of tourism has no regulations to protect consumers from such spikes.\nThe survey reported that this has led to an overwhelming demand for government intervention, with 71 percent of the respondents in favour of a price ceiling. The most popular proposal, supported by 49 percent of those surveyed, is that the maximum rate charged should be restricted to no more than twice the regular rack rate to ensure fair treatment.\nTo ensure these limits are respected, 74 percent of citizens are calling for the appointment of a regulatory body or government agency to oversee compliance, with a separate regulator under the tourism ministry; using the Competition Commission to monitor compliance; and empowering the Central Consumer Protection Authority to handle grievances.\nThe report concludes that while the hospitality sector is vital for job creation and tourism, the Centre must play a “more proactive role\" to ensure the industry remains profitable without subjecting tourists and business visitors to exploitative practices.\nLatest Blogs",
        "link": "https://www.news18.com/india/ai-summit-hotel-room-rates-in-delhi-cross-rs-1-lakh-per-night-next-week-demand-for-govt-price-ceiling-ws-el-9891167.html",
        "date": "Tue, 10 Feb 2026 11:00:35 +0530",
        "fetched_at": "2026-02-12 04:06:32.641773"
    },
    {
        "title": "Gold, Cash Stolen From Congress Minister's Office On Vidhana Soudha Premises In Bengaluru",
        "content": "A theft on the high-security premises of Vidhana Soudha has triggered alarm over possible lapses in access control and monitoring at Karnataka’s seat of power.\nAccording to the complaint filed with the local police, the incident took place in the office of Congress minister Byrathi Suresh, from where a handbag containing about 300 grams of gold jewellery and Rs 1.5 lakh in cash went missing.\nPolice said the bag belonged to Naveen, who had visited the minister’s office for official work.\nHe reportedly carried the handbag with him during the visit but inadvertently left it behind on the office premises.\nNaveen realised the bag was missing only when he returned the following day and subsequently lodged a complaint at the Vidhana Soudha police station.\nDuring the preliminary investigation, officials scrutinised CCTV footage installed inside the complex.\nThe footage, police said, indicated the involvement of a D-group employee attached to the Department of Personnel and Administrative Reforms (DPAR).\nVisuals reportedly showed the employee picking up the handbag from within the office area and leaving with it.\nBased on the evidence, the suspect was identified and taken into custody.\nPolice confirmed that the accused was arrested, and further investigation was underway to establish the sequence of events and whether anyone else was involved in the theft.\nAuthorities have not yet commented on whether additional security audits will be ordered following the incident.\nPolice said further details would emerge as the probe progresses and once questioning of the arrested employee is completed.\nLatest Blogs",
        "link": "https://www.news18.com/india/bag-with-300-grams-of-gold-jewellery-lakhs-of-cash-stolen-bengaluru-vidhana-soudha-congress-byrathi-suresh-office-ws-l-9891430.html",
        "date": "Tue, 10 Feb 2026 10:04:38 +0530",
        "fetched_at": "2026-02-12 04:06:33.538982"
    },
    {
        "title": "Parliament Budget Session Live: Shashi Tharoor Addresses Lok Sabha, Calls Union Budget 'Underwhelming'",
        "content": "Parliament Budget Session Live: The Lok Sabha resumed proceedings at 2 pm on Tuesday after being adjourned twice earlier in the day. As the Budget session continues amid a deadlock, the Opposition submitted a no-confidence notice against Lok Sabha Speaker Om Birla.\nGaurav Gogoi, Deputy Leader of Congress in Lok Sabha, said the notice, signed by 118 Opposition MPs, was submitted under Article 94-C of the Constitution to the Lok Sabha Secretary-General. Notably, the Trinamool Congress (TMC) chose not to sign the notice. Meanwhile, BJP women MPs have written to Speaker Birla, urging him to take “strictest possible action” under parliamentary rules against certain Opposition MPs following disruptions in the House on February 4.\nSeparately, the Parliamentary Standing Committee on External Affairs is scheduled to meet later, with the Foreign Secretary and Commerce Secretary briefing members on the India-US trade deal. The Shashi Tharoor-led committee is expected to debate the deal’s impact on India-Russia relations amid ongoing oil sanctions. Discussions will also cover the EU trade agreement and India-Bangladesh relations. Follow for live updates.\nLeader of Opposition in Lok Sabha, Rahul Gandhi, did not sign the notice of no-confidence motion against Speaker Om Birla, as it is not proper for the LoP to sign a petition for the removal of the Speaker in a parliamentary democracy, ANI reported, citing sources on Tuesday.\nLok Sabha Speaker Om Birla on Tuesday directed the House Secretary-General to examine the no-confidence motion notice against him and take appropriate action, ANI reported, citing sources. The Congress today submitted a notice of no-confidence motion against the Speaker.\nCongress MP Shashi Tharoor on Tuesday addressed the Lok Sabha, presenting his views on the Union Budget.\nLok Sabha proceedings resumed on Tuesday following the submission of a no-confidence notice against Speaker Om Birla. The notice, signed by 118 Opposition MPs, triggered heated debates in the House, though the Trinamool Congress (TMC) chose not to support it. Lawmakers returned to the floor to continue discussions on ongoing legislative business amid heightened political tensions.\nThe Opposition has formally submitted a no‑confidence notice against Lok Sabha Speaker Om Birla to the Secretary‑General, with a total of 118 MPs signing the motion. However, the Trinamool Congress (TMC) chose not to add its support.\nUnion Parliamentary Affairs Minister Kiren Rijiju on Tuesday met senior Opposition MPs on Tuesday in an effort to break the parliamentary logjam, sources said. Congress leaders KC Venugopal and Gaurav Gogoi, Samajwadi Party chief Akhilesh Yadav, Trinamool Congress MP Abhishek Banerjee and BRS leader TR Baalu were present at the meeting. During the discussions, the Opposition insisted on key demands, including that Leader of the Opposition Rahul Gandhi be allowed to speak in the House, suspended MPs be reinstated, and remarks made against women MPs be withdrawn, sources added.\nUnion Parliamentary Affairs Minister Kiren Rijiju on Tuesday accused the Congress of taking pride in what he termed the most degrading conduct by its MPs inside Parliament. In a post on X, Rijiju said the behaviour had diminished the dignity of the House and provoked strong reactions from BJP members during the session.\nThe Lok Sabha has been adjourned again till 2 pm amid Opposition protest.\nLok Sabha proceedings have resumed after being adjourned earlier in the day.\nThe Opposition in the Lok Sabha is set to submit a no‑confidence notice against Speaker Om Birla to the Secretary‑General after 1 pm on Tuesday as part of a coordinated effort to challenge his handling of House proceedings amid repeated adjournments and disputes over speaking rights for Opposition leaders. The move aims to formally initiate a motion under parliamentary rules seeking the Speaker’s removal from office, reflecting deepening tensions in the Budget session between Opposition parties and the ruling side.\nAddressing reporters outside Parliament, Rahul Gandhi reacted to Penguin India’s statement on ex-Army Chief Manoj Naravane’s “unpublished” book, highlighting a contradiction. He pointed to a tweet by Naravane promoting the book’s availability online, saying, “Either Mr Naravane is lying, but I believe… I don’t think he or Penguin is lying, but both can’t be telling the truth. Penguin says the book is not published, but it is available on Amazon.”\nRajya Sabha proceedings are underway.\nThe Lok Sabha remained in deadlock on Tuesday as proceedings were disrupted by sloganeering from opposition members just four minutes after the session commenced. Unable to resume normal business, the Speaker adjourned the House until 12 noon.\nLok Sabha proceedings have begun on Tuesday.\nPrime Minister Narendra Modi arrived in the Parliament for the ongoing Budget Session.\nThe Foreign Secretary and Commerce Secretary are set to brief a parliamentary panel on the India-US trade deal, with intense debate expected in the Tharoor-led committee. Opposition members are likely to seek clarifications on the deal’s impact on India-Russia relations, particularly in light of ongoing oil sanctions. Ahead of the session, External Affairs Minister S. Jaishankar held a detailed briefing yesterday with NDA MPs who are part of the committee. The meeting will also cover discussions on the EU trade deal and India-Bangladesh relations.\nBJP women MPs have written to Lok Sabha Speaker Om Birla, demanding the “strictest possible action, under the rules,” against Opposition MPs who, they allege, disrupted proceedings by tearing papers, entering the treasury benches, and surrounding the Prime Minister. The letter describes these actions as “heinous.”\nLatest Blogs",
        "link": "https://www.news18.com/india/parliament-budget-session-2026-live-updates-lok-sabha-rajya-sabha-opposition-debate-rahul-gandhi-nirmala-pm-modi-liveblog-9891478.html",
        "date": "Tue, 10 Feb 2026 15:12:16 +0530",
        "fetched_at": "2026-02-12 04:06:34.606659"
    },
    {
        "title": "21-Year-Old Maharashtra Woman Administered Injections By Ward Boy Posing As Doctor, Dies",
        "content": "In a shocking incident from Navi Mumbai, police have arrested a ward boy who allegedly posed as a doctor and administered injections to a 21-year-old woman, resulting in her death, an official from the Vashi police station said on Monday.\nThe incident occurred on February 5 in Sector 11 of Vashi. The victim was identified as Prachiti Bhikuram Bhuvad.\nA police official told news agency PTI that the accused, Sandesh Yashwant Pashte, was contacted by the woman’s family after she complained of irregular menstrual cycles.\nAccording to the police, Pashte introduced himself as a doctor and examined the young woman at her residence.\nAs the woman narrated her health issues, the ward boy allegedly informed her that she was suffering from Polycystic Ovary Disorder (PCOD).\nThe ward boy then proposed a treatment plan involving a course of five injections, for which he charged the family Rs 15,000, assuring them that he would personally administer the medication.\nOn February 5, Pashte visited the woman’s home and gave her two injections, the police said.\nShortly after receiving the shots, her condition reportedly worsened rapidly, and she fell unconscious.\nThe Vashi police station official said that the accused appeared panicked following the woman’s collapse, and allegedly asked the woman’s father to dispose of a bag containing used syringes and other medical waste in the trash.\nFamily members then rushed the woman to a nearby hospital, where doctors declared her dead nearly two hours later.\nThe police further said that when confronted by the woman’s relatives, Pashte admitted that he was not a doctor.\nAccording to the official, he confessed to being a ward boy employed at a private nursing home in Andheri in Mumbai and acknowledged that he did not possess any recognised medical qualification or medical certificate.\nFollowing a complaint filed by the family, the police registered a case against Pashte and arrested him on February 6.\nThe accused was booked under the Bharatiya Nyaya Sanhita on charges including culpable homicide not amounting to murder, cheating by personation and other offences.\nPolice said an investigation was underway to determine the exact nature of the injections administered to the woman and to establish further circumstances surrounding her death.\nOfficers were also examining whether the accused had treated other people in a similar manner.\nLatest Blogs",
        "link": "https://www.news18.com/india/navi-mumbai-vashi-ward-boy-poses-as-doctor-administers-injections-to-woman-patient-dies-navi-mumbai-hospital-ward-boy-arrested-ws-l-9891401.html",
        "date": "Tue, 10 Feb 2026 09:28:24 +0530",
        "fetched_at": "2026-02-12 04:06:35.474634"
    },
    {
        "title": "'Not Satisfied With Response': Maithili Thakur Questions Minister Over Condition Of Bihar Hospitals",
        "content": "BJP MLA Maithili Thakur took on her own party’s Health Minister, Mangal Pandey, in the Bihar assembly over the condition of a government hospital in her Alinagar constituency, saying official records did not reflect what she had personally seen on the ground and urging immediate corrective action.\nDuring Question Hour, Thakur rejected the minister’s written reply that suggested the hospital building was not in a severely bad state and only required repairs.\nIn her intervention, she told the House, “I am not completely satisfied with the minister’s response, because it states that the building is not in a bad condition, it just needs to be repaired.\"\n“But I myself have gone and seen that the building is in a bad condition,\" she said.\nShe went on to describe how limited infrastructure and manpower were affecting patient care, saying, “There is a health care system running in a small room there. There is no MBBS doctor, there were two MBBS doctors there in the past, but not now.\"\nReferring to the reply’s mention of another category of doctor, she added, “It is written in the answer that there is another specialist, to which I agree, but we need two MBBS doctors there.\"\nFraming her remarks, the legislator said, “I am not ordering the minister, I am just making a request to him.\"\nShe underlined Pandey’s long association with the health department, noting, “Because I was very young, and since then I have been seeing the health minister as a minister. I have been seeing him working in the health department. So I want him to do it for the benefit of the public, because it is very important.\"\nStressing the scale of dependence on the facility, Thakur told the House, “Five to seven panchayats depend on this hospital. It is clearly believed that 40,000 to 50,000 people benefit from this hospital.\"\nShe also highlighted its strategic location within her constituency, saying, “And this hospital is in the centre of my entire committee, with which the two branches, Ghanshyampur and Alinagar, both can benefit from it.\"\nConcluding her intervention, she urged focused attention on the matter.\n“So I would like to request him to pay special attention to this. Thank you.\"\nThe episode drew attention because it came from a ruling-party legislator of the Bharatiya Janata Party publicly pressing a senior minister from her own side.\nIn his response placed before the House, Pandey had maintained that the government was addressing infrastructure concerns, pointing to approvals for new hospital buildings in several areas, ongoing construction at some sites, and a phased plan to repair or renovate facilities identified as extremely dilapidated.\nLatest Blogs",
        "link": "https://www.news18.com/india/maithili-thakur-questions-bihar-mangal-pandey-over-condition-of-hospitals-need-more-doctors-ws-l-9891333.html",
        "date": "Tue, 10 Feb 2026 08:41:07 +0530",
        "fetched_at": "2026-02-12 04:06:36.376289"
    },
    {
        "title": "'No Copies Published': Penguin India On Row Over Circulation Of Ex-Army Chief's Pre-Print Book",
        "content": "Penguin Random House India has issued a formal clarification on social media platform X, stating that it holds the sole publishing rights for ‘Four Stars of Destiny’, the memoir of former Army chief Manoj Mukund Naravane, and emphasising that the book has not yet been published in any format.\nIn its post, the publisher said it was responding to “recent public discourse and media reporting\" around the alleged circulation of a pre-print version of the manuscript.\n“We wish to make it clear that the book has not gone into publication. No copies of the book, in print or digital form, have been published, distributed, sold, or otherwise made available to the public by Penguin Random House India,\" the company said.\nThe publisher added that it “shall be exercising remedies available in law against the illegal and unauthorised dissemination of the book,\" concluding that the note was being issued “to place the publisher’s position on record.\"\nStatement from the publisher. pic.twitter.com/pksacg3EeT— Penguin India (@PenguinIndia) February 9, 2026\nThe post comes amid a police investigation into claims that an unpublished version of the memoir is being shared online.\nA political fallout was also trigerred and a row erupted after Congress leader Rahul Gandhi attempted to quote from what he described as the pre-print book during his speech in the Lok Sabha on the motion of thanks to the President’s Address, drawing strong objections from treasury benches and repeated adjournments before the motion was eventually adopted by voice vote.\nGandhi was later seen flashing a purported copy of the book in the Parliament complex, and the issue led to major disruptions in the House, culminating in the suspension of eight MPs for the remainder of the Budget session.\nThe Delhi Police said it had taken cognisance of information circulating on social media platforms and news forums alleging that a pre-print copy of ‘Four Stars of Destiny’ was available without mandatory clearance from relevant authorities.\nAn official told news agency ANI that on verification, police found that “a PDF copy of a typeset book with the same title, apparently prepared by M/S Penguin Random House India Pvt. Limited, is available on certain websites,\" and that some online marketing platforms had displayed the finished book cover “as if it is available for purchase.\"\nThe Special Cell subsequently registered a case to investigate what was described as a “purported leak/breach of a yet to be approved publication.\"\n“The Delhi Police has taken cognisance of information circulating on social media platforms and online news forums claiming that a pre-print copy of a book titled ‘Four Stars of Destiny’ is being circulated without mandatory clearance from competent authorities,\" the police statement said.\nPolice reiterated that the required clearance for publication was still awaited and that the probe would examine how the material surfaced in the public domain.\nLatest Blogs",
        "link": "https://www.news18.com/india/four-stars-of-destiny-naravane-unpublished-book-penguin-random-house-india-clarification-sole-publishing-rights-rahul-gandhi-parliament-row-ws-l-9891217.html",
        "date": "Tue, 10 Feb 2026 07:01:09 +0530",
        "fetched_at": "2026-02-12 04:06:37.245111"
    },
    {
        "title": "‘Book Not Published’: MM Naravane's Memoir Publisher Reacts After Delhi Police's FIR",
        "content": "Penguin Random House India on Monday issued a statement clarifying that the memoir of former Indian Army Chief General Manoj Mukund Naravane, ‘Four Stars of Destiny‘, has not been published, following a Delhi Police FIR over the alleged circulation of the book online.\nThe publisher said it holds the sole publishing rights for the memoir and stressed that no copies—printed, digital, or otherwise—have been released to the public.\n“We wish to make it clear that the book has not gone into publication. No copies of the book – in print or digital form – have been published, distributed, sold, or otherwise made available to the public by Penguin Random House India,\" the statement said.\nStatement from the publisher. pic.twitter.com/pksacg3EeT— Penguin India (@PenguinIndia) February 9, 2026\nThe publisher also said it would pursue all legal remedies available against unauthorised dissemination. “Penguin Random House India shall be exercising remedies available in law against the illegal and unauthorised dissemination of the book. This statement is being issued to place the publisher’s position on record,\" it added.\nThe FIR comes after reports emerged that a pre-publication version of ‘Four Stars of Destiny‘ was circulating online without the mandatory clearances. Delhi Police said they acted after information surfaced on social media and news forums suggesting the book was being shared before official approval.\nDuring verification, investigators found a PDF version of a typeset book with the same title available on certain websites. Some online platforms were also displaying the finished book cover as if it were available for purchase.\nThe memoir, written by General Naravane, who served as the 28th Chief of Army Staff from 31 December 2019 to 30 April 2022, is expected to cover his nearly four-decade-long career, from Second Lieutenant to Army Chief.\nIt reportedly offers insights into key moments, including India’s most serious military standoff with China since 1962.\nLatest Blogs",
        "link": "https://www.news18.com/india/book-not-published-mm-naravanes-memoir-publisher-reacts-after-delhi-polices-fir-ws-l-9891099.html",
        "date": "Mon, 9 Feb 2026 23:22:19 +0530",
        "fetched_at": "2026-02-12 04:06:38.108071"
    },
    {
        "title": "Heatwave Grips Kerala, Disaster Authority Issues Safety Advisory",
        "content": "The Kerala State Disaster Management Authority (KSDMA) has issued a public advisory warning residents of rising temperatures across Kerala and urging people to take precautions to avoid heat-related illnesses.\nAccording to the advisory, several parts of the state are experiencing above-normal temperatures, with conditions expected to worsen during peak daytime hours. The authority cautioned that prolonged exposure to heat could lead to dehydration, heat exhaustion and heatstroke, particularly among vulnerable groups such as children, the elderly, outdoor workers and those with pre-existing health conditions.\nThe KSDMA advised people to avoid direct sunlight between late morning and afternoon, drink plenty of water even if not feeling thirsty, and wear light, loose cotton clothing. Residents have also been asked to limit strenuous physical activity during the hottest parts of the day and ensure proper ventilation indoors.\nSpecial instructions were issued for schools, construction workers and those employed in agriculture and other outdoor occupations. Employers were urged to adjust work timings, provide shaded rest areas and ensure access to drinking water.\nThe disaster management authority also warned against leaving children or pets inside parked vehicles and advised the public to check on elderly neighbours and those living alone. In case of symptoms such as dizziness, nausea, headaches or confusion, people were asked to seek medical help immediately.\nOfficials said the situation is being closely monitored and further advisories may be issued depending on how weather conditions evolve in the coming days.\nLatest Blogs",
        "link": "https://www.news18.com/india/heatwave-grips-kerala-disaster-authority-issues-safety-advisory-ws-el-9890969.html",
        "date": "Mon, 9 Feb 2026 21:47:45 +0530",
        "fetched_at": "2026-02-12 04:06:39.096687"
    },
    {
        "title": "“Unprecedented Ghee Adulteration”: Dairy Adulterated Nearly 7 Million Kg, Says Author Ranganathan",
        "content": "| \"This dairy had adulterated close to 7 million kilograms of ghee, this is unprecedented\": @ARanganathan72 n18oc_indian18oc_politicsNews18 Mobile App - https://onelink.to/desc-youtube\nLatest Blogs",
        "link": "https://www.news18.com/videos/india/unprecedented-ghee-adulteration-dairy-adulterated-nearly-7-million-kg-says-author-ranganathan-9890776.html",
        "date": "Mon, 9 Feb 2026 19:36:15 +0530",
        "fetched_at": "2026-02-12 04:06:39.996773"
    },
    {
        "title": "Delhi Police File FIR Over Circulation Of Ex-Army Chief’s Unpublished Book Amid Parliament Row",
        "content": "Delhi Police on Monday registered a case over the alleged leak of a pre-publication copy of Four Stars of Destiny, the memoir of former Army Chief General Manoj Naravane, after reports surfaced that the book was circulating online without mandatory clearances.\nAccording to the police, they took cognisance of information found on social media platforms and news forums claiming that a pre-print version of the book was in circulation, even though official approval for its publication had not yet been granted by the competent authorities.\nDuring verification, investigators found that a PDF version of a typeset book bearing the same title, apparently prepared by publisher Penguin Random House India Pvt. Ltd., was available on certain websites.\nIn addition, some online marketing platforms were found displaying the finished book cover as if the title were available for purchase.\nIn view of the suspected breach and unauthorised circulation of an unpublished work, Delhi Police said a case has been registered with the Special Cell and a detailed investigation is underway to ascertain the source of the leak and the extent of the violation.\nFour Stars of Destiny is a memoir chronicling nearly four decades of General Naravane’s service in the Indian Army, tracing his journey from a Second Lieutenant to Chief of the Army Staff.\nThe book reportedly offers insights into key moments of his career, including India’s most serious military standoff with China since the 1962 conflict.\nPenguin Random House India is the publisher of the memoir.\nThe controversy surrounding the book gained attention during the post-Budget session of Parliament.\nAs Prime Minister Narendra Modi was set to move the Motion of Thanks on the Union Budget, Lok Sabha proceedings were disrupted after Congress leader Rahul Gandhi read out portions of a magazine article said to be based on General Naravane’s unpublished memoir.\nThough Gandhi spoke for only a few minutes, his remarks drew sharp reactions from the BJP leadership.\nUnion Home Minister Amit Shah and Defence Minister Rajnath Singh accused the Leader of the Opposition of citing material from an unpublished book.\nSingh questioned the propriety of referring to content that had not formally entered the public domain.\nWithin days, Gandhi returned to Parliament holding a copy of Four Stars of Destiny, saying he intended to “gift it to the Prime Minister\", further fuelling the political controversy.\nLatest Blogs",
        "link": "https://www.news18.com/india/delhi-police-file-case-over-alleged-leak-of-former-army-chief-naravanes-four-stars-of-destiny-9890754.html",
        "date": "Mon, 9 Feb 2026 20:04:32 +0530",
        "fetched_at": "2026-02-12 04:06:40.910853"
    },
    {
        "title": "‘More Will Get It’: DK Shivakumar Defends Cabinet Rank For Party Workers, BJP Objects",
        "content": "Karnataka Deputy Chief Minister DK Shivakumar on Monday defended the decision to give cabinet rank to party workers, saying it was a matter of status and recognition for those who helped bring the party to power.\nResponding to criticism, Shivakumar questioned what the BJP had done during its time in power and dismissed the objections raised by the opposition.\n“They have got us to power, they will get power. It’s about status. More will get it,\" he said.\nReacting to the move, BJP leader and Chief Whip in the Legislative Council, N Ravikumar criticised the government, saying that the Congress had 139 MLAs but cabinet rank had been given to 150 individuals.\n“Some of them are MLAs, some are not. Whoever complained that they did not get cabinet ranks, to appease them, the state government has given them the status. Whose money are they spending on it? It’s the people’s tax money. How can they do this?\" Ravikumar said.\nHe demanded that the Chief Minister release a list of all those given cabinet rank and disclose how much money was being spent on them.\n“There is no development in the state. Bengaluru has turned into a pothole city. Funds are not being given to MLAs for development, but they are spending people’s tax money to appease some individuals,\" he added.\nAccording to details, the Siddaramaiah government has handed out cabinet and minister of state ranks to a total of 149 individuals so far.\nThis includes 32 full-fledged ministers who are constitutionally appointed cabinet ministers, 43 MLAs granted cabinet rank as chairpersons of various corporations and boards, and 11 MLAs given minister of state status as heads of smaller corporations.\nAmong non-MLAs, cabinet rank has been granted to nine advisers and special representatives, while minister of state rank has been given to 54 Congress leaders and workers.\nRecently, 54 more people serving as heads of boards and corporations were given minister of state status, raising serious questions over the burden on the exchequer.\nThose granted cabinet or minister of state rank are entitled to a monthly salary of Rs 50,000, a hospitality allowance of Rs 3,000, daily travel allowance of Rs 2,000 within the state and Rs 2,500 outside the state, and a fuel allowance of 1,000 litres of petrol or diesel per month.\nThey are also provided house rent allowance of Rs 80,000 per month, house maintenance and staff allowance of Rs 20,000 per month, medical expense reimbursement, and staff facilities including a personal secretary, personal assistants, drivers and an attender.\nAt government programmes, they are given seating arrangements and protocol equivalent to those of state ministers.\nLatest Blogs",
        "link": "https://www.news18.com/india/more-will-get-it-dk-shivakumar-defends-cabinet-rank-for-party-workers-bjp-objects-ws-l-9890604.html",
        "date": "Mon, 9 Feb 2026 19:03:50 +0530",
        "fetched_at": "2026-02-12 04:06:41.786988"
    },
    {
        "title": "Home Minister Amit Shah To Inaugurate CBI's New Cybercrime Branch Tomorrow",
        "content": "Union Home Minister and Minister of Cooperation Amit Shah is set to deliver the keynote address at the National Conference on “Tackling Cyber-Enabled Frauds & Dismantling the Ecosystem\" on Tuesday in New Delhi.\nAccording to a PIB press release, at the event, Shah will also preside over an Investiture Ceremony of CBI officers, inaugurate the new Cybercrime Branch of the Central Bureau of Investigation (CBI), and launch the S4C Dashboard under the Indian Cyber Crime Coordination Centre (I4C), Ministry of Home Affairs.\nThe two-day conference, organised by the CBI in collaboration with I4C, Ministry of Home Affairs, will run from February 10 and 11 at Bharat Mandapam in the national capital.\n“The conference is being convened at a time when, under the leadership of Prime Minister Shri Narendra Modi, India’s rapid digital transformation has significantly improved access to banking, governance, and communication, while simultaneously creating new vulnerabilities that are being exploited by organized cybercriminal networks,\" the release noted.\nThe CBI has been investigating cybercrime since 2000 and enhanced its capabilities by setting up the Cybercrime Investigation Division in 2022. The agency serves as the nodal body for cybercrime cases affecting the Central Government and its offices, handling both cyber-dependent crimes and cyber-enabled frauds.\nThe conference aims to build a shared understanding of the scale, trends, and evolving nature of cyber-enabled fraud in India. It will examine three critical pillars of the cyber-fraud ecosystem: the financial pillar (mule accounts and money laundering), the telecom pillar (misuse of SIM/eSIM and digital infrastructure), and the human pillar (cyber slavery and trafficking into scam compounds).\nKey objectives include strengthening inter-agency and public–private collaboration among law enforcement, banks, telecom providers, regulators, and technology platforms; exploring the use of artificial intelligence and data analytics to scale investigations; and improving mechanisms for faster fraud reporting, real-time fund tracing, timely evidence preservation, and better victim protection.\nSenior officials and experts from Central and State law enforcement agencies, the Department of Telecommunications, Reserve Bank of India, public and private banks, FinTech firms, telecom and social media companies, cybersecurity experts, and international representatives are expected to participate.\nLatest Blogs",
        "link": "https://www.news18.com/india/home-minister-amit-shah-to-inaugurate-cbis-new-cybercrime-branch-tomorrow-ws-l-9890635.html",
        "date": "Mon, 9 Feb 2026 18:57:42 +0530",
        "fetched_at": "2026-02-12 04:06:42.659248"
    }
]