[
    {
        "title": "AI Impact Summit: U.K. Deputy PM calls Delhi summit ‘important moment' to unlock full benefits of AI",
        "content": "Deputy Prime Minister of the United Kingdom David Lammy at Downing Street in London\n| Photo Credit: AP\nThe U.K.'s focus during the AI Impact Summit set to start in New Delhi on Monday (February 16, 2026) will be on championing how artificial intelligence can supercharge growth, unlock new jobs, improve public services and deliver benefits for people around the globe, the British government has said.\nThe U.K. delegation, led by Deputy Prime Minister David Lammy and AI Minister Kanishka Narayan, is keen to highlight how AI can improve everyday life in every corner of the world and make the case for AI as an engine of renewal that can help doctors diagnose faster, teachers personalise learning, councils deliver services in minutes and businesses create the next generation of good jobs.\n\"This summit is an important moment in determining how we can work together with our international partners to unlock the full benefits and potential of AI, while baking in robust and fair safety standards that protect us all,\" said Mr. Lammy, in a pre-summit statement.\nThe Department for Science, Innovation and Technology (DSIT) said India and Britain were \"natural tech partners\", with software giants like Infosys, Tata Consultancy Services (TCS) and Wipro expanding their operations across the U.K.\n\"AI is the defining technology of our generation, and we're determined to make sure it delivers for everyone,\" said Mr. Narayan, the first Indian-origin MP from Wales.\n\"It can cut waiting times, transform public services, create new jobs and give hard-working communities a fresh start – and that's exactly the message we're taking to the summit. It is central to our plans for delivering national renewal, but its benefits can't and shouldn't be reserved by the few,\" he said.\nThe AI minister said the U.K. is \"leading from the front, pushing a global vision for AI that helps people everywhere to learn more, earn more, and shape the future on their terms\".\n\"We are totally aligned in making sure that the people of Britain and the people of India get to not just look at AI being built by others but build AI and benefit from AI directly,\" he said.\nBesides Delhi, Mr. Narayan will also travel to Bengaluru to explore how India and the U.K. are working together to reap the benefits of breakthrough tech.\nBoth countries are investing tens of millions in cutting-edge research — from better batteries and next-generation telecoms for rural communities, to genomic medicine that could tackle rare diseases, the DSIT said.\nIndia is also a vitally important market for British businesses generally, with U.K. firms generating more than 47.5 billion pounds in revenue from their business in India, it stated.\nDuring the AI Impact Summit this week, the U.K. is expected to announce new support for an African Language Hub, enabling AI to work in 40 African languages with the aim of making the technology more inclusive and accessible for millions.\nThis will be one of three new initiatives being announced as part of the more than 100 million pounds AI for Development (AI4D) programme, created to ensure that developing countries benefit fully from the AI revolution.\nALSO WATCH  Watch: MeitY: India hosts AI Impact Summit to democratise technology for Global South\nThe Asian AI4D Observatory will be geared towards supporting responsible AI innovation and governance across South and Southeast Asia, and the AI4D Compute Hub at the University of Cape Town will give African innovators the compute power they need to turn ideas into impact.\nThe AI Impact Summit in New Delhi has been described as the first international artificial intelligence gathering of its kind to be held in the Global South, anchored around three Sutras of people, planet and progress as India's approach to cooperation in the field.\nUnited Kingdom\n/\nArtificial Intelligence",
        "link": "https://www.thehindu.com/news/international/ai-impact-summit-uk-deputy-pm-calls-delhi-summit-important-moment-to-unlock-full-benefits-of-ai/article70637241.ece",
        "date": "Mon, 16 Feb 2026 08:35:34 +0530",
        "fetched_at": "2026-02-16 04:05:08.941041"
    },
    {
        "title": "Centre approves road projects worth over ₹11,000 crore in Maharashtra, Gujarat and Telangana",
        "content": "| Photo Credit: Special Arrangement\nThe Union Government has approved road projects worth more than ₹11,000 crore in Maharashtra, Telangana and Gujarat, according to official statements.\nThe Cabinet Committee on Economic Affairs (CCEA) on Friday approved the rehabilitation and upgradation of the Ghoti-Trimbak (Mokhada)-Jawhar-Manor-Palghar section of NH-160A in Maharashtra at a total capital cost of ₹3,320.38 crore.\nThe region west of Nashik, particularly around Ambad and Satpur, hosts a dense cluster of industrial units developed by the Maharashtra Industrial Development Corporation. This generates significant freight traffic, the Ministry of Road, Transport and Highways (MoRTH) said in a statement on Saturday (February 14, 2026).\nThe CCEA approved the rehabilitation and upgradation of the 154.635 km section of NH-160A in Maharashtra in Engineering, Procurement and Construction (EPC) mode, MoRTH said.\nThe project has been proposed in line with the PM GatiShakti principles and will connect six PM GatiShakti Economic Nodes, one Social Node and eight Logistics Nodes in Maharashtra. This will have a positive impact on the Logistic Performance Index (LPI) of the country.\nIn a separate release, MoRTH said that the CCEA also approved construction of 4-lane sections of Dhamasiya-Bitada/Movi and Nasarpore-Malotha in Gujarat at ₹4,583.64 crore.\nThe 107.67-km-long project is a part of NH-56, which starts at Nimbahera in Rajasthan and traverses through Dahod district in Gujarat, Alirajpur district in Madhya Pradesh and then re-enters Gujarat near Chhota Udepur district, terminating at its junction with NH-48 near Vapi.\nThe project is designed for 100 km/h, enabling a 70 km/h average speed, which will cut travel time by 40% — from 2.5 to 1.5 hours.\nThe CCEA also approved the widening of National Highway-167 with a total capital cost of ₹3,175.08 crore in Telangana, MoRTH said in a separate release.\nThe project from Gudebellur to Mahabubnagar on the Hyderabad-Panaji Economic Corridor to 4-Lane Standard in Telangana with a total project length of 80.01 km and total capital cost of ₹3175.08 crore will be executed in hybrid annuity mode (HAM) under the NH (O) scheme [National Highways (Original)].\nTo address these challenges, the project is proposed to be developed as a 4-lane standard. The project will provide significant benefit to the Narayanpet and Mahabubnagar districts in Telangana.",
        "link": "https://www.thehindu.com/news/national/centre-approves-road-projects-worth-over-11000-crore-in-maharashtra-gujarat-and-telangana/article70633346.ece",
        "date": "Mon, 16 Feb 2026 08:57:37 +0530",
        "fetched_at": "2026-02-16 04:05:09.551508"
    },
    {
        "title": "We need fiscal prudence during elections",
        "content": "Tamil Nadu Chief Minister M.K. Stalin interacts with beneficiaries of the Kalaignar Magalir Urimai Thogai scheme in Chennai on February 14, 2026 . Photo: X/@CMOTamilnadu via ANI\nFiscal prudence never seems to take precedence during elections in India. Last week, this was demonstrated yet again in Tamil Nadu when Chief Minister M.K. Stalin surprised 1.31 crore women covered under the Kalaignar Magalir Urimai Thogai (KMUT) — a universal basic income scheme for poor women — by transferring ₹5,000 to each of them.\nThe amount included ₹1,000 each for the months of February, March, and April, along with a ‘special summer assistance’ of ₹2,000. The ‘special summer assistance’, the first of its kind in the State, drew appreciation from the allies of the DMK and criticism from the Opposition. Mr. Stalin also said that in the event that his party retained power in the Assembly elections, likely to be held in April, the government would increase the monthly amount to ₹2,000.\nAt one stroke, the Tamil Nadu government incurred an expenditure of ₹6,550 crore. Mr. Stalin’s move comes at a time when the DMK has been accusing the Centre of being biased against Tamil Nadu in releasing funds. At a meeting in New Delhi last month, Finance Minister Thangam Thennarasu told the Centre that ₹3,548 crore due under the Samagra Shiksha scheme for 2024-25 and 2025-26 had not been released. He also expressed concern that rate rationalisation of the Goods and Services Tax would lead to a revenue loss of ₹10,000 crore to the State this year.\nKalaignar Magalir Urimai Thogai scheme in Tamil Nadu: crediting care work by women heads of families\nWhat is the scheme Kalaignar Magalir Urimai Thittam in Tamil Nadu? | Explained\nWatch: How Tamil Nadu’s ‘Kalaignar Magalir Urimai Thittam’ is uplifting women | Focus Tamil Nadu\nThe pre-poll bonanza is not new in Tamil Nadu or in other States. On this score, no party in India is different from the other. During the Interim Budget for 2019-20, the BJP-led Central government announced ₹6,000 a year to farmers under the Pradhan Mantri Kisan Samman Nidhi. The scheme has no link to the performance of agriculturists. It came into being in February 2019, just about two months before polling began for the Lok Sabha elections.\nIn June 2024, after securing only 17 out of 48 seats in the Lok Sabha elections in Maharashtra, the Mahayuti government in the State rolled out a women-centric scheme. It was modelled along the lines of Madhya Pradesh’s Ladli Behna Yojana, which played a major role in tilting the scales in favour of the BJP during the 2023 Assembly elections. Apart from announcing that it would increase assistance under the Mukhyamantri Majhi Ladki Bahin Yojana eventually from ₹1,500 to ₹2,100, the Maharashtra government released two installments at one go before the State went to polls in November 2024. The Mahayuti won the elections.\nLast year, before the Assembly elections in Bihar, the Prime Minister launched the Mukhyamantri Mahila Rojgar Yojana, an employment scheme. The government transferred ₹10,000 each to 75 lakh women. The NDA comprising the JD(U) and the BJP was given one more term.\nIn mid-January 2026, AIADMK general secretary Edappadi K. Palaniswami released the party’s first set of guarantees for the Assembly elections. He assured the electorate that the AIADMK, if elected to power, would expand the monthly assistance scheme for women. He promised to provide ₹2,000 per month to the woman head of every ration card-holding family.\nIn defence of his government’s latest move, Mr. Stalin contended that it had “thwarted the attempts of the BJP” to halt the distribution of monthly assistance under the KMUT scheme before the Assembly elections. Mr. Palaniswami accused the Chief Minister of suffering from the “fear” of losing elections after having made the State “insecure” for “girls, women, and senior citizens.” He has consistently alleged that the DMK regime broke its promise of universal coverage for the women’s cash assistance scheme.\nThe culture of freebies or ‘welfare schemes’ is deeply entrenched in the Indian political system. There seems to be no end to the launch of these schemes, whether in Tamil Nadu or other States. This is despite the fact that the efficacy of these schemes varies from one State to another, even in terms of electoral gains. What is required is not the proliferation of welfare schemes, but their efficient and targeted administration for a defined period. They cannot be entitlements without measurable outcomes or fiscal discipline. It would only be fair to expect Tamil Nadu — a State that has consistently been at the forefront of governance — to pave the way for a regime committed to this principle.\nwelfare\n/\nTamil Nadu\n/\nstate politics",
        "link": "https://www.thehindu.com/opinion/op-ed/we-need-fiscal-prudence-during-elections/article70635540.ece",
        "date": "Mon, 16 Feb 2026 01:45:40 +0530",
        "fetched_at": "2026-02-16 04:05:10.171452"
    },
    {
        "title": "Haryana government to deploy 28 mobile food testing labs in NCR",
        "content": "GURUGRAM:\nIn a push to strengthen food and drug safety systems, the Haryana Government has approved ₹53.21 crore for upgrading regulatory infrastructure in the National Capital Region, including the deployment of 28 mobile food testing laboratory (MFTL) vans and modernisation of the District Food Laboratory at Karnal.\nSharing the details, Additional Chief Secretary, Health and Family Welfare Department, Sumita Misra said the initiative marks a step towards ensuring faster, scientific and accessible food testing services for citizens.\nFive MFTL vans provided by Food Safety and Standards Authority of India (FSSAI) are already operational across districts, offering on-the-spot food testing at a nominal ₹20 per sample. The addition of 28 new vans in NCR areas will significantly expand outreach and citizen access.\nHaryana currently has two notified food testing laboratories at Chandigarh and Karnal both NABL-accredited and recognised by FSSAI under Section 43(1) of the Food Safety and Standards Act, 2006. Recognising that milk and dairy products form a major component of the State’s diet — and that Haryana is a leading hub for sportspersons - Ms. Misra said eight state-of-the-art food testing laboratories will be established in phases to ensure high-quality food standards across the State.\nMs. Misra further informed that to promote a hygienic street food culture, four cities namely Ambala, Karnal, Hisar and Gurugram  have been selected for Clean Street Food Hubs. In Ambala, a 60-shop Street Food Hub is being developed at Gandhi Ground, Ambala Cantt, and is expected to be completed by February 2026.\nHisar has completed around 60% of the work and aims to finish the project by the end of the current financial year. In Karnal, land near the Western Yamuna Canal at Vishwakarma Chowk has been identified and the Detailed Project Report approved, with completion targeted for 2026–27. In Gurugram, the project is at the tendering stage.",
        "link": "https://www.thehindu.com/news/national/haryana/haryana-government-to-deploy-28-mobile-food-testing-labs-in-ncr/article70635693.ece",
        "date": "Mon, 16 Feb 2026 01:31:49 +0530",
        "fetched_at": "2026-02-16 04:05:10.807167"
    },
    {
        "title": "Chinese net renovation project in Fort Kochi hits a roadblock",
        "content": "Chinese fishing nets at Fort Kochi beach\n| Photo Credit: File photo for representational purposes\nKerala Tourism’s decade-old project to renovate the 11 Chinese fishing nets that adorn the Fort Kochi beachfront remains far from completion.\nWith barely six months left for the tourist season to begin, concerns are mounting that visitors may once again miss the opportunity to see the iconic nets in operation. Stakeholders fear that the continued uncertainty over replacing the wooden logs, nets and other components could sound the death knell for the ₹2.40-crore project, which was expected to give Fort Kochi an image makeover.\nExpressing concern over the prolonged delay, a net operator said the project could have been completed at least two years ago but for bureaucratic red tape that held up the payment of just over ₹5 lakh to a team of workers who undertook preparatory renovation work under challenging conditions.\nSebastian Kurishinkal, president of the Fort Kochi Chinese Net Owners’ Association, said he hoped Kerala Tourism, which is funding the initiative, and KITCO, the implementing agency, would expedite fund disbursal and the procurement of nets and allied materials. “Otherwise, the long forest teak logs and other wooden materials stacked near the beach may get damaged. The nets readied by Matsyafed over a year ago also face similar risks,” he said.\nThe delay has also affected the livelihood of more than 100 fishermen who operate the nets, each of which requires 12 fishermen working in two shifts. “We hope the necessary funds are released and materials procured at least this month, as the model code of conduct for the Assembly elections, which is expected soon, could further delay the process,” he added.\nResponding to the concerns, sources in Kerala Tourism said the delay occurred because administrative sanction for the project had to be reissued in December 2025. “This required fresh agreements to be signed. Steps are now being taken to hand over the nets to the operators and renovate the platforms from which the fishermen work,” the sources said.\nAmid uncertainty over the renovation, most operators have replaced the damaged teak logs supporting the nets with iron pipes, affecting the traditional aesthetics of the Chinese fishing nets.",
        "link": "https://www.thehindu.com/news/national/kerala/chinese-net-renovation-project-in-fort-kochi-hits-a-roadblock/article70635910.ece",
        "date": "Mon, 16 Feb 2026 01:24:25 +0530",
        "fetched_at": "2026-02-16 04:05:11.425865"
    },
    {
        "title": "Debris of rockets with ISRO logo found near uninhabited island in Maldives",
        "content": "A photo posted by @ispaceflight_in showing a a PLF (Payload Fairing) washed up on an uninhabited island near L. Kunahandhoo, Maldives, found on February 12, 2026. Photo credits: X/@ispaceflight_in\nDebris of a launch vehicle with the Indian Space Research Organisation (ISRO) logo and the national emblem have reportedly been found recently in an uninhabited island in Maldives.\nThe debris of the Payload Fairing which are believed to be that of ISRO’s Launch Vehicle Mark-3 (LVM-3) washed up to an island near L. Kunahandhoo in Maldives, and found on February 12. Local Maldivian media have also reported on parts of the debris washing up to the shore.\nThe debris are said to have fallen on an uninhabited island and there has been no damage caused to any human life or property due to their impact.\nindianspaceflight.in., a website which tracks Indian spaceflight and aerospace developments, in a post on X said the debris were likely from the LVM3-M6 mission.\n“A PLF (Payload Fairing) has washed up on an uninhabited island near L. Kunahandhoo, #maldives (found February 12, 2026). The @isro logo’s position below the national emblem suggests it is likely from the LVM3-M6 launch. This follows a similar recovery on December 28, 2025, in Sri Lanka (Trincomalee), which also appeared to be from the same mission.  #ISRO #LVM3M6 #LVM,” @ispaceflight_in posted on X.\nA PLF (Payload Fairing) has washed up on an uninhabited island near L. Kunahandhoo, #maldives (found February 12, 2026). The @isro logo's position below the national emblem suggests it is likely from the LVM3-M6 launch. This follows a similar recovery on December 28, 2025, in Sri… pic.twitter.com/mOLZfXn4tD\nOn December 19, 2025 ISRO launched the LVM3-M6 / BlueBird Block-2 Mission, a dedicated commercial mission onboard the LVM3 launch vehicle. During the mission, it successfully launched the BlueBird Block-2 communication satellite of AST SpaceMobile, U.S.A. and on November 2 the space agency used the LVM-3 to launch the CMS-03 communication satellite.\nLVM3 is the heaviest rocket developed by ISRO and is a three-stage launch vehicle comprising two solid strap-on motors, a liquid core stage and a cryogenic upper stage .\nISRO is yet to confirm whether the debris are from an Indian launch vehicle.\nMaldives\n/\nspace programme",
        "link": "https://www.thehindu.com/news/national/debris-of-rockets-with-isro-logo-found-near-uninhabited-island-in-maldives/article70635218.ece",
        "date": "Sun, 15 Feb 2026 22:54:32 +0530",
        "fetched_at": "2026-02-16 04:05:12.044895"
    },
    {
        "title": "Watch: Mulund Metro accident: Five arrested, Rs 5 crore fine on contractor",
        "content": "Five people have been arrested following the fatal slab collapse at an under-construction metro site in Mumbai’s Mulund area on February 14, which killed one person and injured three.",
        "link": "https://www.thehindu.com/videos/watch-mulund-metro-accident-five-arrested-rs-5-crore-fine-on-contractor/article70636361.ece",
        "date": "Sun, 15 Feb 2026 22:49:59 +0530",
        "fetched_at": "2026-02-16 04:05:12.653604"
    },
    {
        "title": "Restricted access to AI summit on Day 1; expo to open for all from February 17",
        "content": "A BSF jawan stands guard at a bus stop, ahead of the AI Impact Summit 2026, in New Delhi on Fberuary 15, 2026.\n| Photo Credit: PTI\nEntry to the India AI Impact Summit 2026 will have some restrictions on the first day of the event, and the expo being organised along with it will open for all from February 17, according to an official advisory issued on Sunday (February 15, 2026).\nPreparations are in the final phase and in full swing for India AI Impact Expo 2026, which will be inaugurated by Prime Minister Narendra Modi on Monday (February 16, 2026) at the Bharat Mandapam.\n\"Bharat Mandapam Expo Arena: Closed on 16 February (Inauguration by Hon'ble Prime Minister of India at 5 PM). Open to all from 17 February onwards,\" the advisory said.\nThe expo will also feature 13 country pavilions, showcasing international collaboration in the AI ecosystem. These include pavilions from Australia, Japan, Russia, the United Kingdom, France, Germany, Italy, the Netherlands, Switzerland, Serbia, Estonia, Tajikistan, and Africa.\nThe expo will host over 300 curated exhibition pavilions and live demonstrations, structured across three thematic chakras — people, planet and progress.\nThe India AI Impact Summit 2026 will be held from February 16-20.\nOfficials involved in the preparation for the summit said guests would be able to attend the event by just registering on the DigiYatra or scanning the QR code on the India AI Impact Summit app at various entry points.\nThose who plan to attend the summit will get access to Bharat Mandapam main hall area from three gates — Gate 4, 7 and 10 — in a restricted manner, as per the advisory.\nEntry from Gate 4 will be operational between 7.30 a.m. and 2 p.m. only, drop-offs by cars and cabs will be permitted.\nPost-2 p.m., access through Gate 4 will be regulated and restricted as per security protocol.\nEntry from Gate 7 will open only after 2 p.m. only where delegates will have to alight in front of the gate to enter the Bharat Mandapam Convention Centre through the Business Plaza.\nGate 10 will be closest for delegates commuting through metro trains.\n\"Access through other designated gates shall remain subject to security clearance and movement restrictions as per protocol,\" the advisory said.\nBoth event venues, Bharat Mandapam Convention Centre and Sushma Swaraj Bhawan, will remain open between 9.30 a.m. and 6 p.m.\nShuttle services will ply from parking facilities located at Purana Qila Parking, Zoo Parking Space, and JLN Stadium Parking to Bharat Mandapam Gate 4.\nDelegates will also get access to golf cart to reach the convention centre after entering through Gate 4.\nIndia ‘very successful’ emerging economy; right place to host AI summit: UN Chief Guterres\nEntry will be open from Gate 2 of Sushma Swaraj Bhawan for pedestrians, metro users, drop-off, and self-driven vehicles.\nAn official said there would be no shuttle from Bhairo Mandir Parking, which had been allocated for around 600 media professionals who have registered for the summit.\nThe India AI Impact Expo 2026 is expected to witness the participation of over 2.5 lakh visitors, including international delegates. The event aims to foster new partnerships and create business opportunities within the global AI ecosystem.\nSpread across 10 arenas covering more than 70,000 square metres, the expo will bring together global technology firms, startups, academia and research institutions, Union ministries, State governments, and international partners.\n\"Registration for the event is free. No money is being charged. Anyone can register and attend any of the events on February 16, 17, 18 and 20,” a Meity official said.\nIndia\n/\nNew Delhi\n/\nArtificial Intelligence",
        "link": "https://www.thehindu.com/news/national/india-ai-summit-expo-2026-entry-restrictions/article70636111.ece",
        "date": "Sun, 15 Feb 2026 22:37:52 +0530",
        "fetched_at": "2026-02-16 04:05:13.263776"
    },
    {
        "title": "India has entered recent trade agreements from a position of strength: PM Modi",
        "content": "Prime Minister Narendra Modi. File\n| Photo Credit: ANI\nIndia recently entered into a spate of trade agreements, including with the European Union and the United States, “from a position of strength”, Prime Minister Narendra Modi said on Sunday (February 15, 2026), adding that these deals were designed to expand global market access for Indian manufacturing and services.\nHis remarks, made in a written interview to the Press Trust of India, comes after the first part of the Budget Session of Parliament, where the government faced an attack by the Opposition on the terms of the trade deals.\nMr. Modi defended the agreements, noting that while long negotiations by the previous Congress-led UPA government had not yielded any results, his government’s “political stability and political predictability” had restored investors’ confidence in India.\nThe Prime Minister spoke at length about his own government’s efforts to enable the environment to strike these deals as well as his expectations from the private sector in taking advantage of these agreements.\n“Trade competitiveness is not only about tariffs. It is about liquidity, certification, technology adoption and compliance with global standards. Our Free Trade Agreements (FTAs) are designed to reduce non-tariff barriers and expand market access for Micro Small and Medium Enterprises (MSMEs) in sectors such as textiles, leather, processed food, engineering goods, chemicals, handicrafts and gems and jewellery,” Mr. Modi said.\n“Indian MSMEs are more export-ready than before, and India’s trade policy now deliberately places MSMEs at the centre of global integration. These FTAs are tools to ensure that our youth are not just suppliers to the domestic market, but active participants in global trade and growth,” he said.\nBut, he added, “policy can only create the enabling framework. The next phase of transformation requires a decisive response from the private sector.”\nRead | Ambiguities in the U.S.-India trade deal\n“As a country that is part of various trade agreements, making Indian products and services globally competitive is crucial. Our stance on ‘Zero Defect, Zero Effect’ has resonated deeply with the youth, start-ups and small and medium businesses,” the Prime Minister said. “MSMEs must move beyond being peripheral suppliers. They must become technologically upgraded, globally integrated and export-oriented enterprises that form the backbone of India’s participation in global value chains,” he added.\nComment | India tested, from U.S. sanctions to one-sided trade deal\nMr. Modi explained the long-term approach behind the Union Budget for 2026-2027. “This is not a ‘now or never’ moment born out of compulsion. It is a ‘we are ready’ moment born out of preparation and inspiration. This Budget reflects this yearning to become a developed nation,” he said, explaining the Budget’s boost for capital expenditure.\nHe added that it was now time for the private sector to step up and take advantage of the government’s investment in infrastructure and capital expenditure. “I am proud to say that we have moved from incremental adjustments to systemic transformation,” he said.\nHis government’s top three reform priorities for the next decade, Mr. Modi said, would be continued structural reforms, deepening innovation, and further simplification of governance.\nOn defence expenditure and reforms, he noted that his government’s focus on the issue had visibly paid off during the course of Operation Sindoor against Pakistan.\n“During the operation, one could see the benefits of the reforms we have undertaken in the last decade. Therefore, defence budgets, modernisation, etc., all these are parts of our continuous effort and need not be linked to any particular issue,” he said in the written interview.\nWhen asked whether the higher budgetary allocation to the defence sector was part of the lesson learnt from Operation Sindoor, he answered in the affirmative. “Yes, the reality is that our country has to be strong and be prepared at all times, and that is what we are doing,” the Prime Minister said.\nUnion Budget 2026: Defence gets record ₹7.85 lakh crore Budget boost post-Operation Sindoor\n“In this year’s budget, a record ₹7.85 lakh crore have been allocated to the defence sector. This is 15 per cent higher than the previous budget and is also the biggest chunk allotted to any ministry or department,” he said.\nSpeaking on the eve of the global AI Summit to be held in New Delhi from Monday, Mr. Modi said that “tax incentives announced in the Budget are designed to accelerate investment in this space, lower the cost of building advanced facilities and position India as a globally competitive destination for data infrastructure. The result of this, too, will be a massive number of jobs for our youth. We invite the whole world’s data to reside in India!”\nIndia\n/\nNarendra Modi",
        "link": "https://www.thehindu.com/news/national/pm-modi-interview-india-trade-deals-budget-tariffs-defence/article70636083.ece",
        "date": "Mon, 16 Feb 2026 09:17:04 +0530",
        "fetched_at": "2026-02-16 04:05:13.879195"
    },
    {
        "title": "Mayoral elections: Prohibitory orders imposed in Karimnagar Police Commissionerate limits",
        "content": "Prohibitory orders have been imposed in the Karimnagar Police Commissionerate limits under Section 163 of the Bharatiya Nagarik Suraksha Sanhita (BNSS) in view of the indirect elections to the posts of Mayor and Deputy Mayor, Chairperson and deputy Chairpersons of the municipal bodies on Monday (February 16).\nThe orders will remain in force from 6 a.m. on February 16 to 6 a.m. on February 17, 2026, a press release said.\nGathering of three or more persons has been prohibited in the Karimnagar Municipal Corporation, Choppadandi, Huzurabad and Jammikunta municipal limits.",
        "link": "https://www.thehindu.com/news/national/telangana/mayoral-elections-prohibitory-orders-imposed-in-karimnagar-police-commissionerate-limits/article70636179.ece",
        "date": "Sun, 15 Feb 2026 21:49:01 +0530",
        "fetched_at": "2026-02-16 04:05:14.485766"
    },
    {
        "title": "Watch: MeitY: India hosts AI Impact Summit to democratise technology for Global South",
        "content": "The Ministry of Electronics and Information Technology (MeitY) said India’s AI Impact Summit will focus on democratising artificial intelligence for the Global South. The summit aims to ensure that AI development is inclusive and accessible, particularly for developing nations.",
        "link": "https://www.thehindu.com/videos/watch-meity-india-hosts-ai-impact-summit-to-democratise-technology-for-global-south/article70636206.ece",
        "date": "Sun, 15 Feb 2026 21:46:41 +0530",
        "fetched_at": "2026-02-16 04:05:15.129504"
    },
    {
        "title": "Hope for India-Bangladesh ties in Tarique Rahman’s development pitch: diplomatic sources",
        "content": "Tarique Rahman, chairman of Bangladesh Nationalist Party (BNP), attends a press conference on February 14, 2026.\n| Photo Credit: Reuters\nIndia continues to remain “careful” in setting its expectations on working with the incoming administration of the Bangladesh Nationalist Party (BNP) but the party’s chairman, Tarique Rahman, has a development agenda that may provide an opportunity to both sides to normalise the relations, The Hindu has learnt from highly placed diplomatic sources who are aware of the plans in this regard.\nThe Indian side keenly watched the campaign trail of Mr. Rahman and found that his 31-point agenda has several areas such as his plans in the digital domain and infrastructure building that may help ties that had stalled in the previous 17 months because of multiple factors, including the escape of deposed Prime Minister Sheikh Hasina to India on August 5, 2024.\nMr. Rahman, who returned after more than one and half decade-long exile in the United Kingdom on December 25, 2025, was greeted by a huge crowd and subsequently the support for him and his party was seen in the funeral prayers for his mother, the former Prime Minister Khaleda Zia on December 31. However, it was his election campaign that caught attention in relevant quarters as he steered clear from playing any anti-India card. It was noticed that the anti-India card was not played directly by his opponents Jamaat-e-Islami and the National Citizen Party (NCP) but they often referred to the India factor through codes like ‘pro-hegemony forces’ in their election speeches. In contrast, Mr. Rahman stuck to his 31-point plans that had commitment to building an inclusive ‘Rainbow Nation’, and reiterated the BNP’s opposition to “terrorism, extremism and militancy”.\nIn his campaign trail, Mr. Rahman had promised to “boost regional and international trade and commerce through infrastructural development, technical modernisation, and skills enhancement in all seaports and river ports.” The Hindu was told these promises are being examined in Delhi for possible areas of cooperation. That apart, both sides will have issues such as renewal of the Ganga Water Treaty later this year that are also being studied.\nMr. Rahman is expected to take charge as the new Prime Minister of Bangladesh on Tuesday (February 17, 2026) and there is significant pressure on him to deliver on the foreign policy front. Addressing questions from journalists in the first press interaction on Saturday (February 14, 2026), Mr. Rahman had indicated that he will decide on international cooperation based on Bangladesh’s national interest.\nIn response to a question on Bangladesh’s stance on China’s Belt and Road Initiative, Mr. Rahman said, “We will try to protect the interests of the people of Bangladesh. If something is not in Bangladesh’s interest, naturally we cannot pursue it. I am certain that mutual interests will be our first priority.” While India and Bangladesh have maintained ties during the 17 months of the interim government, the two sides have not hosted each other’s top leaders during this period. The relationship and especially major connectivity projects have therefore taken a hit in this period. That apart, the two sides have experienced stressful phases as witnessed in December 2025 in the aftermath of the murder of young Islamist leader Sharif Osman Hadi when mobs threatened Indian diplomatic missions and visa centres.\nAccording to an estimate, around 49 agitations were organised in 17 months that delivered threats to India’s missions in Bangladesh. One of the main expectations, The Hindu has learned, would be for the new administration to ensure security and protection of India’s diplomatic missions and visa centres so that the visa services, that are vital for commercial and people-to-people ties, can be normalised by both sides.\nThe relation however will face considerable strain because of political activities that former Prime Minister Hasina and her former colleagues continue to carry out from Indian cities. While the Awami League of Ms. Hasina continues to remain banned here, Mr. Rahman has spoken against ‘revenge’ politics and has said the wrong doings of the previous regime will be subjected to a judicial process.\nWorld\n/\nBangladesh\n/\nIndia",
        "link": "https://www.thehindu.com/news/national/hope-for-india-bangladesh-ties-in-tarique-rahmans-development-pitch-diplomatic-sources/article70635995.ece",
        "date": "Sun, 15 Feb 2026 21:42:40 +0530",
        "fetched_at": "2026-02-16 04:05:15.750381"
    },
    {
        "title": "Kerala setting newer models for the world, says Chief Minister Pinarayi Vijayan",
        "content": "Nobel laureate Amartya Sen joins Kerala government's 'Vision 31' conference via videoconferencing at the Sankaranarayanan Thampi hall at the State Assembly in Thiruvananthapuram on Sunday.\n| Photo Credit: NIRMAL HARINDRAN\nThe human development gains made by Kerala are not the end of a path but the starting point for a new stage of economic and social progress, Chief Minister Pinarayi Vijayan said on Sunday, calling this the ‘central idea’ of the State government’s Vision 2031 for the State.\nInaugurating the three-day ‘Vision 2031: An International Conference on Development and Democracy’ organised by the State Planning Board here, Mr. Vijayan said Kerala is setting newer models for the world by constantly renewing itself in tune with the needs of the changing times. “As Kerala approaches its 75th year (in 2031), the goal is not merely to celebrate past achievements. The goal is to prepare for the future: an economy that is productive and knowledge-based, a society that is inclusive and just, a State that is resilient in the face of climate challenges, and a democracy that continues to value discussion and participation,” he said.\nThe coming five years offer the State an opportunity to bring together growth and justice, technology and humanity, modernisation and sustainability. “Kerala’s history shows that such a balance is possible,” he said. The success of this vision, according to him, hinges not merely on government action, but on a collective effort by society.\nHe described the Vision 2031 conference, in which more than 120 international experts are participating, as not just a review exercise, but an effort to chart the next phase of Kerala’s development journey. When Kerala completes 75 years as a State, it will also be a moment that demands reflection and imagination, he said. “Seventy-five years is a long period, enough to assess where we began, what we have achieved, and what remains to be done.”\nMr. Vijayan described fiscal constraints and the Centre’s restrictions on borrowing and revenue centralisation as challenges that Kerala continues to face.\nEconomist and Nobel laureate Amartya Sen and historian Romila Thapar joined the inaugural session online. World Food Prize laureate Shakuntala Thilsted; Ambassador of Palestine to India Abdullah Abu Shawesh; senior Congress leader and former Union Minister Mani Shankar Aiyar; member of the Provincial Government of Havana, Cuba, Aymee Alejandra Díaz Negrin; State Planning Board Vice-Chairman V.K. Ramachandran; Ministers V.N. Vasavan, R. Bindu, P. Prasad, A.K. Saseendran; and Chief Secretary A. Jayathilak spoke in the inaugural session. Minister for Food and Civil Supplies G.R. Anil presided.\nAccording to the Planning Board, the three-day event is intended to chart the future course for the State. On Monday, 18 thematic seminars will be held across nine venues across the capital city. The Chief Minister will address the closing ceremony at the Sankaranarayanan Thampi Members’ Lounge of the Legislative Assembly on Tuesday. A seminar, ‘Secularism, Democracy and Consultative Government,’ is planned on the occasion.",
        "link": "https://www.thehindu.com/news/national/kerala/kerala-setting-newer-models-for-the-world-says-chief-minister-pinarayi-vijayan/article70636015.ece",
        "date": "Sun, 15 Feb 2026 21:19:10 +0530",
        "fetched_at": "2026-02-16 04:05:16.384918"
    },
    {
        "title": "Congress resorting to malpractices for ULB chiefs’ elections: BRS",
        "content": "HYDERABAD\nThe ruling Congress is resorting to malpractices, undemocratic methods and anarchy for the election of municipal chairpersons and mayors by forcibly admitting those elected on other party tickets or by threatening them, general secretary of the Bharat Rashtra Samithi (BRS) and former IPS officer R.S. Praveen Kumar said.\nSpeaking to newspersons here on Sunday, he said the Congress could win only four municipalities in 2020 and this time the BRS had polled about 30% votes. Chief Minister A. Revanth Reddy was ridiculing the democracy by keeping the key portfolios such as home, municipal administration, education and others with him.\nThe fact that the entire municipal election process was completed within one week was clearly indicating why Mr. Revanth Reddy was keeping the home and municipal administration portfolios with him. The realty sector was in doldrums as he was keeping the municipal portfolio with him.\nHe alleged that the State Election Commission had become a puppet in the hands of the government as it could not even serve a notice on Mr. Revanth Reddy even after he asked the voters in Vikarabad to support Congress and the BRS lodging a complaint on it. Similarly, there were incidents involving TPCC working president T. Jagga Reddy and MP Dharmapuri Arvind at Sangareddy and Nizamabad on the day of polling attracting notices from SEC, but in vain.\nA case was registered against Mr. Jagga Reddy in the evening for namesake. Despite sending money bags, the ruling party could win hardly 51% of wards, Mr. Praveen Kumar alleged. He further alleged that the Chief Minister was sending police to BRS camps by identifying locations through phone-tapping.\nDande Vittal, a BRS MLC defected to the Congress, was provided an ex-officio vote in Kagaznagar though he did not vote there since he had his vote registered in the Sanathnagar Assembly Constituency in the city. He demanded that the election to municipal chairpersons and mayors be held transparently.",
        "link": "https://www.thehindu.com/news/national/telangana/congress-resorting-to-malpractices-for-ulb-chiefs-elections-brs/article70636077.ece",
        "date": "Sun, 15 Feb 2026 21:18:43 +0530",
        "fetched_at": "2026-02-16 04:05:16.991139"
    },
    {
        "title": "Palliative care excellence award for GH nursing officer",
        "content": "Neethu Thomas, who is the nursing officer in charge of the ‘Nilavu’ pain and palliative care department at Ernakulam General Hospital (GH), has been presented with the International Excellence for Palliative Care Award in recognition of her service in palliative care.\nThe award was presented at the Indian Association of Palliative Care Conference 2026 in Hyderabad on Sunday (February 15).",
        "link": "https://www.thehindu.com/news/national/kerala/palliative-care-excellence-award-for-gh-nursing-officer/article70635704.ece",
        "date": "Mon, 16 Feb 2026 01:17:41 +0530",
        "fetched_at": "2026-02-16 04:05:17.605409"
    },
    {
        "title": "Karnataka Minister Priyank Kharge accuses RSS of money laundering",
        "content": "Priyank Kharge\nAttacking Rashtriya Swayamsevak Sangh (RSS) again, Rural Development and Panchayat Raj Minister Priyank Kharge on Sunday accused the RSS of indulging in “money laundering” even as he questioned RSS’s source of income. Questioning the unregistered status of RSS, the Minister said that he will ensure that the RSS gets registered one day or the other.\n“RSS has a network of more than 2,500 organisations, including those in America and England. They are taking money in the name of Guru Dakshina. The Guru is defined as the flag, and the money is being collected in the name of the flag. I am telling that these people are into money laundering,” said the Minister, who, a couple of months back, had stoked a controversy urging Chief Minister Siddaramaiah to curtail the activities of RSS. “Where are they getting this kind of money? How is it coming? They want us to be good citizens by paying income tax, but they want to remain free,” he said here during the release of Karavaliya Raktha Kanneeru, a book recounting the horrors of communal riots in the coastal region.\nOn RSS Chief Mohan Bhagwat’s statement that the RSS was a body of individuals not requiring registration, Mr. Kharge said: “If not today, they will have to register (themselves). I will ensure it. As long as we have the law and the Constitution, it will happen. Because we have left them (without registering) for 100 years, should we leave them for another 100 years? To do it, you have to have political will and be legally and constitutionally right”.\nThe Minister said that it is good for organisations- whether RSS or others- to come under the ambit of the law. “They (RSS) are unregistered now. Are they above the law? Are they above the Constitution? (RSS chief) Mohan Bhagwat recently said in Bengaluru that they are a body of individuals. Even the Bangalore Club is a body of individuals. Have they not registered? Are they not paying tax?” he asked.\nBeing a vocal critic of the RSS, Mr. Kharge has taken on the organisation in recent times. He was accused of stonewalling the RSS centenary celebrations march at Chittapur, which was eventually held after the Karnataka High Court’s intervention. In October, he wrote to the Chief Minister seeking a ban on RSS activities on government premises.\nReferring to the Chittapur controversy, he said, “The RSS had given an application to just inform the administration about the march. Will any organisation get approval for such information or should they specifically seek permission? Are they above law?”\nTaking a dig at Mr. Bhagwat, the Minister said, “The RSS chief suggests people have three kids to protect the country and religion. However, he has remained a bachelor. All of you should beget children, but he will remain a bachelor. How does it work? Will he certify you for patriotism? Will he teach us what we are?”\nLater, speaking to reporters here, the Minister explained, “What I am asking is why these organisations have remained unregistered. Where is their Guru Dakshina coming from? Who is paying the Guru Dakshina? Why is it (RSS) not paying tax? When every rupee of others is being accounted for, why is there no accountability for their money?”\nMr. Kharge said, “If you want to contribute to RSS, you cannot give. What I am saying is that the law or the Constitution that is applicable for all, should be applicable to them too”.\nLikening the RSS and BJP to a devil and its shadow, Rural Development and Panchayat Raj Minister Priyank Kharge on Sunday said that the fight for improvement of the country should be with the devil itself. “The RSS is the devil, and the BJP is its shadow. We are currently fighting with the devil’s shadow. If we fight the devil itself, the country will improve.” He said that the condition of the BJP without the RSS will be worse than the Janata Dal (Secular), and it will decline to a lower level than a regional party. Mr. Kharge a suggested that the Janata Dal (Secular) should remove Secular from its name.",
        "link": "https://www.thehindu.com/news/national/karnataka/priyank-kharge-accuses-rss-of-indulging-in-money-laundering/article70635537.ece",
        "date": "Mon, 16 Feb 2026 09:26:01 +0530",
        "fetched_at": "2026-02-16 04:05:18.227714"
    },
    {
        "title": "Upcoming election is a war between Delhi and Tamil Nadu, says Udhayanidhi",
        "content": "Deputy Chief Minister Udhayanidhi Stalin receiving the DMK Youth Wing’s trishul from party members a public meeting at Sengipatti in Thanjavur on Sunday.\n| Photo Credit: R. VENGADESH\nDescribing the forthcoming Assembly election as a “war between Delhi and Tamil Nadu”, DMK youth wing leader and Deputy Chief Minister Udhayanidhi Stalin on Sunday called upon his party’s youth wing members to see themselves as “front line warriors” in a contest he framed as one between “Tamil and Hindi imposition” and between “social justice and social injustice”.\nAddressing a meeting of Thanjavur district youth wing members at Sengipatti, Mr. Udhayanidhi said the youth and women of the State are firmly with the DMK. “When people ask which side the youth and women are on, we tell them they are with us,” he said.\nAccording to him, no other party in the country had a youth wing with comparable organisational strength, including booth-level committees down to the local unit level, as the DMK.\nMr. Udhayanidhi said: “Now there is a group in our State that is roaming around — they only make noise, no ambition or ideology, nothing. The group doesn’t even know what it is. They think politics is entertainment. You, our youth wing brothers, should tell them politics is about commitment and dedication. Using a group that has no commitment or dedication, no one can achieve anything. Our youth wing has the responsibility of defeating old and new slaves.”\nAlleging “fascist forces” were attempting to stall the State government’s flagship Magalir Urimai Thogai scheme, Mr. Udhayanidhi said: “When our leader heard that a BJP advocate had moved the Supreme Court to halt the ₹1,000 assistance, he said, ‘If they think they can stop me from giving ₹1,000, I will give ₹5,000,’ and ensured the grant reached the people of Tamil Nadu,” he said.\nMr. Udhayanidhi said over the past two months, financial assistance amounting to ₹9,000 had been extended to people in the State through various measures, including Pongal support, monthly assistance under the Magalir Urimai Thogai, and additional relief. He added that under a future “Dravidian model 2.0” government, the assistance would be enhanced to ₹2,000.\nDMK leaders, including Ministers S. Regupathy, Anbil Mahesh Poyyamozhi, and Govi Chezhiaan, and Thanjavur MP S. Murasoli were present.\nstate politics\n/\nelection\n/\nDravida Munnetra Kazhagam\n/\nTiruchi",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/upcoming-election-is-a-war-between-delhi-and-tamil-nadu-says-udhayanidhi/article70635690.ece",
        "date": "Sun, 15 Feb 2026 20:40:45 +0530",
        "fetched_at": "2026-02-16 04:05:18.839575"
    },
    {
        "title": "BIAL to collaborate with government to promote Karnataka tourism",
        "content": "A glimpse of Terminal-2 of Bengaluru's Kempegowda International Airport.\n| Photo Credit: File photo\nThe Bangalore International Airport Ltd. (BIAL), operator of the Kempegowda International Airport (KIA) is working with the Karnataka Tourism Department to position Karnataka as a strong destination.\nGirish Nair, chief operating officer, BIAL said Karnataka is a strong destination, and the airport plays a very important role in promoting it.\n“We are working with the tourism department to see how we can collaborate and promote Karnataka as a strong tourism destination. We are also talking to airlines and reaching out to tour operators jointly with the tourism department. We want to conduct joint presentations to airlines to improve international connectivity,” Mr. Nair told The Hindu.\nHe added that the BIAL, along with the department, would also be jointly representing the State in world travel exhibitions and other events.\n“Airports are an integral part of tourism. We’re talking to them (tourism department) in terms of how we can jointly represent the State in world travel exhibitions and so on,” he added.\nMr. Nair said that BIAL has already collaborated with the State government to promote Karnataka’s rich craft, culture and heritage. “We already have the Kala Loka Pavilion, which has been opened at the Domestic Bay of Terminal-2 to promote Karnataka’s craft, culture and heritage,” Mr. Nair said\nAccording to BIAL, the Kala Loka Pavilion is spread across 132 sq. metres and showcases the Geographical Indication- (GI) tagged and heritage products from Karnataka, curated from institutions like the Karnataka State Handicrafts Development Corporation, Karnataka Soaps and Detergents Ltd., Karnataka Silk Industries Corporation, Karnataka Handloom Development Corporation, Dr. Babu Jagajeevan Ram Leather Industries Development Corporation, and GI-tagged specialty coffees Coffee Board.\n“Visitors can explore an eclectic collection that ranges from Mysore Silk Sarees, Ilkal Sarees, Bidriware, Mysore Rosewood Inlay, Channapatna Toys and Sandalwood artefacts, to fine leather products and an exclusive Coffee Bay serving freshly brewed varieties of Karnataka’s world-renowned GI-tagged coffees,” BIAL said.\nAnother outlet is expected to open in the international departure area of Terminal-2, covering 140 square metres.\nThe State government, through the Karnataka State Industrial & Infrastructure Development Corporation Limited, holds a 13% stake in BIAL.",
        "link": "https://www.thehindu.com/news/national/karnataka/bial-to-collaborate-with-government-to-promote-karnataka-tourism/article70635898.ece",
        "date": "Sun, 15 Feb 2026 20:36:37 +0530",
        "fetched_at": "2026-02-16 04:05:19.444527"
    },
    {
        "title": "All-India Inter-University Netball Tournament celebrates sports and culture in Vijayawada",
        "content": "All-India Inter-University Netball (Women) Tournament 2025-26 players unwind at a campfire event at Maris Stella College in Vijayawada on Sunday.\n| Photo Credit: BY ARRANGEMENT\nThe evening session of the All-India Inter-University Netball (Women) Tournament 2025-26 at Maris Stella College,  Vijayawada, was marked by spirited contests and vibrant cultural celebrations on Sunday (February 15, 2026).\nThe tournament began on Saturday (February 14) with 55 university teams from across the country participating in the five-day event organised by the Krishna University. The event is being conducted on a knock-out-cum-league basis under the supervision of Netball Association of India.\nTelugu Desam Party’s NTR district president Gadde Anuradha, along with Vice-Chancellor of Krishna University K. Ramji and Rector M. Basaveswara Rao, attended the campfire event. Maris Stella College Principal Sr. Inyasamma, introduced the players of the teams from the University of Calicut and Punjabi University, setting the stage for an evening of both competition and camaraderie.\nAt the campfire, participants from across regions showcased their rich traditions through music and dance performances. The event highlighted the unity of India’s universities, blending competitive sportsmanship with cultural expression and artistic talent.\nIn the evening match, TNPE University, Chennai, beat Rani Chinnamma University 36–19, Savitribhai Phule University, Pune, edged MGU Kottayam 48–43, RTMNU, Maharashtra, defeated Devi Ahilya University, Indore, 47–31, Sports University of Haryana, Sonipat, beat Bangalore University 43–38, Hemchand Yadav Vishwavidyalaya, Durg (CG) outclassed KBCNMU Jalgaon (MH) 43–18, APJ Abdul Kalam Technological University advanced via walkover, Bangalore University beat Dr. Rammanohar Lohia Avadh University 36–05, Atal Bihari Vajpayee Vishwavidyalaya, Bilaspur, dominated Rajiv Gandhi Proudyogiki Vishwavidyalaya, Bhopal 60–24, Davangere University advanced via walkover, Krishna University, Andhra Pradesh defeated JNTU-Hyderabad 42–27, Sarvajanik University, Surat, advanced via walkover, Kavikulaguru Kalidas Sanskrit University, Ramtek, outplayed Utkal University, Odisha 53–18, University of Kerala overcame Bharathidasan University 44–24, Mangalore University beat Gondwana University, Gadchiroli 34–04, Maharshi Dayanand University, Rohtak (PB) secured a decisive 43–11 win over Tumkur University, Karnataka, and University of Calicut won over Punjabi University, Patiala, by 56-26.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/all-india-inter-university-netball-tournament-celebrates-sports-and-culture-in-vijayawada/article70635844.ece",
        "date": "Sun, 15 Feb 2026 21:40:59 +0530",
        "fetched_at": "2026-02-16 04:05:20.046861"
    },
    {
        "title": "Andhra Pradesh partnering with Gates Foundation to drive AI-led healthcare reforms: Health Minister",
        "content": "The government plans to introduce early disease detection systems, says the Minister.\n| Photo Credit: Representational picture\nAndhra Pradesh is initiating comprehensive reforms in public healthcare with technical support from the Gates Foundation, Minister for Health Satya Kumar Yadav said.\nIn a statement on Sunday (February 15), the Minister said the partnership aligns with the vision of Chief Minister N. Chandrababu Naidu to achieve the ‘Healthy Andhra Pradesh’ goal and said that the Foundation’s co-founder Bill Gates is scheduled to visit Amaravati on Monday (February 16) to review the State’s ongoing initiatives and discuss future action plans.\nMr. Satya Kumar said the primary aim of the collaboration is to ensure universal access to affordable healthcare through modern technology and systemic reforms, to improve nutritional security and public health outcomes, to achieve scalable solutions and to shift from a reactive treatment-based model to a preventive, predictive healthcare approach.\nHe said the government plans to introduce early disease detection systems, personalised health profiling, advance warning mechanisms for potential illnesses, individual health cards and expanded digital health services, including telemedicine.\nThe Minister said based on the Foundation’s recommendation, the State had constituted a high-power expert advisory group comprising 10 international experts to review existing healthcare systems and recommend reforms. Three sub-committees are being formed to focus on specific areas, he informed.\nAn integrated, real-time health monitoring initiative called ‘Sanjeevani’ has been launched in collaboration with Tata MD, he said, adding that the pilot project, which began in Kuppam, has been expanded across Chittoor district and will soon be implemented statewide. “The programme integrates various health centres through technology to strengthen real-time public health surveillance and response,” he explained.\nHe said the State is also taking concrete steps to introduce Artificial Intelligence-based technologies in healthcare services. Discussions on formulating a national AI-based health policy were initiated in Vijayawada last December in partnership with the Gates Foundation and representatives from other States, he said.\nThe Minister said that with support from the Foundation, the government launched a ‘MedTech Challenge’ to identify AI-enabled medical devices and solutions. “Around 100 applicants participated and, after two rounds of screening, 20 were shortlisted, he said, adding that their technologies were being tested in government hospitals under a pilot programme and a final decision will be taken by the end of March.\nHe said the focus areas included AI-based diagnostic tests, portable point-of-care testing centres, smart monitoring and wearable devices, telemedicine tools for remote areas and data integration and disease surveillance. He said health data collected from various sources will be integrated with the RTGS “Aware” platform to enable early detection of disease outbreaks and data-driven policy formulation.\nHe said the Foundation is also supporting the establishment of a Digital Modelling and Intelligence Decision Centre (DMIDC) at Dr. NTR University of Health Sciences to strengthen data analytics and strategic health planning.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/andhra-pradesh-partnering-with-gates-foundation-to-drive-ai-led-healthcare-reforms-health-minister/article70635599.ece",
        "date": "Sun, 15 Feb 2026 21:08:30 +0530",
        "fetched_at": "2026-02-16 04:05:20.657580"
    },
    {
        "title": "Actor Bhavana gets Rotary Club award",
        "content": "Actor Bhavana receiving ‘Sake of Honour’ award during the Rotary Club district conference in Kozhikode on Sunday.\n| Photo Credit: Special Arrangement\nActor Bhavana was presented with ‘Sake of Honour’ award instituted by the Rotary Club during its district conference held here on Sunday (February 15, 2026).\nRotary District Governor Bijosh Manual and former district governors such as V.G. Nayanar and Santhosh Sreedhar attended the event.\nA release said that members from Malappuram, Kozhikode, Wayanad, Kannur and Kasaragod districts attended the three-day conference titled ‘Mohabbat’. Raju Narayana Swamy, Principal Secretary, Government of Kerala, writer, and Radio Jockey Joseph Annamkutty Jose spoke at various sessions held on Saturday.",
        "link": "https://www.thehindu.com/news/national/kerala/actor-bhavana-gets-rotary-club-award/article70635776.ece",
        "date": "Sun, 15 Feb 2026 20:06:52 +0530",
        "fetched_at": "2026-02-16 04:05:21.284997"
    },
    {
        "title": "LSGD imposes ₹9.72 crore fine for waste dumping-related violations in 2025",
        "content": "The Local Self-Governments department (LSGD) imposed a total fine of ₹9.72 crore in 2025 for various violations related to waste dumping. Out of this, as much as ₹5.34 crore was collected for littering and dumping waste in public spaces, while a total amount of ₹1.60 crore was imposed as fine for not keeping the surroundings of shops or commercial establishments clean.\nA total fine of ₹1.02 crore was imposed for the use of banned plastic products, especially in commercial establishments. For discharging sewage into public places or waterbodies, a total fine of ₹1.03 crore was imposed. Failure to remit the user fee for waste collection by Haritha Karma Sena volunteers has attracted a total fine of ₹12.59 lakh. For illegal transportation of septage waste, a total fine of ₹4.86 lakh was imposed.\nIn a measure aimed at encouraging the public to report instances of waste dumping to the authorities, the department had introduced a reward scheme for those who report such cases with evidence. More complaints are being received on the WhatsApp number 9446700800. A special control room has been set up in the Principal Directorate of the LSGD to monitor this properly and take action.\nIndividuals and institutions face a fine up to ₹5,000 for dumping or burning waste. Those who discharge sewage into public places or waterbodies are liable to a fine of ₹5,000 to ₹50,000. Dumping waste into waterbodies is an offence punishable by a fine of ₹10,000 to ₹50,000 and imprisonment of six months to one year. The penalty for selling banned plastic is a fine of ₹10,000 to ₹50,000. Illegal transportation of waste or septage in vehicles will result in action including confiscation of the vehicle.",
        "link": "https://www.thehindu.com/news/national/kerala/lsgd-imposes-972-crore-fine-for-waste-dumping-related-violations-in-2025/article70635789.ece",
        "date": "Sun, 15 Feb 2026 21:35:06 +0530",
        "fetched_at": "2026-02-16 04:05:21.890194"
    },
    {
        "title": "Home Minister inaugurates newly constructed police quarters in Suntikoppa",
        "content": "Home Minister G. Parameshwara inaugurating the newly constructed police quarters in Suntikoppa in Kodagu district on Sunday. Madikeri MLA Manthar Gowda and Superintendent of Kodagu district police Bindumani R N are also seen.\nHome Minister G. Parameshwara inaugurated the newly constructed police residential quarters at Suntikoppa in Kodagu district on Sunday.\nThe 12 residential quarters for police constables  have been built at a cost of ₹ 3.64 crore by the Karnataka State Police Housing and Infrastructure Development Corporation (KSPH&IDC).\nSpeaking after inaugurating the housing facility, the Minister said that around 40,000 residential quarters have already been constructed for police personnel across the state, while another 60,000 houses are still required.\nPointing out that the salaries of constables, who serve at the lowest ranks in the police department, had been increased, Mr. Parameshwara said the Government is providing improved housing facilities after taking note of the fact that many police personnel live in cramped houses.\nAccordingly, the KSPH & IDC will provide housing in a phased manner up to the year 2030, he said.\nEarlier, buildings were constructed at a cost of about ₹ 18 lakh per unit, but now the cost has increased to around ₹ 33 lakh. The government’s aim is to ensure that police personnel lead a comfortable and dignified life, he added.\nThe Minister assured to look into the list of demands made by MLA Mantar Gowda and priority given to construction of housing facilities for police personnel, while necessary steps will also be taken to establish police stations as per the Government’s parameters.\nHe said various measures have been introduced to make the police department more people-friendly, urging police personnel to maintain friendly relations with the public while ensuring strict punishment for offenders.\nHe further noted that Karnataka Police ranks first in the country in terms of safety and security, and police personnel perform their duties day and night, in rain and heat, often without rest. Therefore, they should be respected, and no one should attempt to demoralise them.\nThe Home Minister said that out of the 593 assurances given by the Siddaramaiah-led government in 2023, more than half have already been fulfilled, and all promises would be implemented within the next two years.\nHe added that the government has spent ₹1.36 lakh crore on the five guarantee schemes, aiming to bring poorer sections into the mainstream through various welfare programmes.\nHe stated that the government is people-oriented and functioning as promised, and added that Chief Minister Siddaramaiah would present a strong budget on March 6.\nMLA Dr. Mantar Gowda, speaking on the occasion, requested the Minister to fill vacant police posts, construct additional police quarters, and provide for the establishment of two more police stations in Kodagu district in the upcoming budget.\nHe also suggested utilising available land in the district for setting up a police training center.\nAmong those present were Southern Range Inspector General of Police Boralinagaiah, Deputy Commissioner S. J. Somashekar, Zilla Panchayat CEO Anand Prakash Meena, and Superintendent of Police R. N. Bindumani.",
        "link": "https://www.thehindu.com/news/national/karnataka/home-minister-inaugurates-newly-constructed-police-quarters-in-suntikoppa/article70635760.ece",
        "date": "Sun, 15 Feb 2026 20:01:55 +0530",
        "fetched_at": "2026-02-16 04:05:22.502714"
    },
    {
        "title": "HRD Minister Lokesh expresses solidarity with ‘kova bun’ vendor",
        "content": "Andhra Pradesh HRD Minister Nara Lokesh.\n| Photo Credit: File Photo\nA simple message of solidarity from HRD Minister Nara Lokesh has set off a larger debate on communal harmony, political alliances, and public responsibility in the age of videos going viral.\nControversy began after a disturbing video surfaced from the Medaram Jatara in Telangana, one of the largest tribal religious gatherings in the country.\nA street vendor from Kurnool district in Andhra Pradesh was allegedly forced by a group of YouTubers to eat the ‘kova bun’ he had brought for sale to prove he was not engaging in what they termed as “food jihad.”\nThe incident, reported by The Siasat Daily, triggered outrage across social media.\nMany described the act as humiliating and baseless, accusing the content creators of stoking communal suspicion for online “views and likes.”\nTagging the news report, in a message that struck a softer, personal tone, rather than a combative one, Mr. Lokesh expressed regret that “Brother Vali had to endure such treatment.”\nAmid the growing anger, Mr. Lokesh stepped in with a public message of support for the vendor, identified as Brother Vali. Expressing regret, the Minister said divisive and communal behaviour had no place in Telugu society, which he described as rooted in harmony, mutual respect, and brotherhood.\nAdding a personal touch, he said he was looking forward to meeting Vali soon and tasting his “famous  Khoya [sic] bun.”\nThe gesture was widely appreciated.\nIn his response, Dr. Praveen praised Mr. Lokesh’s outreach. “Day by day you are impressing us with your heartfelt gestures, Lokesh garu. More power to you,” he wrote, calling the message a reaffirmation of unity.\nAnother Netizen, ‘Who cares’, wrote: “Our Telugu society has always stood for harmony and respect. A few hateful voices cannot divide us. Stay strong, Vali bhai.’”\nHowever, the response was not uniformly positive.\nThe Hyderabad Intellectuals Forum welcomed the sentiment, but questioned its political consistency. In a sharp statement, the forum argued that if divisive politics were truly being rejected, the State government should reconsider its alliance with the Bharatiya Janata Party, which, it accused, of promoting polarising narratives under Prime Minister Narendra Modi.\nThe forum went further, urging Mr. Lokesh to “withdraw support to the BJP and rewrite the tweet” if he genuinely intended to distance himself from “communal politics.”\nThe episode has since evolved into a broader debate, not only about the harassment of a small vendor at a religious fair but also about the responsibility of digital content creators, the fragility of communal trust, and the expectations citizens place on political leaders.\nWhat followed was a familiar digital storm - hashtags, rebuttals, ideological crossfire. But beneath the noise lies a quieter truth: a small vendor at a crowded fair became the centre of a larger conversation about dignity, digital responsibility, and the fragile lines that divide communities.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/hrd-minister-lokesh-expresses-solidarity-with-kova-bun-vendor/article70635223.ece",
        "date": "Sun, 15 Feb 2026 19:47:39 +0530",
        "fetched_at": "2026-02-16 04:05:23.123042"
    },
    {
        "title": "Govt. medical college doctors to go on indefinite strike from Monday",
        "content": "The Kerala Government Medical College Teachers’ Association (KGMCTA) will from Monday onwards go on an indefinite strike, which will include a long-term boycott of outpatient (OP) clinical services as well as all academic activities. From February 19, the doctors will boycott indefinitely non-emergency surgeries and other elective procedures also.\nThe KGMCTA said in a statement on Sunday that even though it has been protesting since July 1, the State government failed to fulfil any of the promises made on various demands raised over the years. The demands raised include an end to the postponement of salary revision arrears of medical college doctors despite the full payment of salary revision arrears to State government employees,  rectification of the irregularities in the salary revision order, revision of the pension ceiling at Central rates, creation of sufficient posts in medical colleges, and payment of DA arrears.\nAfter previous strike calls, the association had held meetings with Health Minister Veena George, after which the salary shortfall in the entry levels was resolved partially. However, no action has been taken regarding the payment of salary revision arrears, which is applicable to the vast majority of doctors, said the statement.\nFrom February 26, the faculty will boycott university examination duties and related responsibilities.\nThe KGMCTA said they have exempted casualty (emergency services), labour room, ICUs, inpatient service and postmortem examinations from the strike. It said that the strike was necessary to safeguard the standard of medical education, to ensure the continued sustenance of government medical colleges, and to protect health care rights of ordinary patients.",
        "link": "https://www.thehindu.com/news/national/kerala/govt-medical-college-doctors-to-go-on-indefinite-strike-from-monday/article70635620.ece",
        "date": "Sun, 15 Feb 2026 19:47:03 +0530",
        "fetched_at": "2026-02-16 04:05:23.764593"
    },
    {
        "title": "Yadgir MLA writes to CM seeking funds for infrastructure development",
        "content": "Channareddy Patil Tunnur is the Yadgir MLA\n| Photo Credit: FILE PHOTO\nYadgir MLA Channareddy Patil Tunnur has submitted a requisition to the Chief Minister urging him to earmark ₹585.28 crore in the State Budget for infrastructure development in his constituency.\nMr. Tunnur has said that the funds are required for taking up infrastructure development works in his constituency.\nIn a release here on Sunday, Mr. Tunnur has said that he has highlighted the importance of providing infrastructure, including underground drainage, hospitals, culverts and industrial college buildings, and has requested the Chief Minister to earmark the grants for taking up development works.\nMr. Tunnur has underlined the development works that are to be taken up immediately and given details about the grants required for them.\nHe has stated that ₹288.70 crore is required for underground drainage works in Yadgir city, ₹100 crore for the construction of a 200-bed super-speciality hospital on the premises of Yadgir Institute of Medical Science (YIMS), ₹20.58 crore for the construction of a 50-bed hospital in Wadagera, ₹2 crore for a 50-bed AYUSH Hospital in Yadgir, ₹2 crore for a training hall for the Health Department, ₹75 crore for the construction of 15 culverts on the Wanamarapalli-Raichur State Highway, ₹25 crore for various development works under the recently upgraded Doranahalli Town Panchayat and ₹73 crore for the establishment of the Government Tool Room and Training Centre (GTTC) in Yadgir city.",
        "link": "https://www.thehindu.com/news/national/karnataka/yadgir-mla-writes-to-cm-seeking-funds-for-infrastructure-development/article70635635.ece",
        "date": "Sun, 15 Feb 2026 19:44:28 +0530",
        "fetched_at": "2026-02-16 04:05:24.372243"
    },
    {
        "title": "'Matter Of Immense Pride': PM Modi Welcomes Global Delegates To India AI Impact Summit In Delhi",
        "content": "Prime Minister Narendra Modi on Monday said that the India AI Impact Summit has drawn global attention to the country’s growing technological capabilities, calling it a moment of pride for the nation and a reflection of the potential of India’s youth.\nIn a series of posts on social media platform X, the Prime Minister highlighted the significance of the Summit being hosted in New Delhi and emphasised India’s expanding role in shaping global conversations around Artificial Intelligence (AI).\n“It is a matter of immense pride for us that people from all over the world are coming to India for the India AI Impact Summit. This also shows the capability of our country’s youth,\" PM Modi said.\nHe added that the gathering demonstrates the rapid strides India is making in science and technology.\n“This occasion is further proof that our country is progressing rapidly in the field of science and technology and is making an important contribution to global development,\" he noted.\nWelcoming international delegates, policymakers, innovators and industry leaders attending the event at Bharat Mandapam, PM Modi said the Summit aims to bring the global community together to deliberate on the future of AI.\n“Bringing the world together to discuss AI! Starting today, India hosts the AI Impact Summit at Bharat Mandapam in Delhi. I warmly welcome world leaders, captains of industry, innovators, policymakers, researchers and tech enthusiasts from across the world for this Summit,\" he wrote.\nThe Prime Minister also underlined the theme of the Summit, Sarvajana Hitaya, Sarvajana Sukhaya, meaning welfare for all and happiness for all, describing it as a reflection of a shared commitment to harness AI for human-centric progress.\nHighlighting the growing impact of AI across sectors, PM Modi said, “AI today is transforming several sectors, including healthcare, education, agriculture, governance and enterprise.\"\nHe expressed confidence that deliberations during the summit would enrich global discourse on innovation, collaboration and responsible use of the technology, adding that the outcomes would help shape a progressive and opportunity-driven future.\nHe further credited citizens for India’s rapid advancement in the field.\n“Thanks to the 1.4 billion people of India, our nation stands at the forefront of the AI transformation. From digital public infrastructure to a vibrant Startup ecosystem and cutting-edge research, our strides in AI reflect both ambition and responsibility,\" the Prime Minister said.\nLatest Blogs",
        "link": "https://www.news18.com/india/pm-modi-hails-india-ai-impact-summit-pride-for-country-artificial-intelligence-bharat-mandapam-delhi-ws-l-9905840.html",
        "date": "Mon, 16 Feb 2026 09:33:49 +0530",
        "fetched_at": "2026-02-16 04:05:32.346136"
    },
    {
        "title": "AI Summit India 2026 Live Updates: PM Modi Says Summit Shows Capability Of Country's Youth As Event Kicks Off Today",
        "content": "India AI Impact Summit 2026 Live Updates From Delhi: India is set to host the AI Impact Summit 2026 from February 16–20 at Bharat Mandapam in New Delhi, bringing together global policymakers, technology leaders and AI innovators. The event marks the first major global AI summit to be held in the Global South.\nAhead of the summit, the Ministry of Information and Broadcasting issued a traffic advisory, urging delegates travelling to Bharat Mandapam and Sushma Swaraj Bhawan to use public transport due to limited parking and revised entry arrangements.\nAccording to the Ministry of External Affairs, 20 world leaders will attend the summit, alongside ministerial delegations from more than 45 countries. UN Secretary-General Antonio Guterres and senior representatives from several international organisations are also expected to participate.\nAt the invitation of Prime Minister Narendra Modi, several Heads of State and Government will be present. Confirmed attendees include Bhutan’s Prime Minister Tshering Tobgay, Brazilian President Luiz Inacio Lula da Silva, French President Emmanuel Macron, Spanish President Pedro Sanchez, Sri Lankan President Anura Kumara Disanayaka and Switzerland’s President Guy Parmelin. Follow for live updates.\nPrime Minister Narendra Modi expressed pride as India prepares to host the AI Impact Summit 2026 from February 16–20 at Bharat Mandapam in New Delhi, calling the global participation a testament to the talent and capability of the country’s youth. In a post on X, he said the summit reflects India’s rapid progress in science and technology and highlights its growing contribution to global development. The event will be the first major international AI summit hosted in the Global South.\nयह हमारे लिए अत्यंत गर्व की बात है कि India AI Impact Summit के लिए दुनियाभर से लोग भारत आ रहे हैं। इससे हमारे देश के युवाओं के सामर्थ्य का भी पता चलता है। यह अवसर इस बात का भी प्रमाण है कि हमारा देश विज्ञान और टेक्नोलॉजी के क्षेत्र में तेजी से प्रगति कर रहा है और वैश्विक विकास… pic.twitter.com/7gxXJEtpOz\n— Narendra Modi (@narendramodi) February 16, 2026\nThe Ministry of Information and Broadcasting on Sunday released a traffic advisory ahead of the India AI Impact Summit 2026. In a post on X, the Ministry advised delegates attending events at Bharat Mandapam and Sushma Swaraj Bhawan to opt for public transportation, citing limited parking facilities and changes to entry gate arrangements.\nIndia will host the Artificial Intelligence Impact Summit 2026 starting Monday in New Delhi, bringing together global stakeholders to chart the course for inclusive, responsible and resilient AI development. Prime Minister Narendra Modi is scheduled to inaugurate the India AI Impact Expo 2026 at 5 pm today at Bharat Mandapam. The gathering will be the first major international AI summit hosted in the Global South.\nLatest Blogs",
        "link": "https://www.news18.com/india/india-ai-summit-2026-live-updates-ai-impact-summit-delhi-bharat-mandapam-huang-sundar-pichai-artificial-intelligence-latest-news-liveblog-9905752.html",
        "date": "Mon, 16 Feb 2026 09:35:18 +0530",
        "fetched_at": "2026-02-16 04:05:33.389001"
    },
    {
        "title": "AI Impact Summit Kicks Off Monday: How India Plans To Emerge As A Key Player In The Age Of AI",
        "content": "India is set to host the AI Impact Summit from February 16 to 20 at the grand Bharat Mandapam, bringing together global leaders, policymakers and industry heavyweights in Artificial Intelligence.\nFor India, the summit is not just a high-profile gathering. It is a statement of intent. New Delhi wants to signal that it does not aim to remain merely a participant in the AI revolution, but to emerge as a key architect shaping its rules, standards and opportunities.\nPrime Minister Narendra Modi will address the summit, visit the Expo and engage with global CEOs. At his invitation, several world leaders, including French President Emmanuel Macron and Brazilian President Lula da Silva, are expected to attend.\nMinisterial delegations from over 45 countries, along with the UN Secretary General and senior international officials, will also take part in the event.\nWhy This Summit Matters\nArtificial Intelligence has moved far beyond research labs. It is reshaping healthcare delivery, transforming agriculture, recalibrating financial markets and redefining education and work. In this context, the AI Impact Summit aims to widen the global conversation.\nEarlier global meets focused strongly on AI safety and frontier risks. India is broadening the focus to highlight AI’s developmental impact — how it can drive economic growth, inclusion and sustainability. The emphasis is on “People, Planet, and Progress\".\nIndia will showcase its deep talent pool, digital public infrastructure and expanding startup ecosystem. Backed by the IndiaAI Mission’s push for compute capacity, datasets and skilling, the summit will reflect India’s strategy of balancing rapid innovation with appropriate safeguards.\nIT Secretary S Krishnan has said the key message is that AI must be human-centric and inclusive. “The key message we want to send is that whatever happens with AI needs to be human-centric and inclusive. There needs to be democratic access to AI resources, and it needs to be done in a way where people are at the centre of this process,\" he told news agency PTI.\nBig Themes To Watch\nSeven thematic working groups will present proposals on AI Commons, trusted AI tools, shared compute infrastructure and sector-specific use cases. Over 700 sessions are planned over five days, covering AI safety, governance, ethical use, data protection and sovereign AI.\nThere will be strong focus on indigenous foundation models for strategic sectors. Discussions will also explore how AI is changing industries and what new skills will be needed in the job market.\nIndia, with over 65 per cent of its population under 35, sees its young workforce as a major advantage in adapting to AI-driven industries. Reskilling and AI-focused training are likely to be key talking points.\nProminent CEOs Attending\nThe summit features a blockbuster list of global tech leaders. These include Sundar Pichai of Google, Sam Altman of OpenAI, Demis Hassabis of DeepMind Technologies, Dario Amodei of Anthropic and Brad Smith of Microsoft.\nThe presence of these influential figures places the summit at the centre of global tech deliberations. Frontier AI labs such as OpenAI and Anthropic, along with tech giants like Microsoft and Google, are expected to offer insights into the future direction of AI development.\nIndian startup founders building indigenous models will also share the stage.\nSpotlight On Sovereign AI\nAhead of the summit, 12 Indian AI startups selected under the Foundation Model Pillar presented their work to the Prime Minister. Their projects range from Indian language foundation models and multilingual tools to healthcare diagnostics, engineering simulations and generative AI applications.\nIndia’s approach is innovation-first. While acknowledging the need for regulation, the government has said it stands ready to act when required, without harming innovation.\nAs the first global AI summit hosted in the Global South, the event also aims to bring developing nations to the AI high table. A joint declaration or roadmap for responsible AI deployment could emerge as a key outcome.\n(With inputs from PTI)\nLatest Blogs",
        "link": "https://www.news18.com/india/ai-impact-summit-kicks-off-monday-how-india-plans-to-emerge-as-a-key-player-in-the-age-of-ai-ws-l-9905596.html",
        "date": "Sun, 15 Feb 2026 22:42:53 +0530",
        "fetched_at": "2026-02-16 04:05:33.994527"
    },
    {
        "title": "Chatbot To Simulation: Panchayat Ministry To Showcase Grassroots Governance At AI Impact Summit",
        "content": "From how to upload a Panchayat asset photo and its details to clarifying scheme guidelines, eGramSaathi, an AI-powered assistant developed by the Ministry of Panchayati Raj, is now positioning itself as the digital bridge between village citizens and grassroots governance.\nAnd this is not a pilot project tucked away in files. It will be live on the international stage at the India AI Impact Expo 2026 in New Delhi, starting February 16. News18 reviewed the documents prepared for the summit.\nAt a time when Artificial Intelligence (AI) is often showcased through flashy consumer apps and global tech debates, the Ministry of Panchayati Raj is quietly placing AI inside the Gram Sabha, empowering India’s grassroots governance.\nThe Ministry will present a suite of AI-enabled governance tools designed specifically for decentralised administration. Alongside eGramSaathi, there is SabhaSaar, an AI system that records, transcribes and converts Gram Sabha deliberations into structured, actionable minutes of meeting, reducing paperwork and ensuring decisions don’t dissolve into memory.\nThen comes PRAMAN (Panchayati Raj Asset Monitoring and Notification), an image analytics platform that automatically validates uploaded asset photographs, checks authenticity, flags duplication and assesses quality. In a system where physical asset verification often slows schemes, automation could prove transformative.\nBut the showcase is not confined to dashboards and screens. Visitors will be able to — Be the Sarpanch — a role-based simulation placing participants inside AI-assisted decision-making scenarios. A virtual reality Gram Sabha experience, immersive walkthroughs and live demonstrations aim to show how technology can simplify complex administrative processes without displacing human agency.\nThe larger message is unmistakable here. AI in India’s public systems is not being framed merely as efficiency software, but as an accountability tool. By embedding transcription accuracy, image verification and instant citizen responses into Panchayat workflows, the Ministry is signalling that emerging technologies can strengthen transparency at the grassroots, where governance is most immediate.\nAs India hosts what is being described as a first-of-its-kind global AI summit in the Global South, the rural Ministry’s bet is clear. The future of AI will not be defined only in boardrooms, but in village meetings, asset registers and citizen queries, answered, perhaps, by a chatbot.\nLatest Blogs",
        "link": "https://www.news18.com/india/chatbot-to-simulation-panchayat-ministry-puts-grassroots-governance-at-centre-stage-at-ai-impact-summit-ws-l-9905410.html",
        "date": "Sun, 15 Feb 2026 19:56:19 +0530",
        "fetched_at": "2026-02-16 04:05:34.597528"
    },
    {
        "title": "Top Putin Aide Maxim Oreshkin To Lead Russian Delegation For AI Impact Summit In New Delhi",
        "content": "In a significant move towards fostering international collaboration in artificial intelligence, Russian President Vladimir Putin’s senior aide, Maxim Oreshkin, will lead a substantial delegation to the AI Impact Summit in New Delhi starting Monday.\nIndia is set to host the AI Impact Summit 2026, a prestigious event that will convene global leaders and industry giants in the field of Artificial Intelligence. Scheduled to take place from February 16-20 at New Delhi’s ‘Bharat Mandapam,’ the summit aims to bring together policymakers, industry leaders, and technology innovators to discuss the future of AI.\nMaxim Oreshkin, deputy chief of the Kremlin staff and economic aide to President Putin, is designated to head the Russian delegation. A Kremlin source told PTI that this choice underscores a strategic effort to enhance AI collaboration between Russia and India. The delegation will focus on secure, trusted, and sovereign AI, engaging actively in discussions on AI governance, technology, and partnerships within BRICS and other international platforms, the source added.\nIn an interview to BRICS TV Network on February 9, Russian Foreign Minister Sergei Lavrov said: “India also emphasises ICT security, which we actively support, contributing to the agenda. This is significant, as norms regulating AI use between states, and AI applications by individual states, are only now being established.\" Lavrov said these norms will regulate behaviours that affect security.\n“Some countries are actively introducing AI into military applications. While each state has the right to determine its own approach, certain countries are already attempting to centralise control, subordinating what states can and may do with AI in the military sphere,\" he added.\nBRICS members will not accept infringements on their sovereignty, yet transparency remains crucial, the minister added.\nIndia’s Ambassador to Russia, Vinay Kumar, in an article published by the state-run news agency TASS on Friday, elaborated on the promising prospects for AI cooperation between India and Russia. He underscored the growing strategic and technological partnership, asserting that the collaboration in AI would serve as a catalyst for mutual growth and technological advancement for both nations.\nLatest Blogs",
        "link": "https://www.news18.com/world/top-putin-aide-maxim-oreshkin-to-lead-russian-delegation-for-ai-impact-summit-in-new-delhi-ws-l-9905379.html",
        "date": "Sun, 15 Feb 2026 20:14:50 +0530",
        "fetched_at": "2026-02-16 04:05:35.226182"
    },
    {
        "title": "'Budget 2026 Reflects India's Yearning To Become A Developed Nation': PM Modi",
        "content": "Prime Minister Narendra Modi on Sunday said that the Union Budget 2026-27, which was presented by Finance Minister Nirmala Sitharaman on February 1, reflects “India’s yearning to become a developed nation\".\nIn an exclusive interview with news agency PTI, the Prime Minister described the budget as a “we are ready\" moment, born out of preparation and inspiration, rather than a “now or never\" moment forced by compulsion.\n“None of our budgets are run-of-the-mill ‘bahi-khata’ documents; that’s not our approach,\" he added.\nPM Modi pointed out that India is witnessing the most expansive infrastructure push in its history, built with future readiness in mind. He said, “India has to be strong and prepared at all times, and that is what we are doing,\" referring to the defence budget and modernisation plans.\nThe Union Budget 2026 has unveiled a series of measures aimed at accelerating growth across infrastructure, power, renewable energy and technology, offering a significant demand boost for the capital goods sector.\nThe proposals are expected to benefit engineering, procurement, and construction (EPC) companies as well as domestic manufacturers by lowering production costs and enhancing competitiveness.\nOn the economic front, PM Modi said that restored “political stability and predictability\" have strengthened investor confidence in India, enabling the country to negotiate trade agreements from a position of strength.\nSpeaking on free trade agreements (FTAs), he said the deals are designed to expand market access for micro, small, and medium enterprises (MSMEs) in sectors such as textiles, leather, chemicals, handicrafts, and gems.\n“Stronger manufacturing, services, MSMEs enable India to negotiate trade pacts from a position of strength,\" the Prime Minister said.\nThe Prime Minister also criticised previous Congress-led UPA governments over their economic management, saying India was then unable to negotiate trade pacts with confidence. “During UPA rule, talks would begin and then breakdown; a little real substance achieved despite long negotiations.\" he noted.\nLatest Blogs",
        "link": "https://www.news18.com/india/budget-2026-reflects-indias-aspiration-to-become-a-developed-nation-pm-modi-9905252.html",
        "date": "Sun, 15 Feb 2026 18:52:56 +0530",
        "fetched_at": "2026-02-16 04:05:35.840811"
    },
    {
        "title": "Weeks After Ajit Pawar's Deadly Plane Crash, Govt Conducts Thorough Study Of Non-Scheduled Operators",
        "content": "Civil Aviation Minister K Rammohan Naidu has said the government is conducting a “very thorough study\" of flight operations by non-scheduled operators and uncontrolled airfields to survey areas where steps need to be taken.\nThe flight operations by Non-Scheduled Operators (NSOPs) came under increased scrutiny after the fatal crash of a VSR Ventures-owned LearJet 45 plane that killed Maharashtra Deputy Chief Minister Ajit Pawar and four others near the Baramati airport on January 28.\nEarlier this month, the Directorate General of Civil Aviation (DGCA) had initiated a special safety audit of NSOPs.\nPTI quoted Naidu saying that the civil aviation ministry is doing a “thorough study\" of the NSOPs, as well as the uncontrolled airfields.\nNSOPs are entities which do not have a fixed schedule for operators and mostly operate chartered flights. Baramati, where January 28 incident took place, is an uncontrolled airfield wherein traffic information is provided by instructors/pilots from the flying training organisations.\nThe civil aviation minister said areas where something needs to be done with respect to NSOPs and uncontrolled airfields will be looked into.\nIn reply to a question on whether the ministry would be looking at having a ‘too big to fail’ concept for the airlines, PTI quoted minister Rammohan Naidu saying the focus will be to boost airlines with smaller operations.\nThe Aircraft Accident Investigation Bureau (AAIB) will likely release its preliminary report on the fatal accident soon.\nFollowing the crash, the ministry in its statement said the “aircraft was cleared to land on runway 11 at 0843IST; however, they did not give a readback of the landing clearance\".\n“Next, the ATC saw the flames around the threshold of runway 11 at 0844 IST. The emergency services then rushed to the crash site,\" it had said.\nLatest Blogs",
        "link": "https://www.news18.com/auto/after-ajit-pawar-plane-crash-govt-carrying-out-thorough-study-of-non-scheduled-operators-ws-l-9905150.html",
        "date": "Sun, 15 Feb 2026 17:11:44 +0530",
        "fetched_at": "2026-02-16 04:05:36.443235"
    },
    {
        "title": "PM Modi To Inaugurate India AI Impact Expo 2026 At Bharat Mandapam",
        "content": "Prime Minister Narendra Modi will inaugurate India AI Impact Expo 2026 on February 16 at Bharat Mandapam, New Delhi.\nThe India AI Impact Expo 2026 will be held from February 16 to 20, alongside the India AI Impact Summit, at Bharat Mandapam. The Expo will serve as a national demonstration of AI in action, where policy meets practice, innovation meets scale, and technology meets the everyday citizen, a statement from the Prime Minister’s Office said.\nSpread across 10 arenas covering more than 70,000 square metres, the Expo will bring together global technology firms, startups, academia and research institutions, Union Ministries, State Governments, and international partners.\nThe Expo will also feature 13 country pavilions, showcasing international collaboration in the AI ecosystem. These include pavilions from Australia, Japan, Russia, United Kingdom, France, Germany, Italy, Netherlands, Switzerland, Serbia, Estonia, Tajikistan and Africa.\nIt will host over 300 curated exhibition pavilions and live demonstrations, structured across three thematic chakras – People, Planet and Progress. In addition, the Expo will feature over 600 high-potential startups, many of them building globally relevant and population-scale solutions.\nThese startups will demonstrate working solutions that are already deployed in real-world settings.\nThe India AI Impact Expo 2026 is expected to witness participation of over 2.5 lakh visitors, including international delegates. The event aims to foster new partnerships and create business opportunities within the global AI ecosystem.\nOver 500 sessions will be organised, featuring more than 3250 visionary speakers and panel members. These sessions will focus on acknowledging the transformative impact of AI across sectors and deliberating on future actions to ensure that AI benefits every global citizen.\nFor India, a nation projected to see its AI market surge past USD 17 billion by 2027, this summit is more than a diplomatic triumph – it’s a declaration of intent.\nWith 800 million internet users, a booming startup scene, and world-class digital public infrastructure, India is positioning itself as the bridge between innovation and impact.\nLatest Blogs",
        "link": "https://www.news18.com/cities/new-delhi-news/pm-modi-to-inaugurate-india-ai-impact-expo-2026-at-bharat-mandapam-ws-l-9905141.html",
        "date": "Sun, 15 Feb 2026 16:43:26 +0530",
        "fetched_at": "2026-02-16 04:05:37.051264"
    },
    {
        "title": "'Stepping Into Field Of Providing Affordable Grain': Amit Shah Launches Digital Ration Platform In Gujarat",
        "content": "Union Home Minister Amit Shah on Sunday inaugurated a Central Bank Digital Currency (CBDC)-enabled Public Distribution System (PDS) in Gandhinagar, calling it another step in taking the Digital India initiative into welfare delivery.\nSpeaking at the launch, Shah said technology developed over the past decade is now being applied to essential services such as food distribution to improve transparency and efficiency.\nHe said, “Today, as an extension of Digital India, inspired by Narendra Modi, digital systems are reaching even food and supply management. When I use the term Digital India and look back 11 years, it is hard to imagine that nearly 600 million people in this country came from families that did not have even a single bank account. And today, the same India, 11-12 years later, under the leadership of PM Modi, is accounting for half of the world’s digital transactions. This means that if there are two digital transactions anywhere in the world, one takes place in India—one in the rest of the world and one in India. This transformation has occurred within a span of just 11-12 years.\"\nShah added, “Inspired by Prime Minister Modi’s vision, the expansion of Digital India is today reaching, in a way, the realm of food and supply arrangements… Today, under Prime Minister Modi’s leadership, half of the world’s digital transactions are taking place in India… This transformation has come in just an interval of 11-12 years, and today that same Digital India is stepping into the field of providing affordable grain to the poor…\"\nAccording to him, the new system is intended to make ration distribution more transparent and ensure benefits reach citizens in a smoother and more reliable manner.\nLatest Blogs",
        "link": "https://www.news18.com/india/stepping-into-field-of-providing-affordable-grain-amit-shah-launches-digital-ration-platform-in-gujarat-ws-l-9904912.html",
        "date": "Sun, 15 Feb 2026 14:29:58 +0530",
        "fetched_at": "2026-02-16 04:05:37.662354"
    },
    {
        "title": "Maharashtra Congress Chief Booked For Calling Tipu Sultan ‘Symbol Of Bravery’ Like Shivaji",
        "content": "Harshwardhan Sapkal, the Maharashtra Congress chief, has been booked by Pune police after he described Tipu Sultan as a “symbol of bravery\" comparable to Chhatrapati Shivaji Maharaj.\nThe case was registered following a complaint by city BJP chief Dhiraj Ghate, who alleged that Sapkal’s remarks were provocative and hurt religious sentiments.\nThe complaint relates to Sapkal’s comments about similarities between Shivaji and Tipu Sultan.\nAfter Sapkal’s statement comparing Tipu Sultan with Shivaji, leaders of the Bharatiya Janata Party in Ahilyanagar announced a Rs 10 lakh reward for anyone who would cut off his tongue.\nThe announcement was made during a protest held in front of the Shivaji memorial, where BJP workers alleged that Sapkal’s remarks were objectionable.\nParty workers staged a ‘shoe protest’ against Sapkal and raised slogans at the site.\nThe statement has triggered sharp political reactions and increased tensions in the region.\nSapkal said journalists had asked him whether photographs of all great leaders should be displayed together in offices, and how he viewed the demand that the photos of Shivaji and Tipu Sultan should be placed side by side.\nWhile replying, he said, “Fadnavis’ old habit of twisting words turning ‘dha’ into ‘ma’ has resurfaced, and he has found an opportunity to create a Hindu-Muslim controversy.\"\nSapkal had made his remarks on Saturday while speaking to reporters about a controversy over a portrait of Tipu Sultan displayed in the office of the Malegaon municipal corporation’s deputy mayor Shan-e-Hind Nihal Ahmed, who is Muslim.\nThe portrait of Tipu Sultan, known for fighting British colonialists, is being opposed by the Shiv Sena and other groups.\nSapkal said in Marathi that Tipu had followed Shivaji’s ideals.\n“The kind of bravery that Chhatrapati Shivaji Maharaj possessed and the concept of ‘swarajya’ (self-rule) that he introduced… much later, following in that very tradition and taking inspiration from his ideals, Tipu Sultan waged war against the British,\" he said.\n“In that sense, Tipu Sultan was a great warrior who displayed immense bravery and was a true son of India. He never allowed any poisonous or communal ideas to sway him. As a symbol of bravery, we should view Tipu Sultan as equivalent to Chhatrapati Shivaji Maharaj,\" he added.\nAccording to ANI, the complaint said Sapkal’s remarks “hurt the sentiments of Hindus\", apparently because Tipu was a Muslim and Shivaji a Hindu, and could disturb communal harmony.\nGhate said the remarks hurt the sentiments of Hindus “who believe and consider Chhatrapati Shivaji Maharaj as God\".\n“I don’t understand what point Harshwardhan Sapkal wants to prove by making such a statement, which hurts sentiments,\" he said.\nThe case has been registered under sections 192, 196(1), 196(2), 352 and 356(2) of the Bharatiya Nyaya Sanhita. Police said further investigation is underway.\nLatest Blogs",
        "link": "https://www.news18.com/india/maharashtra-congress-chief-booked-for-calling-tipu-sultan-symbol-of-bravery-like-shivaji-9904793.html",
        "date": "Sun, 15 Feb 2026 13:12:01 +0530",
        "fetched_at": "2026-02-16 04:05:38.290718"
    },
    {
        "title": "Devendra Fadnavis Govt To Beautify Nagpur’s Deekshabhoomi In Tribute To Ambedkar | Exclusive",
        "content": "In the heart of Nagpur stands Deekshabhoomi — not just as a monument of stone and marble, but as a living memory of a historic turning point in India’s social journey. It was here, in 1956, that Dr B. R. Ambedkar embraced Buddhism along with lakhs of followers, marking a profound moment of social assertion and spiritual transformation.\nNow, the Maharashtra government led by CM Devendra Fadnavis has embarked on an ambitious plan to redevelop and beautify the sacred precinct, with an estimated outlay of Rs 70 crore.\nThe project, to be undertaken by the Nagpur Metropolitan Region Development Authority (NMRDA), aims to transform the 58,000 square metre area into a world-class heritage landscape — while preserving its dignity, sanctity and symbolism.\nFor the millions who visit every year, especially during Dhamma Chakra Pravartan Din, Deekshabhoomi is not merely a tourist site. It is a space of reflection, identity and hope. The redevelopment plan seeks to enhance that experience. Master planning and concept design will reorganise the site to ensure smoother pilgrim movement, with clearly demarcated meditation and silence zones.\nSpecial emphasis will be placed on universal accessibility — making pathways barrier-free for the elderly, women and divyang visitors.\nSoft landscaping inspired by Buddhist philosophy will introduce meditation gardens, green buffers and indigenous tree plantations. Hardscaping elements such as plazas, paved forecourts, stone works and seating areas will be redesigned to create dignified ceremonial spaces.\nThe government also plans to install architectural and landscape lighting, energy-efficient systems, and smart illumination to enhance safety without disturbing the spiritual ambience.\nBeyond aesthetics, the project includes vital infrastructure upgrades — drainage and storm-water management, sanitation facilities, drinking water points, signage in Marathi, Hindi and English, and enhanced security systems including CCTV surveillance.\nA thoughtfully designed public address and ambient sound system will assist in crowd management during peak gatherings while maintaining acoustic sanctity.\nImportantly, interpretation zones narrating the life and philosophy of Dr Ambedkar will be developed, ensuring that younger generations understand why this ground holds such deep constitutional and cultural significance.\nOfficials insist that every intervention will be carried out in consultation with the Samaj Kalyan Department and in alignment with government policy, with “absolute respect\" for the spiritual and social ethos of the site.\nFor many visitors, the hope is simple — that Deekshabhoomi remains what it has always been: a place of dignity and quiet strength, now supported by infrastructure befitting its global stature.\nLatest Blogs",
        "link": "https://www.news18.com/india/devendra-fadnavis-govt-to-beautify-nagpurs-deekshabhoomi-in-tribute-to-ambedkar-exclusive-ws-l-9904740.html",
        "date": "Sun, 15 Feb 2026 12:44:36 +0530",
        "fetched_at": "2026-02-16 04:05:38.894296"
    },
    {
        "title": "Rohit Pawar Writes To Amit Shah, Aviation Minister, Seeks Probe Into Uncle Ajit Pawar’s Plane Crash",
        "content": "NCP (SP) MLA Rohit Pawar on Saturday said he has written to Union Home Minister Amit Shah seeking a comprehensive and transparent investigation into the January 28 plane crash that killed Maharashtra Deputy Chief Minister Ajit Pawar.\nIn a post on social media, the Karjat-Jamkhed legislator said he had emailed the Home Minister, Civil Aviation Minister K Rammohan Naidu, and the Directorate General of Civil Aviation (DGCA), attaching a detailed presentation outlining his concerns related to the crash.\nSharing copies of the correspondence, Rohit Pawar said his demand for a probe was not politically motivated but aimed at ensuring that the truth behind the accident is established beyond doubt.\n“It is important that the actual sequence of events is placed before the people so that there is no room for speculation or suspicion,\" he said.\nEarlier, at a press conference on February 10, Rohit Pawar had claimed there were grounds to suspect sabotage in the fatal air crash and called for a deeper examination of all possible angles.\nThe crash occurred on January 28 when a chartered Learjet 45 carrying Ajit Pawar crashed while attempting to land at Baramati airport in Pune district.\nThe aircraft came down near the runway threshold, killing all five people on board.\nThe deceased included Pawar, his personal security officer, a flight attendant, and the pilot and co-pilot. Pawar was travelling from Mumbai to Baramati to campaign for the Zilla Parishad elections.\nMeanwhile, the Aircraft Accident Investigation Bureau (AAIB) and the DGCA are probing the incident.\nUnion Minister of State for Civil Aviation Murlidhar Mohol said on February 7 that investigators had recovered the aircraft’s black box and that its data is currently being analysed.\nAuthorities have not yet released details on the cause of the crash, and officials said the investigation is ongoing.\nLatest Blogs",
        "link": "https://www.news18.com/india/rohit-pawar-writes-to-amit-shah-aviation-minister-seeks-probe-into-uncle-ajit-pawars-plane-crash-9904686.html",
        "date": "Sun, 15 Feb 2026 11:22:14 +0530",
        "fetched_at": "2026-02-16 04:05:39.544573"
    },
    {
        "title": "‘Have Faith In Our Agencies’: Minister Rejects Italian Media Report On Air India Crash",
        "content": "Days after an Italian media report on the Air India crash, Union Minister of State for Civil Aviation Murlidhar Mohol rejected claims about the investigation into the crash in Ahmedabad last year, saying the probe is still underway.\nHis statement came after an Italian newspaper reported that Indian investigators were preparing to say in their final findings that Air India Flight 171 crashed because one of the pilots shut off the plane’s fuel controls.\nMohol denied the report and said investigation agencies are looking into the matter.\n“I just want to inform you all that our investigation agencies are probing the matter. Should we have faith in our own agencies or outsiders? Our agencies are working on it,\" he was quoted as saying by PTI on Saturday.\n“Once the final report is finalised, then only it will be justifiable to comment on it,\" he added.\nThe report in Corriere della Sera said Indian investigators were preparing to state in their final report that Air India Flight 171 crashed because one of the pilots switched off the aircraft’s fuel switches in an act that was “almost certainly\" intentional.\nIt said the claim would rely on findings that no technical fault was detected in the aircraft, suggesting the crash may have been caused by human action. The newspaper added that cockpit voice recordings, cleared of background noise, identified which pilot moved the fuel switch “from RUN to CUTOFF\".\nThe report said it was still not known whether the final findings would directly assign blame. It named the pilot, Sumeet Sabharwal, who died in the crash, as being at the centre of the matter.\nThe publication said a conclusion pointing to the flight captain would be a “desired turning point\" for US experts who have been presenting evidence to Indian authorities, as the Indian side has refused to accept a human role in the disaster.\nIt also said sound analysis clearly showed which pilot carried out the move and ruled out the possibility of an error.\nThe Aircraft Accident Investigation Bureau said reports claiming that the investigation into Air India Flight AI-171 had been completed were “incorrect and speculative\".\n“The investigation is still in progress. No final conclusions have been reached,\" it said.\nThe agency referred to its preliminary report and added that the final investigation report, containing conclusions and safety recommendations, would be published after completion of the probe in line with international norms.\nIn one of India’s deadliest air accidents, 260 people, including 241 passengers, were killed when Air India’s Air India Boeing 787-8 aircraft operating flight AI171 to London crashed shortly after take-off from Ahmedabad on June 12, 2025.\nLatest Blogs",
        "link": "https://www.news18.com/india/have-faith-in-our-agencies-aviation-minister-rejects-italian-media-report-on-air-india-crash-9904629.html",
        "date": "Sun, 15 Feb 2026 11:13:14 +0530",
        "fetched_at": "2026-02-16 04:05:40.148782"
    },
    {
        "title": "Inside AI Impact Summit 2026: What Participants Need To Know Before Reaching Bharat Mandapam?",
        "content": "New Delhi is preparing to host one of its largest technology gatherings as the AI Impact Summit 2026 begins on February 16 at Bharat Mandapam. Over five days, researchers, industry leaders, and officials will move between conference halls, exhibition spaces, and discussion rooms for back-to-back sessions on artificial intelligence.\nLet’s Take A Look At All You Need To Know About The Event\nWhere The Summit Will Take Place\nThe site will have food courts, seating areas, networking spaces and help desks. Some zones may be restricted depending on security requirements.\nWhat The Event Include?\nThe summit will feature:\nSessions generally begin at 9:30 AM, subject to venue access timings.\nDay-by-Day Access\nFebruary 16 (Monday)\nFebruary 17 (Tuesday)\nFebruary 18 (Wednesday)\nFebruary 19 (Thursday)\nNote: Inaugural ceremony is invite-only. QR-code delegates cannot enter.\nFebruary 20 (Friday)\nEntry: Registered delegates allowed\nRegistration And Entry\nRegistration is only through the official website\nThere is no registration or invitation fee\nEntry is strictly via a QR code\nQR codes are sent by email and available in the summit mobile app\nShow QR at:\nBharat Mandapam Gate 4 and Gate 10\nSushma Swaraj Bhawan Gate 2\nBadges and QR codes cannot be shared\nID And Security Checks\nParticipantss must carry:\nHow To Reach The venue\nBharat Mandapam\nPublic transport is recommended due to limited parking.\nEntry gates\nMetro users: Gate 10\nCab/drop-off: Gate 4\nOn February 19: Gate 10 closed, Gate 4 opens after 11 AM\nParking Locations\nPurana Qila parking\nZoo Parking Space-3\nJLN Stadium Parking 4 & 8\nShuttle services will run to Gate 4.\nInside the complex, delegates should use designated golf carts.\nSushma Swaraj Bhawan\nReach via metro, public transport or cab\nEntry through Gate 2\nLatest Blogs",
        "link": "https://www.news18.com/india/inside-ai-impact-summit-2026-what-participants-need-to-know-before-reaching-bharat-mandapam-ws-l-9904567.html",
        "date": "Sun, 15 Feb 2026 09:28:25 +0530",
        "fetched_at": "2026-02-16 04:05:40.781773"
    },
    {
        "title": "On Quad Summit, Jaishankar Says ‘Stay Tuned,’ Insists It Was ‘Never’ Cancelled",
        "content": "In his first remarks on the Quad Summit following the India-US trade deal developments, External Affairs Minister S Jaishankar on Saturday clarified that the Quad summit was “never cancelled,\" pushing back against speculation about the grouping’s trajectory.\nWhile speaking at the Munich Security Conference 2026, where he participated in a roundtable discussion titled ‘Delhi Decides: Mapping India’s Policy Calculus’ hosted by Ananta Aspen, Jaishankar addressed questions regarding the Quad saying that the summit was never cancelled, however it was never specifically scheduled.\n“The Quad summit was never cancelled. It was never specifically scheduled. Yes, it did not take place — but I won’t over read ‘Quad’ not happening at a summit level,\" he said.\nJaishankar further emphasised continued engagement within the group and highlighted that his first meeting with US Secretary of State Marco Rubio took place in the Quad Foreign Ministers’ Meeting (FMM) format.\n“We had two Quad FMMs. Other mechanisms are going on,\" he said, underlining that cooperation among the four countries remains active through multiple channels.\nDownplaying concerns over the absence of a leaders’ summit, the Union Minister signaled continuity rather than disruption in Quad engagements.\nThe Quadrilateral Security Dialogue, comprising India, the United States, Japan and Australia, has been central to Indo-Pacific cooperation on maritime security, supply chains, critical technologies and regional stability.\nJaishankar’s remarks are significant as they mark his first public statement on the QUAD following recent trade deal announcement.\nEarlier this month, US President Donald Trump announced that the United States and India have reached a trade deal to lower reciprocal tariffs. He said that following a phone call with Prime Minister Narendra Modi, the US would reduce tariffs on Indian goods from 25 per cent to 18 per cent with immediate effect. In return, Trump claimed India would cut its tariffs and non-tariff barriers on US products to “zero.\"\nAs part of the understanding, India has signalled plans to increase its purchases of US products in areas such as energy, aircraft parts, machinery and technology, with an overall trade engagement target of around $500 billion over the next few years. Both sides also agreed to work on reducing trade barriers and improving cooperation on areas like digital trade and supply chains.\nLater, the White House replaced its original fact sheet on the interim trade framework with a revised version. A reference to “certain pulses\" being included in tariff reductions has been removed, ensuring that India’s longstanding tariff protections for its farmers remain intact. Similarly, wording that said India had “committed to buy\" $500 billion worth of US goods has been replaced with “intends to buy,\" making it clear that these purchases are not legally binding obligations but part of a broader intent outlined in the joint statement.\nFurther, agriculture has been removed from the list of sectors from which India would purchase US goods, limiting perceived exposure of the farm sector. The earlier line stating that India would remove its digital services tax has also been deleted. Instead, the updated version says India has “committed to negotiate a robust set of bilateral digital trade rules,\" shifting the focus from unilateral concessions to future negotiations.\nLatest Blogs",
        "link": "https://www.news18.com/india/stay-tuned-jaishankar-on-quad-summit-status-says-it-was-never-cancelled-ws-l-9904185.html",
        "date": "Sat, 14 Feb 2026 21:11:04 +0530",
        "fetched_at": "2026-02-16 04:05:41.510444"
    },
    {
        "title": "PM RAHAT: Who Is Eligible And How The Cashless Road Accident Scheme Works?",
        "content": "The government has rolled out PM RAHAT (Road Accident Victim Hospitalisation and Assured Treatment), a nationwide scheme designed to provide cashless medical care to road accident victims and ensure that financial constraints do not delay life-saving treatment.\nThe initiative aims to strengthen India’s emergency response system by guaranteeing immediate medical support during the critical “Golden Hour\" — the first hour after an accident, when timely intervention can significantly improve survival chances.\nUnder PM RAHAT, every eligible road accident victim will be entitled to cashless treatment of up to ₹1.5 lakh for a period of seven days from the date of the accident, regardless of the category of road on which the incident occurred.\nIn non-life-threatening cases, stabilisation treatment will be provided for up to 24 hours. In life-threatening cases, it can extend up to 48 hours, subject to verification through an integrated digital system.\nThe scheme is integrated with the Emergency Response Support System (ERSS) 112. Accident victims, Good Samaritans (Rah-Veer), or anyone present at the scene can dial 112 to receive information about the nearest designated hospital and request ambulance assistance.\nThis linkage is expected to improve coordination between emergency responders, police authorities and hospitals, helping victims reach medical facilities more quickly.\nHospitals will be reimbursed through the Motor Vehicle Accident Fund (MVAF).\nIf the offending vehicle is insured, the payment will come from contributions made by general insurance companies. In cases involving uninsured vehicles or hit-and-run incidents, the government will cover the costs through budgetary allocations.\nApproved claims will be settled within 10 days by the State Health Agency, providing financial assurance to hospitals and encouraging uninterrupted treatment.\nThe scheme operates on a digital platform that integrates the Electronic Detailed Accident Report (eDAR) system of the Ministry of Road Transport and Highways with the National Health Authority’s Transaction Management System (TMS 2.0).\nThis ensures seamless digital tracking from accident reporting and police authentication to treatment delivery, claim processing and payment.\nEach district will have a designated Grievance Redressal Officer, nominated by the District Road Safety Committee, which is chaired by the District Collector or an equivalent authority, to address complaints and ensure accountability.\nIndia records a significant number of road accident deaths every year, many of which could be prevented with timely medical intervention. Studies indicate that nearly half of such fatalities can be avoided if victims receive hospital care within the Golden Hour.\nBy removing upfront payment barriers and ensuring faster emergency coordination, PM RAHAT seeks to reduce preventable deaths and strengthen the country’s emergency healthcare ecosystem.\nIn essence, the scheme ensures that accident victims receive immediate treatment without worrying about costs, a step aimed at saving lives and improving road safety outcomes nationwide.\nLatest Blogs",
        "link": "https://www.news18.com/india/pm-rahat-who-is-eligible-and-how-the-cashless-road-accident-scheme-works-ws-el-9904184.html",
        "date": "Sat, 14 Feb 2026 19:48:40 +0530",
        "fetched_at": "2026-02-16 04:05:42.146371"
    },
    {
        "title": "PM Modi Inaugurates Kumar Bhaskar Varma Setu In Guwahati: ‘Game-Changer For Connectivity’",
        "content": "Prime Minister Narendra Modi on Friday inaugurated the Kumar Bhaskar Varma Setu, a major bridge project across the Brahmaputra River, describing it as a vital infrastructure development for Guwahati and the surrounding areas.\nKumar Bhaskar Varma Setu across the Brahmaputra is a vital infrastructure project for Guwahati and areas around it. Connectivity, comfort and commerce will be significantly enhanced. It will enable devotees to go to the Kamakhya Temple with greater ease. pic.twitter.com/bdpjbW0oNk— Narendra Modi (@narendramodi) February 14, 2026\nSharing images from the site, the Prime Minister said the bridge would significantly enhance connectivity, comfort and commerce in Assam. He also noted that the project would make it easier for devotees to visit the revered Kamakhya Temple in Guwahati.\nThe Kumar Bhaskar Varma Setu is a key bridge constructed over the Brahmaputra, one of India’s largest rivers, aimed at easing traffic congestion and strengthening transport links in Assam’s largest city.\nNamed after the ancient Kamarupa king Kumar Bhaskar Varma, the bridge is designed to serve as an additional crossing over the Brahmaputra, supplementing existing bridges such as the Saraighat Bridge. The new structure is expected to decongest city traffic and improve travel time between north and south Guwahati, as well as nearby districts.\nImproved Connectivity:\nThe bridge will reduce travel time across the Brahmaputra and ease pressure on existing crossings, which often face heavy traffic.\nBoost to Commerce:\nBetter road connectivity is expected to enhance trade and logistics in the region, facilitating smoother movement of goods and services across Assam and the Northeast.\nReligious Tourism:\nWith Kamakhya Temple being one of the most prominent pilgrimage sites in the country, improved access is likely to benefit thousands of devotees who travel to Guwahati each year.\nUrban Expansion:\nThe new crossing is also expected to support urban development by opening up better connectivity to residential and commercial hubs on both sides of the river.\nThe project forms part of a broader push to strengthen infrastructure in the Northeast, aimed at improving economic integration and regional development.\nOfficials say the bridge will play a key role in shaping Guwahati’s future growth while easing daily commuting challenges for residents.\nLatest Blogs",
        "link": "https://www.news18.com/india/pm-modi-inaugurates-kumar-bhaskar-varma-setu-in-guwahati-game-changer-for-connectivity-ws-l-9903784.html",
        "date": "Sat, 14 Feb 2026 16:40:24 +0530",
        "fetched_at": "2026-02-16 04:05:42.761708"
    },
    {
        "title": "Andhra Pradesh Budget Highlights: Big Push For Capital Amaravati, Tirupati As Global Destination",
        "content": "The Andhra Pradesh government unveiled its budget proposals for 2026-27, focusing on regional development, urban infrastructure, and citizen welfare, with a strong emphasis on the capital region, Amaravati. The department of municipal administration and urban development has been allocated Rs 14,539 crore to drive development in the capital area. Additionally, the government has granted administrative sanction for 97 works worth Rs 57,868 crore across sectors.\nSwarna Andhra Vision 2047\nUnder the Swarna Andhra @2047 vision, the state has adopted a regional growth approach to ensure inclusive development. Three regions—Visakhapatnam, Amaravati, and Tirupati—have been identified as key engines of growth. Women are expected to play a pivotal role in achieving the vision, with policies aimed at enhancing women’s participation in development programmes and professional life.\nOf the total urban development and municipal administration fund of Rs 14,549 crore, the share allocated to Amaravati alone is Rs 6,000 crore. The amoount allocated for Vishakhpatnam economic development development – 28,000 crore\nEconomic and Tourism Initiatives\nThe budget also outlines plans for the Andhra Pradesh Wealth Fund, designed to emulate successful sovereign wealth funds like those of Norway and Abu Dhabi, potentially becoming a long-term revenue engine for the state.\nIn the tourism sector, the government aims to upgrade Tirupati as a global destination, improving tourist infrastructure, hotel capacity, and recreational facilities in coordination with the Union government. Meanwhile, the Visakhapatnam Economic Region (VER) will see a comprehensive economic master plan, covering 11 districts with 41 high-impact projects in manufacturing, services, infrastructure, urbanisation, and agriculture. Proposals worth Rs 28,000 crore, including metro rail projects, are being submitted to the Centre for funding and private investment.\nSocial and Environmental Programmes\nEducation initiatives like Talliki Vandanam, introduced under the Super Six programme, continue, providing Rs 15,000 per child annually to over 67 lakh students. Under Deepam 2.0, 1.08 crore women beneficiaries receive three free LPG cylinders per year, with Rs 2,897 crore credited directly to their accounts. Women employees will also benefit from expanded childcare leave without age limits, promoting work-life balance.\nThe Harita Andhra programme aims to achieve 37 per cent green cover by 2030 and 50 per cent by 2047, combating desertification, halting land degradation, and implementing the Green Cover Wall as an ecological buffer across the state.\nWith these initiatives, the Andhra Pradesh government is signalling a strong push for balanced regional development, infrastructure modernisation, environmental sustainability, and women’s empowerment, setting the stage for long-term economic growth and inclusive progress.\nLatest Blogs",
        "link": "https://www.news18.com/india/andhra-pradesh-budget-highlights-big-push-for-capital-amaravati-tirupati-as-global-destination-ws-kl-9903178.html",
        "date": "Sat, 14 Feb 2026 13:32:48 +0530",
        "fetched_at": "2026-02-16 04:05:43.391482"
    },
    {
        "title": "Andhra Pradesh Unveils Rs 3.32 Lakh Crore Budget, CM Credits Centre’s Support For Development",
        "content": "The Andhra Pradesh government on Saturday presented a Budget of Rs 3,32,205 crore for the financial year 2026-27, positioning it as a roadmap aimed at balancing welfare commitments with long-term economic growth and infrastructure development.\nFinance Minister Payyavula Keshav tabled the Budget in the State Assembly, marking the third consecutive time he has presented the state’s financial statement, including one Vote-on-Account and two full-fledged budgets.\nIn the budget presented, the revenue expenditure has been estimated at Rs 2,56,143 crore, while capital expenditure is projected at Rs 53,915 crore. The revenue deficit is pegged at Rs 22,002 crore, and the fiscal deficit at Rs 75,868 crore.\nAccording to news agency PTI, the budget seeks to balance welfare and development spending, with significant allocations across social and infrastructure sectors.\nThe government allocated Rs 32,308 crore for School Education and Rs 19,306 crore for the Health, Medical and Family Welfare Department.\nNearly Rs 23,000 crore has been earmarked for the Panchayati Raj and Rural Development Department, while Rs 51,021 crore has been proposed for the BC component.\nIn his Budget speech, Keshav said rebuilding Andhra Pradesh required sustained effort following challenges faced since its formation.\nHe stated that a short period was insufficient to rebuild a state affected first by the 2014 bifurcation and later by governance and financial difficulties between 2019 and 2024.\nHe described the Budget as “not just an account of figures, but as a roadmap aimed at fulfilling the dreams of five crore people.\"\nAGRICULTURE AND IRRIGATION PRIORITY\nThe budget places strong emphasis on agriculture and water security.\nAllocations include Rs 9,906 crore for major irrigation projects and Rs 6,105 crore for the Polavaram project.\nThe Annadata Sukhibhav scheme received Rs 6,600 crore.\nAdditional provisions include Rs 1,927 crore under the Rashtriya Krishi Vikas Yojana, Rs 500 crore for the Price Stabilisation Fund, Rs 260 crore for fisheries services, Rs 250 crore for crop insurance and Rs 190 crore under the PM Krishi Sinchai Yojana.\nCHIEF MINISTER CREDITS CENTRE’S SUPPORT\nIn posts shared on X, the Chief Minister Chandrababu Naidu’s Office expressed gratitude to the Union government, stating, “While financial challenges remain, the government continues to move forward with strong resolve and responsible fiscal management.\"\nThe post added that “continued support from Hon’ble PM Sri Narendra Modi garu and Hon’ble Union Finance Minister Smt. Nirmala Sitharaman garu has been instrumental in advancing key projects such as Polavaram, Amaravati capital development, and the Rayalaseema Global Horticulture Project.\"\nUNION BUDGET OPPORTUNITIES AND FUTURE PLANS\nThe Chief Minister’s Office also highlighted opportunities arising from the Union Budget, noting that under the Purvodaya initiative, Andhra Pradesh would leverage development prospects linked to the East Coast Industrial Corridor, tourism destinations and deployment of e-buses, while advancing the Rayalaseema Global Horticulture Hub.\nHe further said the state aims to maximise benefits from national initiatives such as Rare Earth Corridors, data centres, regional medical hubs, seaplane manufacturing, container manufacturing and the establishment of girls’ hostels in every district.\nReferring to new competitive project models, the Chief Minister’s Office mentioned, “The Union Budget 2026–27 has opened new opportunities for Andhra Pradesh through PPP and Challenge mode projects, promoting efficiency, innovation and competitive execution in public sector development.\"\nIt added that the state is prepared to compete for projects, including chemical parks, mega textile parks, city economic regions and university townships, with the Visakhapatnam Economic Region plan already prepared.\nLatest Blogs",
        "link": "https://www.news18.com/india/andhra-pradesh-budget-chandrababu-naidu-payyavula-keshav-andhra-state-assembly-health-family-welfare-ws-l-9902906.html",
        "date": "Sat, 14 Feb 2026 12:45:19 +0530",
        "fetched_at": "2026-02-16 04:05:44.211197"
    },
    {
        "title": "Maharashtra School Students Perform To Pakistani Military Song At Cultural Event, FIR Filed",
        "content": "A controversy erupted in Maharashtra’s Yavatmal district after students of a government-run Urdu school were allegedly made to perform to a Pakistani military song during a cultural programme, leading to police action against the school administration.\nAccording to multiple media reports, an FIR was registered against the headmaster and a teacher of Abdul Gafur Shah Municipal Urdu School No. 2 in Umarkhed town following a complaint over the performance held as part of a Republic Day-related cultural event.\nVideos from the programme, which surfaced on social media and were widely circulated in local groups, show students performing a choreographed dance while holding symbolic or mock swords.\nThe song playing in the background was believed to be “Ae Mard-e-Mujahid Teri Yalgaar Kahan Hai,\" described as a Pakistani patriotic or military-motivational anthem.\nVisuals seen in the viral clips show children dressed in stage costumes moving in formation, with the music played through loudspeakers and displayed on screens at the venue.\nThe performance appears to be part of a planned cultural presentation before an audience of parents and residents.\n[News18 chose not to share the video to protect the identities of the minors].\nThe videos triggered sharp reactions online after users alleged that the song had historical links to Pakistan’s armed forces.\nAs reported by The Times of India, BJP councillor Gopal Kalane filed a complaint stating that Class 6 students were dancing with symbolic swords to the song and that the performance hurt public sentiments and could negatively influence children.\nPolice subsequently registered an offence under Section 196(1)(c) of the Bharatiya Nyaya Sanhita, 2023, and launched an investigation.\nOfficials were quoted as saying that statements were being recorded and the role of school authorities in approving the programme was being examined.\nAuthorities were also probing how the song was selected and whether guidelines governing school functions were violated.\nThe school administration has not issued a detailed public statement so far.\nLatest Blogs",
        "link": "https://www.news18.com/india/maharashtra-yavatmal-school-students-perform-on-anti-india-songs-pakistani-military-song-viral-video-fir-registered-ws-l-9902787.html",
        "date": "Sat, 14 Feb 2026 11:01:10 +0530",
        "fetched_at": "2026-02-16 04:05:44.848041"
    },
    {
        "title": "'India Will Become Engine Of World Growth': PM Modi Highlights Nation's Agreements, Policy Shifts",
        "content": "Prime Minister Narendra Modi on Friday said India is poised to emerge as a major driver of global growth and a foundational force in the evolving world order, highlighting the country’s economic rise, reform agenda and technology-led transformation.\nAddressing the ET Now Global Business Summit 2026, PM Modi said the past decade had witnessed significant global upheavals, ranging from the pandemic to geopolitical tensions and supply chain disruptions, but asserted that India had turned challenges into opportunities.\n“The past decade of the 21st century has been disrupting the global pandemic. There is tension and war in different parts of the globe, and supply chain breakdowns are shaking the balance of the globe. The world has seen a lot in the past decade,\" he said.\nHe added that crises often reveal a nation’s true potential and said India had demonstrated resilience during this period.\n“I am very proud that in the midst of many disruptions, this decade has been a time of unprecedented development for India. It has been a time of great delivery and a time of strengthening democracy,\" the Prime Minister said.\nINDIA’S ECONOMIC RISE AND GLOBAL ROLE\nRecalling India’s economic position a decade ago, PM Modi said the country had moved steadily upward despite doubts about its trajectory.\n“When the last decade began, India was the 11th-largest economy. But today, India is rapidly becoming the third-largest economy in the world,\" he said.\nHe stressed that India would play a defining role in shaping global growth in the coming decades.\n“The century of change you are talking about, India is going to be a great foundation for it. India will drive the growth of the world. It will become a new engine for the growth of the world,\" he said.\nThe Prime Minister noted India currently contributes more than 16 per cent to global growth and expressed confidence that this contribution would continue to increase.\nNEW WORLD ORDER AND RESILIENCE\nPM Modi said the global order formed after the Second World War was transforming, as earlier assumptions about stable supply chains and uniform development models were breaking down.\n“The world is moving towards a new world order,\" he said, adding that the earlier system was based on a “one size fits all\" approach that is now losing relevance.\nHe said nations are increasingly focusing on building resilience, adding that India had adopted this vision early through the founding principles of NITI Aayog.\nFREE TRADE AGREEMENTS AND POLICY SHIFT\nThe Prime Minister said India’s free trade agreements were now widely discussed internationally, attributing the change to improved governance and clarity in policy.\n“There’s a lot of discussion these days about India’s FTAs. We are able to sign these trade deals because today’s India is full of self-confidence and ready to compete with the world,\" he said.\nHe said earlier policy uncertainty and governance challenges had weakened global confidence, but reforms had changed perceptions about India.\nREFORMS, TECHNOLOGY AND GOVERNANCE\nHighlighting reforms, PM Modi said his government had shifted policymaking towards outcomes rather than mere expenditure.\nHe described India as riding a “Reform Express,\" with technology and innovation serving as core drivers of growth. He cited the Unified Payments Interface (UPI) as a key example of reforms driven by conviction.\n“It’s not just an app; it’s a testament to the remarkable convergence of policy, process, and delivery,\" he said, adding that digital reforms had expanded financial inclusion.\nThe Prime Minister also highlighted increased capital expenditure, infrastructure investments and initiatives such as university townships, economic regions and high-speed rail corridors as steps aimed at strengthening productivity and employment.\nAI AND FUTURE PREPAREDNESS\nPM Modi underlined that artificial intelligence would bring transformative disruptions globally and said India was preparing itself for that future.\nReferring to the upcoming Global AI Impact Summit to be hosted in India, he said the gathering of world leaders and technology experts would help advance efforts toward building a better world.\nReaffirming the government’s long-term vision, PM Modi said India’s policies were guided by the goal of becoming a developed nation by 2047, stressing that decisions taken today were aimed at securing the future of coming generations.\nLatest Blogs",
        "link": "https://www.news18.com/india/pm-narendra-modi-global-business-summit-2026-global-growth-ai-transformation-free-trade-agreements-ws-l-9902719.html",
        "date": "Sat, 14 Feb 2026 09:26:41 +0530",
        "fetched_at": "2026-02-16 04:05:45.505415"
    },
    {
        "title": "Gangster Mukhtar Ansari’s Close Aide Shoaib Kidwai Shot Dead In UP's Barabanki",
        "content": "Shoaib Kidwai, alias Bobby, a known aide of slain gangster Mukhtar Ansari, was shot dead in broad daylight by unidentified motorcycle-borne assailants on the Ayodhya highway in Barabanki. The incident took took place on Friday afternoon near Asaini turn under the Kotwali area.\nShoaib Kidwai, a resident of the Civil Lines area in the district town, was travelling in a car from Lucknow to Barabanki when two motorcycle-borne assailants intercepted his vehicle and opened fire. He was rushed to a nearby hospital, where doctors declared him dead.\nKidwai was accused in several criminal cases, including murder, extortion, and gang-related offences.\nVIDEO | Barabanki, Uttar Pradesh: Shoaib Kidwai alias Bobby, a shooter associated with slain mafia don Mukhtar Ansari, shot dead by unidentified assailants in broad daylight. Visuals from the spot.#MukhtarAnsari(Full video available on PTI Videos – https://t.co/n147TvrpG7) pic.twitter.com/WvzHsIoWvD\n— Press Trust of India (@PTI_News) February 13, 2026\nKidwai’s name had earlier surfaced in the Lucknow jailer murder case, in which he was named as an accused by investigating agencies. Police said he had been facing multiple criminal cases and had long posed a law-and-order challenge.\nOfficials have indicated that early information points to potential internal rivalry and a gang war as the reasons behind the killing. This angle is also under investigation.\nIn response to the incident, security has been heightened throughout the district, with additional police personnel deployed in sensitive areas. Senior officers visited the crime scene and examined the location, while CCTV footage from nearby areas is being reviewed to identify the attackers.\nSuperintendent of Police Arpit Vijayvargiya mentioned that the initial investigation suggests the attack was premeditated. A forensic team has gathered evidence, and raids are underway to apprehend the suspects, he added.\nLatest Blogs",
        "link": "https://www.news18.com/india/gangster-mukhtar-ansaris-close-aide-shoaib-kidwai-shot-dead-in-ups-barabanki-ws-bl-9902096.html",
        "date": "Fri, 13 Feb 2026 19:23:52 +0530",
        "fetched_at": "2026-02-16 04:05:46.140029"
    },
    {
        "title": "End Of An Era: PM Modi Chairs Last Cabinet Meeting In South Block",
        "content": "Prime Minister Narendra Modi on Friday chaired the final meeting of the Union Cabinet at the South Block in New Delhi, marking the end of an era for the British-era Secretariat building.\nFollowing this meeting, the Prime Minister’s Office (PMO) officially shifted to a new complex, ‘Seva Teerth’, as part of the Central Vista redevelopment project.\nPHOTO | Delhi: PM Modi (@narendramodi) chairs the final Cabinet meeting at the South Block building, marking the end of operations at the premises.(Source: Third Party) pic.twitter.com/s1OUmJn0vW\n— Press Trust of India (@PTI_News) February 13, 2026\nSeveral Union Cabinet ministers, Ministers of State (independent charge) were present in the meeting, including:\nAmit Shah\nRajnath Singh\nNirmala Sitharaman\nS Jaishankar\nJP Nadda\nManohar Lal Khattar\nPiyush Goyal\nJitan Ram Manjhi\nKinjarapu Rammohan Naidu\nShivraj Singh Chouhan\nHD Kumaraswamy\nDharmendra Pradhan\nGajendra Singh Shekhawat\nPralhad Joshi\nThe cabinet meeting was followed by the PMO’s relocation to ‘Seva Teerth’. This marked the end of an era, as all government departments vacated the North and South blocks — the seat of power since 1921.\nThe North and South blocks have been the seat of power in the country since 1921. Earlier, the Home Ministry had moved out of the North Block complex at Raisina Hills in Lutyens’ Delhi.\nPrime Minister Narendra Modi on Friday inaugurated the Seva Teerth complex, the new Prime Minister’s Office (PMO), marking the end of nearly 80 years of operations from South Block at Raisina Hill in New Delhi.\nThis is the first time the PMO has shifted out of South Block, marking a historic administrative transition after nearly eight decades. Since Independence in 1947, the PMO had operated from South Block, part of the British-era Secretariat complex designed by Edwin Lutyens and Herbert Baker.\nThe Seva Teerth complex comprises three structures:\nSeva Teerth-1: Houses the PMO with modern workspaces and ceremonial meeting halls.\nSeva Teerth-2: Occupied by the Cabinet Secretariat.\nSeva Teerth-3: Will host the National Security Council Secretariat and the Office of the National Security Advisor.\nSeva Teerth features open-plan interiors, encrypted communications systems, advanced security frameworks and integrated administrative spaces aimed at improving coordination.\nThe North and South Blocks would be transformed into the world’s largest museum.\nThe Yuge Yugeen Bharat National Museum is a landmark project designed to document over 5,000 years of Indian civilisational history. Spanning a massive 1.55 lakh square metres, it is set to surpass the British Museum and the Louvre in scale. The name itself, “Yuge Yugeen Bharat\", translates from Sanskrit as “everlasting India,\" reflecting the nation’s unbroken heritage from the Vedic period to the digital age.\nLatest Blogs",
        "link": "https://www.news18.com/india/end-of-an-era-pm-modi-chairs-last-cabinet-meeting-in-south-block-ws-l-9901954.html",
        "date": "Fri, 13 Feb 2026 19:17:44 +0530",
        "fetched_at": "2026-02-16 04:05:46.760403"
    },
    {
        "title": "India Is Shaping Next Technological Revolution: Mauritius Minister On AI Impact Summit 2026",
        "content": "New Delhi is all set to host the India–AI Impact Summit 2026, announced by Hon’ble Prime Minister Narendra Modi at the France AI Action Summit, the first time in the Global South, from February 16-20.\nThe Summit charts a path towards a future where the transformative power of AI serves humanity, drives inclusive growth, fosters social development, and promotes people-centric innovations that protect our planet. It also seeks to amplify the voice of the Global South, ensuring that technological advancements and opportunities are shared broadly, not concentrated in a few regions.\nWith Prime Minister of Mauritius Navinchandra Ramgoolam set to participate, News18 spoke to Jyoti Jeetun, Mauritian Minister of Financial Services and Economic Planning.\nEdited excerpts:\nQ: India is hosting the AI Action Summit for the first time in the Global South. With Mauritius Prime Minister Dr Navinchandra Ramgoolam attending, how do you see Mauritius aligning with India’s AI vision? Can we expect deeper collaboration in areas like FinTech and digital services?\nA: India’s leadership in hosting the AI Action Summit for the Global South is both timely and visionary. We commend Prime Minister Narendra Modi and the Government of India for taking this initiative. The participation of our Prime Minister, Navinchandra Ramgoolam, underscores Mauritius’ strong commitment not only to artificial intelligence but also to strengthening our strategic partnership with India.\nIndia has long been a global technology leader. Its IT services exports, skilled technology professionals, and the presence of Indian-origin CEOs leading major global tech firms reflect its technological depth. It is only natural that India is now shaping the next technological revolution through AI.\nMauritius sees significant scope for collaboration in AI-driven financial services, FinTech innovation, digital governance, and cross-border digital infrastructure. We are keen to align with India’s digital transformation journey and explore joint initiatives that can benefit both our economies as well as the wider Global South.\nQ: Mauritius is often described as a gateway to Africa. How can India and Mauritius collaborate on trilateral initiatives involving Africa, especially in trade, financial services and technology?\nA: Mauritius is strategically positioned between India and Africa, both geographically and economically. We are a member of the African Union, COMESA and SADC, and we share deep historical and economic ties with India.\nIndia is one of the fastest-growing major economies in the world. On the other hand, Africa represents a continent of 1.4 billion people, and notably, 15 of the 25 fastest-growing economies last year were in Africa. This signals tremendous opportunity.\nMauritius offers a stable, transparent and well-regulated financial ecosystem that can serve as a bridge for Indian companies seeking expansion into Africa. We provide legal certainty, financial structuring expertise, and a professional services ecosystem that supports cross-border investments.\nWith the African Union now a permanent member of the G20 — inducted under India’s presidency — the potential for structured India-Africa engagement has become even stronger. Mauritius can play a catalytic role in enabling that partnership.\nQ: Mauritius has traditionally been seen as a tax-efficient jurisdiction for investments into India. How are you positioning the country today as a financial centre?\nA: Mauritius’ financial services sector has been built and consolidated over the past three decades. Today, we are ranked first in Africa in the Global Financial Centres Index (GFCI), reflecting the strength and credibility of our financial ecosystem.\nOur financial centre is built on substance, governance, regulatory rigour and quality. For decades, Mauritius has been among the largest sources of foreign direct investment into India, reflecting mutual trust and structured engagement.\nWe continue to enhance economic substance requirements, compliance standards and regulatory oversight. Governance and transparency are ongoing priorities, and we are committed to strengthening them further in partnership with global counterparts.\nQ: Following India’s recent tax scrutiny after the Tiger Global Management case, some foreign investors are reassessing structures routed through Mauritius. Should investors be concerned? How is Mauritius responding?\nA: It would not be appropriate for me to comment on specific judicial rulings. However, what I can say is that Mauritius has proactively strengthened its regulatory and economic substance framework over the past several years.\nOur financial sector today is robust, stable and well-regulated. We offer a strong ecosystem of experienced professionals, legal certainty, and a transparent regulatory environment.\nWe recognise that the global financial landscape is evolving, and Mauritius is continuously adapting to meet new standards and expectations. We are committed to ongoing reforms and engagement with international partners to ensure that investors continue to see Mauritius as a stable and credible financial jurisdiction.\nI would reassure investors that Mauritius is focused on reinvention, resilience and long-term sustainability.\nLatest Blogs",
        "link": "https://www.news18.com/india/india-is-shaping-next-technological-revolution-mauritius-minister-on-ai-impact-summit-2026-ws-kl-9902016.html",
        "date": "Fri, 13 Feb 2026 19:57:14 +0530",
        "fetched_at": "2026-02-16 04:05:47.470382"
    },
    {
        "title": "DGCA Imposes Rs 1 Crore Penalty On Air India For Flying Airbus Without Airworthiness Permit",
        "content": "Aviation watchdog Directorate General of Civil Aviation (DGCA) has imposed a penalty of $110,350 (around Rs 1 crore) for operating an Airbus aircraft on eight flights without a valid airworthiness permit, according to a confidential order issued earlier this month, news agency Reuters reported.\nAn Airbus A320 flew passengers between New Delhi, Bengaluru, Mumbai, and Hyderabad on November 24 to 25 without the mandatory Airworthiness Review Certificate, or ARC, a key permit issued annually by the regulator after a plane passes safety and compliance checks.\nAs per the order dated February 5, 2026, issued to Air India CEO Campbell Wilson, Joint Director General of Civil Aviation Maneesh Kumar noted that the security lapse had “further eroded public confidence and adversely impacted the safety compliance of the organisation.\"\nAn internal investigation conducted by Air India described the incident as a result of “systemic failures\" and acknowledged the urgent need to strengthen its compliance culture. The probe also reportedly blamed pilots who operated the eight flights, saying they did not follow standard operating procedures before take-off, the news agency reported.\nThe regulator held the airline’s accountable manager responsible for the breach and directed the carrier to deposit the penalty within 30 days.\nMeanwhile, Air India responded to the DGCA order and said that all flaws have been satisfactorily addressed and shared with the authority.\n“Air India acknowledges the receipt of a DGCA order in relation to an incident that was voluntarily reported back in 2025. All identified gaps have since been satisfactorily addressed and shared with the authority.\nAir India remains unwavering in its commitment to maintaining the highest standards of operational integrity and safety,\" an Air India spokesperson said.\nThe airline has faced increased scrutiny over safety practices in recent months. It had earlier received warnings from the watchdog for operating aircraft without checking emergency equipment and for other audit lapses.\nThe latest penalty came months after Air India suffered its worst disaster on June 12 after a London-bound Boeing Dreamliner, carrying 242 passengers and crew, including former Gujarat chief minister Vijay Rupani, crashed into a medical college complex shortly after taking off from Ahmedabad’s Sardar Vallabhbhai Patel International Airport. 275 people lost their lives, including 120 men, 124 women, and 16 children.\n(With inputs from Reuters)\nLatest Blogs",
        "link": "https://www.news18.com/india/aviation-watchdog-imposes-rs-1-crore-penalty-on-air-india-over-safety-lapses-report-9901838.html",
        "date": "Fri, 13 Feb 2026 18:59:53 +0530",
        "fetched_at": "2026-02-16 04:05:48.108182"
    },
    {
        "title": "Elephant Tusks Worth Rs 2 Crore Stolen From A Military Camp In Kerala",
        "content": "The Poojappura police have registered a theft case after two elephant tusks, estimated to be worth over Rs 2 crore, were reported missing from the high-security Pangode Military Camp in the Kerala capital.\nAccording to the complaint, the tusks were allegedly stolen from within the camp premises. A case has been filed under Sections 331(4) and 305(e) of the Bharatiya Nyaya Sanhita (BNS).\nPolice suspect the involvement of a person who had entered the camp premises to organise a DJ party. However, officials said details surrounding the theft remain unclear.\n“We currently don’t have any information about the theft. We are gathering the information,\" the Defence PRO told Onmanorama.\nA detailed investigation has been launched to determine how the tusks went missing from the tightly secured defence establishment.\nPangode Military Camp, located in Thirumala in Thiruvananthapuram, functions under the Southern Command of the Indian Army. The base conducts key training activities and hosts joint military exercises. Known for its strict access controls, the camp is considered one of Kerala’s major defence installations.\nLatest Blogs",
        "link": "https://www.news18.com/india/elephant-tusks-worth-rs-2-crore-stolen-from-a-military-camp-in-kerala-ws-el-9899842.html",
        "date": "Fri, 13 Feb 2026 15:45:00 +0530",
        "fetched_at": "2026-02-16 04:05:48.717630"
    },
    {
        "title": "'Matter Of Pride': UP Deputy CM Keshav Prasad Maurya Praises Govt's Vande Mataram Directive",
        "content": "Uttar Pradesh Deputy Chief Minister Keshav Prasad Maurya on Friday welcomed the Union Home Ministry’s directive mandating the singing of all six verses of the national song, Vande Mataram, before the national anthem, calling it a “matter of pride.\"\nSpeaking to news agency ANI, Maurya said, “Vande Mataram has been notified in the gazette; now all Indians should sing Vande Mataram as the national song. This is a matter of pride, and I congratulate the Home Minister for this.\"\nBJP MP Sudha Murthy also expressed support, stating, “I like Vande Mataram and Jana Gana Mana.\"\nThe reactions follow the Union Ministry of Home Affairs (MHA) releasing detailed guidelines for the national song, stating that when both the national song and the national anthem are performed at an event, all six stanzas of the official version of Vande Mataram must be presented first.\nEarlier on Thursday, Madhya Pradesh Chief Minister Mohan Yadav welcomed the directive, saying the state government would implement it immediately. Speaking to reporters, CM Yadav said, “I not only approve of the decision by the Home Ministry, under the leadership of the Prime Minister, to sing six verses of Vande Mataram before Jana Gana Mana, but also I feel joy that this decision by our Prime Minister will bring the entire nation together with us to remember all those who sacrificed their lives for the country before independence. We are fortunate that the Prime Minister has decided to sing the entire Vande Mataram. The Madhya Pradesh government also supports this decision, and we will implement it immediately in our state.\"\nMadhya Pradesh School Education Minister Uday Pratap Singh also praised the move, noting its potential to inspire nationalism among future generations. He said, “I believe this auspicious day has arrived quite late. The work that should have been done years ago has now been carried out by Prime Minister Modi. I proudly say that this decision will become a major role to inspire a sense of nationalism among the coming generations in India. I thank Prime Minister Modi from the bottom of my heart, and I feel proud that a decision which should have been taken much earlier was implemented during his tenure.\"\nOn implementation in schools, Singh added, “Most schools and institutions follow this on their own, but I believe that when something becomes law, it naturally becomes mandatory for every institution and school to implement it. I would say this is a very good decision.\"\nThe move has received widespread support, with leaders hailing it as a step toward fostering national pride and unity.\nLatest Blogs",
        "link": "https://www.news18.com/india/matter-of-pride-up-deputy-cm-keshav-prasad-maurya-praises-govts-vande-mataram-directive-ws-l-9901187.html",
        "date": "Fri, 13 Feb 2026 15:06:31 +0530",
        "fetched_at": "2026-02-16 04:05:49.550463"
    },
    {
        "title": "Ministers Assert India-US Trade Deal Safeguards Farmers' Interests, Call Rahul Gandhi 'Habitual Liar'",
        "content": "Prime Minister Narendra Modi has always been in favour of the farmers and continues to prioritise their welfare in international trade agreements, said Union Minister of Agriculture and Farmers Welfare, Shivraj Singh Chouhan.\nTaking to X, Chouhan said, “Prime Minister Narendra Modi has always been in favour of the farmers. All his decisions have been taken in favour of the farmers. His plans have changed their lives.\"\nTalking about the recent trade agreement signed with the United States, the Union Minister said that the deal is designed to protect the interests of the domestic agricultural sector.\nChouhan noted that the Prime Minister’s decisions consistently aim to improve the lives of those in the farming community through strategic planning and policy shifts.\nThe Agriculture Minister emphasised that the agreement specifically addresses the needs of farmers who produce various staples. “The farmers who produce grains like wheat, rice, corn, soya and other grains have been taken care of,\" Chouhan said.\nआदरणीय प्रधानमंत्री श्री @narendramodi जी के नेतृत्व में देश का अन्नदाता सुरक्षित भी है, समर्थ भी है और सशक्त भी है। pic.twitter.com/I79m3TsV27— Shivraj Singh Chouhan (@ChouhanShivraj) February 12, 2026\nHe further explained that the deal ensures protection for those involved in different segments of the industry. According to the Minister, “The farmers who produce fruits and vegetables have also been protected in this agreement.\"\nTalking about the exposure to the international market, Chouhan said that beyond spices, several other commodities are expected to benefit from increased international exposure. “Spices, coffee, tea, marine products, and many other things will get a new market,\" he said.\nUnion Minister Dharmendra Singh Pradhan also talked about PM Modi’s visionary leadership and said that “India will never compromise on the interests of our ‘Annadatas’.\"\n“Farmers’ interests are fully protected, dairy and poultry are safeguarded, and exports are expanding, directly strengthening livelihoods,\" Pradhan said, adding, “On the global stage, India has delivered a historic win by securing duty-free access to the US for garment and textile exports, injecting fresh momentum into industry, manufacturing, and India’s global economic presence.\nUnder the visionary leadership of Prime Minister Shri Narendra Modi, India will never compromise on the interests of our ‘Annadatas’.Farmers’ interests are fully protected, dairy and poultry are safeguarded, and exports are expanding, directly strengthening livelihoods.\nOn the…\n— Dharmendra Pradhan (@dpradhanbjp) February 13, 2026\nIn addition to this, the Minister also slammed Rahul Gandhi and Congress party for spreading misinformation, theatrics, and divisive politics.\nAccusing the Congress of doing nothing to address the real concerns of our farmers, Pradhan attacked them for repeatedly tying to downplay India’s global achievements. “Their politics thrives not on solutions, but on denial, distortion, and manufactured outrage,\" he added.\nUnion Commerce Minister Piyush Goyal also on Thursday hit out at Congress leader Rahul Gandhi, calling him a “habitual liar\" and accusing him of misleading farmers with what he termed a “fake narrative\" regarding the recent trade agreement with the United States.\nIn a self-made video posted on X, Goyal alleged that Rahul Gandhi had “broken all records of speaking falsehood\" and made “baseless allegations\" in a video released earlier in the day.\nAnnadata Devo Bhava!Under PM @NarendraModi ji’s leadership, our farmers will always be secure, empowered, and prosperous. pic.twitter.com/tkUCHCsa7w\n— Piyush Goyal (@PiyushGoyal) February 12, 2026\nHe further accused the Congress leader of attempting to provoke farmers.\n“Rahul Gandhi is a habitual liar…In a video released today, he has broken all records of speaking falsehood and made baseless allegations. He is misleading our farmers with his fake narrative and trying to provoke them,\" he said.\n“Prime Minister Narendra Modi has always been empathetic towards our farmers. He has always put the interest of farmers first and taken all decisions to ensure their prosperity…In the recent trade deal with the United States of America, the interests of farmers have been kept paramount and fully protected…,\" Goyal said in the video.\nLatest Blogs",
        "link": "https://www.news18.com/india/bjp-asserts-india-us-trade-deal-safeguards-farmers-interests-calls-rahul-gandhi-habitual-liar-9900922.html",
        "date": "Fri, 13 Feb 2026 16:08:56 +0530",
        "fetched_at": "2026-02-16 04:05:50.303059"
    },
    {
        "title": "Minister Ashish Shelar Receives UNESCO World Heritage Certificate For 12 Marata Forts",
        "content": "Maharashtra’s Cultural Affairs Minister, Ashish Shelar, has formally received the UNESCO World Heritage certificate recognising twelve forts associated with Chhatrapati Shivaji Maharaj. The certificate was accepted at the UNESCO headquarters in Paris, marking the completion of a long process that brought global recognition to the historic Maratha military network.\nThe forts were inscribed last year under the title ‘Maratha Military Landscapes of India’ during the 47th session of UNESCO held on July 11, 2025. After technical presentations and follow-up documentation by the Maharashtra government delegation, the official recognition document has now been handed over. Officials described it as an important cultural moment not only for the state but for the country’s historical legacy.\nMaharashtra Chief Minister, Devendra Fadnavis, also expressed joy over the development.\nA moment of joy and pride !The official certificate declaring 12 forts of Chhatrapati Shivaji Maharaj as UNESCO World Heritage Sites was formally handed over to Cultural Affairs Minister Ashish Shelar.\nThe recognition marks a historic and emotional moment for the people of…\n— Devendra Fadnavis (@Dev_Fadnavis) February 12, 2026\nThe group includes Raigad, Rajgad, Pratapgad, Panhala, Shivneri, Lohgad, Salher, Sindhudurg, Suvarnadurg, Vijaydurg, Khanderi and Gingee Fort in Tamil Nadu. Built across mountains and coastline, these forts formed a strategic defence system during Shivaji Maharaj’s rule. Historians regard the network as a unique example of military planning combined with governance and public welfare.\nThe state government said the recognition places India’s indigenous fort architecture on the global heritage map. During his visit, Shelar also paid tribute to B. R. Ambedkar at the UNESCO premises, where Maharashtra had installed his bust on Constitution Day last year. The memorial symbolises values of equality, education, and social justice, which align with UNESCO’s ideals.\nCalling the honour emotional and historic, the minister thanked national and state leadership for support throughout the nomination process. Officials present at the ceremony included India’s Permanent Representative to UNESCO, Vishal Sharma, and senior officers from the cultural and archaeology departments. The state government said the recognition will help conservation efforts and increase global awareness of Maharashtra’s heritage. For many in the state, the acknowledgement is seen as a tribute to Shivaji Maharaj’s vision and a reminder of the region’s enduring historical identity.\nTourism officials believe the World Heritage status will encourage responsible tourism while ensuring better preservation of the forts. Plans are being discussed to improve visitor facilities, signage, and guided interpretation without disturbing the original structures. Conservation experts say global recognition also brings stricter monitoring standards, which will help protect the sites from damage and unplanned development. For local communities living around the forts, the move is expected to create livelihood opportunities through heritage tourism and cultural activities.\nLatest Blogs",
        "link": "https://www.news18.com/india/minister-ashish-shelar-receives-unesco-world-heritage-certificate-for-12-marata-forts-ws-bl-9900495.html",
        "date": "Fri, 13 Feb 2026 12:16:12 +0530",
        "fetched_at": "2026-02-16 04:05:50.963243"
    },
    {
        "title": "Maharashtra Govt Unveils Multi-Sector Plan To Make Mumbai ‘Drug-Free And World-Class’",
        "content": "The Maharashtra government has announced a broad plan to improve living conditions in Mumbai, aiming to turn the city into what it described as a “drug-free and world-class\" urban centre. Deputy Chief Minister Eknath Shinde shared the roadmap after a meeting of the Mumbai City District Planning Committee on Wednesday.\nThe government said that the new approach will combine health, housing, civic works and enforcements measures at the same time. The coordinated action will bring quicker and more visible results for residents.\nOne major focus is tackling substance abuse. Every municipal hospital will open de-addiction, counselling and rehabilitation facilities under a city-wide anti-drug campaign. Authorities will also push stalled housing schemes and speed up cluster redevelopment, while continuing work on large affordable housing projects across Mumbai.\nWith monsoon approaching, civic agencies have been instructed to complete road repairs, desilting of drains and flood prevention work.\nThe Maharashtra Deputy CM said that the first phase of concrete roads has already been finished and the second phase is nearing completion, with the next phase to start soon.\n📍 #मुंबई |मुंबई शहर जिल्हा नियोजन समितीची बैठक आज जागतिक व्यापार केंद्रातील नियोजन समिती कक्षात पार पडली. या बैठकीत वर्ष २०२६ -२७ साठी वाढीव मागण्यांसह ८१३ कोटी ३५ लाख ७२ हजार रकमेच्या प्रारूप आराखड्यास मंजुरी देण्यात आली.\nयात प्रामुख्याने मुंबईला ड्रग्स-फ्री, झोपडपट्टीमुक्त… pic.twitter.com/ygXkEQkq0s\n— Eknath Shinde – एकनाथ शिंदे (@mieknathshinde) February 12, 2026\nWaterlogging points will get pumping systems, holding ponds will remain operational and damaged asphalt roads will be repaired.\nEncroachments on footpaths will be cleared through a special drive to improve pedestrian safety. At the same time, authorities have been told to consider the livelihoods of those affected.\nTraffic congestion near railway stations and markets will be addressed through coordination between multiple agencies. Mobile toilets and women-only “pink toilets\" will be placed in crowded areas, and maintenance of public toilets will be tightened.\nThe plan also includes pollution control measures. Construction sites, both private and government, will have to use sprinklers and protective netting to reduce dust and improve air quality.\nIn healthcare, the government aims to widen coverage under the public health scheme to include expensive treatments such as angiography and stent procedures. Hospitals have been directed to ensure medicines are provided free to patients after inspections found some were still purchasing them outside facilities.\nPolice and district authorities have additionally been instructed to identify illegal foreign nationals and take legal action where required.\nShinde said the government wants to provide immediate relief while also planning long-term improvements so that the city becomes cleaner, safer and better prepared through coordinated efforts rather than isolated projects.\nFor Mumbaikars, the announcement raises cautious hope. Many of these promises have been made before, but citizens say the real test will be daily experience — cleaner streets, smoother travel, and reliable public services. If departments work together and deadlines are met, the impact could be visible quickly. Otherwise, it risks becoming another plan on paper. The government now faces the challenge of turning intent into visible change across neighbourhoods.\nLatest Blogs",
        "link": "https://www.news18.com/india/maharashtra-govt-unveils-multi-sector-plan-to-make-mumbai-drug-free-and-world-class-ws-l-9900449.html",
        "date": "Fri, 13 Feb 2026 11:25:54 +0530",
        "fetched_at": "2026-02-16 04:05:51.575762"
    },
    {
        "title": "Telangana Local Body Election Results Live: Congress Crosses 900-Mark, BRS Leads On 521 Seats; BJP Trailing",
        "content": "Telangana Municipal Election Results 2026 Live Updates: Counting of votes for elections in 116 municipalities and seven municipal corporations in Telangana began on Friday, marking a key test of popularity for the ruling Congress, opposition BJP and BRS.\nCongress has crossed the 900-mark in overall leads and wins, consolidating a strong position in the early trends. Meanwhile, BRS is leading on 521 seats, the BJP on 174, and other parties and independents on 169 seats, indicating a decisive edge for Congress in the ongoing count.\nAhead of the counting, major parties moved their candidates to undisclosed locations to prevent poaching by rivals, according to PTI sources. Counting is being conducted at 123 centres across the state since 8 am. The process is expected to take time, as ballot papers were used in these elections. Voting took place on February 11.\nThe State Election Commission (SEC) stated that adequate security arrangements have been made to ensure peace and order. Section 163 of the BNSS (prohibitory orders) is in force around the counting centres.\nDirector General of Police (DGP) B Shivadhar Reddy said that comprehensive security measures are in place. Nearly 12,000 police personnel, supported by armed forces and Quick Response Teams, have been deployed to maintain law and order during the counting. Follow for live updates.\nTotal seats: 60\nTotal municipalities-19\nAs per the data announced by Telangana State Election Commission, Congress has won Yellandu, Aswaraopeta, Parakala, Dharmapuri, Korutla, Station Ghanpur, Bhupalapally, Yellareddy, Banswada, Bichkunda, Huzurabad, Choppadandi, Edulapuram, Wyra, Madhira, Kalluru, Sattupalli, Luxettipet, Chennur, Dornakal, Maripeda, Bhoothpur, Chevella, Shadnagar, Shankarpally, Kodangal, Tandur, Atmakur, Pebbair, Wanaparthy, Kalwakurthy, Kollapur, Nagarkurnool, Chandur, Chityal, Devarakonda, Haliya, Miryalguda, Nandikonda, Huzurnagar, Kodada, Neredcherla and Suryapet municipalities.\nAs of 6 pm, Telangana State Election Commission has announced results of 2,836 Wards. Check party wise result:\nTotal – 34\nTotal -24\nOut of the 2,996 Wards, Telangana State Election Commission has announced the results of 2,774 wards. Check party wise result below.\nTotal seats 30, check party wise results below:\nIn the Kothagudem Municipal Corporation, CPI emerged as the largest party with 21 seats, followed by Congress with 17, while BRS won six, Independents five, and BJP one.\nCongress is leading in Ramagundam, Nalgonda and Manchirial Corporations as counting of votes are underway.\nCongress has crossed the 900-mark in overall leads and wins, consolidating a strong position in the early trends. Meanwhile, BRS is leading on 521 seats, the BJP on 174, and other parties and independents on 169 seats, indicating a decisive edge for Congress in the ongoing count.\nIn Vikarabad district, results have been declared for 41 out of 100 wards across four municipalities, including seats decided unanimously. Congress emerged ahead with 20 wards, followed by BRS with 14. BJP secured 3 wards, while AIMIM and Independent candidates won 2 wards each.\nTelangana Congress leaders celebrated at the party office in Nampally, Hyderabad, distributing sweets, bursting crackers, beating drums and dancing as early trends in the municipal election results boosted their morale. Expressing confidence of securing more seats, party workers rejoiced after the State Election Commission announced that Congress had won 240 of the 448 Municipal Corporation wards declared so far.\n#WATCH | Telangana Congress leaders distribute sweets, burst crackers, beat drums and dance as they celebrate at the party office in Nampally, Hyderabad, expressing confidence that they will win more seats in today’s municipal election results.\nAs per the State Election… pic.twitter.com/1wOnuSyFEd\n— ANI (@ANI) February 13, 2026\nEarly trends indicate that Congress has crossed the 600-mark in total seats, establishing a strong lead. Meanwhile, BRS is ahead on 350 seats, and the BJP is leading in 102 seats, reflecting a competitive contest across several municipalities and wards in the state.\nSo far, Congress has secured victories in 27 municipalities, while BRS won in four, reflecting a strong lead for the ruling party in the local polls.\nEarly trends show that Congress has crossed the 430-mark in total seats, while BRS leads on 250 seats. The BJP is ahead on 64 seats, indicating a competitive race among the major parties.\nCongress has won Aswaraopeta Municipality in Bhadradri Kothgudem district of Telangana.\nCongress has won Nandikonda Municipality in Nalgonda district of Telangana.\nCongress has won ward number 15 in Sangareddy.\nBRS has won ward number 12 in Ibrahimpatnam Municipality with a margin of 100 votes.\nIn Sangareddy District, BRS emerged victorious in the Gaddapotharam Municipality elections, winning 14 seats, while Congress secured 3 seats and an independent candidate won 1 seat.\nRajanna Sircilla in-charge Collector Garima Agrawal inspected the ongoing municipal vote counting process, overseeing arrangements to ensure a smooth and orderly procedure.\nDirector General of Police B Shivadhar Reddy stated that robust security measures have been implemented for the vote counting. Around 12,000 police personnel, supported by Quick Response Teams, have been deployed at the counting centres, and prohibitory orders are in effect in and around these areas to ensure law and order, PTI reported.\nIn Warangal District’s Wardhannapet, counting of votes for the municipal elections is currently underway. Visuals have emerged from the counting centre. The police and Election Commission have put in place security and logistical arrangements to ensure the process is conducted smoothly and in an orderly manner.\n#WATCH | Telangana: Counting of votes for Municipal election is underway in Wardhannapet, Warangal District. The Police and Election Commission have made arrangements for the counting of votes at the centres. pic.twitter.com/ap8oW61TZH\n— ANI (@ANI) February 13, 2026\nThe counting of votes for elections in 116 municipalities and seven municipal corporations in Telangana began on Friday.\nLatest Blogs",
        "link": "https://www.news18.com/india/telangana-municipal-elections-results-2026-ts-local-body-polls-vote-counting-winners-list-telangna-election-commission-latest-news-liveblog-ws-l-9900279.html",
        "date": "Fri, 13 Feb 2026 19:30:40 +0530",
        "fetched_at": "2026-02-16 04:05:52.709486"
    },
    {
        "title": "MK Stalin's Big Pre-Poll Move: Rs 5,000 Each For 1.3 Crore Women Under Kalaignar Scheme",
        "content": "Tamil Nadu Chief Minister MK Stalin on Friday announced the disbursal of Rs 5,000 to women beneficiaries under the Kalaignar Women’s Rights Scheme, describing it as part of his government’s ongoing commitment to women’s welfare.\nIn a post on X, Chief Minister Stalin emphasised that the payments, covering February, March, and April, include Rs 3,000 as the standard monthly allocation and an additional Rs 2,000 as a “summer special\" bonus. He stated that the funds have already been credited to 1.31 crore women under the scheme.\nதமிழ்நாட்டு மகளிருக்கு இந்த ஸ்டாலின் தந்த உறுதிமொழிதான் உரிமைத்தொகை. யார் தடை ஏற்படுத்தினாலும் அதிலிருந்து பின்வாங்க மாட்டேன்.தேர்தலைக் காரணம் காட்டி, மூன்று மாதங்களுக்கு உரிமைத்தொகையை முடக்கப் பார்க்கிறார்கள். முந்திக்கொண்டது நமது #DravidianModel அரசு!\nபிப்ரவரி, மார்ச்,… pic.twitter.com/n7VrMqcrb7\n— M.K.Stalin – தமிழ்நாட்டை தலைகுனிய விடமாட்டேன் (@mkstalin) February 13, 2026\n“This promise given by this Stalin to Tamil Nadu women is the rights allocation. No matter who imposes obstacles, I will not back down from it. Using elections as an excuse, they are trying to stall the rights allocation for three months. What was promised was by our #DravidianModel government! As advance for February, March, April months: ₹3 thousand + as summer special allocation: ₹2 thousand!,\" he tweeted.\nStalin described the scheme as a hallmark of the Dravidian Model government, asserting that attempts to delay the disbursement by three months, allegedly citing elections as an excuse, would not deter his administration. “No matter who imposes obstacles, I will not back down from it,\" he wrote, highlighting his commitment to the programme.\nThe DMK leader also promised that in the proposed Dravidian Model 2.0, the monthly rights allocation would increase from Rs 1,000 to Rs 2,000, reinforcing his focus on expanding financial support to women. He concluded the post with a message of solidarity and electoral confidence, urging women to support the party in the upcoming assembly elections.\nThe tweet comes ahead of the Tamil Nadu assembly elections scheduled later this year, with Stalin’s government seeking to highlight welfare measures targeted at women as a key campaign plank.\nTamil Nadu Congress Chief Vows To Protect Scheme\nSelvaperunthagai K, President of the Tamil Nadu Congress Committee, welcomed the increase in monthly assistance for women household heads, noting that 1.31 crore families will benefit from the move.\nமகளிர் குடும்பத் தலைவர்களுக்கான மாதாந்திர உதவித் தொகை உயர்வு அறிவிப்பு மகிழ்ச்சி அளிக்கிறது.இதனால் தமிழ்நாடு முழுவதும் 1.31 கோடி குடும்பங்கள் நேரடியாகப் பயன் பெற உள்ளன.\nகடந்த மாதம் தமிழர் திருநாளான பொங்கல் முன்னிட்டு ஒரு குடும்பத்திற்கு ரூ.3,000 வழங்கப்பட்டதும், தற்போது…\n— Selvaperunthagai K (@SPK_TNCC) February 13, 2026\nIn a post on X, Selvaperunthagai wrote, “The announcement of the monthly assistance amount increase for women household heads brings joy. As a result, 1.31 crore families across Tamil Nadu will directly benefit. Last month, ahead of the Tamil harvest festival of Pongal, Rs 3,000 was provided per family, and now this month, with Rs 5,000 being provided under the women’s rights scheme, families will receive a total of Rs 8,000 in consecutive months, bringing about real change in the lives of families. This will serve as true relief for poor and middle-class families struggling under the burden of rising prices.\"\nHe praised the move as recognition of women’s labor and self-reliance, while accusing the Union government of attempting to “obstruct this people-welfare scheme.\"\n“We cannot accept this trend of disregarding state rights and the welfare of the people. The Tamil Nadu Congress Committee will firmly safeguard this scheme that ensures social justice and human compassion,\" he further wrote.\nCommentator Sumanth Raman Targets Tamil Nadu Govt Over Cash Scheme\nCommentator Sumanth Raman criticised the Tamil Nadu government over its announcement of Rs 2,000 for “summer expenses,\" questioning the timing ahead of elections. In a post on X, he alleged that the financial assistance amounted to voter inducement.\n“A Govt that claims to have transformed Tamil Nadu and fulfilled most of its promises has to resort to what is effectively a bribe to the voters before the elections. Rs 2000 for Summer expenses? What next? Monsoon expenses and Winter expenses?\" Raman wrote in a post on X.\nHe also pointed out that with Rs 3,000 given for Pongal and now Rs 2,000 for summer expenses, nearly Rs 10,000 crore is being distributed, suggesting the move is linked to the upcoming polls.\n“How is this any different from the BJP bribing Bihar voters with Rs 10,000 before the elections? Rs 3,000 for Pongal expenses and now Rs 2000 for summer expenses? Almost Rs 10,000 crore being distributed because elections are coming,\" he further wrote.\nLatest Blogs",
        "link": "https://www.news18.com/india/stalin-credits-rs-5000-to-1-3-crore-women-under-kalaignar-scheme-promises-hike-in-allocation-ws-l-9900228.html",
        "date": "Fri, 13 Feb 2026 09:08:04 +0530",
        "fetched_at": "2026-02-16 04:05:53.565016"
    },
    {
        "title": "Can You Be Penalised For Playing Loud Music On A Flight? Here's What Government Says",
        "content": "Playing loud music on an aeroplane without earphones may lead to penal action if such actions lead to unruly behaviour under aviation rules. Replying to a question raised in the Lok Sabha by Namakkal MP Matheshwaran, Minister of State for Civil Aviation Murlidhar Mohol said the action will be taken as per the Civil Aviation Requirements (CAR) issued by the DGCA.\nThe Directorate General of Civil Aviation (DGCA) issued CAR to deal with unruly passengers.\nWithout indicating any new penal provisions for people playing loud music on the aircraft, the minister clarified that the airlines provide in-flight entertainment and play soft instrumental music during boarding and disembarkation.\nHe further highlighted Rules 22, 23, and 29 of the Aircraft Rules of 1937 that cover disruptive behaviour on board an aircraft.\nRule 22 deals with refusal of carriage and disembarkation of passengers, Rule 23 empowers the pilot-in-command to restrain persons acting in a manner prejudicial to safety or good order, and Rule 29 provides for penalties for contravention of the Aircraft Rules.\nThe minister also responded to a query related to vlogging inside an aeroplane and underscored Rule 13 of the Aircraft Rules which restricts photography at DGCA-licensed aerodromes.\nLatest Blogs",
        "link": "https://www.news18.com/india/playing-loud-music-on-flight-an-offence-heres-what-government-says-ws-be-9899313.html",
        "date": "Thu, 12 Feb 2026 19:25:43 +0530",
        "fetched_at": "2026-02-16 04:05:54.821181"
    },
    {
        "title": "CNBC AWAAZ Sweeps Budget Day, Leads FM Speech And Budget Week Ratings",
        "content": "Cementing its position as the market leader in Hindi business news, CNBC AWAAZ emerged as the go-to destination for investors and market watchers during the Union Budget 2026 coverage.\nAccording to BARC data, CNBC AWAAZ captured a dominant 63% market share during the live telecast of Finance Minister Nirmala Sitharaman’s Budget speech on 1st February 2026, significantly outperforming Zee Business, which stood at 37%.\n(Source: BARC | MKT: HSM Urban | TG: 22-40 M | Period: 1st Feb 2026(1100-1230)\nThe leadership extended across the full Budget Day as well. On 1st February 2026, CNBC AWAAZ secured a 61.3% market share, while Zee Business registered 38.7%, highlighting CNBC AWAAZ’s dominance during one of the most competitive and high-stakes news events of the financial calendar. (Source: BARC | MKT: HSM Urban | TG: 22-40 M | Period: 1st Feb 2026)\nBudget Day traditionally drives intense viewer engagement, as audiences track policy announcements, taxation reforms, sectoral allocations, fiscal discipline measures, and their real-time impact on markets. CNBC AWAAZ’s comprehensive coverage, blending expert analysis, corporate voices, and live market decoding, resonated strongly with its core audience of investors and traders.\nThe momentum carried into Budget Week, where CNBC AWAAZ maintained a commanding lead with a 76.4% market share, compared to Zee Business at 23.6%,  less than half of CNBC AWAAZ’s share, reaffirming sustained viewer preference beyond the headline announcements. (Source: BARC | MKT: HSM 10L+ | TG: 22-40 M | Period: Wk 05’26)\nOn the digital front as well, CNBC AWAAZ emerged among the world’s top-viewed live news streams on Union Budget Day 2026. During the peak live window between 11:00 am and 12:40 pm, the channel emerged as the clear leader in digital viewership, registering a peak concurrency of 765.1K, recording 3.5x the viewership of Zee Business, highlighting its growing cross-platform strength. (Source: Databeings)\nWith sustained leadership across key market hours and critical policy moments, CNBC AWAAZ continues to strengthen its position as India’s most-watched Hindi business news channel, setting new benchmarks  year after year.\nLatest Blogs",
        "link": "https://www.news18.com/india/cnbc-awaaz-sweeps-budget-day-leads-fm-speech-and-budget-week-ratings-9899245.html",
        "date": "Thu, 12 Feb 2026 18:16:16 +0530",
        "fetched_at": "2026-02-16 04:05:55.420315"
    }
]