[
    {
        "title": "Bill Gates skips keynote address at India AI summit amid Epstein files controversy",
        "content": "Microsoft co-founder Bill Gates. File\n| Photo Credit: Reuters\nBill Gates ‌will not appear at the India ​AI Impact Summit on ⁠Thursday (February 18, 2026) to deliver his keynote address, dealing another blow to an event already ‌marred by organisational lapses, a robot snafu and delegate ‌complaints over VIP traffic disruptions.\nNo reason ‌was ⁠given. But the Gates ⁠Foundation said the billionaire will not deliver his address “to ensure the focus remains on the ​AI Summit’s ‌key priorities”.\n“After careful consideration, and to ensure the focus remains on the AI Summit’s key priorities, Mr. Gates will not be delivering his keynote address. The Gates Foundation remains fully committed to our work in India to advance our shared health and development goals,” the foundation said in a statement.\nThe cancellation comes after the U.S. Department of Justice released emails last month that included ‌communication between late financier and convicted ​sex offender Jeffrey Epstein and the foundation’s staff.\nThe documents ⁠indicate Gates and Epstein met repeatedly after Epstein’s prison term to discuss ‌expanding Gates’ philanthropic efforts. Gates has said the relationship was confined to philanthropy-related discussions and that it was a mistake for him to meet with Epstein.\nThe Gates ‌Foundation, the philanthropic organisation started by Microsoft ​co-founder Bill Gates and his then-wife in 2000, is one ⁠of the world’s biggest funders of ⁠global health initiatives. Bill Gates is chair and a board member ‌of the foundation.\ntechnology (general)\n/\nsummit\n/\nIndia\n/\nArtificial Intelligence",
        "link": "https://www.thehindu.com/sci-tech/technology/bill-gates-skips-keynote-address-at-india-ai-summit-amid-epstein-files-controversy/article70650292.ece",
        "date": "Thu, 19 Feb 2026 09:25:22 +0530",
        "fetched_at": "2026-02-19 04:01:23.889229"
    },
    {
        "title": "US tech giants announce India deals at AI summit",
        "content": "Nvidia, the world’s most valuable company, said it was teaming up with three Indian cloud computing providers [File]\n| Photo Credit: REUTERS\nGoogle said it would build new subsea cables from India and chip titan Nvidia unveiled tie-ups with computing firms on Wednesday as tech giants rushed to announce deals and investments at a global AI conference in New Delhi.\nThis week's AI Impact Summit is the fourth annual gathering to discuss how to govern the fast-evolving technology, and also an opportunity for India to raise its profile in the booming sector.\n\"India's going to have an extraordinary trajectory with AI and we want to be a partner,\" Google CEO Sundar Pichai told reporters as the US firm unveiled a plan to boost connectivity to the South Asian country.\nNew direct undersea connections from India to Singapore, South Africa and Australia will be constructed, it said, touting faster connections as demand for computing power, including AI, ramps up.\nIt is part of Google's $15 billion investment announced in October to construct its largest AI data centre hub outside the United States, in Visakhapatnam, a port city in the southeastern state of Andhra Pradesh.\nAlso on Wednesday, the California-based Nvidia, the world's most valuable company, said it was teaming up with three Indian cloud computing providers to provide advanced processors for data centres that can train and run AI systems.\nDozens of world leaders and ministerial delegations are in New Delhi for the summit to discuss the opportunities and threats, from job losses to misinformation, that AI poses.\nLast year India leapt to third place, overtaking South Korea and Japan, in an annual global ranking of AI competitiveness calculated by Stanford University researchers.\nBut despite its plans for large-scale infrastructure and grand ambitions for innovation, experts say the country has a long way to go before it can rival the United States and China.\nThe AI conference has brought a flurry of deals, with IT minister Ashwini Vaishnaw saying Tuesday that India expects more than $200 billion in investments over the next two years, including roughly $90 billion already committed.\nMumbai cloud and data centre provider L&T said Wednesday it was teaming up with Nvidia to build what it touted as \"India's largest gigawatt-scale AI factory\".\n\"We are laying the foundation for world-class AI infrastructure that will power India's growth,\" said Nvidia boss Jensen Huang in a statement that did not put a figure on the investment.\nNvidia is also working with other Indian AI infrastructure players such as Yotta, which announced a $2 billion deal with the US company that will provide it with 20,000 top-end AI processors.\nNvidia's Huang is not attending the AI summit but other top US tech figures joining include OpenAI's Sam Altman, Meta chief AI officer Alexandr Wang and Microsoft founder Bill Gates.\nMicrosoft said it was investing $50 billion this decade to boost AI adoption in developing countries, while US artificial intelligence startup Anthropic and Indian IT giant Infosys said they would build AI agents for the telecoms industry.\nIndian Prime Minister Narendra Modi and other world leaders including French President Emmanuel Macron and Brazil's Luiz Inacio Lula da Silva are expected to deliver a statement at the end of the week about how they plan to address concerns raised by AI technology.\nBut experts say the broad focus of the event and vague promises made at previous global AI summits in France, South Korea and Britain mean that concrete commitments are unlikely.\nNick Patience, practice lead for AI at tech research group Futurum, told AFP that nonbinding declarations could still \"set the tone for what acceptable AI governance looks like\".\nBut \"the largest AI companies deploy capabilities at a pace that makes 18-month legislative cycles look glacial,\" Patience said.\n\"So it's a case of whether governments can converge fast enough to create meaningful guardrails before de facto standards are set by the companies themselves.\"\ntechnology (general)",
        "link": "https://www.thehindu.com/sci-tech/technology/us-tech-giants-announce-india-deals-at-ai-summit/article70650213.ece",
        "date": "Thu, 19 Feb 2026 09:15:54 +0530",
        "fetched_at": "2026-02-19 04:01:24.539561"
    },
    {
        "title": "AI In Focus: The 2026 AI Impact Summit put in perspective",
        "content": "As India hosts the 2026 AI Impact Summit in New Delhi, experts call for applying technology for social good, proper guardrails for military AI and an appropriate system for AI governance.\nHere is a collection of Opinion articles sharing insights into these topics and more.\nArtificial Intelligence",
        "link": "https://www.thehindu.com/sci-tech/technology/ai-in-focus-analysis-opinion-package-collection/article70650240.ece",
        "date": "Thu, 19 Feb 2026 08:57:49 +0530",
        "fetched_at": "2026-02-19 04:01:25.166787"
    },
    {
        "title": "Gujarat unveils ₹4.08 lakh crore budget for tourism, AI, sports infrastructure",
        "content": "Bihar Finance Minister Kanubhai Desai announces the State budget on February 18, 2026. | Photo: Screen grab via X/@PTI_News.\nGujarat Finance Minister Kanubhai Desai on Wednesday (February 18, 2026) tabled the State Budget for the financial year 2026–27 in the State Assembly, focusing on digital governance, tourism promotion, and creation of sports infrastructure ahead of the 2030 Commonwealth Games.\nWith a total outlay of ₹4,08,053 crore, the budget is the largest ever presented in the State’s history. It focuses on regional growth, welfare initiatives, and sector-specific investments.\nThe announcement came weeks after the Union Budget was presented on February 1, amid keen interest over the State’s fiscal priorities and development roadmap for the coming year. In a notable visual departure, the budget document cover features Kansari Devi, a tribal goddess, illustrated in the traditional Warli art style.\nThe Budget, with an estimated surplus of ₹974 crore and no new taxes, continued the 5% tax rebate for electric vehicles. This fiscal year, ₹63,184 crore was allotted to the Education department, followed by ₹33,504 crore to the Urban Development department and ₹29,709 crore to the Roads and Buildings department. The total outlay increased by 10.2% (₹3,70,250 crore) to ₹4,08,053 crore over the previous financial year, Mr. Desai said.\nOn the sports front, the Budget outlines an ambitious roadmap to develop Ahmedabad as an “Olympic Ready City” in the run-up to the 2030 Commonwealth Games, which Gujarat will host. A total of ₹1,278 crore has been proposed for Games-related infrastructure, including international-standard sports complexes and stadiums, as well as improved urban transport connectivity around key venues.\nThe sports department has been allocated ₹1,331 crore overall. Of this, ₹500 crore will be used for developing Ahmedabad as an Olympic-ready destination and for the Sardar Vallabhbhai Patel (SVP) Sports Enclave. Additionally, ₹165 crore has been set aside for building and upgrading sports complexes in districts across the State.\nThe Budget also provides ₹100 crore each for developing Olympic-level sports infrastructure at Karai and for establishing a Para High Performance Centre in Gandhinagar, along with ₹90 crore for constructing a world-class hockey stadium.\nTourism and sports infrastructure emerged as key pillars of the State Budget, with substantial allocations aimed at boosting Gujarat’s global profile.\nRead | Centre approves road projects worth over ₹11,000 crore in Maharashtra, Gujarat and Telangana\nDeclaring 2026 as ‘Gujarat Tourism Year’, the Finance Minister said the State intends to secure a stronger presence on national and international tourism maps. To support this push, ₹236 crore has been allocated for upgrading infrastructure in and around the Statue of Unity, which the government said has become a major global attraction while generating employment, particularly for tribal communities.\nFurther, ₹300 crore has been proposed under the Ambaji Corridor Masterplan for the comprehensive development of the Ambaji pilgrimage centre. An additional ₹447 crore has been earmarked for constructing iconic bus stations at Somnath and Ambaji and for developing a multi-modal transport hub at Somnath.\nReaffirming its focus on long-term growth, the Finance Minister said the government remains committed to creating world-class infrastructure that supports economic expansion while advancing Gujarat’s cultural and sporting ambitions on the global stage.\nThe Budget estimates an overall surplus of ₹974 crore, reflecting what the government described as prudent fiscal management.\nIn a push towards technology-driven governance, over ₹850 crore has been allocated for Artificial Intelligence and digital governance initiatives. The government plans to establish a Gujarat Unified Digital Stack to integrate and deliver citizen services through a single platform. In addition, a Data Fusion Centre and a Centre of Excellence will be set up to leverage AI for enhancing safety and security mechanisms.\nDigital “lake and air-watch systems” will be introduced for monitoring air and water quality.\nOn the taxation front, the Minister proposed extending the 5% rebate on Motor Vehicle Tax for electric vehicles for another year. The continuation of the incentive is expected to provide relief of ₹210 crore to citizens and further encourage the adoption of electric mobility in the State.\nThe Finance Minister said the Budget has been structured around five key pillars — social security, human resource development, infrastructure expansion, economic growth and green growth — to provide a balanced framework for the State’s progress.\nHe stated that the overarching objective of these focus areas is to fast-track Gujarat’s transformation into a developed state by 2047, aligning policy priorities with long-term developmental goals.\nGujarat\n/\nArtificial Intelligence\n/\ntourism\n/\npower (infrastructure)",
        "link": "https://www.thehindu.com/news/national/gujarat/gujarat-unveils-408-lakh-crore-budget-for-tourism-ai-sports-infrastructure/article70648471.ece",
        "date": "Thu, 19 Feb 2026 07:59:23 +0530",
        "fetched_at": "2026-02-19 04:01:25.799201"
    },
    {
        "title": "T.N. Climate Summit ends with emphasis on tackling forest fire",
        "content": "Chief Minister M.K. Stalin at the Tamil Nadu Climate Summit 4.0 in the city on Wednesday.\n| Photo Credit: Special Arrangement\nThe two-day Tamil Nadu Climate Summit 4.0 brought together global institutions, national experts, State departments, field officers, and community partners to take stock of Tamil Nadu’s five-year climate journey.\nWith the Day two of the Summit opening with a session titled “Voices from the Field – Strengthening Climate Resilient Ecosystems”, which was science-driven and field-informed, one of the segments focused on forest-fire preparedness in a “warming world”.\nThe discussion circled around India’s leadership at the Seventh United Nations Environment Assembly (UNEA-7), where it piloted and secured adoption of a resolution calling for strengthened international collaboration on wildfires. The “Tamil Nadu experience” was presented as a model of anticipatory governance: the government has established a State-Level Command and Control Centre in Chennai, complemented by district-level control rooms to monitor forest fires through real-time data streams, satellite inputs and rapid-response coordination.\nThe government’s decentralised, yet integrated architecture, ensures scientific monitoring, early detection, and minimal response time. The session highlighted investments in first-responder training, capacity building, modern fire-fighting equipment and mobility infrastructure.\nThe Summit also touched upon “Biodiversity and Climate Change”, which brought into focus the accelerating loss of biodiversity due to habitat fragmentation, urbanisation, pollution and climate variability.\nThe dialogue then moved towards circularity and the green economy, anchoring climate action in resource efficiency and waste transformation.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/tn-climate-summit-ends-with-emphasis-on-tackling-forest-fire/article70649086.ece",
        "date": "Thu, 19 Feb 2026 00:54:47 +0530",
        "fetched_at": "2026-02-19 04:01:26.416744"
    },
    {
        "title": "Fishermen take oath to oppose coastal projects",
        "content": "On ‘Sindhanai Sirpi’ Singaravelar’s 167th birth anniversary on Wednesday, fishermen from hamlets in and around the city, took an oath to oppose projects like Blue Economy and TN Shore as they do not seem to ‘bother’ about the welfare of the fisher community.\n“These projects only aim at economic development through tourism, ports, ship building activities, and assistance for large fishing companies. We are being side-lined. These projects do not speak about long-term measures for issues like rising sea-level and coastal erosion. Fishing hamlets are the first to get affected in the event of any natural disaster on the coast. There are no systems in place for our safety,” said fishing community leader K. Bharathi.\nKabaddi Maran, a community leader, said that both Central and State governments were vying with each other to make money out of the coast in the name of economic development. Artisanal fishermen and even those with mechanised boats were suffering due to dwindling catch. The governments were not bothered about the welfare of fishermen, he charged.",
        "link": "https://www.thehindu.com/news/cities/chennai/fishermen-take-oath-to-oppose-coastal-projects/article70648913.ece",
        "date": "Thu, 19 Feb 2026 02:06:26 +0530",
        "fetched_at": "2026-02-19 04:01:27.032147"
    },
    {
        "title": "​Troubled waters: On the Great Nicobar Project",
        "content": "Proponents of the controversial Great Nicobar Project will be enthused by an order from the Kolkata bench of the National Green Tribunal (NGT) ruling that all environmental safeguards are in place, that the potential impact of this gargantuan project on resident native populations of the region is duly accounted for, and the project’s “strategic utility” is reason enough for the government to not be fully transparent with what it shares in the public domain. But the dominant narrative around the project mirrors the classic development versus environment conflict of a pristine Pandora being ravaged for the greed of far-away mainlanders. The Great Nicobar Island Project (GNIP) envisages a trans-shipment port, an international airport, township development, and a 450 Megavolt-Amperes (MVA) gas and solar-based power plant. In the early 20th century, the British Phosphate Commissioners (a joint venture of the U.K., Australia, and New Zealand) began large-scale phosphate mining for fertilizer on Nauru and Banaba in the Pacific Ocean. By 1945, the island had been so physically devastated by strip mining that it was deemed uninhabitable. The native Banabans were forcibly relocated to Rabi Island in Fiji, over 2,000 kilometres away. Today, Banaba is a desolate landscape of jagged limestone “pinnacles” and the displaced population is fighting for the rehabilitation of its homeland. These serve as historical precedents for why economic logic alone cannot dictate actions in remote territories. Though accorded an environment and preliminary forest clearance by the Union Environment Ministry, concerns about the potential loss of biodiversity, tree-felling, and impact on resident tribes prompted the NGT to order a review of the environmental aspects of the project.\nIndependent scientists and environmentalist groups have said that the felling of tracts of pristine tropical forest — nearly nine lakh trees across 130 sq.km — for this project would significantly harm the biodiversity of the region and constitute an irreparable loss. This is not counting the disturbance to leatherback turtle nesting grounds and the assault on the corals. There was also the contested matter of whether the community rights of the local Shompen and the Nicobarese tribes were fully settled under the requirements of the Forest Rights Act. Recently, members of the Tribal Council said they were being coerced to sign “surrender certificates” that implied their consent to large parts of their land being diverted for the project. The NGT order essentially rubber-stamps the government’s appraisal process without independently examining the concerns raised. It only imposes faith that the government will be a conscientious executor of the project. Whether the Great Nicobar Project is a ‘net good’ can only be judged by future generations, but the lack of a process that offers a fair appraisal of independent concerns bodes ill for the present.\nenvironmental issues\n/\nAndaman and Nicobar Islands\n/\nFiji\n/\ntribals\n/\ngovernment\n/\nfertiliser\n/\nUnited Kingdom\n/\nAustralia\n/\nNew Zealand\n/\nhistory\n/\nmining\n/\nforests\n/\nlaws",
        "link": "https://www.thehindu.com/opinion/editorial/troubled-waters-on-the-great-nicobar-project/article70648264.ece",
        "date": "Thu, 19 Feb 2026 08:15:26 +0530",
        "fetched_at": "2026-02-19 04:01:27.666888"
    },
    {
        "title": "Govt. to further simplify process of deleting private lands from 22A list",
        "content": "The Andhra Pradesh government would further simplify the process of removing eligible private lands from the 22A prohibited list to benefit the poor and prevent inconvenience to genuine landowners, Revenue, Registration and Stamps Minister Anagani Satya Prasad informed the Assembly on Wednesday.\nReplying to questions from TDP MLA Kolikapudi Srinivasa Rao and BJP MLA P. Vishnu Kumar Raju, the Minister said a memo had already been issued permitting deletion of five categories of private lands from the prohibited list.\nSpeaker Ch. Ayyanna Patrudu noted that 22A land issues persist across the State and stressed effective implementation of guidelines.\nThe Minister said a team, comprising the Special Chief Secretary (Revenue) and senior officials, was periodically reviewing the matter. Chief Minister N. Chandrababu Naidu ha directed that 22A issues be resolved in a manner beneficial to the poor, while protecting public interest. A special drive involving in-charge Ministers and District Collectors would be launched to expedite eligible deletions.\nOn alleged encroachment of government land in Ramannapalem village of Tiruvuru mandal, he said the matter was under court litigation. Regarding assigned lands to ex-servicemen in Visakhapatnam, he clarified they could be sold after 10 years, but water bodies must be protected in line with court orders.\nMeanwhile, R&B Minister B.C. Janardhan Reddy said tree removal during road expansion was being carried out strictly as per norms. Under the leadership of Mr. Naidu and Deputy Chief Minister K. Pawan Kalyan, the government was prioritising environmental conservation, avenue plantations and translocation of large trees, wherever feasible.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/govt-to-further-simplify-process-of-deleting-private-lands-from-22a-list/article70648247.ece",
        "date": "Wed, 18 Feb 2026 23:41:55 +0530",
        "fetched_at": "2026-02-19 04:01:28.285080"
    },
    {
        "title": "Kerala government moves Supreme Court after High Court stalls public survey",
        "content": "Image used for representational purpose only.\n| Photo Credit: Shashi Shekhar Kashyap\nThe Kerala government moved the Supreme Court on Wednesday (February 18, 2026) against a State High Court decision to keep in abeyance the ‘Nava Keralam Citizen Response Programme’, a public outreach and development feedback initiative to obtain suggestions from the public on development and welfare measures.\nThe special leave petition filed by the State government, represented by advocate C.K. Sasi, submitted that the High Court intruded into matters of public policy not only to stall a programme approved by the council of Ministers of the State but further to set aside consequential financial sanction and budgetary proceedings.\n“The High Court interfered with the government’s power to implement governance and development outreach programmes and seriously prejudiced the ability of the State to take policy decisions involving public expenditure and thus disturbed the constitutional balance between the executive and judiciary,” the petition submitted.\nThe Kerala government said the programme was envisaged as a time-bound statewide exercise to be conducted from January 2026 to February 2026 for collection of public opinion and suggestions regarding development and welfare schemes through a multi-level mechanism involving State, district and local-level coordination, as well as volunteers drawn from the Social Volunteer Force portal.\nThe State submitted that approximately ₹20 crores under the Budget head ‘Special PR Campaign’’ was set aside for the conduct of the programme. The financial sanction for the programme was done by the State’s Information and Public Relations Department in October last year and proceedings detailing the tentative budgetary allocation and expenditure components were issued subsequently in November 2025..\nThe High Court’s intervention was on the basis of a writ petition alleging that the programme violated the Rules of Business framed under Article 166(3) of the Constitution in as much as the subject matter of the programme relating to collection of development inputs and evaluation of welfare schemes fell within the domain of departments, and not the Information and Public Relations Department.\nThe writ petitioners had contended that the allocation of ₹20 crore amounted to diversion or misuse of public funds and required legislative sanction under Articles 202 to 205 of the Constitution.\nThe State had countered that the programme had received Cabinet approval and that administrative and financial sanction had been granted along with detailed budgetary proceedings.\nIt had argued that the Information and Public Relations Department was competent to implement the programme. “The High Court failed to appreciate that the Rules of Business are internal executive instructions intended for convenient transaction of governmental business and are directory in nature. Non-compliance with such internal allocation of business does not ipso facto render executive action void,” the appeal in the apex court argued.\nThe High Court had failed to appreciate that the provisions of the Kerala Budget Manual and other internal fiscal norms were executive guidelines without statutory force, and cannot be treated as mandatory provisions whose alleged violation would invalidate governmental action, the petition said.\nIt said that internal fiscal instructions cannot be elevated to the status of enforceable law by the court in judicial review.\njudiciary (system of justice)\n/\nSupreme Court\n/\nlaw enforcement",
        "link": "https://www.thehindu.com/news/national/kerala/kerala-government-moves-supreme-court-after-high-court-stalls-public-survey/article70648867.ece",
        "date": "Wed, 18 Feb 2026 23:03:24 +0530",
        "fetched_at": "2026-02-19 04:01:28.904455"
    },
    {
        "title": "India adds its name to list of countries criticising Israel’s unilateral measures on West Bank",
        "content": "Palestinian Ambassador to the U.N., Riyad H. Mansour, is flanked by diplomats of other countries as he reads out a statement. Source: Palestinian Mission to U.N.\nIndia has added its name to the list of countries criticising Israel for its unilateral measures on the West Bank. India had not joined the original group of 85 countries that announced the statement on Tuesday (February 17, 2026)\nThe statement was endorsed by the League of Arab States; the European Union; BRICS founder members Russia, China, Brazil, and South Africa; India’s Quad partners Australia and Japan; and neighbouring countries, including Bangladesh, the Maldives, Mauritius, and Pakistan. It came just ahead of a UN meeting on the issue and the U.S.-led Board of Peace meeting in Washington on Thursday.\nThe joint statement was issued at a “stakeout” on Tuesday (February 17, 2026), and it was read out by the Palestinian Ambassador to the UN, flanked by diplomats from dozens of countries that co-signed the document.\nJust in- India adds name to list of countries criticising Israel for unilateral measures on West Bank. India had not joined the original group of 85 countries that announced the statement on Tuesday, signs onto statement 24hrs later. https://t.co/A8wstsvxYJ\n“We strongly condemn unilateral Israeli decisions and measures aimed at expanding Israel’s unlawful presence in the West Bank,” Palestinian Ambassador to the UN Riyad Mansour said.\n“We underline in this regard our strong opposition to any form of annexation,” Mr. Mansour said, adding that the statement rejected all measures “aimed at altering the demographic composition, character and status of the Palestinian territory occupied since 1967, including East Jerusalem”.\nOver the past few months, following the ceasefire in Gaza, the Israeli Knesset has passed a number of plans to tighten its control over land in the Palestinian West Bank’s “A” and “B” Areas, which have been administered by the Palestinian Authority since the Oslo Accords (1993-1995). Among the measures are the removal of restrictions on the acquisition of land by outsiders and the checking of documentation for those currently living on the land, which is seen as a precursor to occupying and annexing the territory, as Israeli settlers have done elsewhere.\n“Such measures violate international law, undermine the ongoing efforts for peace and stability in the region, run counter to the Comprehensive Plan and jeopardise the prospect of reaching a peace agreement ending the conflict,” the statement said.\nPrior to the development, the absence of India’s name in the statement drew strong criticism from diplomats on social media. Former Ambassador to Iran K.C. Singh called it “regrettable that India has chosen Israeli corner so blatantly” and questioned whether the move was also linked to help India’s ties with the U.S.\n“Strategic autonomy was meant to expand India’s choices, not shrink its moral vocabulary. If autonomy turns into avoidance of normative positions altogether, it starts looking less like independence and more like hedging,” wrote former Foreign Secretary Nirupama Menon Rao, referring to India’s normal positions on the Israel-Palestine conflict.\nOn January 31, External Affairs Minister S. Jaishankar had hosted a meeting of the League of Arab States and met Palestinian Foreign Minister Varsen Aghabekian Shahin. It is unclear whether Mr. Jaishankar discussed Mr. Modi’s upcoming visit to Israel, his first since July 2017, and whether Mr. Modi was also planning a trip to Palestine subsequently as he had in February 2018.\nThe visit to Israel has been under discussion for some weeks and comes after Israel Prime Minister Benjamin Netanyahu put off his visit to India last November, reportedly for security reasons. Mr. Modi’s travel to Israel will also come weeks after the release of the “Epstein files” in the U.S., where the late American investor and convicted sex offender Jeffery Epstein had claimed in correspondence with a Qatari interlocutor that Mr. Modi “danced and sang” at the behest of U.S. President Donald Trump (in his previous tenure), an allegation the External Affairs Ministry denied strongly.\nIsrael\n/\nIsrael-Palestine Conflict",
        "link": "https://www.thehindu.com/news/national/india-adds-its-name-to-list-of-countries-criticising-israels-unilateral-measures-on-west-bank/article70648900.ece",
        "date": "Thu, 19 Feb 2026 08:35:37 +0530",
        "fetched_at": "2026-02-19 04:01:29.538482"
    },
    {
        "title": "Centre to bring 1,954 border villages under development scheme",
        "content": "Kibithu, one of the eastern most villages in Arunachal Pradesh, is very close to the Line of Actual Control with China, which is being developed under the Vibrant Village Programme. File\n| Photo Credit: The Hindu\nThe second phase of the Vibrant Village Programme (VVP) will cover 1,954 strategic villages along the land borders with Pakistan, Nepal, Bangladesh, Bhutan, and Myanmar in 15 States and two Union Territories, according to the Ministry of Home Affairs (MHA).\nThe VVP was launched in 2023, originally to assist development in villages along the China border. The VVP-II was cleared by the Union Cabinet in April 2025.\nOn February 20, Home Minister Amit Shah is likely to launch the VVP-II programme at Nathanpur village in Assam’s Cachar district along the Bangladesh border.\nThe Ministry said that often, residents of the border villages may resort to illicit activities, petty crimes, connive in trans-border crimes, and are prone to migrating to urban areas, creating a vacuum that leads to demographic changes and illegal migration. “The VVP programme envisages ensuring assimilation of the border population with the nation, and inculcate them as eyes and ears of the border guarding forces (BGFs), create better living conditions and adequate livelihood opportunities, and wean away the border population from inimical activities,” the Ministry said.\nThe government also plans “culturally sensitive” border-specific outreach activities to engage with communities who live near international borders to build trust, provide information, and encourage cooperation “These activities will foster a positive relationship between border guarding agencies and local population, and promote a sense of shared responsibility in border management,” the MHA said in its guidelines shared with the States.\nWhile VVP-I was aimed at villages along the China border, the phase two with a total outlay of ₹6,839 crore shall be implemented in select strategic villages in Arunachal Pradesh, Assam, Bihar, Gujarat, Jammu and Kashmir, Ladakh, Manipur, Meghalaya, Mizoram, Nagaland, Punjab, Rajasthan, Sikkim, Tripura, Uttarakhand, Uttar Pradesh and West Bengal till the financial year 2028-29. It is proposed that ₹3 crore will be spent in each village.\nThe Ministry said the main objective of the VVP-II is to meet the developmental needs and well-being of the border population, as wells as promote diverse livelihood opportunities to ensure economic and cultural assimilation with the nation’s overall growth story. “In these villages, opportunities for professional growth, social cohesion and national integration would be enhanced to ensure that border regions are not left behind in the country’s development journey and would be developed as growth centres,” the MHA said.\nThe strategy includes saturation of existing schemes of the government to eligible individual beneficiaries and households, strengthen basic infrastructure and create enabling infrastructure and capacities to increase livelihood opportunities.\nThe purpose of the outreach activities would be to ﻿build trust between border control agencies and local communities by providing clear and accurate information about border security procedures, immigration laws, encourage active participation from border communities in reporting suspicious activities and contributing to overall security efforts.\nIndia\n/\nsocial conditions\n/\ndevelopment",
        "link": "https://www.thehindu.com/news/national/centre-to-bring-border-villages-under-development-scheme/article70648203.ece",
        "date": "Wed, 18 Feb 2026 22:36:13 +0530",
        "fetched_at": "2026-02-19 04:01:30.164639"
    },
    {
        "title": "Nearly 2,000 security personnel launch anti-Maoist operation along Chhattisgarh-Telangana border",
        "content": "Image used for representational purpose only.\n| Photo Credit: Getty Images/iStockphoto\nAround 2,000 security personnel, led by the Central Reserve Police Force (CRPF), launched an operation on Tuesday (February 17, 2026) along the Chhattisgarh-Telangana border to track down senior Maoist commanders, a senior CRPF official said on Wednesday (February 18, 2026).\nThe operation, codenamed “KGH-2”, is underway in the Nambi and Korgotalu Hills region and forms part of the Union Government’s declared objective of eradicating Left-Wing Extremism (LWE) from the country by March 2026.\nAccording to the official, the number of politburo and central committee members of the banned Communist Party of India (Maoist)—the highest decision-making body—has come down to four from 20 in January 2025.\nSecurity forces are searching for four senior leaders: Ganapati, Devuji, Malla Raja Reddy and Misir Besra. In the ongoing operation, security personnel are looking for central committee member Devji alias Chetan and junior cadre Kesa Sodhi, the official said.\nThe CRPF is the lead force in implementing government schemes in Maoist-affected areas. Recently, the Chhattisgarh Government designated CRPF company locations in interior areas as “Integrated Centres” for implementing the “Niyad Nellanar Yojna”, a multi-dimensional developmental initiative.\nAccording to the CRPF, the number of districts categorised as Maoist-affected declined from 18 at the beginning of 2025 to eight by year-end.\nThe paramilitary force said targeting Maoist leadership is part of its broader combat strategy aimed at weakening the organisation’s operational capabilities. In 2025, 12 senior Maoist leaders were neutralised, and five others surrendered amid intensified operations.\nIn all, 370 Maoists were killed in operations conducted by the CRPF, 1,175 ultras or their sympathisers were apprehended, and 2,391 extremists surrendered.\n“As part of the combat strategy, CRPF has identified the strongholds of Maoists, and it was decided to establish launch pads/FOBs with the intention to disrupt supply chains and the launching of operations. In 2025, 61 forward operating bases were established in core areas, including 32 in Chhattisgarh, 9 in Jharkhand, 4 in Odisha, 4 in Maharashtra, 11 in Madhya Pradesh and one in Telangana,” CRPF said.\nlaw enforcement\n/\ncrime\n/\npolice",
        "link": "https://www.thehindu.com/news/national/nearly-2000-security-personnel-launch-anti-maoist-operation-along-chhattisgarh-telangana-border/article70648621.ece",
        "date": "Wed, 18 Feb 2026 22:21:30 +0530",
        "fetched_at": "2026-02-19 04:01:30.817268"
    },
    {
        "title": "A.P. SIPB approves 27 projects with investments of ₹29,021 crore",
        "content": "Chief Minister N. Chandrababu Naidu chairing the 15th State Investment Promotion Board meeting in Amaravati on Wednesday.\n| Photo Credit: Special Arrangement\nThe 15th State Investment Promotion Board (SIPB) meeting held under the chairmanship of Chief Minister N. Chandrababu Naidu at the Secretariat on Wednesday approved 27 projects with an investment of ₹29,021 crore, taking the total investments approved so far to ₹9,03,726 crore.\nMr. Naidu made it clear that the Speed of Doing Business policy should be the guiding principle in all matters related to industrial projects. He emphasised that mega projects by reputed companies such as Google, ArcelorMittal and BPCL were in the pipeline and instructed officials to ensure that they faced no hurdles from the government.   Approvals should be cancelled if any company fails to start work, he told the Ministers’ Committee.\nMr. Naidu said the government was ready to offer special incentives to attract more semiconductor projects and suggested that a proposal to give additional incentives for projects being set up on private lands should be examined. He said tourism should be developed in Visakhapatnam, Amaravati, and Tirupati regions in a cluster-based approach.\nMr. Naidu noted that value addition in aquaculture would help revive exports to the U.S.A. and boost dairy, poultry, livestock, and meat exports.\nThe officials must introduce a warehousing policy and prepare an action plan for setting up electric vehicle charging stations on a large-scale, he said.\nMinisters Nara Lokesh, Anagani Satya Prasad, T.G. Bharat, P. Narayana, K. Atchannaidu, Gottipati Ravi Kumar, B.C. Janardhan Reddy, Kandula Durgesh and Vasamsetti Subhash, Chief Secretary K. Vijayanand and other senior officials were present.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/ap-sipb-approves-27-projects-withinvestments-of-29021-crore/article70648785.ece",
        "date": "Wed, 18 Feb 2026 22:19:53 +0530",
        "fetched_at": "2026-02-19 04:01:31.430430"
    },
    {
        "title": "VIT organises GST 2.0 Summit to strengthen tax compliance",
        "content": "The Vellore Institute of Technology (VIT), Vellore, in association with Vellore chapter of Southern India Regional Council of Institute of Chartered Accountants of India organised GST 2.0 Summit on its campus in Vellore on Wednesday.\n| Photo Credit: Special Arrangement\nThe Vellore Institute of Technology (VIT), Vellore, in association with Vellore chapter of Southern India Regional Council of the Institute of Chartered Accountants of India (ICAI), organised GST 2.0 Summit on its campus in Vellore on Wednesday.\nAccording to a press release, the summit titled ‘Navigating Compliances and Empowering Growth’, was aimed at creating awareness about recent developments in Goods and Services Tax (GST) and promoting sound compliance practices among students, professionals, and industry representatives.\nMore than 100 industry professionals and 1,100 students in Vellore and surrounding districts participated. The summit served as a powerhouse of insights, connecting students with domain experts and strengthening Vellore’s academic and industrial ecosystem.\nThe event was inaugurated by P. Rajendra Kumar, Chairman, GST and Indirect Taxes Committee, Institute of Chartered Accountants of India (ICAI), New Delhi, in the presence of D. P. Suresh, Assistant Commissioner, GST and Central Excise, ICAI (Vellore).\nSpecial sessions were also conducted on career opportunities in taxation and finance, offering students practical exposure to professional pathways in indirect taxation, the release said.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/vit-organises-gst-20-summit-to-strengthen-tax-compliance/article70647294.ece",
        "date": "Wed, 18 Feb 2026 22:11:02 +0530",
        "fetched_at": "2026-02-19 04:01:32.069512"
    },
    {
        "title": "Congress slams tax on disability pension, seeks rollback of policy",
        "content": "“As per the Finance Bill 2026, the income tax exemption was granted to only those personnel who were wounded in action and were invalided out from service on receiving a bodily disability,” Chairman of Ex-Serviceman Department AICC Col. Rohit Chaudhary (retd.) said. File photo: AICC via PTI\nThe Congress on Wednesday (February 18, 2026) criticised the government’s move to levy income tax on disability pensions of disabled armed forces personnel, calling it an “insult” to soldiers’ sacrifice and warning of its impact on morale.\nAddressing a press conference, AICC Ex-Servicemen Department chairman Col. (retired) Rohit Chaudhry, along with Col. (retired) S.P. Singh of the Indian Ex-Servicemen League, said that as per the Finance Bill 2026, the income tax exemption was granted to only those personnel who were wounded in action and were invalided out from service on receiving a bodily disability.\nThrough this clause, the government had removed the income tax exemption from the recipients of disability pension who got bodily injuries during action and were retained in service and also from those who had got the disability attributable to or aggravated due to military service conditions.\nThe ex-servicemen community urged the government to retain full tax exemption on disability pensions and withdraw the new disability policy introduced in 2023, Col. Chaudhry said.\nThe party demanded restoration of the status quo under the Income Tax Acts of 1922 and 1961, which kept such pensions tax-exempt.\nHe said that under both the 1922 and 1961 Income Tax Acts, disability pensions for personnel injured in action or whose disabilities were attributable to or aggravated by service conditions were kept outside the tax net, whether they were invalided out or retained in service.\nHe alleged that the government had been attempting to tax such pensions since 2016 and had now restricted the exemption, under the Finance Bill 2026, only to those invalided out after being wounded in action.\nHe said the move would bring under taxation personnel who continued in service despite injuries or those whose disabilities were linked to harsh service conditions.\nReferring to the 2023 disability policy, he said the renaming of disability pension as “impairment relief” had effectively made it taxable for new pensioners.\nCiting the example of Field Marshal Sam Manekshaw, who rose to the top despite being wounded in battle, Col. Chaudhry said retaining injured soldiers had long been part of military tradition and morale building.\nThe Congress claimed the decision could affect nearly two lakh disabled soldiers and warned of nationwide protests, beginning at Jantar Mantar on March 1, if the move was not reversed.\nIndian National Congress\n/\nstate budget and tax\n/\ntaxes and duties\n/\ndisabled",
        "link": "https://www.thehindu.com/news/national/congress-slams-tax-on-disability-pension-seeks-rollback-of-policy/article70648760.ece",
        "date": "Wed, 18 Feb 2026 22:10:00 +0530",
        "fetched_at": "2026-02-19 04:01:32.793342"
    },
    {
        "title": "Ernakulam District Panchayat Budget to give thrust to welfare measures",
        "content": "The Ernakulam District Panchayat’s upcoming Budget is expected to focus on welfare initiatives and addressing the needs of marginalised and disadvantaged communities.\nDistrict panchayat president K.G. Radhakrishnan said the Budget would prioritise sectors such as education, geriatric care, agriculture, and palliative care, with special attention to the elderly, differently abled, Scheduled Caste communities, and transgender persons.\nIn the case of differently abled people, focus will be given to formulating programmes and training methodologies to make them self-sufficient.\nAgriculture is another area that will get special focus, said Mr. Radhakrishnan. “When we consider agriculture, we also need to focus on developing value-added products. We are considering identifying one product from each panchayat and promoting it. For instance, we could take the case of Vazhakkulam in Manjalloor panchayat and promote pineapple. Or, there could be panchayats that have ample production of paddy, and this can be promoted. We will focus on one panchayat and one product, brand it that way and focus on value-added products from there,” said Mr. Radhakrishnan.\nSpecial focus will be given to the development of Scheduled Caste communities. In the case of schools, focus will be on ensuring quality education. “We need to make these plans considering the changing environment and technology and equip classrooms with technological tools designed for the present times,” he added.\nMental health and geriatric health will be given primary importance, he said. The key focus will be on creating recreational spaces for the elderly. “We need to create public spaces where they can engage and relax. A large majority of the elderly are facing loneliness and social isolation, and it has to be addressed,” he added.\nFarm tourism is another area that is likely to get adequate focus in the Budget.",
        "link": "https://www.thehindu.com/news/national/kerala/ernakulam-district-panchayat-budget-to-give-thrust-to-welfare-measures/article70648131.ece",
        "date": "Wed, 18 Feb 2026 22:06:42 +0530",
        "fetched_at": "2026-02-19 04:01:33.412862"
    },
    {
        "title": "Madras High Court denies interim relief to political parties de-registered for not contesting elections in last six years",
        "content": "The judges agreed with senior counsel G. Rajagopalan, representing the ECI, that the balance of convenience was actually in favour of the ECI and not in favour of the petitioners.\nThe Madras High Court on Wednesday refused to stay the orders passed by the Election Commission of India (ECI) recently for de-registering a host of political parties which had not contested either the Legislative Assembly or Parliamentary elections in the last six years.\nChief Justice Manindra Mohan Shrivastava and Justice G. Arul Murugan said no interim order could be passed in favour of the de-registered political parties since it would amount to allowing their writ petitions and permitting them to contest the upcoming Assembly election in Tamil Nadu.\nThe judges agreed with senior counsel G. Rajagopalan, representing the ECI, that the balance of convenience was actually in favour of the ECI and not in favour of the petitioners which had admittedly not contested any of the elections conducted by the commission in the last six years.\nTamizhaga Makkal Munnetra Kazhagam, Manithaneya Makkal Katchi, Manithaneya Jananayaga Katchi and a few others had filed the writ petitions challenging their de-registration. The petitioners had questioned the authority of the ECI to de-register them in the absence of a statutory power to do so.\nAgreeing that the batch of cases argued by senior counsel N.L. Rajah, S. Prabakaran, P. Wilson, R. Srinivas and others had raised “a serious issue of constitutional importance,” the judges directed the High Court Registry to list the main writ petitions for final hearing in the second week of March 2026.\nThe petitioners had attacked the de-registration orders on the prime ground that Section 29A of the Representation of the People Act of 1951 speaks only about registration of political parties with the ECI but there was no corresponding provision for de-registration of those parties.\nTherefore, once the parties get registered, they could not be de-registered by the ECI by invoking Section 21 of the General Clauses Act of 1897, they argued. They relied upon the Supreme Court’s verdict in Indian National Congress versus Institute of Social Welfare (2002) to support their argument.\nIn that judgement, the Supreme Court had held that parties could be de-registered only in extreme circumstances such as they having obtained registration through fraud or forgery or if they ceased to have faith and allegiance to the Constitution or to the principles of socialism, secularism and so on.\nHowever, the ECI contended that the 2002 judgement was rendered before the commission issued elaborate guidelines, by exercising its powers under Article 324 of the Constitution, in 2014 requiring every other political party to contest elections, conducted by the commission, in a block period of six years.\nMr. Rajagopalan said, after 2014, the ECI had made it mandatory for every new political party to incorporate in its constitution that it shall contest elections within five years of its registrationd and that it would agree for de-registration if it fails to contest the elections within a block period of six years. He said, the guidelines were issued after the Income Tax department had brought to the notice of the ECI that many registered political parties had been receiving public donations and claiming tax benefits without actually contesting any elections and remaining to be political parties just on paper.\nThe petitioners had also challenged the de-registration orders on the grounds that their members had contested Assembly and Parliamentary elections under the symbols belonging to other parties and that their direct participation in the local body polls had not been taken into consideration by ECI.\nHowever, the ECI claimed that the participation in elections conducted by the commission alone would be taken into consideration and said, though the show cause notices to the petitioners had been issued by the Chief Electoral Officers, the de-registration orders had been passed by the ECI secretary.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/madras-high-court-denies-interim-relief-to-political-parties-de-registered-for-not-contesting-elections-in-last-six-years/article70647885.ece",
        "date": "Wed, 18 Feb 2026 22:00:15 +0530",
        "fetched_at": "2026-02-19 04:01:34.027013"
    },
    {
        "title": "Modi to address AI summit on February 19; key leaders to attend",
        "content": "Prime Minister Narendra Modi with Union Minister of Information Technology Ashwini Vaishnaw during the India AI Impact Summit, at Bharat Mandapam in New Delhi on February 18, 2026. Photo: PMO via PTI Photo\nPrime Minister Narendra Modi will address the AI Impact Summit on Thursday (February 19, 2026), joined by fellow world leaders and senior tech executives. Mr. Modi’s address will be followed by keynote presentations  by OpenAI CEO Sam Altman, Google DeepMind CEO Dennis Hassabis, and Reliance Industries Limited, chairman and managing director, Mukesh Ambani. The keynote speakers include Gates Foundation Chair Bill Gates, and Microsoft president Brad Smith.\nIndia AI Summit 2026 Day 3 Highlights\nThe event has drawn strong crowds, and has been positioned for months as India’s flagship AI event by the government. It follows similar multilateral summits in the U.K., France, and South Korea. President of France Emmanuel Macron will be in attendance, as will Spanish President Pedro Sánchez Pérez-Castejón, and Sri Lankan President Anura Kumara Dissanayake.\nThe AI Impact Summit’s expo has been extended by one day, to Saturday (February 21, 2026), so that attendees can visit with more flexible security arrangements after all the multilateral events at the venue wind up, IT Secretary S. Krishnan said in a press conference on Wednesday (February 18, 2026). Students and professionals, who have not been able to attend on the weekdays, would be able to come easily, Mr. Krishnan said.\nOver 400 exhibitors, from startups, large corporate firms and government entities to researchers, have their own booths at the summit.\nThe summit has attracted massive crowds over the first three days, which led to acute inconvenience on Monday (February 16, 2026), when large parts of the venue were closed for public access. Three days in, attendance remains strong, leading to this extension. It is unclear if all exhibitors will be able to stay back through Saturday (February 21, 2026).\nThe expo will be closed on Thursday (February 19, 2026) in view of the plenary session with Prime Minister Narendra Modi and other world leaders. It will reopen on Friday (February 20, 2026).\nArtificial Intelligence\n/\npolitics\n/\ndiplomacy",
        "link": "https://www.thehindu.com/sci-tech/technology/pm-address-ai-summit-on-february-19-world-leaders-gather/article70648563.ece",
        "date": "Thu, 19 Feb 2026 06:47:24 +0530",
        "fetched_at": "2026-02-19 04:01:34.649592"
    },
    {
        "title": "Simultaneous polls panel weighs bar on no-confidence motions in final year of government’s term",
        "content": "P. P. Chaudhary, senior advocate and politician who has served as a Member of Parliament in the Lok Sabha, representing Pali constituency in Rajasthan during The Hindu Mind Function, in New Delhi.\n| Photo Credit: Sushil Kumar Verma\nThe Joint Parliamentary Committee (JPC) examining the Bill on simultaneous elections is considering a provision that would bar the introduction of a no-confidence motion against an incumbent government if only one year of its term remains, committee chairperson and BJP MP P.P. Chaudhary said on Wednesday (February 18, 2026).\nHe was speaking at The Hindu Mind, a conversation series featuring leading newsmakers.\nThe Constitution (129th Amendment) Bill, 2024 enabling simultaneous elections was introduced in the Lok Sabha on December 17, 2024, and immediately referred to the committee. The panel has held 16 meetings in Delhi so far and travelled across the country, with six former Chief Justices of India sharing their views on the legislation.\nExplaining key provisions of the Bill, Mr. Chaudhary said that if enacted before the 2029 general elections, the first sitting of the new Lok Sabha would become the “appointed date.” State Assembly terms beginning thereafter would be truncated to align with the 2034 Lok Sabha polls. This one-time synchronisation, he argued, would not violate the federal structure, contrary to the concerns raised by critics.\nThe pros and cons of simultaneous elections | Explained\nMr. Chaudhary said the panel was deliberating whether to introduce a time bar on moving a no-confidence motion. “We are actively considering introducing a provision that would bar the moving of a no-confidence motion if the incumbent government has only one year left in its term,” he said, noting that several States had similar restrictions for Panchayati Raj institutions.\nHowever, such provisions vary widely across States. Under the Tamil Nadu Panchayats Act, 1994, for instance, a no-confidence motion cannot be moved in the last year of the term against certain panchayat office-bearers. In contrast, the Karnataka High Court ruled on February 9 that there should be no embargo on moving a no-confidence motion in the final year, emphasising the need to prevent misuse of office during the remaining tenure.\n“When grassroots democracy has such a provision, why can’t we adopt it for the Lok Sabha and State Assemblies?” Mr. Chaudhary asked.\nWhile Mr. Chaudhary  maintained that such a restriction was legally plausible, he acknowledged that the final decision must be a political one. “We will also consult the political parties on the issue,” he added.\nMr. Chaudhary conceded that there were infirmities in the current formulation of the Bill, and noted that addressing these gaps was precisely what the panel was attempting to do. For instance, during the deliberations so far, several members had pointed out that the Election Commission had been vested with unfettered powers under the proposed law.\nSection 82 A(5) of the new Bill states that “if the Election Commission is of the opinion that the elections to any Legislative Assembly cannot be conducted along with the general election to the House of the People, it may make a recommendation to the President, to declare by an order, that the election to that Legislative Assembly may be conducted at a later date.” Members argued that by not specifying a deadline for the Election Commission, the provision effectively grants the poll panel “arbitrary and unregulated powers.”\nThis apprehension, Mr. Chaudhary acknowledged, was valid, and the panel was deliberating on how to alter the clause. “Prima facie, I am also of the view that the apprehension is correct and we will have to think about it,” the BJP MP said, adding that it was ultimately for the members to decide on the matter.\nThe panel, he said, could consider introducing an oversight mechanism. At the same time, he emphasised that the Election Commission was a constitutional body, and there was no reason to distrust its intentions or functioning.\npolitics\n/\nelection\n/\nnational government",
        "link": "https://www.thehindu.com/news/national/simultaneous-polls-panel-weighs-bar-on-no-confidence-motions-in-final-year-of-governments-term/article70648147.ece",
        "date": "Thu, 19 Feb 2026 06:29:50 +0530",
        "fetched_at": "2026-02-19 04:01:35.271479"
    },
    {
        "title": "BSNL pensioners discuss welfare, legal developments during conference",
        "content": "Members of the All India BSNL Pensioners' Welfare Association participate in a conference in Vijayawada on Wednesday.\n| Photo Credit: G.N. RAO\nAround 500 people from across the State attended the circle conference of the All India BSNL Pensioners’ Welfare Association (AIBSNLPWA), held in Vijayawada on Wednesday (February 18).\nAIBSNLPWA national president D. Gopala Krishnan, general secretary V. Vara Prasad and others spoke on organisational matters, pensioners’ welfare and legal developments.​\nMr. Gopala Krishnan pointed out that following the pension revision implemented in 2007, the next revision has been due since January 1, 2017. ​Referring to the judgment of the Principal Bench, Central Administrative Tribunal, Delhi, September 2023, which directed that pension revision be granted on a par with Central government employees, Mr. Gopala Krishnan said pension revision should be implemented from January 1, 2017, taking the judgment as the guiding benchmark. ​\nMr. Vara Prasad said the issue of pension revision has not been included in the Terms of Reference of the 8th Central Pay Commission (8th CPC). ​He cautioned that the absence of clarity regarding the date of effect may adversely impact pensioners who retired prior to 2026.​\nThrough the conference, the members urged the government to amend the Terms of Reference to include pension revision for former pensioners and to clearly specify 01-01-2026 as the date of implementation.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/bsnl-pensioners-discuss-welfare-legal-developments-during-conference/article70648661.ece",
        "date": "Wed, 18 Feb 2026 21:26:25 +0530",
        "fetched_at": "2026-02-19 04:01:35.890967"
    },
    {
        "title": "BRS flays Congress for holding Telangana government’s performance review in Delhi",
        "content": "T. Harish Rao\n| Photo Credit: SIDDHANT THAKUR\nBharat Rashtra Samithi (BRS) senior MLA and former Minister T. Harish Rao slammed the Congress top leadership for the scheduled review of the Telangana government’s two-year performance at the AICC headquarters in New Delhi on Thursday (February 19) calling it ‘a direct affront to Telangana’s pride and the very idea of self-governance’.\nTaking strong objection to the meeting scheduled to be chaired by the Leader of the Opposition in the Lok Sabha Rahul Gandhi and attended by Chief Minister A. Revanth Reddy, his Cabinet colleagues, TPCC president B. Mahesh Kumar Goud and other senior party leaders from the State, he wrote an open letter on Wednesday.\nAddressed to the All India Congress Committee (AICC) and tagged to senior leaders Rahul Gandhi, Priyanka Gandhi and other AICC functionaries, the BRS Legislature Party deputy floor leader said Telangana was formed after a prolonged struggle for self-rule and self-respect, not to function as ‘a remote-controlled State or as a political outpost’ answerable to periodic approvals from Delhi.\nMr. Rao demanded that the Congress leadership first examine its own failure to implement the party’s six-guarantees made during the election campaign in 2023 claiming that 90 % of the guarantees remain unfulfilled even after more than two years.\nAlleging that the Congress government had failed to honour key promises made to the farming community, including the ₹2 lakh crop loan waiver, enhanced Rythu Bharosa, crop bonus and crop insurance, he said that partial implementation and exclusions had left farmers disillusioned. He also pointed to unfulfilled commitments.\nOn social justice, Mr. Harish Rao said the promised enhancement of reservations for SCs and STs and related procurement benefits had not materialised. He further alleged that several welfare schemes launched by the BRS government were being diluted or discontinued.\nHe also levelled serious allegations of corruption against the State government and warned that Telangana society would not tolerate external control.",
        "link": "https://www.thehindu.com/news/national/telangana/brs-flays-congress-for-holding-telangana-governments-performance-review-in-delhi/article70648653.ece",
        "date": "Wed, 18 Feb 2026 21:22:24 +0530",
        "fetched_at": "2026-02-19 04:01:36.503996"
    },
    {
        "title": "Works on bridge across Vasista to begin soon: Union Minister B. Srinivas Varma",
        "content": "Union Minister of State for Steel and Heavy Industries Bhupathiraju Srinivas Varma and Narsapuram MLA Bommidi Nayakar at a press conference in Bhimavaram on Wednesday.\n| Photo Credit: BY ARRANGEMENT\nUnion Minister of State for Steel and Heavy Industries Bhupathiraju Srinivas Varma on Wednesday announced that the works of the bridge proposed across Vasista, a branch of the Godavari river, would begin soon.\nThe one-kilometre-long bridge connects Narsapuram town in West Godavari district to Sakhinetipalli Lanka in Dr. B. R. Ambedkara Konaseema district. At present, people from these two districts cross the river by punt.\nProposed in 2008, the bhumi puja was performed for the bridge by all the successive Chief Ministers of united Andhra Pradesh. However, the construction of the bridge, which is part of the National Highway-216 project was halted after private landowners moved the court over the land acquisition for the highway road.\nSpeaking to newsmen at a press conference on Wednesday, Mr. Srinivas Varma said: “All the legal hurdles to speed up the bridge across Vasista branch have been cleared. Once commissioned, the entire region of Konaseema, West Godavari and erstwhile Krishna districts will have better connectivity”.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/works-on-bridge-across-vasista-to-begin-soon-union-minister-b-srinivas-varma/article70648462.ece",
        "date": "Wed, 18 Feb 2026 21:21:44 +0530",
        "fetched_at": "2026-02-19 04:01:37.124433"
    },
    {
        "title": "T.N. Minister distributes project completion certificates to students",
        "content": "About 2,500 students successfully completed two projects and received their certificates from Education Minister Anbil Mahesh Poyyamozhi.\n| Photo Credit: Special Arrangement\nAbout 2,500 students of 10 government and aided schools in north Chennai successfully completed two projects on energy management at schools and homes, and designing and building a functional foldable house model, as part of the north Chennai Project-based Learning Programme.\nThe students received their completion certificates from School Education Minister Anbil Mahesh Poyyamozhi on Wednesday.\nFor the first project, the students used data analysis to map energy consumption at schools and homes and drew up a practicable plan to reduce waste using real applications of Data Science and AI. For the second project, the students used physics and engineering concepts to build working physical prototypes of a foldable house that are rapidly deployable to suit low-income and disaster-prone communities.\nThroughout the project cycle, the students were mentored by experts from IIT Madras, Illinois Institute of Technology, KREA University, and industry professionals. The programme is part of the CSR initiative of Kamarajar Port and Rhapsody Music Foundation.\nThe students were already thinking differently, asking questions, making decisions with data and building things with their hands, according to Anil Srinivasan, Founder, Rhapsody Music Foundation.\nThe programme will continue through 2026 with more projects before a final showcase event, a press release stated.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/minister-distributes-project-completion-certificates-to-students-of-north-chennai-government-schools/article70647456.ece",
        "date": "Thu, 19 Feb 2026 00:59:13 +0530",
        "fetched_at": "2026-02-19 04:01:37.733927"
    },
    {
        "title": "Higher Education Minister R. Bindu inaugurates major college infrastructure projects across State",
        "content": "Higher Education Minister R. Bindu at a newly-developed building at University College, Thiruvananthapuram, on Wednesday\nHigher Education Minister R. Bindu has said that the State is making remarkable strides in the higher education sector through infrastructure development and comprehensive curriculum reforms.\nShe was speaking after inaugurating the renovated AR Centre (Oriental Block) at University College, Thiruvananthapuram, and several newly completed buildings in colleges across the State here on Wednesday.\nAccording to the Minister, the government has invested ₹6,000 crore over the past four years for infrastructure development in the higher education sector. The implementation of four-year undergraduate programmes has brought transformative changes in both the content and approach to education. Moreover, the revised curriculum has been designed to enhance employability skills and foster research aptitude among students.\nEmphasising the concept of ‘work while studying’, she said campuses must empower students to become entrepreneurs and job creators. Besides, under the ‘Scholar Connect’ scheme, students are being provided opportunities to interact with diaspora experts working abroad.\nDr. Bindu said that development works worth ₹22 crore, sanctioned by the Kerala Infrastructure Investment Fund Board (KIIFB), have been completed at the University College. The heritage Oriental Block was renovated without compromising its architectural legacy, alongside the construction of a new Language Block and a Laboratory Block.\nInfrastructure development works undertaken at Government Victoria College, Palakkad; Kodiyeri Balakrishnan Memorial Government College, Thalassery; Government Arts and Science College, Chelakkara; Government Arts and Science College, Pathirippala; Government Arts and Science College, Kulathoor; MMS Government Arts and Science College Malayinkeezhu; Government Arts and Science College, Karunagappally; and Government Arts and Science College, Mankada were also inaugurated.\nUniversity College Principal Santhosh Kumar K.R. presided over the function.",
        "link": "https://www.thehindu.com/news/national/kerala/higher-education-minister-r-bindu-inaugurates-major-college-infrastructure-projects-across-state/article70648388.ece",
        "date": "Wed, 18 Feb 2026 21:01:05 +0530",
        "fetched_at": "2026-02-19 04:01:38.398617"
    },
    {
        "title": "Karnataka Man Kills Wife Over Loan Dispute, Buries Body In House Compound",
        "content": "In a shocking incident, a man allegedly killed his wife and buried her inside their house compound in Devarahipparagi town of Vijayapura district in Karnataka, with the crime coming to light 24 days later.\nAccording to the police, the deceased has been identified as Sarojini Ratnakar (45), while the accused as Prabhu Ratnakar (46).\nPrabhu had allegedly taken loans in Sarojini’s name, which often led to disputes between the couple. On the night of January 23, the two were reportedly involved in a heated argument. The following day, January 24, Prabhu allegedly killed Sarojini by hitting her on the head with an iron rod.\nLater, he is said to have buried her body within the house premises and fabricated a story claiming that she had left home and not returned. He even lodged a missing complaint at the Devarahipparagi police station and joined her parental family in the search for her.\nDuring the course of the investigation, the police grew suspicious of Prabhu and summoned him for questioning. During sustained interrogation, he reportedly confessed, leading to the revelation of the truth behind the case.\nPolice later exhumed the body following due legal procedure. After conducting the post-mortem examination, the body was handed over to the family.\nFollowing a complaint lodged by Sarojini’s mother, a case has been registered against Prabhu. Further investigation into the incident is underway.\nLatest Blogs",
        "link": "https://www.news18.com/india/karnataka-man-kills-wife-over-loan-dispute-buries-body-in-house-compound-ws-kl-9916595.html",
        "date": "Thu, 19 Feb 2026 09:07:08 +0530",
        "fetched_at": "2026-02-19 04:01:42.156786"
    },
    {
        "title": "Bill Gates Not To Deliver Keynote Address At India AI Summit Today",
        "content": "Bill Gates will not deliver his scheduled keynote address at the ongoing AI Summit in Delhi today, organisers said on Thursday, citing the need to keep the focus on the event’s key priorities. Follow Live Updates\nIn a statement, it was announced that the Gates Foundation will instead be represented by Ankur Vora, President of the Africa and India Offices, who is set to speak later today at the summit.\nMicrosoft co-founder Bill Gates’ participation in the AI summit became a subject of speculation on Tuesday amid conflicting reports. Government sources had initially indicated that he would not attend, but a spokesperson for the Gates Foundation later said he was indeed participating.\npic.twitter.com/tGJtEQS97E— Gates Foundation India (@BMGFIndia) February 19, 2026\nGates had been listed among global tech leaders, policymakers, founders and innovators on the official website of the AI Impact Summit, which began in the national capital on February 16.\nHowever, his name briefly disappeared from the key participants’ list on Wednesday morning, triggering confusion.\nGates was scheduled to deliver a keynote address today, with a 12-minute speaking slot at 11:50 am at Bharat Mandapam, where several global leaders and industry heads are expected to participate.\nUnion Minister for Information & Broadcasting and Electronics & Information Technology Ashwini Vaishnaw, who is leading the AI summit, did not give a direct response when asked about Gates’ participation during a scheduled press conference.\nThe India AI Impact Summit 2026 has brought together participating nations and global institutions, highlighting India’s emphasis on multilateral cooperation and leveraging artificial intelligence to tackle global challenges while fostering shared growth.\nIndia is hosting the summit from February 16 to 20, structured around three core pillars, or ‘Sutras’: People, Planet and Progress. The prime minister inaugurated the India AI Impact Expo 2026 at Bharat Mandapam in New Delhi on Monday.\nLatest Blogs",
        "link": "https://www.news18.com/india/bill-gates-to-not-deliver-keynote-address-at-india-ai-summit-today-9916579.html",
        "date": "Thu, 19 Feb 2026 09:15:09 +0530",
        "fetched_at": "2026-02-19 04:01:43.049232"
    },
    {
        "title": "‘Report Unruly Passengers’: DGCA  Adopts ‘Zero Tolerance’ Policy Towards In-Flight Misconduct",
        "content": "Unruly flyers, beware. India has adopted a “no tolerance\" or “zero tolerance\" policy with immediate effect for misbehaviour or indiscipline during air travel. The  Directorate General of Civil Aviation (DGCA) has instructed the airlines to report such passengers.\nThe aviation regulator said the move is aimed at ensuring the safety of aircraft, people and property, and at maintaining good order and discipline on board.\nThe DGCA has also issued draft rules on how airlines must handle such passengers on aircraft.\nUnder the changes proposed by DGCA chief Faiz Ahmed Kidwai, airlines will now be required to put in place procedures to deal with unruly passengers both at the airport and on board the aircraft. The SOP on this will be communicated throughout the organisation and especially to all employees who are in direct contact with passengers, both on the ground and on the aircraft.\nThe draft also states that the “no-fly rules\" will apply to all passengers during the period of air travel to or from India. This means that this rule is not just limited to Indian carriers and airports, the rules will also apply to unruly passengers travelling on foreign airlines on flights to and from India, if those carriers report the matter.\nThe draft classifies unruly conduct into four categories:\nLevel 1: Unruly behaviour such as physical gestures, verbal harassment and disruptive drunken conduct.\nLevel 2: Physically abusive actions including pushing, kicking, hitting, grabbing, inappropriate touching or sexual harassment.\nLevel 3: Life-threatening behaviour, including damage to aircraft operating systems and serious physical violence such as choking, eye gouging or attempted murder.\nLevel 4: Attempted or actual breach of the flight crew compartment.\nLatest Blogs",
        "link": "https://www.news18.com/india/report-unruly-passengers-dgca-adopts-zero-tolerance-policy-towards-in-flight-misconduct-9916544.html",
        "date": "Thu, 19 Feb 2026 08:28:49 +0530",
        "fetched_at": "2026-02-19 04:01:43.673695"
    },
    {
        "title": "VVIP Movement For AI Summit To Disrupt Delhi Traffic Today: Check Diversions, Alternate Routes",
        "content": "The Delhi Traffic Police has released a traffic advisory for Thursday, February 19, outlining restrictions and route diversions across central Delhi due to the AI Impact Summit 2026 at Bharat Mandapam.\nAccording to the advisory, special traffic arrangements will be in place from 7:30 am to 10:00 am and again from 5:00 pm to 9:00 pm, owing to multiple VVIP movements scheduled at Bharat Mandapam, the airport, and other key locations.\nIn a post on X, the Delhi Traffic Police advised the commuters to plan their journeys in advance, avoid affected stretches, and follow directions of traffic personnel on duty.\nTraffic AdvisorySpecial traffic arrangements will be in place on 19 Feb, 2026 from 07:30–10:00 AM & 05:00–09:00 PM in view of AI Impact Summit–2026.\nCommuters are advised to plan their journeys in advance, avoid affected stretches, and follow directions of traffic personnel… pic.twitter.com/DWW8mfq8RM\n— Delhi Traffic Police (@dtptraffic) February 18, 2026\nTraffic restrictions will impact several key stretches across central Delhi, including major roads such as Sardar Patel Marg, Janpath, Akbar Road and Teen Murti Marg.\nImportant diplomatic and high-security routes like Shanti Path, Satya Marg and Africa Avenue will also see regulations.\nAdditionally, parts of Mathura Road, Subrahmaniam Bharti Marg, Prithvi Raj Road and Dr. Zakir Hussain Marg are expected to face diversions, along with connecting stretches near Lodhi Flyover and Kautilya Marg.\nCommuters using these corridors are likely to experience delays and are advised to plan alternate routes accordingly.\nTo ease congestion during the restrictions, commuters have been advised to use alternate routes including San Martin Marg, Panchsheel Marg, and APJ Abdul Kalam Marg.\nKey corridors such as Aurobindo Marg, Lodhi Road, Ring Road, and Barapullah Road are also recommended to help divert traffic from affected stretches.\nOther suggested routes include Tilak Marg, Ferozshah Road, Rafi Marg, Sansad Marg, and K Kamraj Marg, along with South Avenue Road and Vandematram Marg.\nMotorists are encouraged to plan their journeys in advance and opt for these alternative roads to minimise delays and ensure smoother travel.\n“Commuters have been urged to cooperate with authorities and avoid the affected routes wherever possible. They are advised to plan their journeys in advance and factor in additional travel time to account for potential delays,\" the advisory said.\n“Motorists should strictly follow the directions of traffic personnel deployed on duty, adhere to traffic regulations, and maintain proper lane discipline to ensure smooth and safe movement for all road users,\" it added.\nThe AI Impact Summit 2026, set to conclude on February 20, is being framed as a key platform aimed at amplifying the voices of developing nations in shaping global AI governance.\nLatest Blogs",
        "link": "https://www.news18.com/cities/new-delhi-news/vvip-movement-for-ai-summit-to-disrupt-delhi-traffic-today-check-diversions-alternate-routes-ws-l-9916453.html",
        "date": "Thu, 19 Feb 2026 07:24:10 +0530",
        "fetched_at": "2026-02-19 04:01:44.333858"
    },
    {
        "title": "AI Summit 2026 India LIVE: Prime Minister Modi To Welcome World Leaders At Bharat Mandapam Shortly",
        "content": "AI Summit 2026 India Live Updates: New Delhi is preparing for a key moment in its technology journey as the India AI Impact Summit 2026 moves towards its formal inauguration. The opening ceremony at Bharat Mandapam on Thursday is expected to set the tone for how India wants to shape the global conversation on artificial intelligence in the years ahead. Prime Minister Narendra Modi’s address will be the focal point, with a clear emphasis on India’s plans for responsible and inclusive AI.\nAfter a week of discussions, exhibitions, and closed-door meetings, the summit now enters its most visible phase. Leaders, policymakers, and technology executives from across the world are gathering for the opening session, where the focus will shift from dialogue to direction. The event is being seen as a chance for India to present its vision for using AI not just for economic growth, but also for public good.\nPrime Minister Narendra Modi to welcome world leaders at Bharat Mandapam and a family photo will b e taken at around 9.15 AM The PM will participate in the Opening Ceremony of India AI Impact Summit 2026, which will start at around 9.40 AM. He will then address the ceremony around 10.25 AM.\n#WATCH | #IndiaAIImpactSummit2026 | Prime Minister Narendra Modi to welcome world leaders at Bharat Mandapam and a family photo will be taken at around 9.15 AM\nThe PM will participate in the Opening Ceremony of India AI Impact Summit 2026, which will start at around 9.40 AM.… pic.twitter.com/yvMQTCG47X\n— ANI (@ANI) February 19, 2026\nBill Gates will not deliver the keynote address at the India AI Summit today, organisers confirmed, marking a change in the previously announced speaking schedule for the event.\npic.twitter.com/tGJtEQS97E\n— Gates Foundation India (@BMGFIndia) February 19, 2026\nPrime Minister Narendra Modi will hold bilateral and side-line meetings with various heads of state at Bharat Mandapam at 7:00 PM, focusing on discussions and diplomatic engagement.\nOn the sidelines of the AI Summit in Delhi, Prime Minister Narendra Modi on Thursday will hold a closed-door CEO roundtable with global technology leaders, including Sam Altman and Sundar Pichai, to discuss innovation and cooperation.\nPM Modi met Pichai on Wednesday also.\nOn Thursday, PM Modi will attend the Opening Ceremony of the India AI Impact Summit 2026 at around 9:40 a.m. The event will also be addressed by the President of France, the UN Secretary-General and top industry leaders from across the world.\nAt 11 a.m., the Prime Minister will visit the India AI Impact Expo 2026 and tour various country pavilions with other leaders.\nHe will then join the Leaders’ Plenary at noon to discuss AI governance, infrastructure and international cooperation.\nFrom 5:30 p.m., he will take part in a CEO roundtable on investment, research collaboration, supply chains and AI deployment.\nAfter the India AI Impact Summit, Delhi is likely to push for a more democratised use of artificial intelligence. The focus will be on affordability and wider access to the technology. Government officials say this approach is aimed at countering the trend in the West, where AI development is concentrated in the hands of a few companies and individuals.\nA senior government official told The Indian Express that the move is in line with India’s G20 narrative. The official said Delhi wants to assert its position in the Global South and show that it speaks in the interest of the region.\nPrime Minister Narendra Modi will participate in the opening ceremony of the India AI Impact Summit 2026 on Thursday morning.\nIndia AI Summit 2026 Day 4 Live Updates: Over the past week, Bharat Mandapam has turned into a major meeting point for the global tech community. With more than 2.5 lakh visitors and participants from over 60 countries, the scale of the summit reflects India’s growing importance in the AI ecosystem. The presence of heads of state and leading technology companies has further underlined the summit’s political and economic weight. The discussions so far have focused heavily on how AI can be used to solve real-world problems, especially in developing economies. From language tools to climate applications, the emphasis has been on practical solutions that can reach large populations.\nIndia AI Summit 2026 Day 4 Live Updates: The morning will begin with Prime Minister Narendra Modi welcoming world leaders at Bharat Mandapam, followed by the formal opening ceremony. Speakers will include French President Emmanuel Macron and UN Secretary-General António Guterres, reflecting the summit’s global significance.\nHis keynote address is expected to outline India’s approach to what the government calls “Sovereign AI,” a framework that focuses on building domestic capabilities while working with global partners. The speech is likely to highlight areas such as digital infrastructure, access to computing power, and the use of AI in sectors like agriculture, healthcare, and governance.\nLatest Blogs",
        "link": "https://www.news18.com/india/ai-summit-2026-live-updates-new-delhi-pm-narendra-modi-niti-aayog-tech-leaders-day-4-liveblog-ws-l-9916413.html",
        "date": "Thu, 19 Feb 2026 09:15:19 +0530",
        "fetched_at": "2026-02-19 04:01:45.036382"
    },
    {
        "title": "Handshakes, Headlines & PM Modi's High-Stakes Keynote: Thursday’s Big Script At India AI Summit",
        "content": "In a historic display of India’s technological and diplomatic prowess, the capital prepares for the crowning moment of the India AI Impact Summit 2026. Following a week of high-level deliberations and the vibrant AI Impact Expo, the formal inauguration by Prime Minister Narendra Modi on Thursday at Bharat Mandapam is set to be a global spectacle, cementing New Delhi’s role as the “capital of the Global South\" in the artificial intelligence era.\nThe morning will begin with a powerful visual of global unity at the iconic Bharat Mandapam.\n09:15 AM: Prime Minister Narendra Modi will personally welcome heads of state and world leaders, followed by a Family Photo—a symbolic image representing the unified global front on AI governance.\n09:40 AM: The Opening Ceremony of the India AI Impact Summit 2026 will commence, featuring addresses from high-profile leaders including French President Emmanuel Macron and UN Secretary-General António Guterres.\n10:25 AM: Prime Minister Modi will deliver his keynote address, setting the definitive roadmap for “Sovereign AI\" and inclusive technology.\nThe atmosphere at Bharat Mandapam has been nothing short of electric. Transformed into a futuristic hub, the venue has hosted over 2.5 lakh visitors and delegates from more than 60 nations. The architectural brilliance of the convention centre, illuminated with AI-themed light installations, provides a fitting backdrop for what is being called the “G20 moment\" of the tech world.\nThe scale of the event is a testament to India’s burgeoning influence. With over 20 heads of state and 500 global AI leaders—including CEOs from OpenAI, Anthropic, and Microsoft—the summit has transcended being a mere tech conference. It is a declaration of India’s intent to bridge the digital divide. The theme, “Sarvajana Hitaya, Sarvajana Sukhaya\" (Welfare for all, happiness of all), resonates through the halls, where the focus remains on using AI for social empowerment, agriculture, and sustainable development.\nWorld leaders have been effusive in their praise for India’s distinctive approach to technology. UN Secretary-General António Guterres lauded India as a “very successful emerging economy\" and the “perfect host,\" emphasising that the world needs India to ensure AI doesn’t become a privilege of the few. President Alar Karis of Estonia, a global digital pioneer himself, remarked that India’s Digital Public Infrastructure (DPI) is now the global benchmark for how modern states should operate.\nThe summit has successfully showcased that India is not just a consumer of AI but a primary innovator. From the launch of 12 indigenous foundation models tailored for Indian languages to the democratisation of high-end computing resources, the “India Way\" is being viewed as the blueprint for the Global South. As leaders gather for the family photo tomorrow morning, they aren’t just standing with a tech hub; they are standing with a nation that has successfully married ancient wisdom with frontier technology.\nLatest Blogs",
        "link": "https://www.news18.com/tech/handshakes-headlines-and-pm-modis-high-stakes-keynote-thursdays-big-script-at-india-ai-summit-9916384.html",
        "date": "Thu, 19 Feb 2026 00:49:21 +0530",
        "fetched_at": "2026-02-19 04:01:45.677962"
    },
    {
        "title": "From Kashmiri Girda To Rajma Gilawat, PM Modi’s AI Summit Dinner Celebrates India’s Culinary Map",
        "content": "The India AI Impact Summit 2026 is underway at Delhi’s Bharat Mandapam, where prominent world leaders, policymakers and innovators have gathered to discuss the future of artificial intelligence. PM Modi hosted a special dinner in New Delhi for the visiting heads of state.\nThe summit, held from February 16–20, follows the UK’s first AI Summit in 2023 and France’s 2025 edition, which highlighted major global investments in AI. It is the first major global AI event hosted in the Global South.\nThe menu for the high-profile dinner has been curated by chefs from the ITC group, which has been entrusted with catering all official events at Bharat Mandapam. The dinner showcases the depth and diversity of India’s culinary traditions.\nFull Menu Of PM Modi’s Dinner\nThe evening coincided with the festival of Shishir Ritu, described in the menu note as “a season marking a gentle end of the winter dew and quiet indulgence. A season that arrives with an abundance of harvest, hope and harmony.\"\nThe multi-course menu at the exquisite dinner began with a starter titled “Varnila\", comprising baby spinach crisp, yoghurt sphere, tamarind date chutney, cilantro relish with old Delhi masala, and a Jowar Crisp.\nThe main courses included Sasya, which is a tribute to the mountains of Uttarakhand. This comprises of GI-tagged Munsyari rajma gilawat, pahadi rice and jhangora (barnyard millet) pulao, kumaoni aloo and subz ke gutke and a silky tomato-anari sauce.\nA selection of Indian breads followed, including Taftaan, a leavened bread topped with melon seeds, and Kashmiri Girda, which refers to a popular Kashmiri bread baked fresh every morning.\nDessert was presented as “Nisarga ‘Natures Creation’\", comprising Rasmalai Tres Leches with Winterberry preserve. The menu described it as moist and creamy ‘chena’ cake sponge soaked in sweetened milk, paired with winter berry compote and perched on pearl millet streusel.\nBeverages served at the gala included Kashmiri Kahwa, filter coffee and Darjeeling tea, along with Indian Rose and Mishri Gulkand Chocolate Leaf.\nPM Modi Welcomes World Leaders\nEarlier today, PM Modi welcomed a host of world leaders to the venue as part of the India AI Impact Summit 2026, including French President Emmanuel Macron, Spanish President Pedro Sanchez, Estonia President Alar Karis, UN Secretary General António Guterres and Dutch PM Dick Schoof.\nThe summit, organised under the IndiaAI Mission, focuses on People, Planet and Progress. It features 12 indigenous foundation models in 22 Indian languages and pavilions from France, Japan, the UK and others. The Prime Minister is scheduled to deliver the inaugural address on February 19.\nLatest Blogs",
        "link": "https://www.news18.com/india/from-kashmiri-girda-to-rajma-gilawat-pm-modis-ai-summit-dinner-celebrates-indias-culinary-map-ws-kl-9916340.html",
        "date": "Wed, 18 Feb 2026 23:01:18 +0530",
        "fetched_at": "2026-02-19 04:01:46.325189"
    },
    {
        "title": "'We Want Our Allies, Including India, To Leverage US AI Infrastructure': White House Policy Advisor",
        "content": "Speaking at the AI Impact Summit, US House Select Committee on Artificial Intelligence Policy Advisor Srinivas Krishna on Saturday said India can leverage American innovation to build artificial intelligence tools that directly benefit its citizens.\nSpeaking at a special session on the sidelines of the AI-India Impact Summit in New Delhi, Krishna described India as a “vibrant\" democracy and highlighted the shared strengths of the two countries in technology and research.\n“All the leading model companies are based in the US. It’s like you’ve built billions of dollars between this year and next year, that just keeps vertical on the GPUs, on advanced AI chips, Nvidia and TPUs are really the only game in town for everyone,\" Krishna said. He added that while the US has advanced AI infrastructure, India can emerge as a key partner in applying AI for public good.\nDelhi | India AI Impact Summit : Sriram Krishnan, Senior White House Policy Advisor on Artificial Intelligence, says, “…We want to make sure that the world uses the American AI stack…We also want the world to use our AI model…We want all our allies, including India, to… pic.twitter.com/u1tpf74wFS— ANI (@ANI) February 18, 2026\n“I think the question is, how do you bring AI to make everyone the quality of life as citizens? And, for example, the way we are trying to do it, I just give you one example in education,\" he said.\nKrishna noted that AI applications can extend beyond sectors like healthcare and be embedded in broader civic systems. “When people talk about what a country like India should do, I think about how do you use AI leverage, all of this investment leverage, all of the innovation happening in America, which we think is the best in class, and then build, you know, the services, the tools, which you utilize for your citizens,\" he added.\nReferring to India’s AI Action Plan, Krishna outlined three focus areas: accelerating innovation, building AI infrastructure, and leading internationally in AI governance and policy.\nHe also emphasised the need for open scientific collaboration between the two countries. “We want to make sure we unlock the Cernis of the world, the open ways of the world, the blocks of the world, the anthropics of the world,\" he said, underlining the importance of shared research and discovery.\nKrishna pointed to the TRUST (Transforming the Relationship Utilizing Strategic Technologies) initiative as a framework to deepen US-India collaboration in areas such as artificial intelligence, semiconductors, quantum computing, biotechnology and space.\nAs part of future cooperation, he said both countries are working on a roadmap under the US-India initiative on Critical and Emerging Technology (iCET), focusing on joint development in AI, semiconductor supply chains, defence technologies and advanced materials.\n“So a lot of scientific discovery is going to change, and we are only getting started. So I think it’s time of great excitement, and I think all of us should feel lucky that we’re living through this,\" Krishna said.\nLatest Blogs",
        "link": "https://www.news18.com/india/india-can-leverage-us-innovation-to-build-ai-tools-us-house-ai-policy-advisor-ws-l-9916027.html",
        "date": "Wed, 18 Feb 2026 21:50:43 +0530",
        "fetched_at": "2026-02-19 04:01:47.047453"
    },
    {
        "title": "‘Modi Opened The Doors For India’: Serbian President Vučić Hails PM’s Statecraft",
        "content": "Serbian President Aleksandar Vučić, in an exclusive conversation with CNN-News18’s Rahul Shivshankar, praised PM Narendra Modi for turning India into a decisive global voice.\nHailing India’s foreign policy, he said, “…At the end, all doors, gates are opened…That is serious statecraft.\"\nListing the ways in which PM Modi turned India into a decisive global voice, Serbian President Vučić said, “He is a very charismatic and hardworking leader. He is well-known across the world. India became visible in the world because of him. He is overwhelmingly present and dominant.\"\nHailing the foreign policy of India, the Serbian President said, “When you speak to PM Modi, you speak to him and the India state, without being influenced by other powers.\"\nAccording to Vučić, the third major reason is PM Modi’s contribution to India’s progress. “Not only in overall economy, but specific areas such as IT sector, digitised economy and AI.\"\nVučić said he first met Modi in Ahmedabad in Gujarat for a special conference in 2017. “What I saw not only in Modi’s behaviour, but his eyes was that he was committed to his country. He takes care of everything. He is committed to details. He is a control freak in a positive sense because he cares,\" the Serbian President said.\n#BreakingNews | How is the world looking at India’s contribution towards AI? What PM Modi has done different to put India as a rising global voice?WATCH @RShivshankar in EXCLUSIVE conversation with President Of Serbia @predsednikrs #NationAt5 #IndiaAI #GlobalAILeader… pic.twitter.com/oigC0vfNcM\n— News18 (@CNNnews18) February 18, 2026\n“Strategic autonomy gives you respect,\" he said.\nRecounting the economic pressure, political isolation and attempts to weaken Serbia, the President said, “In the end, Narendra Modi opened all gates. We are not isolated. It was not the case 2-3 years ago…\"\n“There are tonnes of players in the world who want a weaker contender from India…Of course. There will always be attempts to weaken strong competitors. Why would others prefer a strong India? They would rather face a weaker one,\" he said.\nThat is why PM Modi is dedicated towards strengthening the military of India, political position of India in world and working on economic progress…He signed a Free Trade Agreement (FTA) with the European Union (EU), with the United States (US), at the same time, he did not spoil his relation with Russia, while being cautious with China. Always keeping calm and stable is great politics…\"\nLatest Blogs",
        "link": "https://www.news18.com/india/modi-opened-the-doors-for-india-serbian-president-vucic-hails-pms-charisma-statecraft-ws-l-9915350.html",
        "date": "Wed, 18 Feb 2026 20:08:40 +0530",
        "fetched_at": "2026-02-19 04:01:47.686517"
    },
    {
        "title": "AAP Sarpanch Shot Dead At Wedding In Punjab, BJP Slams Bhagwant Mann Govt Over Law And Order",
        "content": "In a daylight attack in Punjab’s Tarn Taran district, an Aam Aadmi Party (AAP) sarpanch was shot dead during a wedding function on Wednesday, sparking fresh outrage over the state’s law and order situation.\nAccording to police and eyewitness accounts, two unidentified motorcycle-borne gunmen suddenly entered the marriage palace where the sarpanch, Harbrinder Singh alias Happy, was attending a ceremony with relatives. Without warning, they opened indiscriminate fire on him from close range, killing him on the spot and critically injuring his cousin, who was rushed to a nearby hospital.\nSenior officers reached the scene soon after the incident, cordoned off the area and launched a manhunt for the attackers. Forensic teams are scanning CCTV footage from the venue and surrounding areas as part of the investigation. Police have stated that the motive remains unclear, although preliminary investigations are underway.\nThe brazen shooting comes amid heightened tensions in the state. It follows several high-profile attacks on politicians in recent weeks, prompting criticism from opposition leaders who have blamed the ruling AAP government for a deteriorating security climate.\nBJP leader Jaiveer Shergill condemned the incident on social media, saying, “Another day, another broad daylight murder in Punjab. AAP sarpanch shot dead in a wedding function in Tarn Taran, Punjab! Punjab is witnessing a non-stop naked dance of lawlessness & death!\" He demanded action, adding that “Punjab needs to be saved from criminals & AAP!\"\nAnother day , Another broad daylight murder in Punjab-Murder AAP Sarpanch shot dead in a wedding function in Tarn Taran, Punjab !Punjab is witnessing a non-stop naked dance of lawlessness & death !\nPunjab needs to be saved from criminals & AAP!\n— Jaiveer Shergill (@JaiveerShergill) February 18, 2026\nAdditonally,\nPunjab Congress and the Leader of Opposition, Partap Singh Bajwa also reacted sharply to the incident, calling it a “cold-blooded murder\" that exposes what he described as a collapse of law and order in the state. In a post on X, Bajwa alleged that under Chief Minister Bhagwant Mann and the AAP government, gangsters are roaming freely while the administration remains focused on public relations. He claimed that border districts are increasingly turning into crime zones and said Punjab is paying a heavy price for what he termed the government’s “bloody badlaav\" (change).\nThe cold-blooded murder of a sitting Sarpanch at a wedding in Tarn Taran exposes the shocking collapse of law & order in Punjab.Under @BhagwantMann and @AAPPunjab government, gangsters roam free while the government stays busy with PR. Border districts are turning into crime… pic.twitter.com/azghxrxHtX\n— Partap Singh Bajwa (@Partap_Sbajwa) February 18, 2026\nLatest Blogs",
        "link": "https://www.news18.com/india/aap-sarpanch-shot-dead-at-a-wedding-in-punjab-bjp-slams-bhagwant-mann-govt-over-law-and-order-ws-l-9914990.html",
        "date": "Wed, 18 Feb 2026 18:00:47 +0530",
        "fetched_at": "2026-02-19 04:01:48.312586"
    },
    {
        "title": "'Exhibitors Must Not Display Items That Are Not Theirs': Govt Official Amid Galgotias Robodog Row",
        "content": "The Centre issued a stern warning to all exhibitors after the Galgotias University sparked a major controversy at the high-profile India AI Impact Summit 2026 in New Delhi by allegedly presenting a Chinese robodog as its own.\nFollowing the controversy, IT Secretary S Krishnan said the government does not want any exhibitor to showcase items that are not their own. “We do not want such exhibits to continue,\" he said, after organisers asked Galgotias University to vacate its stall.\nThis came after the Greater Noida-based Galgotias University faced intense criticism after reports suggested that the Unitree Go2 robotic dog was displayed under the name “Orion,\" prompting allegations that imported technology was being presented as indigenously developed.\nA clip went viral showing Galgotias’ Professor Neha Singh introducing the Robodog as ‘Orion’ and saying it was developed by the Centre of Excellence of the institution. Shiv Sena (UBT) MP Priyanka Chaturvedi said the incident brought significant damage to the country and the AI Summit.\nCongress leader and Leader of Opposition in Lok Sabha Rahul Gandhi described the event as a “disorganised PR spectacle\" where Indian data is being showcased alongside Chinese products.\nKrishnan said the government would not tolerate exhibits misrepresented as original creations. “We want genuine and actual work to be reflected in the way that people exhibit in expos. The idea is not to sort of use this as an opportunity in any other fashion. We don’t want the controversy surrounding the exhibits presented here. So I think it’s essential that a code is followed there. Misinformation cannot be encouraged,\" he added.\nAbhishek Singh, Additional Secretary in Ministry of Electronics and Information Technology, said the intention is not to stifle innovation but it should not be misleading. The controversy “should not overshadow the kind of effort that the others have put in,\" he said.\nGalgotias Asked To Vacate AI Summit\nLater, authorities asked the Galgotias University to vacate the AI Impact Summit Expo following the allegations. The staff and students of Galgotias University vacated their stall, and power was reportedly cut off at the Galgotias University pavilion after the institution was asked to leave the venue.\nGovernment sources said the Centre has taken the matter seriously and that a clear message has been conveyed to all exhibitors regarding compliance and transparency at the summit.\nHowever, the university defended itself by saying that it had never claimed to have built the device. “Galgotias has not built this robodog, nor have we claimed to do so,\" it said in a statement.\n“We at Galgotias, faculty and students, are deeply pained by the propaganda campaign against our university. We would like to clearly state that the robotic programming is part of our endeavour to make students learn AI programming and develop & deploy real world skills using globally available tools and resources, given developing AI talent is need of an hour,\" the university in another statement.\nThe India AI Impact Summit, billed as a flagship event in the Global South, is underway in Delhi and is expected to host at least 20 heads of state and governments, including French President Emmanuel Macron and Brazilian President Luiz Inácio Lula da Silva. Prime Minister Narendra Modi will address the event on Thursday.\n(with inputs from PTI)\nLatest Blogs",
        "link": "https://www.news18.com/india/exhibitors-must-not-display-items-centre-amid-galgotias-chinese-robodog-display-at-ai-summit-9914448.html",
        "date": "Wed, 18 Feb 2026 21:32:28 +0530",
        "fetched_at": "2026-02-19 04:01:49.122148"
    },
    {
        "title": "Ram Temple Fuels Ayodhya’s Economic Surge: Study Projects Rs 4 Lakh Crore Tourism Revenue",
        "content": "The construction and consecration of the Ram Janmabhoomi Temple in January 2024 has significantly reshaped Ayodhya’s economic landscape, leading a surge in tourism, investment and job creation, according to a new study by Indian Institute of Management Lucknow (IIM Lucknow).\nThe report, titled “Economic Renaissance of Ayodhya,\" examined the transformation of the temple town following the consecration of the grand temple. The report also described how faith-led infrastructure has become a durable growth driver, helping Ayodhya pivot from a low-capacity pilgrimage town to a high-footfall tourism hub.\nThe study has been authored by Venkataramanaiah Saddikuti of IIM Lucknow, KV Raju, Professor Emeritus at Chanakya University and economic advisor to the Uttar Pradesh government, and Gopika Varma of Indian Institute of Management Rohtak.\nAccording to the study, more than 11 crore (110 million) devotees visited Ayodhya within the first six months after the consecration. Annual footfall is now projected at 5–6 crore, placing the city among India’s leading religious tourism destinations.\nBefore the temple’s construction, Ayodhya’s economy revolved around small-scale pilgrimage activity. Annual visitor numbers were modest, hospitality capacity was limited, national hotel chains had negligible presence, and the absence of an airport constrained connectivity. Employment opportunities were limited, leading to youth migration.\nPost-consecration, redevelopment and capacity expansion projects worth approximately Rs 85,000 crore are underway, spanning roads, railways, urban renewal and airport expansion. These investments have helped crowd in private capital and expand the services sector.\nTourism-led economic activity is projected to generate Rs 20,000–25,000 crore in tax revenues over the medium term. The study estimated that tourism spending in Uttar Pradesh could cross Rs 4 lakh crore, with Ayodhya contributing a significant share.\n“The scale of the economic turnaround surprised us. When we began the study, we did not anticipate such a sharp enrichment of the region. The temple has acted as a catalyst, and infrastructure has converted footfall into sustained economic activity,\" professor Saddikuti told Moneycontrol. “This is not a one-off spike. We are seeing repeat visitation, longer stays and higher spend per visitor, which is what makes the model durable,\" he added.\nIt is noteworthy that after assuming office in 2017, Chief Minister Yogi Adityanath accelerated the temple economy framework, coupling temple development with modern infrastructure expansion in Ayodhya, thereby opening pathways for broader economic prosperity.\nThe report further highlighted rapid employment growth across hospitality, construction, transport and services. Around 6,000 micro, small and medium enterprises (MSMEs) have been newly set up or revived in and around Ayodhya. Over the next four to five years, tourism expansion is expected to generate approximately 1.2 lakh direct and indirect jobs.\nSmall retailers and street vendors report daily earnings rising from Rs 400–500 earlier to as much as Rs 2,500. Real estate prices near the temple precinct have risen five to ten times, attracting investors from across India.\nBetween February 2020 and February 2025, the Ram Temple Trust remitted around Rs 400 crore in taxes, including approximately Rs 270 crore in GST, indicating growing formalisation and compliance, the authors noted.\nDaily footfall of over two lakh pilgrims has sustained demand for hospitality and allied services. More than 150 new hotels and homestays have opened in the city. Major hotel chains, including Taj Hotels, Marriott International and Wyndham Hotels & Resorts, have announced expansion plans in Ayodhya.\nOnline travel platforms have reported up to fourfold growth in bookings. Tour operators said that pilgrims are increasingly combining visits to Ayodhya with trips to Varanasi, indicating the emergence of a broader spiritual tourism circuit.\nProfessor Saddikuti said that the Ram temple is shaping India’s emerging “temple economy\" playbook, comparable to redevelopment-led tourism growth seen around Kashi Vishwanath Temple and Mahakaleshwar Temple.\n“If connectivity, crowd management and last-mile services keep pace, Ayodhya can anchor a multi-city spiritual tourism circuit with measurable economic spillovers,\" he said.\nUnder the guidance of Prime Minister Narendra Modi and the leadership of Uttar Pradesh Chief Minister Yogi Adityanath, the temple-led development framework has gained academic validation, the report noted.\nLatest Blogs",
        "link": "https://www.news18.com/india/ram-temple-fuels-ayodhyas-economic-surge-study-projects-rs-4-lakh-crore-tourism-revenue-9913403.html",
        "date": "Wed, 18 Feb 2026 16:13:05 +0530",
        "fetched_at": "2026-02-19 04:01:49.839378"
    },
    {
        "title": "Lights Off, Pack Up: Galgotias University Leaves AI Summit Amid Chinese Robodog Row",
        "content": "Electrical power to the Galgotias University stall at the India AI Impact Summit 2026 in Delhi was cut after it was asked to vacate the high-profile summit amid controversy over the display of a Chinese robotic dog.\nThe staff and students of Galgotias University vacated their stall and power was reportedly cut off at the Galgotias University pavilion after the institution was asked to leave the venue. The university faced heavy criticism for allegedly claiming a Chinese Unitree robodog as its own.\nVIDEO | Delhi: Power has reportedly been cut off at the Galgotias University pavilion at the AI Summit after it was asked to vacate the expo following a row over the display of a robotic dog.(Full video available on PTI Videos – https://t.co/n147TvrpG7) pic.twitter.com/j5rOrSWfF0\n— Press Trust of India (@PTI_News) February 18, 2026\n#WATCH | Delhi | Galgotias University staff and officials vacate their stall at India AI Impact Summit expo, following row over display of Chinese-made robodog.As per sources, the govt had asked Galgotias University to vacate the stall at the expo. pic.twitter.com/cqN5vBcgcN\n— ANI (@ANI) February 18, 2026\nEarlier, top government sources told CNN-News18 that authorities became aware of Galgotias University’s claims regarding the Chinese-made robotic dog and took immediate action by asking it to vacate the venue. Sources added that the government has taken the matter seriously and that a clear message has been conveyed to all exhibitors regarding compliance and transparency at the summit.\nWhat’s The Matter?\nGalgotias University faced intense criticism after reports suggested that the Unitree Go2 robotic dog was displayed under the name “Orion,\" prompting allegations that imported technology was being presented as indigenously developed. A clip went viral showing Galgotias’ Professor Neha Singh introducing the Robodog as ‘Orion’ and saying it was developed by the Centre of Excellence of the institution.\nPolitical leaders also slammed the university for causing “national embarrassment\" and shame by displaying Chinese-made AI robots at a high-profile tech summit hosted by India. Facing intense backlash, the university issued an official clarification, saying it had never claimed to have built the device. “Galgotias has not built this robodog, nor have we claimed to do so,\" it said.\nGalgotias University also came under scrutiny over a ‘soccer drone‘ it claimed to have built from scratch. However, several social media users identified it as the Striker V3 ARF, a soccer drone developed by South Korea’s Helsel Group for drone sports. The model is reportedly available for purchase in India for around Rs 40,000.\nGalgotias University strikes again.This is the Helsel Striker V3 soccer drone, made in South Korea.\nBut they shamelessly claimed that it was innovated at Galgotias University and presented it at the AI Summit in Delhi.\nI have no words.\npic.twitter.com/D1HZWzh2ai\n— Mohit Chauhan (@mohitlaws) February 18, 2026\nAdditionally, the university faced fresh ridicule over a drone model entirely made of thermocol at the international summit. “Cancel this university’s UGC accreditation, they are ruining lives of its students,\" a user wrote.\nMy dudes at Galgotia literally brought a thermocol made Drone in an international AI summit 😭Cancel this university’s UGC accreditation man , they are ruining lives of its students.pic.twitter.com/9YNggvQWYT\n— Roshan Rai (@RoshanKrRaii) February 18, 2026\n“We at Galgotias, faculty and students, are deeply pained by the propaganda campaign against our university. We would like to clearly state that the robotic programming is part of our endeavour to make students learn AI programming and develop & deploy real world skills using globally available tools and resources, given developing AI talent is need of an hour,\" the university in another statement.\nLater, Galgotias University Registrar Nitin Kumar Gaur said the confusion stemmed from the use of the words “develop\" and “development.\" He clarified that the university did not develop the robot but had worked on its development for academic and research purposes.\nLatest Blogs",
        "link": "https://www.news18.com/india/power-cut-stall-vacated-galgotia-university-leaves-ai-summit-amid-chinese-robodog-row-ws-l-9913267.html",
        "date": "Wed, 18 Feb 2026 16:18:33 +0530",
        "fetched_at": "2026-02-19 04:01:50.482681"
    },
    {
        "title": "Green Light For Rs 80,000-Crore Great Nicobar Mega Project: NGT’s ‘Balanced Approach’ Explained",
        "content": "The National Green Tribunal (NGT) recently cleared the Rs 80,000-crore Great Nicobar Island mega infrastructure project, stating there were “adequate safeguards\" in place.\nThe tribunal’s special six-member bench, headed by Chairperson Justice Prakash Shrivastava, refused to interfere with the environmental clearance (EC) originally granted in November 2022, citing the project’s strategic national importance.\nThe NGT’s decision followed a report from a High-Powered Committee (HPC), which was formed in 2023 to address earlier deficiencies in the clearance process.\nThe project, spearheaded by the Andaman and Nicobar Islands Integrated Development Corporation (ANIIDCO), includes an International Container Transshipment Terminal (ICTT), a greenfield international airport, a power plant, and a township.\nThe Great Nicobar Island (GNI) project, officially known as the ‘Holistic Development of Great Nicobar Island’, aims to transform India’s southernmost island into a major global maritime and strategic hub.\nThe project spans 166 sq km (about 10% of the island) and includes four primary pillars:\nInternational Container Transshipment Terminal (ICTT): Located at Galathea Bay, this deep-sea port is the centerpiece. It aims to capture global trade passing through the Malacca Strait, reducing India’s reliance on foreign ports like Colombo and Singapore.\nGreenfield International Airport: A dual-use facility for both civilian tourism and military logistics, capable of handling wide-body aircraft.\nIntegrated Township: Designed to support a future population of over 3.5 lakh people, up from the current 8,000.\nGas & Solar Power Plant: A 450-MVA hybrid plant to provide energy self-sufficiency for the new infrastructure.\nThe island is just 40 nautical miles from one of the world’s busiest shipping lanes, Malacca Strait, where 40% of global trade passes. It serves as India’s “first line of defence,\" providing a forward base to monitor naval movements in the Indo-Pacific, particularly countering regional influence from other powers. Currently, 75% of India’s transshipment cargo is handled outside the country. This project aims to bring that revenue and logistical control back to India.\nThe project is being implemented in phases, with the first phase of the port targeted for completion by 2028.\nThe tribunal on February 16 emphasised a “balanced approach,\" ruling that the project’s significance for national security and trade near the Malacca Strait outweighed the grounds for halting it.\nRelying on Zoological Survey of India (ZSI) findings, the NGT noted no major reefs are in the direct project footprint but mandated the translocation of approximately 16,000 coral colonies found nearby. Directives were issued to ensure no loss of sandy beaches, which are critical nesting grounds for the Leatherback sea turtle and the Nicobar megapode.\nThe tribunal concluded that the project does not fall within prohibited Island Coastal Regulation Zone (ICRZ-IA) areas, dismissing petitioners’ claims of regulatory violations.\nThe NGT noted that the government must adhere to welfare conditions for the Shompen (a Particularly Vulnerable Tribal Group) and Nicobarese communities, though local leaders have alleged coercion in land surrender.\nWhile the NGT has disposed of environmental clearance challenges, the project remains under scrutiny:\nCalcutta High Court: Forest clearance for the project is still being argued.\nEnvironmentalists and political figures, including Jairam Ramesh, have termed the ruling “deeply disappointing,\" warning of “disastrous ecological impacts\" such as the felling of over 10 million trees and the displacement of indigenous tribes.\nWith Agency Inputs\nLatest Blogs",
        "link": "https://www.news18.com/explainers/nod-for-rs-80000-crore-great-nicobar-mega-infra-project-ngts-balanced-approach-explained-ws-kl-9913347.html",
        "date": "Wed, 18 Feb 2026 17:22:13 +0530",
        "fetched_at": "2026-02-19 04:01:51.380530"
    },
    {
        "title": "Mamata Banerjee Fact-Checked: What Bangladesh Election Data Shows On Minority Representation | Exclusive",
        "content": "Indian intelligence sources have rejected West Bengal Chief Minister Mamata Banerjee’s recent remarks citing Bangladesh’s elections in her criticism of the Election Commission of India, saying she does not have complete data about how the neighbouring country’s polls were conducted.\nAddressing the media after polls in the neighbouring country, Banerjee had said: “The election in Bangladesh was concluded peacefully. Everybody thought there will be violence. But it was done peacefully. But while India is a democratic county, its Election Commission with its ‘threat culture’, will bulldoze democracy.\"\nHowever, sources familiar with internal assessments told CNN-News18 that the picture emerging from Bangladesh’s parliamentary elections is far more complex, and troubling, particularly with regard to minority participation and representation.\n‘Deliberate Playbook’\nIntelligence inputs indicate that violence and intimidation targeting Hindus and other minorities continued for over a year, particularly in politically sensitive and border districts. Officials describe what they term a “deliberate playbook\" by certain political actors aimed at inciting anti-minority sentiment, including attacks and pressure tactics designed to discourage participation.\nIn several constituencies, especially in volatile regions such as Bagerhat and Gopalganj, rejections and withdrawals of minority candidates were reportedly higher, pointing to security concerns. Sources allege that in some pockets, minorities were “systematically pushed out of the system\" through a mix of administrative hurdles and intimidation.\nRepresentation Gap In Candidate Numbers\nData from the Bangladesh parliamentary election shows that of 2,034 candidates contesting 299 seats, only 80 were from Hindu minority backgrounds. That represents approximately 3.9 per cent of the total candidate pool, even though Hindus comprise about 8 per cent of Bangladesh’s population—effectively half their demographic share.\nIn several constituencies where Hindu voters account for 15-20 per cent of the electorate, major political parties reportedly did not nominate Hindu candidates.\nMany Hindu aspirants are said to have filed nominations in significant numbers, including in minority-heavy constituencies such as Khulna-1, where eight Hindu nominees initially entered the race. However, some nomination papers were rejected on multiple grounds, while others were allegedly withdrawn under pressure.\nMost of the 80 Hindu candidates were fielded by smaller leftist parties with limited vote share. Only two to three Hindu candidates are believed to have won seats, all on tickets from the Bangladesh Nationalist Party (BNP). No major mainstream party is seen to have significantly exceeded proportional representation for Hindu candidates.\nWar Of Words\nBanerjee’s comments, suggesting that India should look at how Bangladesh conducted its polls, sparked immediate backlash from the BJP and drew a firm response from the Election Commission, which defended the country’s electoral processes.\nIntelligence sources now argue that selective comparisons overlook ground realities in Bangladesh, including minority underrepresentation and reported intimidation.\nLatest Blogs",
        "link": "https://www.news18.com/india/mamata-banerjee-fact-checked-what-bangladesh-election-data-shows-on-minority-representation-exclusive-ws-kl-9913122.html",
        "date": "Wed, 18 Feb 2026 15:18:59 +0530",
        "fetched_at": "2026-02-19 04:01:52.004324"
    },
    {
        "title": "News18 Afternoon Digest: Galgotias University Asked To Vacate AI Summit Amid Row; Dwarka Crash & More",
        "content": "In today’s afternoon digest, News18 brings you the latest updates on AI Impact Summit 2026, the row over the display of a Chinese robot by Galgotias University, and more.\nGalgotias University Asked To Vacate AI Summit Expo Over China-Made Robodog Row: Sources\n‘Fun Reel Crushed His Manchester Dream’: Mother Of Dwarka Crash Victim Demands Justice\n‘It Can’t Be Clearer’: Expert Says India Struck Pakistan’s Nuclear Depot During Op Sindoor\nEmmanuel Macron’s Mumbai Jog Decoded By Harsh Goenka: Why It Matters To You\n‘Rumours Have Now Come True’: Gaurav Gogoi Alleges Bhupen Borah Leaked Congress’s Internal Info\n‘He’s Nowhere Close To…’: Babar Azam Slammed, Comparison With Virat Kohli Branded ‘Unfair’\nKiara Advani Mourns Father-In-Law Sunil Malhotra’s Loss In Emotional Note: ‘You Welcomed Me With Open Arms…’\nLatest Blogs",
        "link": "https://www.news18.com/india/news18-afternoon-digest-galgotias-university-asked-to-vacate-ai-summit-amid-row-dwarka-crash-more-ws-l-9912235.html",
        "date": "Wed, 18 Feb 2026 14:27:15 +0530",
        "fetched_at": "2026-02-19 04:01:52.851958"
    },
    {
        "title": "Too Noisy? Mumbai’s Melody Road Sparks Backlash Days After Launch",
        "content": "Mumbai’s newly opened melody road on the Coastal Road is facing backlash just two days after its inauguration. Residents of Breach Candy have written to Municipal Commissioner Bhushan Gagrani, calling the constant musical vibrations a major disturbance. A copy of the complaint has also been sent to the Maharashtra Chief Minister’s Office.\nThe local residents’ forum, representing over 650 families, said the tune plays daily from 6am to midnight, adding to the existing traffic noise. They have demanded that the BMC discontinue the musical stretch. The civic body is yet to respond.\nThe musical stretch is designed to play the tune ‘Jai Ho’ when vehicles strike precision rumble strips at the correct speed. It was meant to reward safe driving. However, residents in nearby densely populated neighbourhoods say it has become a constant disturbance.\nIn their letter, the Breach Candy ALM and the Breach Candy Residents Forum said the amplified sound enters homes as a constant, muffled but intrusive background noise. Many residents are keeping windows shut. Senior citizens have reportedly expressed serious discomfort.\nResidents said the northbound side of the road is meant for fast-moving traffic. They argue that drivers are getting distracted by listening to the music instead of focusing on the road. Some drivers are slowing down suddenly to hear the tune, which could lead to high-speed crashes or pile-ups.\nThe community said Mumbai already faces constant horn-honking and engine noise. They believe adding amplified music is unnecessary and worsens the noise problem.\nThey also pointed out that the music plays near schools and hospitals, where peace and quiet are important for health and learning. The letter said residents are increasingly fatigued from raising serious civic concerns while avoidable and non-essential interventions receive attention. It added that the deafening noise from speeding supercars on the Coastal Road remains unaddressed.\nResidents have urged the civic administration to immediately review and discontinue the music initiative, calling it disruptive to daily life in the neighbourhood.\nLatest Blogs",
        "link": "https://www.news18.com/india/too-noisy-mumbais-melody-road-sparks-backlash-days-after-launch-9912240.html",
        "date": "Wed, 18 Feb 2026 13:33:28 +0530",
        "fetched_at": "2026-02-19 04:01:53.505824"
    },
    {
        "title": "'Rumours Have Now Come True': Gaurav Gogoi Alleges Bhupen Borah Leaked Congress's Internal Info",
        "content": "Assam Congress president Gaurav Gogoi on Wednesday launched a sharp attack on former state Congress chief Bhupen Borah, questioning his decision to move towards the Bharatiya Janata Party (BJP) soon after resigning from the party and alleging that recent developments have validated long-standing suspicions within the Congress about internal information leaks.\nReacting to Borah’s statements and his impending entry into the BJP, Gogoi said Congress leaders had earlier been troubled by how confidential discussions within the party were allegedly reaching individuals close to Chief Minister Himanta Biswa Sarma.\n“We always wondered how confidential details of our meetings were leaked to a particular journalist linked to Himanta Biswa Sarma. We tried our best not to believe in these rumours and speculation, but now these rumours have come to light, and it is true,\" Gogoi said.\nHe further accused Borah of quickly aligning with the BJP leadership after stepping down from the Congress, saying the timing of the move has raised serious political questions.\n“A day after leaving the Congress party, Bhupen Borah has no qualms about joining the BJP and surrendering to Himanta Biswa Sarma. Why, within a day of resignation, did you join Himanta Biswa Sarma?\" Gogoi asked.\nGogoi also dismissed Borah’s criticism of the Congress as a justification for switching sides.\n“All of this is just an excuse to join the BJP. When someone joins the BJP, they are given a script, and they have to read that script,\" he said.\nGogoi added that people across Assam were questioning Borah’s decision to join the BJP instead of another opposition party if he was dissatisfied within the Congress.\n“The people of Assam are thinking that if you are facing difficulties in the Congress party, then why don’t you join some other party that is fighting against the BJP? There are other parties too that are fighting against the BJP. Why did you shake hands with Himanta Biswa Sarma within just one day of resigning?\" he said.\nThe political row comes after Borah resigned from Congress earlier this week, triggering a major churn in Assam politics.\nBorah claimed that the state Congress unit is no longer functioning under Gogoi’s effective leadership and alleged that Dhubri MP Rakibul Hussain has become the party’s “sole base\", while describing Gogoi as merely the “face of the party\".\nBorah also said that the Leader of the Opposition in the Lok Sabha, Rahul Gandhi, spoke to him at length after he submitted his resignation letter, recalling their long political association.\nSenior Congress leaders, including the party’s central leadership, had reached out to persuade him to reconsider his decision, though Borah maintained that he needed time to reflect after more than three decades in the party.\nMeanwhile, Chief Minister Himanta Biswa Sarma announced that Borah would formally join the BJP on February 22 after meeting him at his residence, publicly welcoming the former Congress leader and stating that the BJP’s doors remain open to him.\nLatest Blogs",
        "link": "https://www.news18.com/india/gaurav-gogoi-slams-bhupen-borah-congress-resignation-joining-bjp-former-assam-congress-chief-ws-l-9912086.html",
        "date": "Wed, 18 Feb 2026 13:19:05 +0530",
        "fetched_at": "2026-02-19 04:01:54.140863"
    },
    {
        "title": "India AI Impact Summit Expo Extended By A Day, To Continue Till February 21",
        "content": "The government has extended the India AI Impact Summit 2026 Expo by an additional day, allowing the exhibition to remain open to the public on Saturday, February 21, in view of the large public turnout and to ensure a smoother and more comfortable experience for visitors.\nAccording to an official announcement, the Expo timings have already been extended till 8 pm, reflecting the growing enthusiasm among delegates and the general public attending the event at Bharat Mandapam.\nHowever, the Expo will remain closed to the public on Thursday, February 19, due to access-restricted events and heightened security arrangements at the venue.\nAs per PTI reports, delegates attending the conference will face restricted access on Wednesday and Thursday owing to VIP movements and security protocols.\nParticipants would be required to vacate the convention area by 4:30 pm as the Prime Minister is scheduled to host a dinner for state guests and business leaders later in the evening.\nDigital India Managing Director and CEO Akhil Kumar told reporters that the Expo area has drawn significant interest, prompting organisers to extend operating hours.\n“Delegates can move to the expo area after vacating the convention area. Exit will be only through Gate 4 throughout the day,\" Kumar said, adding that entry arrangements have been streamlined with Gate 4 designated for vehicle drop-offs and Gate 10 operational for Metro arrivals between 8 am and 4:30 pm.\nOfficials also cautioned that intermittent traffic restrictions may be experienced between 4 pm and 11 pm in and around the ITPO area during summit days due to security arrangements.\nThe Expo extension comes amid a major achievement for the IndiaAI Impact Summit 2026, which has entered the Guinness World Records for recording the highest number of student pledges for the responsible use of artificial intelligence within 24 hours.\nGuinness World Records adjudicator Pravin Patel announced that a total of 2,50,946 pledges were received during the summit, significantly surpassing the target of 5,000.\nUnion Minister Ashwini Vaishnaw credited the initiative to Prime Minister Narendra Modi’s vision, saying outreach efforts to schools and colleges played a crucial role.\n“It was the vision of Honourable Prime Minister Narendra Modi because of which we reached out to schools and colleges for the pledge for responsible use of AI,\" Vaishnaw said.\nThe Prime Minister is scheduled to inaugurate the main summit on February 19, with restricted entry expected during the morning inaugural session.\nOfficials said the Expo area would open for all delegates from 11 am onward that day, including access to the media centre in Hall 1.\nLatest Blogs",
        "link": "https://www.news18.com/india/india-ai-impact-summit-expo-extended-by-a-day-to-continue-till-february-21-timings-extended-delhi-expo-summit-9912170.html",
        "date": "Wed, 18 Feb 2026 13:11:55 +0530",
        "fetched_at": "2026-02-19 04:01:54.789362"
    },
    {
        "title": "On Cam: Pedestrian Suffers Serious Injuries After Crane Runs Over Him In Karnataka’s Udupi",
        "content": "A man walking along the roadside in Perampalli village in Karnataka’s Udupi was run over by a crane in broad daylight. The accident took place in front of the Herga Agricultural Service Cooperative Society. The pedestrian sustained serious injuries and was rushed to a nearby private hospital for treatment.\nAccording to preliminary reports, the crane driver allegedly swerved the vehicle to avoid an oncoming car and, in the process, ran over the man walking alone along the roadside. The horrific incident was captured on CCTV.\nIn the video, the man can be seen coming under the vehicles of the crane. The footage shows the driver halting his vehicle for a brief moment after the man was run over but he soon resumed his journey without checking on the man. A few moments later, the pedestrian managed to regain his senses, visibly struggling to get up. It is to be noted that the vehicle was moving in a moderate speed when the accident occurred.\nThe driver reportedly fled the scene immediately after the accident. So far, no arrests have been made as\nauthorities continue to examine the footage to trace the driver.\nCrane Crushes Man To Death In Rajasthan\nEarlier in January, an elderly farmer, Kailash Gurjar (56), was crushed to death by a speeding crane on the service road of the Jaipur-Agra National Highway in Dausa, Rajasthan. According to police, Gurjar was walking home from Manpur Chauraha Market when the crane hit him from behind, and its wheels ran over his body. He was declared dead on the spot. The driver fled, and authorities launched a search based on a complaint filed by Gurjar’s son.\nResidents in both areas have raised concerns over the reckless operation of cranes and other heavy vehicles. Along busy service roads and near industrial units, large vehicles frequently move at high speeds, posing serious risks to pedestrians. Locals have demanded stricter enforcement of traffic rules and accountability for drivers of such heavy machinery to prevent any untoward incident in the future.\nLatest Blogs",
        "link": "https://www.news18.com/india/on-cam-pedestrian-suffers-serious-injuries-after-crane-runs-over-him-in-karnatakas-udupi-ws-el-9912020.html",
        "date": "Wed, 18 Feb 2026 12:42:15 +0530",
        "fetched_at": "2026-02-19 04:01:55.435834"
    },
    {
        "title": "Google CEO Sundar Pichai Meets PM Modi On Sidelines Of AI Impact Summit 2026",
        "content": "Amid the sidelines of the Global AI Impact Summit 2026, Google CEO Sundar Pichai on Wednesday met Prime Minister Narendra Modi in the national capital.\nPichai arrived in New Delhi to attend the India AI Impact Summit 2026 and is set to deliver the keynote address on February 20 at the event.\n#WATCH | #IndiaAIImpactSummit2026 | Prime Minister Narendra Modi meets Google CEO Sundar Pichai in Delhi.(Source: DD News) pic.twitter.com/JNjMaOa0ux\n— ANI (@ANI) February 18, 2026\nFollowing his arrival in India, the Google CEO took to X and wrote, “Nice to be back in India for the AI Impact Summit – a very warm welcome as always and the papers looked great too.\"\nThe India AI Impact Summit — the first global AI summit to be hosted in the Global South — aims to reflect on the transformative potential of AI aligning with the national vision of “Sarvajana Hitaya, Sarvajana Sukhaya\" (welfare for all, happiness for all) and the global principle of AI for Humanity.\nTalking about the summit, Prime Minister Modi spoke about the growing impact of Artificial Intelligence (AI) on the IT industry and the government’s strategy to strengthen the sector.\n“India’s IT sector has been the backbone of our services exports and a key driver of economic growth. AI presents both a tremendous opportunity and a challenge for this sector. AI market projections show India’s IT sector could reach $400 billion by 2030, driven by new waves of AI-enabled outsourcing and domain-specific automation,\" he said.\nThe Summit will have participation of more than 110 countries, 30 International organizations, including about 20 HoS/HoG level participation, about 45 Ministers.\n(With agency inputs)\nLatest Blogs",
        "link": "https://www.news18.com/india/google-ceo-sundar-pichai-meets-pm-modi-at-ai-impact-summit-2026-in-delhi-9911960.html",
        "date": "Wed, 18 Feb 2026 12:34:20 +0530",
        "fetched_at": "2026-02-19 04:01:56.260146"
    },
    {
        "title": "PM Modi Holds Bilateral Talks With Spanish President Sanchez On Sidelines Of AI Summit 2026",
        "content": "Prime Minister Narendra Modi on Wednesday met with Spanish President Pedro Sánchez Pérez-Castejón at Hyderabad House in New Delhi amid high-level engagements at the ongoing India AI Impact Summit 2026.\nThe meeting between the two leaders followed President Sanchez’s arrival in the national capital to participate in the prestigious summit, being held at Bharat Mandapam. The Spanish President was warmly welcomed at the airport by Minister of State for Skills Development and Entrepreneurship Jayant Singh.\nExtending greetings to President Sanchez, Ministry of External Affairs (MEA) spokesperson Randhir Jaiswal wrote in a post on ‘X’, “Welcome, President of Spain, Mr. Pedro Sanchez Perez-Castejon @sanchezcastejon for the India-AI Impact Summit. Warmly received by Minister of State for Skills Development and Entrepreneurship @jayantrld.\n“The visit of President Sanchez will add further impetus to the ongoing celebrations of India-Spain Dual Year of Culture, Tourism and AI\", he added.\nIn a separate post, Randhir Jaiswal stated that PM Modi and President Sanchez discussed a wide range of topics, involving trade and economy, digital, innovation, health, climate action, and more.\n“PM @narendramodi held bilateral meeting with President @sanchezcastejon of Spain during his visit to New Delhi to attend the AI Impact Summit 2026. Both leaders discussed a wide range of issues aimed at deepening India-Spain partnership\", the post read.\nPM @narendramodi held bilateral meeting with President @sanchezcastejon of Spain during his visit to New Delhi to attend the AI Impact Summit 2026.Both leaders discussed a wide range of issues aimed at deepening India-Spain partnership.\nKey areas discussed include trade and… pic.twitter.com/KAjmZucYBz\n— Randhir Jaiswal (@MEAIndia) February 18, 2026\n“Key areas discussed include trade and economy, digital, innovation, health, climate action and education among others. PM conveyed his appreciation for Spain’s consistent support for strong India-EU relations\", it added.\nAI IMPACT SUMMIT 2026\nThe AI Impact Summit 2026 — being held at Bharat Mandapam in New Delhi — commenced on February 16 and will conclude on February 20.\nAs the first global AI summit hosted in the Global South, it is being famed as a platform to strengthen the nation’s position in the AI governance.\nThe summit focuses on AI’s transformative potential, falling in line with India’s national vision of “Sarvajana Hitaya, Sarvajana Sukhaya\" (welfare for all, happiness for all). The prestigious summit features participation from more than 110 countries and 30 international organisations.\nLatest Blogs",
        "link": "https://www.news18.com/india/pm-modi-holds-bilateral-talks-with-spanish-president-sanchez-on-sidelines-of-ai-summit-2026-9911954.html",
        "date": "Wed, 18 Feb 2026 12:22:02 +0530",
        "fetched_at": "2026-02-19 04:01:57.131810"
    },
    {
        "title": "What Is Galgotias? Location, Fame, Key Alumni As Robodog Fiasco Boots University From Delhi AI Summit",
        "content": "Big technology events are often seen as a stage to show what the future looks like. Universities, startups and companies bring their latest ideas in a hope to impress experts and policymakers.  That is what happened at the India AI Impact Summit 2026 in Delhi where Galgotias University found itself in the middle of a debate.\nGovernment sources said on Wednesday, February 18, that the university had been asked to vacate the expo venue immediately. The move came after questions were raised about a robotic dog displayed at the summit.\nWhat Sparked Galgotias University’s Robotic Dog Controversy?\nThe issue began when a robotic dog named “ORION\" was presented at the summit. A video showed a faculty member demonstrating the robot which caught widespread attention online. Soon after, social media users claimed that the device looked exactly like the Unitree Go2, a commercially available robotic dog made by a Chinese company.\nThis led to accusations that the university was presenting an imported product as its own innovation. The controversy grew because the display was linked to the university’s larger Rs 350 crore AI ecosystem investment.\nHow Did The University Respond?\nAs the debate picked up pace online, the university issued a clarification. It said that it had never “claimed\" to have built the robotic dog. According to the statement, the device was purchased from China-based Unitree for academic purposes and student learning.\n“The recently acquired robodog from Unitree is one such step in that journey. It is not merely a machine on display; it is a classroom in motion. Our students are experimenting with it, testing its limits and, in the process, expanding their own knowledge. Let us be clear: Galgotias has not built this robodog, nor have we ever claimed to. Let us be clear – Galgotias has not built this robodog, neither have we claimed. But what we are building are minds that will soon design, engineer, and manufacture such technologies right here in Bharat,\" the statement read which was shared by the university’s official X (formerly Twitter) handle.\npic.twitter.com/cgBbhld876— Galgotias University (@GalgotiasGU) February 17, 2026\nWhat Were The Broader Criticisms?\nThe controversy did not remain limited to just the robot. Critics began questioning how projects are selected for display at national-level technology events. Concerns about whether imported, off-the-shelf products should be showed at such summits were also raised.\nThe debate also extended to government-backed innovation funding and patent support.\nWhat Is Galgotias University’s AI Ecosystem Investment?\nAt the centre of the discussion is the university’s announcement of investing over Rs 350 crore in building an AI ecosystem. This has been described as the largest investment of its kind by a private university in India.\nThe investment was made with an aim to create strong infrastructure for AI education, research and real-world applications.\nWhat Are The Core Infrastructure And Key Components Of University’s AI Push?\nA high-end computing setup powered by NVIDIA’s DGX H200 supercomputing platform is the major part of its AI push. It is designed to handle large-scale AI model training across areas like data science, machine learning and computer vision.\nThe campus also houses Centres of Excellence focused on applied research, patents and startup support. Students and researchers are given access to high-performance computing tools for interdisciplinary projects. The curriculum is reportedly aligned with industry needs and supported by enterprise-level technology.\nWhat About The Strategic Goals?\nDhruv Galgotia, CEO of Galgotias University, has stated that the long-term goal is to help position India as a global leader in AI. He said that the emphasisis is on building real national capability in advanced technologies.\nWhat Is Galgotias University Famous For?\nGalgotias University is a private institution that is located in Greater Noida. It is known for its engineering and technology programs.\nThe university has over 20,000 students and 80,000 alumni worldwide. In engineering, it has been ranked in the 101–150 band in the National Institutional Ranking Framework (NIRF) ankings.\nWhy Is Galgotias University Popular?\nThe university attracts a large number of students because of its industry connections and NAAC A+ accreditation. Tech giants like Infosys, TCS, Amazon, Google and Cisco are known to hire from the campus.\nWho Are Some Notable Alumni?\nSeveral graduates have built successful careers in technology and business. Some former students now work at global companies such as Google and Cisco. There are also entrepreneurs among its alumni, including founders and CEOs in the tech and startup space.\nWhat Are The Best Courses Offered?\nThe university’s strongest programs are in technology. B.Tech in Computer Science and Engineering especially with AI and machine learning specialisations, remains one of the most sought-after courses.\nApart from engineering, it also offers MBA and core engineering branches like Mechanical and Civil.\nWhat Are Galgotias University’s AI Contributions?\nBeyond the current controversy, the university positions itself as a major private investor in AI education in India. The Rs 350 crore ecosystem includes advanced labs in areas such as semiconductors and drone intelligence.\nStudents and startups associated with the university were also showcased at the AI Impact Summit 2026. Despite the debate around the robotic dog, the institution continues to project itself as a serious player in India’s growing AI landscape.\nLatest Blogs",
        "link": "https://www.news18.com/education-career/what-is-galgotias-location-fame-alumni-amid-robodog-fiasco-at-delhi-ai-summit-aa-ws-l-9911669.html",
        "date": "Wed, 18 Feb 2026 13:37:06 +0530",
        "fetched_at": "2026-02-19 04:01:57.774537"
    },
    {
        "title": "Galgotias University Asked To Vacate AI Summit Expo Over China-Made Robodog Row: Sources",
        "content": "Galgotias University has been asked to vacate the Delhi AI Summit expo venue immediately, government sources said on Wednesday, amid the controversy over the display of a Chinese-made robotic dog at the ongoing event in the national capital.\nThe development comes a day after the university issued a clarification stating that the robotic dog showcased at the summit was procured from China-based Unitree and that it had “never claimed\" to have built the device.\nTop government sources said authorities became aware of Galgotias University’s claims regarding the Chinese-made robotic dog and took immediate action. The university was instructed to vacate the venue the same day.\nSources added that the government has taken the matter seriously and that a clear message has been conveyed to all exhibitors regarding compliance and transparency at the summit.\nLater, power was also cut off at the Galgotias University pavilion at the AI Summit after after the government directive came.\nVIDEO | Delhi: Power has reportedly been cut off at the Galgotias University pavilion at the AI Summit after it was asked to vacate the expo following a row over the display of a robotic dog.(Full video available on PTI Videos – https://t.co/n147TvrpG7) pic.twitter.com/j5rOrSWfF0\n— Press Trust of India (@PTI_News) February 18, 2026\nThey also alleged that sections of the opposition were attempting to politicise the issue, claiming they were unsettled by the success of the first-ever AI Summit in India.\nThe institution had faced criticism after reports suggested that the Unitree Go2 robotic dog was displayed under the name “Orion,\" prompting allegations that imported technology was being presented as indigenously developed.\nIn its earlier statement, the university had said, “Let us be clear, Galgotias has not built this robodog, nor have we claimed to do so. What we are building are minds that will soon design, engineer and manufacture such technologies in Bharat.\" It also maintained that the device was acquired for academic purposes and used as a learning tool for students.\nThe controversy triggered a social media backlash, with several users accusing the institution of misrepresenting the origin of the AI-powered robotic dog. Responding to the criticism, Galgotias University had said it routinely brings global technologies to campus to expose students to cutting-edge innovation and that its focus remains on fostering indigenous capabilities in the long run.\nGovernment sources, however, indicated that following the episode, the university has now been directed to vacate the AI Summit expo space. The AI Impact Summit, which brings together policymakers, industry leaders and innovators, continues at Bharat Mandapam under heightened scrutiny.\nLatest Blogs",
        "link": "https://www.news18.com/india/galgotias-university-asked-to-vacate-ai-summit-expo-over-china-made-robodog-row-sources-9911746.html",
        "date": "Wed, 18 Feb 2026 14:54:12 +0530",
        "fetched_at": "2026-02-19 04:01:59.292025"
    },
    {
        "title": "Chhatrapati Shivaji Maharaj Jayanti 2026: Banks, Schools & Offices Open Or Closed In Mumbai On February 19?",
        "content": "Chhatrapati Shivaji Maharaj Jayanti is observed every year on February 19 to mark the birth anniversary of Chhatrapati Shivaji Maharaj. He was the founder of the Maratha Empire and is remembered as one of India’s most respected rulers. Known for his courage and strong leadership, he fought several battles and built a powerful kingdom.\nHe was crowned as the “Chhatrapati (Emperor)\" in 1674. His ideas, leadership style, and words still inspire people across the country. In Maharashtra, the day is celebrated with pride, and many events are organised to honour his legacy.\nFebruary 19 is a public holiday in Maharashtra. In Mumbai, several services and offices remain closed for the day, while some essential services continue to function. Residents and visitors should plan their schedules accordingly.\nPublic transport in Mumbai, including buses, local trains, and taxis, will operate normally. Commuters can travel without worrying about service disruptions. Metro services are also expected to run as per their regular schedule.\nEssential services such as hospitals, clinics, pharmacies and emergency services will remain open. Medical staff and emergency responders will be available throughout the day to handle any urgent needs.\nAll government offices in Mumbai will stay closed on February 19 in observance of the holiday. This includes municipal offices and other state-run departments.\nBanks across Maharashtra will also not operate, as per the Reserve Bank of India’s holiday calendar. Customers are advised to complete important banking work in advance or use online banking services where possible.\nGovernment-run schools and colleges will remain closed. Private educational institutions may decide independently whether to declare a holiday, so students and parents should check with their respective schools or colleges.\nPrivate offices and businesses may follow different schedules. Some companies may close to mark the occasion, while others may continue operations. It is best to confirm with the concerned workplace.\nAcross the city, cultural events, processions and local programmes are usually held to celebrate the life and achievements of Chhatrapati Shivaji Maharaj. Devotees of Chhatrapati Shivaji Maharaj join processions and rallies held in his honour, with dhol beats and music filling the streets of cities like Mumbai, Pune, Nashik and Kolhapur.\nMany also visit important forts connected to his life, including those at Shivneri, Raigad and Pratapgad, to pay their respects and remember his legacy.\nLatest Blogs",
        "link": "https://www.news18.com/india/chhatrapati-shivaji-maharaj-jayanti-2026-whats-open-closed-mumbai-february-19-aa-ws-kl-9911650.html",
        "date": "Thu, 19 Feb 2026 08:07:37 +0530",
        "fetched_at": "2026-02-19 04:01:59.940335"
    },
    {
        "title": "Lost & Found Within 24 Hours: Startup Devices Stolen From AI Impact Summit In Delhi Recovered",
        "content": "Hours after Delhi Police registered an FIR in connection with the alleged theft of AI wearable devices during the ongoing India AI Impact Summit, the Bengaluru-based AI startup founder confirmed that the devices have been recovered — nearly 24 hours after he first flagged the incident.\nThe start-up founder on Tuesday alleged that the company’s wearable devices were stolen from inside a “high-security zone\" at the India AI Impact Summit, being held at Bharat Mandapam in the national capital.\nTwo individuals have been identified who were present at the AI Summit to work. They are investigating whether this is a case of theft or if the wearables were mistakenly taken away, India Today reported, citing police sources.\nGiving an update on the theft incident, Dhananjay Yadav, founder of NeoSapien, took to social media and informed that the devices were traced swiftly following police action.\n“Just wanted to update everyone, our devices have been recovered. Huge thanks to Delhi Police for the superfast response and support. Truly grateful for all the messages, help, and encouragement we’ve received over the last two days, it means a lot to me,\" he wrote in a post on X.\nJust wanted to update everyone, our devices have been recovered.Huge thanks to Delhi Police for the super fast response and support.\nTruly grateful for all the messages, help, and encouragement we’ve received over the last two days, it means a lot to me🙏.\n— Dhananjay Yadav (@imDhananjay) February 17, 2026\nIn a shocking incident, the founder of NeoSapien on Tuesday claimed that a theft occurred during the India AI Impact Summit after exhibitors were asked to vacate their stalls ahead of Prime Minister Narendra Modi’s visit.\n“Day 1 of the AI Impact Summit turned to be a pain for us,\" Dhananjay Yadav wrote on X. “I came genuinely excited… it was the first time the summit was being hosted in India, and I wanted to show up personally to support the ecosystem and the government’s push.\"\nHe said that at around 12 noon, security personnel arrived to sanitise and cordon off the area ahead of the Prime Minister’s scheduled visit at 2 pm. “I explained that we’re building India’s first patented AI wearable at NeoSapien and requested a chance to showcase it,\" he said.\nYadav further highlighted “lack of co-ordination between the security\" and said that while one officer allegedly allowed him to stay, another group later ordered him and his team to leave immediately.\n“I asked: ‘Should we take our wearables?’ They said, others are leaving even laptops behind, security will take care. Trusting them, I left. Hoping that the wearables will be safe, and if I am lucky, it might catch the eye of PM Modi,\" he wrote, adding that the gates were closed from 12 pm to 6 pm — “much, much longer than expected.\"\nWhen they were allowed back in, he claimed, the devices were gone.\n“Later we found out that our wearables were stolen,\" he wrote. “Only to see our wearables disappear inside a high-security zone. If only security and official entourage had access, how did this happen? This is extremely disappointing.\"\nDay 1 of the AI Impact Summit turned to be a pain for us.I came genuinely excited, it was the first time the summit was being hosted in India, and I wanted to show up personally to support the ecosystem and the government’s push.\nBut what happened next was shocking.\nAt 12… pic.twitter.com/9gVygparq0\n— Dhananjay Yadav (@imDhananjay) February 16, 2026\nFollowing the complaint, Delhi Police registered an FIR in connection with the reported theft. Delhi Police managed to recover the stolen goods within a little over 24 hours.\nLatest Blogs",
        "link": "https://www.news18.com/india/startup-devices-neosapien-stolen-from-india-ai-impact-summit-in-delhi-recovered-within-24-hours-9911538.html",
        "date": "Wed, 18 Feb 2026 10:26:16 +0530",
        "fetched_at": "2026-02-19 04:02:00.588889"
    },
    {
        "title": "RSS Chief Mohan Bhagwat Renews Call For United Hindu Society, Backs Three-Child Policy",
        "content": "Rashtriya Swayamsevak Sangh (RSS) chief Mohan Bhagwat on Tuesday reiterated that Hindu families should consider having at least three children. He was addressing a social-harmony meeting at Saraswati Shishu Mandir in Lucknow.\nBhagwat expressed concern over what he described as a declining Hindu population and called for uniting and empowering Hindu society. He said there is no threat but vigilance is necessary.\n“There is a need to unite and empower Hindus. There is no threat to us but vigilance is necessary,\" Bhagwat said.\nBhagwat said Hindu families should consider at least three children. He cited scientific opinions that societies with an average fertility rate below three could disappear in the future.\nHe said newly married couples should be made aware of this. According to him, the purpose of marriage is to carry forward creation, not merely to fulfil personal desires.\nRaising concerns over infiltration, Bhagwat said infiltrators should be detected, deleted and deported, and not given employment.\nHe stressed that lack of harmony leads to discrimination and said all citizens share one country and one motherland. He described Sanatan thought as a philosophy of harmony and said differences must be addressed through understanding and practice.\nResponding to a question on UGC guidelines, Bhagwat said laws must be obeyed and flawed laws can be changed through constitutional means.\nHe said caste divisions should not cause conflict and called for uplifting the disadvantaged with a sense of belonging. Bhagwat added that India would guide the world in the near future and that many global problems have solutions in the country’s civilisational ethos.\nHe also cautioned that some elements in the United States and China are working against India’s social harmony and called for vigilance and mutual trust.\nLatest Blogs",
        "link": "https://www.news18.com/india/rss-chief-mohan-bhagwat-renews-call-for-united-hindu-society-backs-three-child-policy-9911565.html",
        "date": "Wed, 18 Feb 2026 09:54:08 +0530",
        "fetched_at": "2026-02-19 04:02:01.268819"
    },
    {
        "title": "PM Modi Shares Serbia President’s Article As India’s AI Growth Wins Global Praise",
        "content": "Prime Minister Narendra Modi shared and welcomed Serbia President Aleksandar Vucic’s praise for India’s artificial intelligence progress and its growing global influence, posting his remarks on social media platform X (formerly Twitter).\n“A fine article by President Aleksandar Vucic of the Republic of Serbia, in which he talks about AI, of course, but at the same time highlights his fondness for India, India’s strides in AI and strong India-Serbia relations!\" PM Modi wrote while sharing the Serbian leader’s opinion piece.\nIn his article published in The Indian Express, Vucic praised India’s technological ambitions and described the country as being at the centre of global conversations on artificial intelligence.\nHe said India’s approach to AI focuses on “real-world deployment, ethical standards and inclusive innovation\" with applications spanning healthcare, agriculture, education and financial inclusion. He noted that this pragmatic model reflects India’s aspiration to become a trailblazer in using technology for societal good.\nMet President Aleksandar Vučić on the sidelines of the India AI Impact Summit. We discussed ways to deepen cooperation in areas such as defence, manufacturing, DPI, fertilisers and infrastructure. For many years, India and Serbia have worked closely and I am confident our ties… pic.twitter.com/gHO2jaPR5d— Narendra Modi (@narendramodi) February 18, 2026\nVucic also said the India AI Impact Summit places the country “firmly at the centre of the global discourse on artificial intelligence,\" and credited PM Modi’s vision to democratise access to technology so that its benefits reach everyone, not just a privileged few.\nReflecting on India’s broader trajectory, the Serbian President said India possesses qualities such as “grit, equanimity and self-belief\" in abundance and declared that those who underestimate India’s potential would be proven wrong.\n“India is not arriving at the future. It is helping to define it,\" he wrote.\nWorld And Tech Leaders Praise India’s AI Growth\nGlobal leaders and technology executives also voiced strong support for India’s growing leadership in artificial intelligence. UN Secretary-General Antonio Guterres praised India as the ideal host for the AI Impact Summit, calling the country “a very successful emerging economy\" with an increasingly important role in global affairs.\n“I see India in the centre of those emerging economies,\" Guterres said, adding that he has “a lot of hope for the role that India can play in shaping this multipolar world.\" He also congratulated India for organising the summit and emphasised the importance of ensuring AI benefits all countries, particularly in the Global South.\nSundar Pichai, CEO of Google and Alphabet, described the current moment as an “extraordinary time of hyper progress\" and reaffirmed the company’s commitment to partnering with India across the entire AI ecosystem.\nOpenAI CEO Sam Altman also backed India’s ambitions, saying the country could emerge as a “full-stack AI leader\" capable of building core AI systems, infrastructure and applications.\nLatest Blogs",
        "link": "https://www.news18.com/india/pm-modi-shares-serbia-presidents-article-as-indias-ai-growth-wins-global-praise-ws-l-9911514.html",
        "date": "Wed, 18 Feb 2026 15:30:15 +0530",
        "fetched_at": "2026-02-19 04:02:01.894300"
    },
    {
        "title": "AI Summit 2026 India Updates: PM Modi Welcomes World Leaders At Bharat Mandapam",
        "content": "Emmanuel Macron India AI Summit 2026 LIVE Updates: French President Emmanuel Macron, Spanish President Pedro Sánchez, Google CEO Sundar Pichai among top delegates attended the AI Impact Summit hosted by India in Delhi on Wednesday. The summit, held from February 16–20, follows the UK’s first AI Summit in 2023 and France’s 2025 edition, which highlighted major global investments in AI.\nMacron and France’s First Lady Brigitte Macron arrived in Mumbai on Tuesday for an official three-day visit to India from 17 to 19 February 2026. This is his fourth official visit to India.\nAt a joint press meet with Prime Minister Narendra Modi, Macron thanked him for the welcome and spoke about attending the AI summit.\nPrime Minister Narendra Modi and President Macron inaugurated the India-France Year of Innovation 2026 at the Gateway of India.\nSpeaking at the India-France Innovation Forum, Macron said the question is no longer whether India innovates, but who will innovate with India. He said France wants to be that partner and added, “We are here. We want to be here with you. And we are not leaving.”\nHe also announced an Innovation Day to be held before the G7, led by Franco-Indian initiatives and bringing together students and researchers. Macron said France wants to be a trusted partner so that both countries’ industries can deliver unique cooperation.\nThe India AI Impact Summit 2026 is being held from 16 to 20 February at Bharat Mandapam in New Delhi. It is the first major global AI event hosted in the Global South.\nThe summit, organised under the IndiaAI Mission, focuses on People, Planet and Progress. It features 12 indigenous foundation models in 22 Indian languages and pavilions from France, Japan, the UK and others.\nFrance has the largest international pavilion, covering 436 square metres, with 29 companies showcasing AI across several sectors.\n“We want all our allies, including India, to leverage our AI infrastructure,” says Sriram Krishnan, Senior White House Policy Advisor on Artificial Intelligence.\nDelhi | India AI Impact Summit : Sriram Krishnan, Senior White House Policy Advisor on Artificial Intelligence, says, “…We want to make sure that the world uses the American AI stack…We also want the world to use our AI model…We want all our allies, including India, to… pic.twitter.com/u1tpf74wFS\n— ANI (@ANI) February 18, 2026\nSharing an AI-generated picture with Prime Minister Narendra Modi, French President Emmanuel Macron says, “When friends connect, innovation follows. Ready for The AI Impact Summit!”\nWhen friends connect, innovation follows. Ready for The AI Impact Summit! pic.twitter.com/oh4700pQ09\n— Emmanuel Macron (@EmmanuelMacron) February 18, 2026\nPrime Minister Narendra Modi welcomes President of Spain, Pedro Sánchez Pérez-Castejón, at Bharat Mandapam.\nPrime Minister Narendra Modi welcomes President of the Slovak Republic, Peter Pellegrini, at Bharat Mandapam.\nPrime Minister Narendra Modi welcomes Prime Minister of Kazakhstan, Olzhas Bektenov, at Bharat Mandapam.\nPrime Minister Narendra Modi welcomes Prime Minister of Finland, Petteri Orpo, at Bharat Mandapam.\nPrime Minister Narendra Modi welcomes President of Estonia, Alar Karis, at Bharat Mandapam.\nPrime Minister Narendra Modi welcomes Vice President of Seychelles, Sebastien Pillay, at Bharat Mandapam.\nMauritius Prime Minister Dr Navinchandra Ramgoolam arrives at Bharat Mandapam.\nPrime Minister Narendra Modi welcomes Prime Minister of Croatia Andrej Plenković at Bharat Mandapam.\nPrime Minister Narendra Modi welcomes UN Secretary General António Guterres at Bharat Mandapam.\nPrime Minister Narendra Modi welcomes IMF MD Kristalina Georgieva at the Bharat Mandapam.\nPrime Minister Narendra Modi welcomes Dick Schoof, Prime Minister of the Netherlands, at Bharat Mandapam.\nPrime Minister Narendra Modi welcomes world leaders at AI Impact Summit 2026 in Bharat Mandapam.\n“We speak about 10,000 per year, more or less, depending on the season. We decided with Prime Minister Modi to have 30,000 by 2030,” says French President Emmanuel Macron on student visas.\n#WATCH | Delhi: French President Emmanuel Macron says, “…It’s very important for us to welcome more Indian students and to have more French students coming here. We speak about 10,000 per year, more or less, depending on the season. We decided with Prime Minister Modi to have… https://t.co/pj8bOckFdM pic.twitter.com/RPNLq4a7co\n— ANI (@ANI) February 18, 2026\nFrench President Emmanuel Macron inaugurated the Franco-Indian Centre for Artificial Intelligence in Healthcare, led by AIIMS, Sorbonne Université and the Brain Institute.\nÀ New Delhi, nous inaugurons le Centre franco-indien de l’intelligence artificielle en santé, porté par AIIMS, Sorbonne Université et l’Institut du cerveau.\nRecherche, formation, innovation : France et Inde mobilisent l’IA pour le bien commun ! pic.twitter.com/lbHLdLhyUn\n— Emmanuel Macron (@EmmanuelMacron) February 18, 2026\nIndiaAI and Intel India earn GUINNESS WORLD RECORDS for most pledges received for an AI responsibility campaign in 24 hours.\nIndiaAI and Intel India earn GUINNESS WORLD RECORDS for most pledges received for an AI responsibility campaign in 24 hours. ???????? pic.twitter.com/kgyWhCt6eU\n— Ashwini Vaishnaw (@AshwiniVaishnaw) February 18, 2026\nUN Secretary-General António Guterres arrives in Delhi to attend the India AI Impact Summit 2026.\n#WATCH | UN Secretary-General António Guterres arrives in Delhi to attend the India AI Impact Summit 2026. He was received by Union MoS Harsh Malhotra pic.twitter.com/WgYsVfAqKY\n— ANI (@ANI) February 18, 2026\n“I’ve arrived for another visit with an important agenda: strengthening ties, deepening partnerships, and discussing the future of artificial intelligence in the world,” Brazil President Luiz Inácio Lula da Silva shares in a post on X.\nNamaste, India! ????????\nCheguei para mais uma visita com uma agenda importante: estreitar laços, aprofundar parcerias e discutir o futuro da inteligência artificial no mundo.\nSeguimos trabalhando para construir mais cooperação, inovação e oportunidades entre nossos países.\n????… pic.twitter.com/6daINLNyvf\n— Lula (@LulaOficial) February 18, 2026\nExhibitors must not display items that are not theirs, says IT Secretary S Krishnan on Galgotias University’s China-made robotic dog at AI Summit.\nBrazil President Luiz Inácio Lula da Silva reaches New Delhi on a State Visit. During his visit, President Lula will be participating in the India–AI Impact Summit.\nPresident Luiz Inácio Lula da Silva of Brazil, @LulaOficial has arrived in New Delhi on a State Visit.\nHe was warmly received by Minister of State @PmargheritaBJP.\nDuring his visit, President Lula will be participating in the India–AI Impact Summit. PM @narendramodi will also… pic.twitter.com/VF3WZ7UQuJ\n— Randhir Jaiswal (@MEAIndia) February 18, 2026\nFrench President Emmanuel Macron reaches New Delhi, to attend the AI Impact Summit 2026.\nWarm welcome to President @EmmanuelMacron in New Delhi for the AI Impact Summit 2026. Received by MoS @KVSinghMPGonda.\nThe summit provides an opportunity to further advance ???????????????? shared priorities and mark an important step as AI moves from dialogue to impact on ground. pic.twitter.com/HSrY2SVey7\n— Randhir Jaiswal (@MEAIndia) February 18, 2026\nSweden’s Deputy Prime Minister Ebba Busch has said that Sweden’s partnership with India is growing stronger in areas like artificial intelligence, innovation, trade, and global politics. Speaking to a news channel, She called India a “chosen partner” for Europe during a time of global uncertainty. Busch also praised India for hosting the first global AI summit in the Global South, saying it showed strong leadership. She added that the new India‑European Union Free Trade Agreement is about “much more than trade,” and will help build deeper cooperation between the two sides.\nAmid the controversy, Galgotias University staff and officials vacated their stall at the India AI Impact Summit expo following objections over the display of a Chinese‑made robo‑dog. Power was reportedly cut off at the Galgotias University pavilion after the institution was asked to leave the venue due to the row surrounding the robotic dog exhibit. A security guard at the India AI Impact summit expo venue told ANI, “My supervisor has said that Galgotiyas’ stall is being shut. Lights might have been switched off by the electricity department.”\nVIDEO | Delhi: Power has reportedly been cut off at the Galgotias University pavilion at the AI Summit after it was asked to vacate the expo following a row over the display of a robotic dog.\n(Full video available on PTI Videos – https://t.co/n147TvrpG7) pic.twitter.com/j5rOrSWfF0\n— Press Trust of India (@PTI_News) February 18, 2026\nThe government has extended the India AI Impact Summit 2026 Expo by an additional day, allowing the exhibition to remain open to the public on Saturday, February 21, in view of the large public turnout and to ensure a smoother and more comfortable experience for visitors. According to an official announcement, the Expo timings have already been extended till 8 pm, reflecting the growing enthusiasm among delegates and the general public attending the event at Bharat Mandapam.\nBrazilian President Luiz Inácio Lula da Silva departed for India on Tuesday for an official visit from February 18 to 22 at the invitation of Prime Minister Narendra Modi. Lula will arrive in New Delhi to participate in the AI Summit, where global leaders are gathering to discuss the future of artificial intelligence. His visit underscores Brazil’s growing engagement with India on technology, innovation and multilateral cooperation.\nFrench President Emmanuel Macron has left Mumbai and departed for Delhi after concluding his city visit. He is set to attend the AI Impact Summit in the capital. Posting on X, he wrote, “Thank you, Mumbai, for your welcome. Delhi, we’re on our way!”\nThank you, Mumbai, for your welcome.Delhi, we’re on our way! ???????????????? pic.twitter.com/hgDMsYXPyu\n— Emmanuel Macron (@EmmanuelMacron) February 18, 2026\nSwiss President Guy Parmelin has praised India’s rise as a strong force in artificial intelligence research and innovation. Speaking about post-summit cooperation, he said Switzerland sees major potential to deepen collaboration with India in AI research, governance frameworks, capacity building and responsible innovation. He welcomed Swiss startups attending the summit, noting they are presenting bold ideas and advanced technologies while exploring partnerships with Indian firms. Parmelin said both countries believe AI must serve the public good by supporting inclusive growth, social progress and sustainability. He added that Switzerland values close cooperation with India on international and multilateral agreements for AI governance.\nSwiss President Guy Parmelin said Switzerland’s priorities closely align with India’s vision for the AI Impact Summit, emphasising shared commitments to responsible and inclusive technological development. Responding to questions on the convergence of goals, Parmelin welcomed the summit’s guiding principles – People, Progress, Planet – noting they reflect Switzerland’s own approach to artificial intelligence. He stressed that AI must be developed so its benefits reach all sections of society, driving both economic and social progress. Parmelin added that safeguarding the planet is equally essential, calling for AI innovation that remains sustainable and respectful of environmental limits.\nPrime Minister Narendra Modi met Google CEO Sundar Pichai in Delhi on the sidelines of the AI Summit.\n#WATCH | #IndiaAIImpactSummit2026 | Prime Minister Narendra Modi meets Google CEO Sundar Pichai in Delhi.\n(Source: DD News) pic.twitter.com/JNjMaOa0ux\n— ANI (@ANI) February 18, 2026\nIt was a delight to meet Mr. Sundar Pichai on the sidelines of the AI Impact Summit in Delhi. Talked about the work India is doing in AI and how Google can work with our talented students and professionals in this field.@sundarpichai pic.twitter.com/lUCzOn0LSh\n— Narendra Modi (@narendramodi) February 18, 2026\nGalgotias University has been asked to vacate the Delhi AI Summit expo venue immediately, government sources said on Wednesday, amid the controversy over the display of a Chinese-made robotic dog at the ongoing event in the national capital.\nThe development comes a day after the university issued a clarification stating that the robotic dog showcased at the summit was procured from China-based Unitree and that it had “never claimed” to have built the device.\nThe Delhi Traffic Police has issued a traffic advisory for today, February 18, announcing restrictions and diversions across central Delhi in view of the AI Impact Summit 2026, being held at Bharat Mandapam.Traffic curbs will be in place between 4 P.M. and 10 P.M. due to VVIP movements and security protocols.\nSpanish President Pedro Sánchez arrived in New Delhi to attend the ongoing India AI Impact Summit 2026 at Bharat Mandapam. The summit, held from February 16–20, follows the UK’s first AI Summit in 2023 and France’s 2025 edition, which highlighted major global investments in AI.\nVIDEO | Spanish President Pedro Sanchez arrives in Delhi to attend the ongoing AI summit.\nThe India AI Impact Summit 2026 is currently underway, being held from February 16-20 at Bharat Mandapam, New Delhi.\nThe UK hosted the first AI Summit in 2023 that focused on AI safety… pic.twitter.com/NG9gV6SFOa\n— Press Trust of India (@PTI_News) February 18, 2026\nPM Modi praised Serbian President Aleksandar Vučić for his insightful article on AI and his admiration for India.\nSharing it on X, the Prime Minister highlighted Vučić’s recognition of India’s progress in artificial intelligence and the deep, growing partnership between India and Serbia.\nA fine article by President Aleksandar Vučić of the Republic of Serbia, in which he talks about AI, of course, but at the same time highlights his fondness for India, India’s strides in AI and strong India-Serbia relations! @predsednikrs https://t.co/5k4yAEUMwI\n— Narendra Modi (@narendramodi) February 18, 2026\nPM Modi said India must become one of the world’s top three AI superpowers by 2047, outlining an ambitious national tech vision.\nIndia is hosting the AI Impact Summit 2026 for the first time in the Global South. The motto is “Sarvajan Hitay, Sarvajan Sukhaye” – Welfare for All, Happiness of All.\nPrime Minister Narendra Modi said AI stands at a civilisational turning point. It can expand human capability but may also test social foundations if left unguided. The summit focuses on impact that ensures fair and meaningful outcomes, not just innovation. Technology must serve humanity, not replace it.\nThe summit centres on People, Planet and Progress, aiming to spread AI’s benefits widely and support global development in a human-centric way, he added.\nAs India hosts the AI Impact Summit in Delhi, I’ve shared my thoughts on the transformative potential of AI, the role India can play in the AI revolution and more in this interview with ANI. https://t.co/0rYOGdm1AX\n— Narendra Modi (@narendramodi) February 18, 2026\nGoogle and Alphabet CEO Sundar Pichai will also be attenting the AI Summit today.\nHe posted on X, “Nice to be back in India for the AI Impact Summit – a very warm welcome as always and the papers looked great too:)”\nNice to be back in India for the AI Impact Summit – a very warm welcome as always and the papers looked great too:) pic.twitter.com/szM9g2wB4d\n— Sundar Pichai (@sundarpichai) February 18, 2026\nWelcome to our blog, bringing you live updates as French President Emmanuel Macron attends the AI Impact Summit in Delhi today.\nLatest Blogs",
        "link": "https://www.news18.com/india/ai-summit-2026-live-updates-emmanuel-macron-pm-modi-india-ai-impact-summit-day-3-delhi-bharat-mandapam-latest-news-liveblog-9911393.html",
        "date": "Wed, 18 Feb 2026 23:59:58 +0530",
        "fetched_at": "2026-02-19 04:02:02.778775"
    },
    {
        "title": "India Considering Age-Based Restrictions With Social Media Platforms, Says IT Minister",
        "content": "After Australia, India is now considering age-based restrictions with social media companies, Information Technology Minister Ashwini Vaishnaw said on Tuesday.\n“This is something which has now been accepted by many countries, that age-based [restrictions] … has to be there,\" Vaishnaw said during a press conference at the AI Impact Summit in the national capital.\n“Right now we are in conversation regarding deepfakes, regarding age-based restrictions, with the various social media platforms,\" Vaishnaw said, adding that the government is discussing “the right way\" to enforce the regulation.\nHowever, the minister did not name any specific platforms or companies that are in conversation with the central government.\nAny restrictions in India — a country with around 1.4 billion population — could have a major impact on social media firms including Meta and Google, which enjoy an enormous user base in the country.\nAUSTRALIA BANS SOCIAL MEDIA FOR UNDER-16s\nThe move comes as several governments are considering age-based restrictions with social media platforms, given the rising cases of deepfakes, digital arrests, and online blackmailing.\nRecently, in December, the Australian government banned users under 16 from accessing major social media platforms. Australia emerged as the first nation in the world to enact such a rule.\nDenmark last year approved a new rule to bar users under 15 from social media. In addition, Spain this month announced it would ban under-16s from social media.\nMeta’s Facebook and Instagram are two of the most popular social media platforms in India, while Google’s YouTube also boasts a huge audience.\nLatest Blogs",
        "link": "https://www.news18.com/india/india-considering-age-based-restrictions-with-social-media-platforms-says-it-minister-ws-l-9911263.html",
        "date": "Wed, 18 Feb 2026 07:28:03 +0530",
        "fetched_at": "2026-02-19 04:02:04.084767"
    },
    {
        "title": "Emmanuel Macron Extends Invite To PM Modi To Attend 52nd G7 Summit In France",
        "content": "French President Emmanuel Macron on Tuesday invited Prime Minister Narendra Modi to the 52nd G7 Summit, which will be presided over by France in 2026.\nMacron, who is currently on a three-day visit to India, called for an ad hoc meeting between India and France to reach an agreement on the international agenda ahead of the G7 Summit in Evian.\n“This year, 2026, is a year of acceleration for our partnership, of translating much of this agenda into action. It is also the year in which the Prime Minister, you, will chair the BRICS group, and France will chair the G7 group. In this spirit, I have invited Prime Minister Modi as a very special guest to the G7 Summit in Evian,\" the French President said.\n“It is also to this end that we have together decided to have, as part of a bilateral segment that the Prime Minister will hold, a moment for innovation, our youth, bringing together Indian youth from the best universities and research centres, our youth in France, Europe, and the G7, so that we can continue to mobilise in the service of innovation and the resolution of the major problems we face,\" he added.\nMacron further called for an effective partnership between New Delhi and Paris over research, student exchanges, and trade.\nThe Group of Seven (G7) is an intergovernmental political and economic forum consisting of United States, the United Kingdom, France, Germany, Japan, Italy, Canada, and the European Union (EU).\nLast year, Prime Minister Narendra Modi attended the summit on Canadian Prime Minister Mark Carney’s invitation.\nMeanwhile, BRICS is an international group of eleven countries comprising India, Brazil, China, Egypt, Ethiopia, Indonesia, Iran, Russia, Saudi Arabia, South Africa, and the UAE.\nAccording to the joint statement released by India and France, Prime Minister Modi has welcomed the invitation, noting India’s longstanding partnership with the G7 and its commitment.\nBoth leaders further expressed confidence that India’s participation would further strengthen collective efforts to address global challenges and promote a more balanced, inclusive, and resilient international order.\n(With agency inputs)\nLatest Blogs",
        "link": "https://www.news18.com/india/emmanuel-macron-extends-invite-to-pm-modi-to-attend-52nd-g7-summit-in-france-9911241.html",
        "date": "Wed, 18 Feb 2026 06:21:31 +0530",
        "fetched_at": "2026-02-19 04:02:04.711967"
    },
    {
        "title": "‘We Never Claimed’: Galgotias University Clarifies Robodog Displayed At AI Summit Was Chinese-Made",
        "content": "Galgotias University on Tuesday issued a clarification after facing criticism over the display of a robotic dog at the ongoing AI summit in the national capital, saying it “never claimed to have built the device\" and that it was procured from a Chinese manufacturer for academic purposes.\nIn a statement, the university said the robotic dog was acquired from Unitree, a global robotics company based in China, and is being used as a learning tool for students.\n“Let us be clear, Galgotias has not built this robodog, nor have we claimed to do so. What we are building are minds that will soon design, engineer and manufacture such technologies in Bharat,\" the university said.\nThe clarification followed a social media backlash after reports claimed that the university showcased the Unitree Go2 robotic dog, an AI-powered device available on Chinese platforms for Rs 2–3 lakh, under the name “Orion\" at the AI summit in New Delhi.\nSeveral users accused the institution of presenting imported technology as indigenously developed.\nResponding to the controversy, the university said its focus has always been on exposing students to cutting-edge global technologies to prepare them for future innovation.\n“From the US to China and Singapore, we bring advanced technologies to campus because exposure creates vision, and vision creates creators,\" the statement said, adding that the robodog is actively being used by students to test capabilities and explore real-world applications.\nEmphasising its academic intent, Galgotias University said innovation should not be limited by borders and learning must remain global in outlook.\n“This is not about importing technology, but about inspiring transformation. Our students study, challenge and improve upon global innovations so they can eventually build world-class solutions from India for the world,\" it added.\nThe university said it would continue to source advanced technologies internationally to support hands-on learning and foster an ecosystem that empowers young innovators to develop indigenous solutions in the long run.\nLatest Blogs",
        "link": "https://www.news18.com/india/we-never-claimed-galgotia-university-clarifies-robodog-displayed-at-ai-summit-was-chinese-made-9911059.html",
        "date": "Tue, 17 Feb 2026 22:20:59 +0530",
        "fetched_at": "2026-02-19 04:02:05.349915"
    },
    {
        "title": "Delhi Police Register FIR Over Alleged Product Theft At AI Impact Summit",
        "content": "Delhi Police has registered a First Information Report (FIR) in connection with the alleged theft of AI wearable devices during the ongoing India AI Impact Summit at Bharat Mandapam in the national capital.\nThe action came after a Bengaluru-based startup founder claimed that his company’s AI wearable product went missing from a exhibition stall during a security evacuation ahead of Prime Minister Narendra Modi’s visit on the opening day of the summit.\nDhananjay Yadav, co-founder and CEO of NeoSapien, claimed that the company’s AI wearable went missing from its booth at the summit venue after exhibitors were asked to vacate the area ahead of PM Modi’s visit.\nIn a post on X, Yadav described the incident as “shocking\" and said Day 1 of the summit “turned out to be a pain\" for the company. According to him, security personnel began clearing the exhibition area around noon to sanitise the venue ahead of the Prime Minister’s scheduled visit.\nYadav said that he tried to explain that NeoSapien had developed what he described as India’s first patented AI wearable, capable of tracking conversations and analysing emotions, and requested permission to stay back briefly to showcase it.\n“Day 1 of the AI Impact Summit turned to be a pain for us. At 12 noon, security personnel arrived to sanitise and cordon off the area ahead of the visit by PM Modi visit at 2pm. I explained that we’re building India’s first patented AI wearable at NeoSapien and requested a chance to showcase it,\" he said in a post on X.\nWhile one officer initially allowed him to remain, he alleged that another security team later instructed all exhibitors to vacate the area immediately.\nHe said that he specifically asked whether he should carry the wearable devices along, but was told that even laptops were being left behind and that security would ensure the safety of items kept inside the booths.\n“Trusting them, I left,\" Yadav wrote, adding that the exhibition zone remained sealed for nearly six hours. When access was restored, he claimed the AI wearables were missing. He later shared images on social media showing empty boxes at the NeoSapien stall.\nHe questioned that how the theft could have taken place when, according to him, only security personnel were allowed inside the exhibition zone at the time.\n“If only security and official entourage had access, how did this happen? This is extremely disappointing,\" he added.\nMeanwhile, Union Electronics and IT Minister Ashwini Vaishnaw on Tuesday issued a formal apology for logistical challenges and overcrowding that marked the opening day of the summit. Addressing a press conference at Bharat Mandapam, he attributed the disruptions to an “unprecedented\" surge in attendance, with more than 70,000 people arriving at the venue on the first day alone.\nVaishnaw said registrations for the five-day event have crossed 300,000 and acknowledged that “pockets of confusion\" emerged due to the scale of participation and security arrangements for the Prime Minister’s inauguration. He said a dedicated war room has since been set up to streamline operations and prevent further inconvenience to exhibitors and delegates.\nThe India AI Impact Summit, being held at Bharat Mandapam, is among the most high-profile technology events hosted in the country this year. The five-day summit, inaugurated on 16 February, has drawn global attention with attendees including Sundar Pichai and Sam Altman.\nLatest Blogs",
        "link": "https://www.news18.com/cities/new-delhi-news/delhi-police-register-fir-over-alleged-product-theft-at-ai-impact-summit-ws-l-9910967.html",
        "date": "Tue, 17 Feb 2026 21:23:47 +0530",
        "fetched_at": "2026-02-19 04:02:05.973360"
    },
    {
        "title": "Telangana Allows Muslim Govt Employees To Leave Office Early During Ramzan",
        "content": "The Telangana government permitted Muslim employees working in government offices to leave work an hour early during the month of Ramzan to offer prayers.\nChief Secretary K Ramakrishna Rao issued an official memorandum allowing Muslim government employees, including teachers, contract and outsourcing staff, employees of boards and corporations, and those working in public sector undertakings, to leave their offices or schools at 4 pm during the fasting period.\nThe relaxation will be in effect from February 19 to March 20, except in cases where employees are required to remain on duty due to service exigencies.\nIn a related move, the state’s Director of School Education has approved revised school timings for Ramzan.\nFrom February 19 to March 20, all Urdu-medium government and aided schools, Urdu-medium sections in parallel-medium schools, and DIET colleges will function from 8 am to 1.30 pm.\nTo compensate for the reduced instructional hours, upper primary and secondary schools will be required to operate for one additional working day, while primary schools will extend their daily schedule by 30 minutes on two working days.\nRegional and district education officers have been directed to ensure strict implementation of the revised timings and compensatory arrangements, in line with established practices.\nMeanwhile, the Andhra Pradesh government has also issued similar orders allowing Muslim employees in government offices and educational institutions to leave work an hour early during Ramzan.\nMinister for Minority Welfare NMD Farooq said the concession in Andhra Pradesh will be applicable from February 18 to March 19.\nOfficials said the measure is intended to facilitate the observance of religious practices during the fasting month, and departments have been instructed to ensure uniform implementation, barring emergency situations.\nLatest Blogs",
        "link": "https://www.news18.com/india/telangana-allows-muslim-govt-employees-to-leave-office-early-during-ramzan-9910837.html",
        "date": "Tue, 17 Feb 2026 19:49:31 +0530",
        "fetched_at": "2026-02-19 04:02:06.824943"
    },
    {
        "title": "‘Tech To Serve Humanity...’: PM Modi Explains Vision Of India’s AI Summit, Motto Meaning",
        "content": "Prime Minister Narendra Modi on Tuesday said that technology exists to serve humanity, not replace it.\nIn an exclusive interview with news agency ANI, the Prime Minister explained the vision behind India’s AI Impact Summit 2026 and its motto, “Sarvajan Hitay, Sarvajan Sukhaye,\" saying that the guiding spirit of the summit reflects India’s civilisational philosophy.\n“The guiding spirit, “Sarvajan Hitay, Sarvajan Sukhaye“, reflects India’s civilisational philosophy. The end goal of technology should be ‘Welfare for All, Happiness of All’. Technology exists to serve humanity, not replace it,\" he said.\nPM Modi further said that artificial intelligence stands at a “civilisational inflection point,\" capable of expanding human capability in unprecedented ways but also posing challenges if left unguided. “That is why we have deliberately framed this Summit around Impact that ensures meaningful and equitable outcomes, not just innovation,\" he said.\nThe Prime Minister emphasised that while AI may enhance human capabilities, the ultimate responsibility for decision-making must always remain with human beings.\nHis remarks came amid the ongoing AI Impact Summit 2026 in the national capital- the first time a global artificial intelligence gathering of this scale is being hosted in the Global South.\nThe Prime Minister said that the summit is structured around three pillars — People, Planet and Progress — and emphasised that AI systems draw upon knowledge and data generated across societies worldwide.\n“AI systems draw upon knowledge and data generated across societies worldwide. Therefore, we want AI’s benefits to be diffused to everyone and not just hoarded by early adopters,\" he said.\nHe further said that as the first global AI summit hosted in the Global South, India is creating a platform that amplifies under-represented voices and development priorities.\nHighlighting India’s priorities, PM Modi said AI governance, inclusive datasets, climate applications, agricultural productivity, public health and multilingual access are central to the country’s approach.\n“Our vision is clear: AI must accelerate global development while remaining deeply human-centric,\" he said.\nIndia is hosting the AI Impact Summit 2026 at Bharat Mandapam in New Delhi from February 16-20, bringing together global policymakers, technology leaders and AI innovators. The event marks the first major global AI summit to be held in the Global South. Prime Minister Narendra Modi inaugurated the India AI Impact Expo on Monday.\nThe summit, which features over 300 pavilions and delegates from 60 countries, continues to host high-profile discussions on responsible AI, sovereign models like BharatGen, and the inevitable role of AI in national defence.\nThe summit, positioned as one of the world’s largest gatherings dedicated to artificial intelligence, initially struggled to cope with the sheer scale of global interest. With total registrations already surpassing 300,000, the first day saw long queues and significant delays at entry points. Participants, including startup founders, international delegates, and researchers, reported being stranded for hours as security protocols for VVIP movements—including the inauguration by Prime Minister Narendra Modi—clashed with the massive public footfall.\nLatest Blogs",
        "link": "https://www.news18.com/india/tech-to-serve-humanity-pm-modi-explains-vision-of-indias-ai-summit-motto-meaning-ws-l-9910587.html",
        "date": "Tue, 17 Feb 2026 20:45:20 +0530",
        "fetched_at": "2026-02-19 04:02:07.458952"
    },
    {
        "title": "'Conduct Yourselves With Dignity': Court Asks Sunjay Kapur's Wife, Sister To Exercise Restraint",
        "content": "The Delhi High Court on Tuesday ordered late industrialist Sunjay Kapur’s wife, Priya Kapur, and sister Mandhira Kapur Smith to refrain from making public statements against each other amid an escalating defamation dispute.\nWhile hearing a civil suit filed by Priya Kapur, who has accused her sister-in-law of running a continuous and defamatory campaign against her through podcasts, interviews, social media posts and other public statements, Justice Mini Pushkarna emphasised the need for dignity and decorum given the nature of the dispute, and said, “Both parties are directed to exercise restraint in making statements on each other, directly or indirectly,\" news agency PTI reported.\nThe high court also issued summons to Mandhira Kapur Smith and podcast host Pooja Chaudhri in the matter and listed the case for further hearing in May.\nIn her lawsuit, Priya Kapur alleged that within days of Sunjay Kapur’s death, his sister “embarked upon a systematic and organised course of conduct\" to malign and socially discredit her.\nAccording to the suit, the alleged defamatory statements falsely accused her of dishonesty, moral impropriety, professional incompetence, concealment of assets and illegitimate assumption of corporate control. The plea further claimed that such content was deliberately published and amplified through the podcast ‘InControversial with Pooja Chaudhri’, causing serious harm to her reputation, dignity, privacy and mental peace.\nSenior counsel appearing for Priya Kapur argued that Mandhira had uploaded and circulated content on social media with the intent to tarnish her reputation. The suit sought a permanent injunction restraining the defendants from publishing any further content against her, removal of existing material, an unconditional public apology and damages of Rs 20 crore.\nOn the other hand, counsel for Mandhira Kapur Smith told the court that there was a “concerted media vilification campaign\" against her as well.\nSunjay Kapur passed away on June 12 last year after collapsing during a polo match in England. He reportedly suffered a sudden cardiac arrest.\nPriya Kapur has also filed a criminal defamation case against Mandhira Smith before a trial court.\n(With inputs from agencies)\nLatest Blogs",
        "link": "https://www.news18.com/india/conduct-yourselves-with-dignity-court-asks-sunjay-kapurs-wife-sister-to-exercise-restraint-9910297.html",
        "date": "Tue, 17 Feb 2026 18:27:20 +0530",
        "fetched_at": "2026-02-19 04:02:08.097992"
    },
    {
        "title": "AI Summit Snarl: Ashwini Vaishnaw Apologises, Says Massive Youth Turnout Behind Day-One Disruptions",
        "content": "Union Electronics and IT Minister Ashwini Vaishnaw issued a formal apology on Tuesday for the logistical hurdles and overcrowding that marred the opening day of the India AI Impact Summit. Speaking at a press conference at New Delhi’s Bharat Mandapam, the minister attributed the disruptions to a “phenomenal\" and unprecedented surge in attendance, which saw more than 70,000 people arrive at the venue on the first day alone.\nThe summit, positioned as one of the world’s largest gatherings dedicated to artificial intelligence, initially struggled to cope with the sheer scale of global interest. With total registrations already surpassing 300,000, the first day saw long queues and significant delays at entry points. Participants, including startup founders, international delegates, and researchers, reported being stranded for hours as security protocols for VVIP movements—including the inauguration by Prime Minister Narendra Modi—clashed with the massive public footfall.\n“The response was phenomenal. The energy is palpable,\" Vaishnaw remarked, acknowledging the enthusiasm of the youth and the tech community. He admitted that the intensity of the crowd had caused “pockets of confusion\", but assured stakeholders that a dedicated war room has been operational since Monday to streamline the experience for the remainder of the five-day event.\nThe first day was not without specific controversies. Several exhibitors and startup founders voiced their disappointment on social media over overlapping security directives. Most notably, Dhananjay Yadav, CEO of Neo Sapien, alleged that AI wearables intended for display were stolen from his stall during a mandatory security evacuation for the Prime Minister’s visit. Other attendees flagged “patchy\" Wi-Fi connectivity and registration glitches that prevented even pre-registered delegates from accessing certain sessions.\nResponding to these criticisms, Vaishnaw emphasised that the government is “open-minded\" and actively seeking feedback to ensure the organisation remains smooth. He noted that seating capacities and help desks have been increased, and communication regarding security sweeps has been improved to prevent a repeat of the opening-day chaos.\nBeyond the apologies, the minister utilised the platform to outline India’s ambitious AI roadmap. He projected that the country is poised to receive over $200 billion in investments across the “AI stack\" over the next two years. He highlighted India’s unique position in the Global South, leveraging its Digital Public Infrastructure (DPI) to democratise AI access.\nThe summit, which features over 300 pavilions and delegates from 60 countries, continues to host high-profile discussions on responsible AI, sovereign models like BharatGen, and the inevitable role of AI in national defence. Despite the initial friction, the minister maintained that the event’s scale proves India has arrived as a central pillar of the global AI map.\nLatest Blogs",
        "link": "https://www.news18.com/tech/ai-summit-snarl-vaishnaw-apologises-says-massive-youth-turnout-behind-day-one-disruptions-9910194.html",
        "date": "Tue, 17 Feb 2026 17:28:49 +0530",
        "fetched_at": "2026-02-19 04:02:08.725094"
    },
    {
        "title": "‘Broken Seats, Non-Functional Screens’: Punjab MP Writes To Aviation Minister Over Air India Flights",
        "content": "Gurjeet Singh Aujla, the Congress MP from Amritsar, has written to Union Civil Aviation Minister Kinjarapu Rammohan Naidu raising concerns over the condition of Air India’s long-haul aircraft operating to destinations such as Vancouver, Toronto and Australia.\nIn his communication, Aujla said passengers on ultra-long-haul routes are paying high fares but travelling on aircraft with non-functional seat-back screens, broken or loose seats, damaged armrests, worn upholstery and poor cabin maintenance. He termed the situation “unacceptable\" and urged the minister to ensure immediate upgradation of the long-haul fleet, improved ground support and modern facilities for international passengers, particularly from Punjab. “Our diaspora deserves world-class service,\" he said.\nPassengers on long-haul flights to Vancouver, Toronto & Australia are paying very high fares but travelling on aircraft with non-functional screens, broken seats, worn upholstery & poor cleanliness. This is unacceptable.Urge Hon’ble Civil Aviation Minister Mr Ram Mohan Naidu to… pic.twitter.com/69KOFZs2Ov\n— Gurjeet Singh Aujla (@GurjeetSAujla) February 16, 2026\nThe MP stated that he has been receiving growing complaints, especially from travellers belonging to Punjab and the North Indian diaspora, regarding the condition and passenger facilities on these flights. He noted that many travellers have reported malfunctioning in-flight entertainment systems and overall unsatisfactory onboard conditions on journeys often exceeding 12 to 15 hours.\nWhile acknowledging that Air India has initiated a fleet retrofit and modernisation programme to upgrade interiors, seating and entertainment systems, Aujla pointed out that the completion timeline for wide-body aircraft stretches into 2027-28. He said that until the upgrades are fully implemented, passengers — including students, families and working professionals — continue to face avoidable discomfort despite paying premium fares, and called for interim measures to ensure acceptable standards of comfort and service.\nLatest Blogs",
        "link": "https://www.news18.com/india/broken-seats-non-functional-screens-punjab-mp-writes-to-aviation-minister-over-air-india-flights-ws-l-9909631.html",
        "date": "Tue, 17 Feb 2026 14:55:30 +0530",
        "fetched_at": "2026-02-19 04:02:09.585495"
    },
    {
        "title": "News18 Afternoon Digest: French President Emmanuel Macron’s India Visit, Bill Gates To Attend AI Summit & Other Top Stories",
        "content": "In today’s afternoon digest, News18 brings you the latest updates on the Delhi hit-and-run case, French President Emmanuel Macron’s India visit, Bill Gates attending the AI Summit, cricket legends writing to the Pakistan government over Imran Khan’s treatment, and other top stories.\nLatest Blogs",
        "link": "https://www.news18.com/india/news18-afternoon-digest-french-president-emmanuel-macrons-india-visit-bill-gates-to-attend-ai-summit-other-top-stories-9909523.html",
        "date": "Tue, 17 Feb 2026 14:57:22 +0530",
        "fetched_at": "2026-02-19 04:02:10.250027"
    },
    {
        "title": "All About Bharat Mandapan, The Venue Hosting AI Impact Summit In Delhi",
        "content": "Bharat Mandapam, India’s state-of-the-art International Exhibition and Convention Centre (IECC) at Pragati Maidan in New Delhi, is hosting the ongoing India AI Impact Summit 2026. The venue that now stages global gatherings once stood on what many saw as wasteland. Today, it can seat more people than the Sydney Opera House. Here is what you may not know.\n1. Built on historic ground\nBharat Mandapam stands on the 123-acre Pragati Maidan site in central New Delhi. The land hosted an international agriculture fair in 1959, attended by US President Dwight Eisenhower and Soviet leader Nikita Khrushchev during the Cold War.\nIt was also home to the Hall of Nations, considered the world’s first large-span cast-in-situ concrete space frame. The structure was demolished overnight in April 2017 despite protests and court cases.\n2. A name with meaning\n“Bharat\" means India. “Mandapam\" refers to a pillared pavilion in ancient temple architecture used for public rituals and ceremonies.\nThe name draws inspiration from the Anubhav Mandapam, a 12th-century concept promoted by Lord Basaveshwara as a space for open public discussion. The venue is intended to serve as a forum for dialogue.\n3. Inspired by a river\nThe design competition in 2016 was won by Sanjay Singh of Arcop Associates (Delhi) and Simon Nunez of Aedas (Singapore). Their concept was inspired by the Yamuna River, which once flowed close to the site.\nThe building’s elliptical form mirrors the river’s movement and is shaped like a shankha, or conch shell, a symbol in Hindu tradition. It has no designated front or rear entrance and appears the same from every side, reflecting equality and inclusivity.\n4. Larger than the Sydney Opera House\nThe main convention hall can seat up to 7,000 people in a single format. The Sydney Opera House has a combined seating capacity of about 5,500 across its venues.\nThe complex also includes a 3,000-seat open-air amphitheatre, six exhibition halls covering 150,000 square metres, and a total built-up area of 390,000 square metres. It was built at a cost of around Rs 2,700 crore, or about $325 million.\n5. A ‘window to Delhi’\nOn the fourth floor is a 120-metre-long lobby with floor-to-ceiling glass offering views of Kartavya Path, the India Gate canopy, and the domes of Rashtrapati Bhawan.\nThe feature was designed as a tribute to its location near Lutyens’ Delhi. Delegates can view one of the capital’s most recognised skylines from this space.\n6. From inauguration to G20\nPrime Minister Narendra Modi inaugurated Bharat Mandapam on July 26, 2023, marking Kargil Vijay Diwas.\nJust 45 days later, it hosted the 19th G20 Summit on September 9 and 10, welcoming leaders including US President Joe Biden, UK Prime Minister Rishi Sunak and French President Emmanuel Macron.\n7. Hosting AI Impact Summit\nFrom February 16 to 20, 2026, Bharat Mandapam is hosting the India AI Impact Summit. More than 250,000 visitors, over 100 countries and global technology leaders such as Google CEO Sundar Pichai and OpenAI CEO Sam Altman are attending.\nIn less than three years since its inauguration, the venue has hosted both a G20 Summit and a major global AI gathering.\nLatest Blogs",
        "link": "https://www.news18.com/india/all-about-bharat-mandapan-the-venue-hosting-ai-impact-summit-in-delhi-ws-l-9909259.html",
        "date": "Tue, 17 Feb 2026 14:23:44 +0530",
        "fetched_at": "2026-02-19 04:02:10.970141"
    },
    {
        "title": "India May Attract USD 200 Billion In AI Investments In Next Two Years: Ashwini Vaishnaw",
        "content": "Union Minister for Electronics and IT Ashwini Vaishnaw on Tuesday said India is expecting more than USD 200 billion in investments over the next two years, underscoring growing global interest in the country’s artificial intelligence and deep tech ecosystem.\n“There are two types of interest. The first type is investment. There is an expectation of more than 200 billion dollars in investment over the next two years. The second type is deep tech funding by VC. And the third type is India’s innovativeness and India’s digital public infrastructure,\" Vaishnaw told ANI on the sidelines of the India AI Impact Summit at Bharat Mandapam in New Delhi.\nElaborating on how India’s digital framework is accelerating adoption, he said, “Because of the digital public infrastructure, there is a very good technology framework under the leadership of the Prime Minister. Because of this framework, the diffusion of AI in India can be accelerated. This is what everyone believes.\"\nThe minister noted strong interest from global CEOs, particularly in deep tech startups and infrastructure projects. “A lot of interest in investing in India, especially in the Indian deep tech startups, in the infra, also in finding new solutions at population scale. Because the way our Honorable Prime Minister Narendra Modi has created this digital public infrastructure in our country, that brings out a huge advantage for any solution which needs to be brought at a population scale,\" he said.\nHighlighting the enthusiasm around the summit, Vaishnaw said participation has been overwhelming, especially among youth and researchers. “There is a lot of excitement in AI Summit. More than 300,000 youth and researchers and students have registered. And all the sessions are going full. They are houseful. There is a lot of excitement, And especially among the youth. Through this summit, there is a new energy all over the country. By using AI, how to solve big problems on a population scale, such excitement is seen here among the youth,\" he said.\nHe also emphasised the need to balance innovation with safeguards. “By balancing these two, we have to move forward with this new technology,\" he noted, referring to solving large-scale economic and social challenges while mitigating risks.\nThe India AI Impact Summit has brought together policymakers, industry leaders, investors and innovators to discuss leveraging artificial intelligence for economic growth and social transformation. Prime Minister Narendra Modi is scheduled to deliver the inaugural address on Thursday, setting the tone for enhanced global cooperation and India’s vision for inclusive and development-focused AI.\nLatest Blogs",
        "link": "https://www.news18.com/india/over-200-billion-investment-expected-vaishnaw-on-indias-ai-push-ws-l-9909439.html",
        "date": "Tue, 17 Feb 2026 15:47:34 +0530",
        "fetched_at": "2026-02-19 04:02:11.598697"
    },
    {
        "title": "When Dues Go Unpaid: Court Locks Railway Office Over Farmer Compensation",
        "content": "In a striking display of judicial enforcement, the Senior Section Engineer’s (SSE) office of the Railway Department in Srirangapatna, Karnataka was seized on Wednesday after officials failed to settle a long-standing compensation debt owed to a local farmer.\nThe dispute dates back to the land acquisition process for the Bengaluru-Mysuru double-track railway project. During the expansion, the Railway Department acquired agricultural land belonging to Mahadevaiah, a resident of Baburayanakoppal village.\nWhile the land was taken for public infrastructure, the compensation provided was far below the market value. As per the then prices of land in the area, the compensation agreed upon to be paid by Railway Department was Rs 50 lakh but it was never paid in full.\nSeeking fair treatment, Mahadevaiah moved the court to demand enhanced compensation. Following a prolonged legal battle, the court ruled in his favour, ordering the Railway Department to pay the remaining balance along with accrued interest, totaling several lakhs of rupees.\nThe Seizure: Furniture and Computers Confiscated\nDespite the clear judicial mandate and multiple follow-up notices, the railway authorities failed to release the funds. Exhausting his options, the farmer filed an Execution Petition (EP), prompting the court to authorize the attachment of the department’s movable property.\nOn Wednesday, court bailiffs arrived at the SSE office located near the Srirangapatna railway station. When officials were unable to produce the payment, the staff began clearing the office of its essential assets. The confiscated items included:\nThe Aftermath\nThe seized assets were loaded into vehicles and transported to the court premises. Court officials have made it clear that if the compensation is not disbursed immediately, they will proceed with the next phase of legal attachment, which could include more significant departmental assets.\nThe incident has resonated strongly with the local farming community, serving as a rare example of a common citizen successfully holding a major government entity accountable through the power of the judiciary.\nWhile the land was taken for public infrastructure, the compensation provided was far below the market value. As per the then prices of land in the area, the compensation agreed upon to be paid by Railway Department was Rs 50 lakh but it was never paid in full.\nSeeking fair treatment, Mahadevaiah moved the court to demand enhanced compensation. Following a prolonged legal battle, the court ruled in his favour, ordering the Railway Department to pay the remaining balance along with accrued interest, totaling several lakhs of rupees.\nThe Seizure: Furniture and Computers Confiscated\nDespite the clear judicial mandate and multiple follow-up notices, the railway authorities failed to release the funds. Exhausting his options, the farmer filed an Execution Petition (EP), prompting the court to authorize the attachment of the department’s movable property.\nOn Wednesday, court bailiffs arrived at the SSE office located near the Srirangapatna railway station. When officials were unable to produce the payment, the staff began clearing the office of its essential assets. The confiscated items included:\nThe Aftermath\nThe seized assets were loaded into vehicles and transported to the court premises. Court officials have made it clear that if the compensation is not disbursed immediately, they will proceed with the next phase of legal attachment, which could include more significant departmental assets.\nThe incident has resonated strongly with the local farming community, serving as a rare example of a common citizen successfully holding a major government entity accountable through the power of the judiciary.\nScan the QR code to download the News18 app and enjoy a seamless news experience anytime, anywhere.\nLatest Blogs",
        "link": "https://www.news18.com/india/when-dues-go-unpaid-court-locks-railway-office-over-farmer-compensation-skn-ws-l-9909383.html",
        "date": "Tue, 17 Feb 2026 13:55:08 +0530",
        "fetched_at": "2026-02-19 04:02:12.222773"
    },
    {
        "title": "AI Impact Summit Opens To Packed Halls, Heavy Footfall Leads To Crowding, Delays On Day 1",
        "content": "With a global assembly of Presidents, Prime Ministers, technology pioneers and thousands of attendees from global tech firms in attendance, Day 1 of the India AI Impact Summit 2026 in New Delhi saw unprecedented energy.\nBut the bevvy of world leaders, industry experts, policymakers and dignitaries for the world’s largest artificial intelligence summit at the Bharat Mandapam also means large crowds and some delays which the attendees should account for.\nAmong the issues attendees need to brace for are security sweeps for high-level arrivals. Also, with the heightened interest, certain sessions saw more than expected participants, causing disappointment among those who couldn’t join.\nSteps have been taken to ease congestion and improve coordination for better crowd flow and access management, organisers were reported as saying.\nOne such instance was reported by Maitreya Wagh, CEO and one of the founders of Bolna AI, who couldn’t access his booth at the summit owing to the gates being shut.\nWagh wrote on X: “Gates are closed so could not access my own booth at the AI Summit. If you’re also stuck outside and wanted to visit the @bolna_dev team, dm me. We may set up a mini-booth at some Connaught Place café.\"\nGates are closed so could not access my own booth at the AI Summit. If you’re also stuck outside and wanted to visit the @bolna_dev team, dm me.We may set up a mini-booth at some Connaught Place cafe 😂 pic.twitter.com/YVIdWagxKM— Maitreya Wagh (@maitreya_wagh) February 16, 2026\nThe sudden evacuation stumped Dhananjay Yadav, co-founder and CEO of Neo Sapien. He also complained of confusing directions.\n“We paid for flights, accommodation, logistics and even the booth. Only to see our wearables disappear inside a high-security zone. If only security and official entourage had access, how did this happen? This is extremely disappointing,\" he wrote on X.\nDay 1 of the AI Impact Summit turned to be a pain for us.I came genuinely excited, it was the first time the summit was being hosted in India, and I wanted to show up personally to support the ecosystem and the government’s push.\nBut what happened next was shocking.\nAt 12… pic.twitter.com/9gVygparq0\n— Dhananjay Yadav (@imDhananjay) February 16, 2026\nKritika Kapoor, a content creator, highlighted some of the logistical challenges. “Too crowded…sitting on the floor,\" she wrote on X.\nBrooooooo it’s too crowded here at AI SUMMIT Delhi like you can’t even navigate properly plus other than AI posters there’s nothing AI and future here 😭 just another well marketed event pic.twitter.com/msWSy6KKNv— Kritika Kapoor (@Kritikaaaa_10) February 16, 2026\nPunit Jain, founder of Reskill, complained of the limited access.\n“If access was limited to select guests, it should have been communicated upfront,\" he said.\nAn AI Summit that sidelines its own builders?• 7 AM queues• 9 AM entry• 12 PM full evacuation• Hours of sanitization• PM visit at 5 PM. Day 1 Ends here\nMeanwhile — exhibitors, delegates, startup founders left outside. No water. No clarity.\nMedia shows celebration.… pic.twitter.com/u6hXBbiDG6\n— Punit Jain (@punit__jain) February 16, 2026\nA Reuters report said some journalists covering the summit spent much of Monday seeking clarity on entry procedures, with confusion over separate digital QR codes and physical passes for access, according to messages in a WhatsApp group for the event.\nSeveral exhibitors at the summit, however, called these logistical issues teething problems, which would be resolved soon.\nSpread across 10 arenas covering more than 70,000 square metres, the Expo brings together global technology firms, start-ups, academia, research institutions, Union Ministries, State Governments, and international partners.The event features 13 country pavilions showcasing international collaboration from nations including Australia, Japan, Russia, the United Kingdom, France, Germany, Italy, the Netherlands, Switzerland, Serbia, Estonia, Tajikistan, and Africa.\nExpecting 2.5 lakh visitors, the Expo hosts over 300 curated exhibition pavilions and live demonstrations, organised into three thematic chakras: People, Planet, and Progress.\nIn addition, it features over 600 high-potential start-ups, many of which are building globally relevant and population-scale solutions already deployed in real-world settings.\nThe massive scale of the event is further highlighted by over 500 sessions featuring more than 3,250 visionary speakers and panel members.\nRunning until February 20, the Impact Summit and Expo showcase New Delhi’s ambition to shape an AI future that is inclusive, responsible, and impactful, anchored in the Prime Minister’s broader vision for sovereign AI that benefits every global citizen.\nFinal two days of the Summit — February 19 and 20 — will see more than 20 heads of state and government, including France’s Emmanuel Macron and Brazil’s Luiz Inácio Lula da Silva, along with Indian Prime Minister Narendra Modi, talking about the future of AI alongside business leaders and investors.\nWith Agency inputs\nLatest Blogs",
        "link": "https://www.news18.com/india/ai-impact-summit-opens-to-packed-halls-heavy-footfall-leads-to-crowding-delays-on-day-1-ws-l-9908859.html",
        "date": "Tue, 17 Feb 2026 14:26:32 +0530",
        "fetched_at": "2026-02-19 04:02:12.877356"
    },
    {
        "title": "Macron’s India Itinerary: From Mumbai Talks With PM Modi To AI Summit In Delhi",
        "content": "French President Emmanuel Macron arrived in India for a multi-day visit focused on strengthening bilateral ties, attending the AI Impact Summit and holding key engagements with Prime Minister Narendra Modi. Macron’s visit, which includes stops in Mumbai and New Delhi, marks his fourth trip to India and his first official visit to the country’s financial capital.\n“President Emmanuel Macron will be on an official visit to India from 17-19 February 2026 at the invitation of Prime Minister Narendra Modi to participate in the AI Impact Summit hosted by India, as well as hold a bilateral summit with the Prime Minister in Mumbai,\" according to a press statement issued by the government.\nHere’s What Macron’s Visit To India Entails\nFebruary 17: Bilateral Talks With PM Modi, Innovation Events\nOn February 17, Macron will hold bilateral talks with Prime Minister Modi at Lok Bhavan in Mumbai at 3:15 pm, where both leaders are expected to review the progress of the India-France strategic partnership and discuss regional and global issues. This will be followed by the exchange of Memoranda of Understanding and a joint press statement at Raj Bhavan. Later in the evening, Macron will attend the India-France Innovation Forum at the Taj Mahal Palace Hotel. He will also participate in the India-France Year of Innovation and Cultural Commemoration event at the Gateway of India.\nEmmanuel Macron India Visit LIVE Updates here\nFebruary 18: Travel To New Delhi, Summit Engagements\nMacron will arrive in New Delhi on February 18 and head to Bharat Mandapam, where he will participate in events related to the AI Impact Summit hosted by India.\nFebruary 19: AI Summit, Departure For Paris\nOn February 19, Macron will attend the summit’s opening ceremony, join other global leaders for plenary discussions and a working lunch, and visit country pavilions. Following the conclusion of his engagements, he will depart for Paris later that afternoon.\nLatest Blogs",
        "link": "https://www.news18.com/india/macrons-india-itinerary-from-mumbai-talks-with-pm-modi-to-ai-summit-in-delhi-ws-l-9909042.html",
        "date": "Tue, 17 Feb 2026 12:14:51 +0530",
        "fetched_at": "2026-02-19 04:02:13.653111"
    },
    {
        "title": "Bill Gates Will Attend India AI Summit, Spokesperson Clarifies",
        "content": "Billionaire Microsoft co-founder Bill Gates will attend the AI Impact Summit and deliver his keynote address as scheduled, his spokesperson clarified on Tuesday, putting to rest speculation over his participation.\nThe clarification comes after reports suggested that Gates was not attending the ongoing AI Summit in Delhi, following his name reportedly missing from the event’s ‘Global Visionaries’ list. Government sources had earlier told News18 that Gates was not part of the summit due to “unavoidable reasons\" amid the fallout related to the Epstein files.\n“India is a global leader in artificial intelligence, powered by one of the world’s largest AI talent pools, rapid adoption across sectors, and innovation at a population scale. Under the leadership of Prime Minister Narendra Modi, AI has become central to India’s vision of Viksit Bharat, driving inclusive growth and responsible innovation,\" the Gates Foundation mentioned in X.\n“India’s distinctive public-private model, bringing together government, startups, academia, and industry, is proving that AI can be built for impact, for inclusion, and for the world,\" it further added.\nLate last week, Nvidia said its CEO Jensen Huang will not travel to India to attend the Summit. Huang was one of the biggest attractions at the Summit.\nThe development coincides with Gates’ visit to India. He had earlier travelled to Andhra Pradesh, where he lauded the state’s growth driven by AI and technology. Following his visit to Amaravati, Gates expressed admiration for the southern state’s innovations in health, agriculture and education.\nThe AI Impact Summit 2026 at Bharat Mandapam was inaugurated by Prime Minister Narendra Modi, highlighting India’s commitment to responsible and inclusive Artificial Intelligence. The summit brings together policymakers, technology companies, innovators, academia and industry leaders, aiming to translate global AI discussions into actionable development outcomes under the IndiaAI Mission and the Digital India initiative.\nLatest Blogs",
        "link": "https://www.news18.com/india/bill-gates-not-to-attend-ai-summit-amid-epstein-files-row-name-goes-missing-from-global-visionaries-list-9908989.html",
        "date": "Tue, 17 Feb 2026 13:24:58 +0530",
        "fetched_at": "2026-02-19 04:02:14.274599"
    },
    {
        "title": "Eknath Shinde Directs PMC To Fast-Track Appointment Of Pahalgam Victim Santosh Jagdale’s Daughter",
        "content": "The Maharashtra government has directed the Pune Municipal Corporation (PMC) to offer a permanent post of Class 2 officer to Asawari Jagdale, daughter of Santosh Jagdale who was killed in the Pahalgam terror attack last year.\nSources said the Chief Minister’s office called twice to speed up her appointment. Chief Minister Devendra Fadanavis was personally tracking the matter. Deputy Chief Minister Eknath Shinde later directed the civic administration to appoint her at the earliest.\nDeputy Chief Minister Eknath Shinde had earlier met the Jagdale family in Pune and assured them of government employment for Asawari. On Monday, He spoke to Pune Municipal Commissioner Naval Kishore Ram and directed that a post equivalent to her education be created. He also spoke to Asawari and said the appointment would be approved as a special matter.\nThe process to induct her into government service will be completed soon.\nThe move came after reports of financial distress and disappointment due to a delay of around 10 months in providing the government job promised on February 15.\nTwenty-six-year-old Asawari Jagdale approached the Union government seeking intervention. She said the family has been facing hardship since her father was killed by terrorists on April 22 last year. She said she left her private sector job to support her mother.\nIn a letter to the Modi government, she wrote that her family was struggling financially and was being made to run around for a job.\nAfter the attack, efforts were made to provide employment to Asawari. To avoid delays in government procedures, she was offered an option at a private university. The Chief Minister personally spoke to the university, but the family declined, said sources.\nShe was later offered a job at PMRDM, though her preference was the Pune Municipal Corporation.\nThe PMC can provide Class 3 or Class 4 posts at its level. As a special case, it sent a proposal to the state government to grant her a Class 2 post. Action on the proposal is under way.\nCongress leader Supriya Shrinate criticised the BJP government. In a post on X, she said that although the state had promised a job after Santosh Jagdale was martyred in the Pahalgam attack, it had now turned its face away.\n“Santosh Jagdale’s daughter wrote a letter to the Modi government describing the situation. In the terrorist attack in Pahalgam, Maharashtra’s Jagdale ji was martyred, the state government had promised his daughter a government job. But, as always, they have now turned their face away,\" read her post on X.\nOn November 26, 2008, during the terrorist attacks in Mumbai, Police Sub-Inspector Prakash Pandurang More was martyred while confronting terrorists. His daughter, Anushka More, was appointed on compassionate grounds.\nLatest Blogs",
        "link": "https://www.news18.com/india/eknath-shinde-directs-pmc-to-fast-track-appointment-of-pahalgam-victim-santosh-jagdales-daughter-9908595.html",
        "date": "Tue, 17 Feb 2026 09:22:25 +0530",
        "fetched_at": "2026-02-19 04:02:14.898304"
    },
    {
        "title": "AI Summit: Cyber Threat Triggers Nationwide Alert As India Activates G20-Grade Shield | Exclusive",
        "content": "The India AI Impact Summit 2026 is facing multiple waves of cyber threats from foreign-based attackers prompting a serious alert across Indian security agencies.\nOwing to this, a senior cyber security officer overseeing summit operations said a G20-grade shield has been activated till the event ends on February 20.\nAccording to the authorities, one of the most serious risks is the misuse of social media and deepfake technology to manipulate or fabricate statements by world leaders, potentially spreading false narratives within minutes.\nThe authorities said cyber teams are closely monitoring online platforms to prevent disinformation campaigns linked to the summit, which was inaugurated by Prime Minister Narendra Modi on Monday (February 16). As per sources, the alert states that government websites are under threat and can be targeted through “watering hole attacks\" in which hackers attempt to exploit vulnerabilities to silently plant malware.\nOfficials said summit communications also face threats from session and token hijacking, rogue “Evil Twin\" WiFi hotspots, and data theft operations aimed at delegates and affiliated social media accounts. As per the inputs, cybercriminals are simultaneously preparing ransomware attacks against critical infrastructure, while distributed denial-of-service (DDoS) strikes are intended to overwhelm digital public platforms and disrupt services.\nInvestigators suspect high-powered brute-force attempts could be executed by advanced computing capabilities, targeting network hardware such as video conferencing systems, routers and switches. Security agencies have also warned of infected USB storage devices being used to infiltrate computers and quietly spread malware across organisations.\nIn a further escalation, foreign-based threat actors are exploiting outdated or vulnerable routers used by internet service providers turning them into proxy networks to launch attacks on Indian IT infrastructure.\nA G20-grade, multi-layered, defence framework is fully operational now, with the system engineered to withstand thousands of attack attempts per minute.\nThis cyber shield includes mandatory multi-factor authentication, real-time patch management, disabled USB autorun, restricted user privileges, continuous backups and ongoing vulnerability and penetration testing audits across summit systems.\nThe umbrella system has multiple cyber security experts, teams of private players and groups of analysts. Officials indicated India’s experience hosting the G20 Summit, during which agencies neutralised more than 1.6 million cyberattack attempts without a breach. That infrastructure and operational playbook have now been expanded to safeguard the AI summit.\nLatest Blogs",
        "link": "https://www.news18.com/india/ai-summit-cyber-threat-triggers-nationwide-alert-as-india-activates-g20-grade-shield-ws-l-9908402.html",
        "date": "Tue, 17 Feb 2026 09:01:26 +0530",
        "fetched_at": "2026-02-19 04:02:15.528676"
    },
    {
        "title": "Emmanuel Macron's India Visit Updates: PM Modi, Macron Inaugurate India–France Innovation Forum",
        "content": "Macron India Visit, PM Modi Meeting, AI Summit Updates: French President Emmanuel Macron arrived in Mumbai on Monday night along with First Lady Brigitte Macron on a three-day official visit to India. The French President and the First Lady were received by Maharashtra Governor Acharya Devvrat and Chief Minister Devendra Fadnavis at the Mumbai airport.\nMacron met Prime Minister Narendra Modi at Lok Bhavan where he discussed artificial intelligence and strategic cooperation. A key focus was renewed push for bilateral defence cooperation, including joint manufacturing of helicopters and HAMMER precision-guided missiles.\nNotably, this visit marks Macron’s fourth visit to the country at the invitation of PM Modi, signaling sustained momentum in the India-France strategic partnership, with a particular focus on Artificial Intelligence (AI) cooperation and emerging technologies.\nPrime Minister Narendra Modi on Tuesday announced that 2026 will be celebrated as the India-France Year of Innovation, following discussions with French President Emmanuel Macron at the inauguration of the India–France Innovation Forum.\nPrime Minister Narendra Modi and French President  Emmanuel Macron inaugurate the India–France Innovation Forum.\nPresident Macron said, “In the past eight years, India and France have collaborated in several sectors, and we are happy turn this partnership into a special strategic partnership.”\nHe said that apart from defence, there are several other sectors where India and France can collaborate, such as the space program.\nPM Narendra Modi said, “India and France both believe in democratic values, the rule of law, and a multipolar world. We are unanimous that reform of global institutions will solve global challenges. We will continue to support all efforts for peace in every region, be it Ukraine, West Asia, or the Indo-Pacific. We share a common commitment to eradicate terrorism in all its forms and manifestations.”\nPrime Minister Narendra Modi said, “Today we are strengthening our cooperation in critical minerals, biotechnology, and advanced materials. We are launching the Indo-French Centre for AI in Health, the Indo-French Centre for Digital Science and Technology, and the National Centre of Alliance for Skilling in Aeronautics. These are not just institutes, they are future-building platforms. Friends, the world is facing a period of uncertainty. In this environment, the India-France partnership is a force for global stability. We are combining France’s expertise and India’s scale. We are developing trusted technologies. We will ensure human development through the International Solar Alliance, the India-Middle East-Europe Economic Corridor, and joint development projects, and will continue to strengthen efforts for stability and prosperity through multilateralism, dialogue, and diplomacy.”\nPrime Minister Narendra Modi said, “I am delighted to welcome my dear friend, President Macron, to Mumbai. Last year, he invited me to the AI ​​Action Committee Summit in France. At that time, we visited Marseille, France’s largest port and a major gateway to France and all of Europe. Marseille is the city from where our Indian soldiers set foot in Europe during World War I. Their saga of bravery is still remembered in many parts of Europe, and it is the same city where freedom fighter Veer Savarkar jumped into the sea to escape the British. His action symbolised his unwavering resolve for India’s independence. I had the opportunity to remember and pay my respects to him in Marseille last year. This time, when President Macron is in India for the AI ​​Impact Summit, we are fortunate to welcome him in Mumbai, the gateway to India.”\nIndia and France have also signed an agreement to promote mutual investment and avoid double taxation. PM Modi also announced the launch of the India–France Year of Innovation. He said innovation grows through collaboration and stronger people-to-people ties.\nThe goal, he added, is to transform the strategic partnership into a true “Partnership of the People,” paving the way for shared prosperity.\nIn a major announcement, PM Modi said India and France will jointly manufacture in India the world’s only helicopter capable of flying to the heights of Mount Everest.\nThe helicopter will be made in India and exported worldwide.\nPrime Minister Narendra Modi has said that India and France share a “very special relationship,” calling France one of India’s oldest and most trusted strategic partners. He said that both leaders have worked together to give the partnership “unprecedented depth and energy.”\nHe announced that India and France are now elevating their ties to a Special Global Strategic Partnership.\nWhile addressing a joint press conference With Macron, PM Modi said that 2026 is a landmark year in the evolution of India’s engagement with Europe. According to him, this year marks a decisive shift—from steady cooperation to transformative partnership.\nPrime Minister Narendra Modi and French President Emmanuel Macron virtually inaugurate the H125 Light Utility Helicopter Final Assembly of Tata Airbus at Vemagal, Karnataka.\nPrime Minister Narendra Modi addresses joint press conference with France’s Macron, says India-France ties are “special”.\n#WATCH | Prime Minister Narendra Modi holds delegation-level talks with French President Emmanuel Macron at the Lok Bhavan in Mumbai\n(Source: DD/ANI) pic.twitter.com/1zEltBFxRb\n— ANI (@ANI) February 17, 2026\nPrime Minister Narendra Modi on Tuesday held wide-ranging talks with French President Emmanuel Macron to boost ties in key sectors such as trade, defence, energy and critical technologies.\nAfter the talks with Modi, Macron will attend a ceremony to launch the India-France Year of Innovation.\nHis visit comes days after India cleared a long-pending proposal to procure 114 Rafale fighter jets under a government-to-government framework with France.\nIt has been billed as one of the world’s biggest military procurement programmes in recent years.\nThe leaders will also inaugurate the India-France Year of Innovation 2026 and address a gathering of business leaders, start-ups, researchers, and other innovators from both countries.\nThe meeting is aimed at reviewing the progress of the India-France strategic partnership and exploring avenues to deepen cooperation across key sectors. The meeting between Prime Minister Modi and President Macron is expected to further strengthen bilateral ties between India and France, with discussions likely to focus on strategic cooperation, trade, defence collaboration, and global issues of mutual interest.\nPrime Minister Narendra Modi on Tuesday said in a post on X it was a delight to meet his “friend”, French President Emmanuel Macron, in Mumbai. In a post on X, PM Modi said that Macron expressed his fondness for Mumbai and had also enjoyed a morning run earlier in the day.\nIt’s a delight to meet my friend, President Macron in Mumbai! He told me he really likes the city and also enjoyed his run earlier in the day! @EmmanuelMacron pic.twitter.com/edPKuLdn0f\n— Narendra Modi (@narendramodi) February 17, 2026\nPrime Minister Narendra Modi holds a bilateral meeting with French President Emmanuel Macron at the Lok Bhavan in Mumbai.\nAux côtés de légendes du cinéma indien. La culture nous rassemble. pic.twitter.com/rYDm1Ni9qz\n— Emmanuel Macron (@EmmanuelMacron) February 17, 2026\nAt the Taj Mahal Palace in Mumbai, we paid tribute to the victims of the 2008 attacks. To their families and loved ones, and to India: France stands with you. In the face of terrorism, unity and determination. pic.twitter.com/rcQ5fb93ZC\n— Emmanuel Macron (@EmmanuelMacron) February 17, 2026\nPrime Minister Narendra Modi meets French President Emmanuel Macron at Lok Bhavan in Mumbai.\n#WATCH | Prime Minister Narendra Modi meets French President Emmanuel Macron in Mumbai\n(Source: DD) pic.twitter.com/1eR61g3QUr\n— ANI (@ANI) February 17, 2026\nFrench President Emmanuel Macron arrived in Mumbai early on Tuesday and began his day by jogging at the iconic Marine Drive near the Coastal Road.\nHe and First Lady Brigitte Macron later also paid floral tributes to those killed in the November 2008 terror attack at the Taj Mahal Palace Hotel in south Mumbai.\nThe French president is scheduled to meet Prime Minister Narendra Modi at the Lok Bhavan in south Mumbai, where the two leaders will review the progress made in the India-France strategic partnership.\nFrench President Emmanuel Macron stepped out of his hotel, avoiding the media, and went for a run along Mumbai’s iconic Marine Drive, drawing attention from morning walkers and security personnel.\nOn French President Emmanuel Macron’s India visit, Shiv Sena (UBT) MP Sanjay Raut said it was good that Macron was visiting Mumbai with Prime Minister Narendra Modi and would be shown places including the Gateway of India. He said earlier foreign guests were usually taken to Ahmedabad. Raut criticised the Shinde-faction for putting up posters welcoming Macron, saying foreign guests are welcomed by the government, not political parties, and protocol should be followed.\nFrench President Emmanuel Macron left the Taj Mahal Palace under tight security on Tuesday. He arrived in Mumbai ahead of his meeting with Prime Minister Narendra Modi. The two leaders are set to review progress in the India–France strategic partnership.\nVIDEO | Mumbai: French President Emmanuel Macron leaves fromTaj Mahal Palace under tight security.\nFrench President Emmanuel Macron arrived in Mumbai on Tuesday, ahead of his meeting with Prime Minister Narendra Modi, where the two leaders will review the progress made in the… pic.twitter.com/7AjTfwtS4R\n— Press Trust of India (@PTI_News) February 17, 2026\nPrime Minister Narendra Modi and French President Emmanuel Macron are expected to discuss global economic uncertainty linked to tariff policies under US President Donald Trump, as well as China’s regional influence, according to reports. The Prime Minister’s Office said talks will focus on cementing the strategic partnership and diversifying it into new areas. Bilateral trade stands at about $18 billion annually, with strong defence and aerospace ties. French investment in India totals nearly $15 billion.\nIn a post ahead of his arrival in Mumbai, French President Emmanuel Macron said, business leaders and key economic, industrial, cultural and digital figures are travelling with him to deepen ties between the two nations. He added that both sides will go even further in cooperation and addressed Prime Minister Narendra Modi as “my dear friend”.\nEn route to India!\nThree days from Mumbai to New Delhi to take our strategic partnership even further.\nOn board with me: business leaders and the economic, industrial, cultural and digital players who give real, tangible life to the ties between India and France.… pic.twitter.com/k3Q9fSckWs\n— Emmanuel Macron (@EmmanuelMacron) February 16, 2026\nPrime Minister Narendra Modi and French President Emmanuel Macron will meet today in Mumbai for key discussions. The city marked their arrival with a grand welcome. The Bandra–Worli Sea Link has been specially illuminated, with decorative lighting installed to honour both leaders. The sea-facing stretch glowed through the evening, reflecting the importance of the high-level meeting taking place in Mumbai.\nPM Modi welcomed French President Emmanuel Macron in India.\nHe post on X reads, “Welcome to India! India looks forward to your visit and to advancing our bilateral ties to new heights. I am confident that our discussions will further strengthen cooperation across sectors and contribute to global progress. See you in Mumbai and later in Delhi, my dear friend Emmanuel Macron.”\nWelcome to India!\nIndia looks forward to your visit and to advancing our bilateral ties to new heights. I am confident that our discussions will further strengthen cooperation across sectors and contribute to global progress.\nSee you in Mumbai and later in Delhi, my dear friend… https://t.co/5gDTDt6llp\n— Narendra Modi (@narendramodi) February 17, 2026\nPrime Minister Narendra Modi and President Emmanuel Macron will on Tuesday also inaugurate India’s first helicopter final assembly line through a videoconference from Mumbai. The facility, a joint venture between Tata Group and Airbus, is located in Vemagal in Karnataka near Bengaluru. It will manufacture the Airbus H125, the company’s best-selling single-engine helicopter. Macron’s office said the visit aims to strengthen cooperation with India and diversify France’s economic and trade partnerships.\nFrance is seeking to deepen its defence partnership with India as President Emmanuel Macron begins a three-day visit to New Delhi, reports France 24. Talks are expected to include cooperation in artificial intelligence and a possible multibillion-dollar deal for 114 additional Dassault Rafale fighter jets. The visit comes after India confirmed plans to place a major Rafale order and follows the signing of a landmark free trade agreement between India and the European Union in January.\nOn Tuesday afternoon, French President Emmanuel Macron and PM Modi will hold bilateral engagements at Lok Bhavan in South Mumbai.\nLater, they will inaugurate the India-France Year of Innovation 2026 and address a gathering of business leaders, start-ups, researchers and other innovators from both countries.\nPresident Macron is on an official visit to India from February 17 to 19 at the invitation of PM Modi to participate in the AI Impact Summit hosted by India, as well as hold a bilateral summit with the latter in Mumbai.\nTaking to X, External Affairs Ministry Spokesperson Randhir Jaiswal wrote, “Towards a stronger India-France strategic partnership! Warm welcome to President Emmanuel Macron of the French Republic. He was warmly received by the Governor of Maharashtra and Gujarat, Acharya Devvrat, at the Mumbai airport.”\n“During the visit, PM Narendra Modi will hold bilateral meeting with President Emmanuel Macron. Both leaders will launch Year of Innovation 2026. The visit will impart further momentum to the vibrant India-France strategic partnership,” he added.\nVers un partenariat stratégique renforcé entre l’Inde et la France\nChaleureuse bienvenue au Président @EmmanuelMacron de la République française. Il a été chaleureusement accueilli par le gouverneur du Maharashtra et du Gujarat, Shri Acharya Devvrat @adevvrat à l’aéroport de… pic.twitter.com/1A4e3BsmEv\n— Randhir Jaiswal (@MEAIndia) February 16, 2026\nFrench President Emmanuel Macron and First Lady Brigitte Macron arrived in Maharashtra’s Mumbai on Tuesday for their scheduled three-day to India until February 19.\nLatest Blogs",
        "link": "https://www.news18.com/india/emmanuel-macron-india-visit-live-updates-meet-with-pm-modi-in-mumbai-artificial-intelligence-defence-boost-on-agenda-liveblog-9908398.html",
        "date": "Wed, 18 Feb 2026 00:02:05 +0530",
        "fetched_at": "2026-02-19 04:02:16.435924"
    },
    {
        "title": "'Submit 2-Page Note, Cite Apps For Department Use': Ministry Officials Asked To Attend AI Summit | Exclusive",
        "content": "The cabinet secretariat has asked officials from across ministries to attend the ongoing India AI Impact Summit 2026 and follow this up by submitting brief notes on their experience and observations, which will then be compiled by the respective secretaries.\nThe office memorandum was issued on Monday, directing all officers at and above the level of deputy secretary in ministries and departments to visit the summit that was inaugurated by Prime Minister Narendra Modi at New Delhi’s Bharat Mandapam.\nAccording to the memorandum, officers are required to observe artificial intelligence-based innovations, use cases showcased at the event, and identify applications relevant to their ministries, departments, and organisations. Each officer must submit a brief note, not exceeding two pages, highlighting significant ideas and potential departmental use cases, it stated.\nThe memorandum stated that secretaries of the ministries and departments will compile these submissions and forward a consolidated report to the cabinet secretariat by February 27, a week after the summit ends on February 20. It stressed on strict adherence to these instructions.\nWith this landmark summit, the Centre is pitching AI as a key enabler of India’s development journey, strengthening governance and transforming public service delivery in alignment with the vision of ‘Viksit Bharat 2047’. It also aligns with India’s commitment to responsible and inclusive AI.\n“The summit, the first global AI gathering to be hosted in the Global South, has witnessed unprecedented participation with over 20 heads of state, 60 ministers, and 500 global AI leaders. Bringing together policymakers, technology companies, innovators, academia, and industry leaders, the summit seeks to translate global AI deliberations into actionable development outcomes under the IndiaAI Mission and the Digital India initiative,\" stated an official government release.\nOn February 19, Modi is scheduled to deliver the inaugural address setting the tone for enhanced global cooperation and advancing India’s vision for inclusive, trusted, and development-oriented AI.\nLatest Blogs",
        "link": "https://www.news18.com/india/submit-2-page-note-cite-apps-for-department-use-ministry-officials-asked-to-attend-ai-summit-ws-l-9908337.html",
        "date": "Tue, 17 Feb 2026 09:02:03 +0530",
        "fetched_at": "2026-02-19 04:02:17.172941"
    },
    {
        "title": "'Shaping Solutions For The World': PM Modi, Experts Hail India As Global AI Leader At Landmark Summit",
        "content": "India was hailed as a global leader in artificial intelligence at the ‘India AI Impact Summit 2026’, which was inaugurated by Prime Minister Narendra Modi on Monday.\nThe landmark summit, which will end on February 20, signals India’s commitment to shaping AI solutions for the global stage.\nAfter the inauguration at New Delhi’s Bharat Mandapam, Modi shared moments from the event on his social media and said being amongst researchers and tech enthusiasts provided a “glimpse of the extraordinary potential of AI, Indian talent and innovation\". He said India’s efforts will “shape solutions not just for India but for the world\" as the nation advances its vision of Viksit Bharat.\n“Inaugurated the India AI Impact Expo 2026 at Bharat Mandapam. Being here among innovators, researchers and tech enthusiasts gives a glimpse of the extraordinary potential of AI, Indian talent and innovation. Together, we will shape solutions not just for India but for the world!\"\nInaugurated the India AI Impact Expo 2026 at Bharat Mandapam. Being here among innovators, researchers and tech enthusiasts gives a glimpse of the extraordinary potential of AI, Indian talent and innovation. Together, we will shape solutions not just for India but for the… pic.twitter.com/G370iXYAXm— Narendra Modi (@narendramodi) February 16, 2026\nThe India AI Impact Summit garnered widespread praise from international experts, who view India as a global leader dedicated to using AI as a transformative force for public good and economic development.\nGabriela Ramos, former UNESCO assistant director general, lauded the summit’s focus on tangible results. She said while technology is evolving daily, the real question lies in its impact on sectors like education and healthcare.\n“I feel that the AI Impact Summit is putting the emphasis on the impact. I’m very glad because we have been focusing too much on the technologies, which is great, because these technologies have capacities that are evolving by the day, either generative or agentic. Each time they do more cognitive tasks that were just reserved for humans. But this time we’re looking at the impacts.  And that’s what we need to do,\" Ramos said.\n#WATCH | Delhi: India AI Impact Summit 2026 | Gabriela Ramos, Former UNESCO Assistant Director General, says, \"I feel that as the AI Impact Summit is putting the emphasis on the impact. I'm very glad because we have been focusing too much on the technologies, which is great,… pic.twitter.com/IX0cz11ssQ— ANI (@ANI) February 16, 2026\nPraising the shift towards a human-based approach, she added: “If we apply these technologies for school, are the students learning? If we apply it for health, are the patients recovering better? I feel that this is the real question that we are now to answer here. It’s not about how we develop these technologies in a more human-based approach, but also how we deploy it and how we use it to solve our problems…\"\nOther experts stressed that AI must be “safe by default\". Cynthia McCaffrey, UNICEF India representative, said while it offers a “tremendous opportunity\" to expand horizons for children and educators, protections and guardrails must be built in from the design phase rather than as an afterthought.\n“The way that UNICEF is looking at AI, and I believe the Government of India is seeing this as well, is that AI is a tremendous opportunity to expand horizons, to open opportunities about how children can learn the type of knowledge that teachers and parents and others can have access to. At the same time, to also look at how you have to build in the protections from the beginning,\" McCaffrey said.\n#WATCH | Delhi: | India AI Impact Summit 2026: Cynthia McCaffrey, UNICEF India Representative says, \"The way that UNICEF is looking at AI, and I believe the Government of India is seeing this as well, is that AI is a tremendous opportunity to expand horizons, to open… pic.twitter.com/Bej7KmpimO— ANI (@ANI) February 16, 2026\nShe said this sentiment aligns with India’s broader strategy of ensuring AI improves the quality of life while remaining anchored in ethical principles.\n“It’s important to identify those guardrails and those regulations that governments can put in place that industry can think about as they design AI because the opportunities are huge but you have to think about the protections at the beginning… One of the things that  UNICEF is saying and advocating for with many others is that AI should be safe by default, shouldn’t be an afterthought…\" she added.\nAccording to an official release, the India AI Impact Summit 2026 is defined by several key developments that position the country at the centre of the global technological discourse.\nHere’s all you need to know:\nWith an AI market projected to surpass $17 billion by 2027, India is using this summit to declare its intent to bridge the gap between innovation and global impact. As the event continues, the focus will firmly remain on harnessing AI to solve human challenges across both rural and urban landscapes.\n(With agency inputs)\nLatest Blogs",
        "link": "https://www.news18.com/india/india-ai-impact-summit-modi-experts-hail-india-global-leader-ai-solutionss-for-world-ws-l-9908127.html",
        "date": "Mon, 16 Feb 2026 22:47:59 +0530",
        "fetched_at": "2026-02-19 04:02:17.817137"
    },
    {
        "title": "'AI For All' Vision: Akash Ambani Showcases Jio Pavilion To PM Modi At India AI Impact Summit",
        "content": "Prime Minister Narendra Modi on Monday visited the Jio pavilion at the India AI Impact Summit, where Reliance Jio Infocomm Ltd chairman Akash Ambani showcased the company’s AI ecosystem and next-generation solutions.\nModi reviewed applications spanning intelligence, healthcare, education, culture, and smart homes powered by AI models and solutions, at the Jio Intelligence Pavilion.\nWatch the video here:\nDuring the visit, he saw the live demonstrations of Jio AI Stack, Jio Sanskriti AI, Jio Arogya AI, Jio Shiksha, and Jio AI Home. These platforms are designed to drive enterprise intelligence, promote Indian languages and cultural content, enhance healthcare delivery, strengthen education systems, and enable AI-powered smart living. Akash Ambani briefed him on Jio’s comprehensive AI ecosystem and its role in accelerating digital transformation across sectors.\nReiterating Jio’s vision of “AI for All\", the company highlighted its commitment to making advanced technologies accessible and inclusive at scale. Reliance Industries chairman Mukesh Ambani has previously stressed that the true value of technology lies in its ability to benefit people widely and equitably.\nThe India AI Impact Summit has brought together leading technology firms, innovators, and policymakers from India and around the world to explore the future of artificial intelligence. The Prime Minister’s visit to the Jio Pavilion underscored the growing role of India’s private sector in shaping the country’s AI landscape.\nLatest Blogs",
        "link": "https://www.news18.com/india/ai-india-summit-akash-ambani-reliance-jio-modi-ai-for-all-vision-ws-l-9908060.html",
        "date": "Mon, 16 Feb 2026 21:03:19 +0530",
        "fetched_at": "2026-02-19 04:02:18.515086"
    },
    {
        "title": "ED Slaps Rs 184 Crore Fine On NewsClick, Editor Prabir Purkayastha Over Foreign Funding Violations",
        "content": "The Enforcement Directorate has imposed a Rs 184 crore fine against news portal NewsClick, and its editor-in-chief, Prabir Purkayastha, under the Foreign Exchange Management Act (FEMA), news agency PTI reported, citing official sources.\nAs per the order, PPK NewsClick Studio Private Limited, the company that owns the portal, has been fined Rs 120 crore, while Purkayastha has been issued a separate penalty of Rs 64 crore for alleged violations.\nThe entities have been found “contravening\" FEMA provisions on two counts — alleged misrepresentation of foreign direct investment (FDI) funds and misdeclaration of services and exports, sources told the news agency.\nA response from NewsClick on the development is awaited.\nThe ED had first conducted searches at the portal’s premises in the Saidulajab area of the national capital in September 2021 in connection with a money laundering probe. The agency has since recorded statements of more than 25 individuals, including Purkayastha.\nIn 2023, the BJP cited a report by The New York Times to allege wrongdoing by the portal and its promoters. The report had claimed that NewsClick was part of a global network that received funding from American billionaire Neville Roy Singham, who allegedly has links with Chinese government media entities.\nFounded in 2009, NewsClick describes itself on its website as an independent media organisation focusing on news coverage from India and abroad, particularly progressive movements.\n(With inputs from agencies)\nLatest Blogs",
        "link": "https://www.news18.com/india/ed-slaps-rs-184-crore-fine-on-newsclick-editor-prabir-purkayastha-over-foreign-funding-violations-ws-l-9907948.html",
        "date": "Mon, 16 Feb 2026 20:37:55 +0530",
        "fetched_at": "2026-02-19 04:02:19.254003"
    },
    {
        "title": "Centre To Soon Launch 'Create In India' Mission To Boost Jobs: Ashwini Vaishnaw At AI Summit",
        "content": "Minister for Electronics and Information Technology Ashwini Vaishnaw on Monday announced the plan to launch ‘Create in India’ mission, with aim to enhancing industry, creating jobs, and preparing a future-ready talent pipeline.\nSpeaking during a fireside chat with Charles Rivkin, chairman of the Motion Picture Association (MPA), at an official satellite event of the AI Impact Summit 2026, Vaishnaw said: “Very soon, the govt will launch ‘Create in India’ mission, which will be an industry, employment and future-oriented mission. It will look at strengthening what we have, making sure we become the most preferred platform for the world and create a future-ready talent pipeline which keeps that growth that we need to have for the next 25 years.\"\n#WATCH | Delhi | At India AI Impact Summit, Union Railway Minister Ashwini Vaishnaw says, “Very soon, the govt will launch ‘Create in India’ mission, which will be an industry, employment and future-oriented mission. It will look at strengthening what we have, making sure we… pic.twitter.com/IvqsBXButI— ANI (@ANI) February 16, 2026\n“There should not be a diluting effect, but a complementing effect of AI into our lives. Many of the developed countries are looking at it as the benchmark,\" he added.\nOn how the government can work with industry to provide guardrails fight deepfakes and disinformation, the Union Minister said, “Deep fakes and disinformation are attacking the foundation of our society and the root of trust between institutions created by society. AI models, creators will have to take responsibility for making sure that the new technology is strengthening the trust rather than belittling it…\"\nThe minister also addressed the ongoing fears of AI replacing human roles. Pointing out the impact of AI on jobs and its adoption in India, he said: “The talent pipeline which is getting created in India is high. Natural growth is happening, and we are promoting this.\"\n“In the next few days of the AI summit, we are looking at the impact of AI on human society. There are positive impacts of AI, including weather forecasting, climate change, agriculture, the discovery of new materials, and productivity gains. There are potential negative impacts. We are looking at how to balance these impacts so we can capture the benefits while containing the harms. We will come out with a good outcome from this summit,\" he said.\nVaishnaw reiterated the announcement made in the Budget 2026 around content creator labs and said: “In the Budget 2026, we announced the content creator labs in 15000 schools. Throughout the country, we are opening these labs with the help of the industry. We have the world’s best students in 350 universities in the semiconductors sector; similarly, we will have more students in AI.\"\nLatest Blogs",
        "link": "https://www.news18.com/tech/centre-to-soon-launch-create-in-india-mission-to-boost-jobs-ashwini-vaishnaw-at-ai-summit-ws-l-9908035.html",
        "date": "Mon, 16 Feb 2026 20:28:39 +0530",
        "fetched_at": "2026-02-19 04:02:19.906187"
    },
    {
        "title": "Drunk Man Snoozes On Mumbai Railway Tracks As Train Approaches, Case Filed | Video",
        "content": "A man, who appeared to be intoxicated, was caught sleeping on railway tracks at Chhatrapati Shivaji Maharaj Terminus (CSMT) in Mumbai on Monday afternoon, briefly disrupting Harbour Line train services.\nThe incident took place around 3.30 pm just as a train was pulling into the Harbour Line track. Avinash Prakash Kardile (19), who collects trash on the tracks, suddenly lay down and covered himself with a white cloth, apparently expecting the train to run him over, an official said.\nCommuters shouted and waved to alert him as the train slowed and honked repeatedly. The man remained unfazed and continued sleeping. A video of the incident has gone viral on social media.\nA drunk man was found sleeping right on the tracks at CSMT, bringing Harbour Line local train services to a halt. pic.twitter.com/0k3sgcMIYY— Truth On Track (@truth_on_track) February 16, 2026\nOfficers from the Government Railway Police (GRP) and Railway Protection Force (RPF) quickly rushed in and lifted him off the tracks, allowing train services to resume safely.\nMeanwhile, authorities later vacated the man from the tracks, and normal train operations resumed. A case has been registered against him under Section 147 (trespass) and other relevant provisions of the Indian Railway Act.\n(With inputs from agencies)\nLatest Blogs",
        "link": "https://www.news18.com/viral/drunk-man-snoozes-on-mumbai-railway-tracks-as-train-approaches-case-filed-video-ws-l-9907965.html",
        "date": "Mon, 16 Feb 2026 20:17:17 +0530",
        "fetched_at": "2026-02-19 04:02:20.771868"
    }
]