[
    {
        "title": "Ahead of State budget, resident welfare associations demand focus on civic infrastructure",
        "content": "Stressing that durable, basic civic infrastructure be given priority, resident welfare associations urged the authorities to ensure sustainable development.\n| Photo Credit: Special Arrangement\nWith the Tamil Nadu and the Greater Chennai Corporation (GCC) Budget announcements fast approaching, some Resident Welfare Associations (RWAs) have put forth a charter of expectations, urging the authorities to focus on long-pending basic infrastructure works.\nHarsha Koda of the Federation of OMR Resident Associations (FOMRRA) alleged that residents of Old Mahabalipuram Road (OMR) had been waiting for more than 15 years for basic civic amenities such as piped water supply and underground sewage connections. He said many roads also lack proper stormwater drains (SWD), citing the Model School Road in Sholinganallur, where nearly 7,000 apartments lack a functional SWD system, resulting in frequent flooding during the monsoon.\nAcross the OMR stretch, which has an estimated one lakh apartments, stormwater drains have been laid only in a few smaller lanes and remain largely unconnected, making them incapable of handling heavy or continuous rainfall, he said. Mr. Koda further said that despite repeated budgetary allocations for stormwater and drainage projects by the Tamil Nadu government and the GCC since 2016, implementation has been inadequate.\nHe added that Sholinganallur, a key part of Chennai’s IT corridor and a major contributor through property and sales taxes, has not received commensurate infrastructure investment to address these long-pending issues.\nThe Alliance of Resident Welfare Associations has called on the GCC to allocate funds in the interim Budget for a technical audit and rectification of stormwater drains, restoration of roads, and completion of pending infrastructure works.\nThe association also sought transparency in contracts and expenditure, adherence to quality standards in water management, and the setting up of a swift grievance redress mechanism to reduce flood risk.\nStressing that durable, basic civic infrastructure must take precedence over “cosmetic, temporary measures and freebies”, it urged the authorities to ensure sustainable development and to revisit the proposal to expand waste-to-energy capacity at the Kodungaiyur dumpyard.\nGomathinayagam, president of the Neelangarai Residents’ Welfare Association, said that though the overhead tank under the Nemmeli Desalination Plant project was inaugurated by Chief Minister M.K Stalin about 10 days ago, water supply to households is yet to commence.\nResidents have also expressed concern over the lack of clarity on connection charges, with some stating that the cost could be as high as ₹80,000. Installation of water meters is still awaited, he added.\nFurther, he flagged delays in the widening of the 8.8 km to 10.5 km stretch from Thiruvanmiyur to Akkarai into six lanes, which is over 50% complete but remains stalled due to land acquisition issues. Also, three proposed iron-girder bridges linking ECR and OMR have not yet been taken up, he said.\nT.R. Subhash, general secretary of the Sarathy Nagar Residents’ Welfare Association, said a six-vent culvert located behind a saree retail hall in Velachery carries floodwater from Sarathy Nagar, Tansi Nagar, Bhuvaneswari Nagar, VGP Nagar, and Selva Nagar.\nHowever, the culvert has no proper outlet to the Pallikaranai marshland, leading to recurrent water stagnation. Though funds are reportedly allocated every year, the work has not been executed so far, he said. He added that the area has witnessed a reduction in bus services over the years, underscoring the need for a dedicated bus terminus. Direct connectivity to Kilambakkam or Koyambedu would benefit a large number of residents, he said, pointing out that many currently spend around ₹600 on cab fares to reach Kilambakkam.\nKathiravan Duraisamy of Maduravoyal said RWAs across the constituency have urged the authorities to prioritise completion of long-pending civic works over announcing new projects.\nResidents seek regulation of heavy vehicle movement through residential areas, maintenance of existing parks, walking tracks, and senior citizen-friendly amenities. They have flagged basic infrastructure gaps in Nolambur, Vanagaram, Alapakkam and surrounding areas that continue to affect daily life, including damaged interior roads, persistent waterlogging during rain, inadequate stormwater drainage, irregular water supply, and poor waste management.\n“The residents called for expediting completion of stormwater drain networks in interior roads and regular desilting of canals before the monsoon, as incomplete or poorly connected systems often aggravate flooding,” he added.\nHe said citizens also sought expansion of Metro water supply and underground drainage to all streets, and the setting up of localised waste composting units.\nChennai\n/\nChennai Corporation\n/\nIndia",
        "link": "https://www.thehindu.com/news/cities/chennai/ahead-of-state-budget-resident-welfare-associations-demand-focus-on-civic-infrastructure/article70632903.ece",
        "date": "Sun, 15 Feb 2026 08:05:12 +0530",
        "fetched_at": "2026-02-15 03:26:19.760110"
    },
    {
        "title": "Tamil Nadu Chief Minister Stalin inspects ongoing work on sports complex in Tirupattur",
        "content": "Along with Collector K. Sivasoundaravalli, and Minister for Public Works E.V. Velu, Chief Minister Stalin inspected the spacious sports complex area.\n| Photo Credit: Special Arrangement\nChief Minister M. K. Stalin on Saturday inspected the ongoing work for the ₹15 crore sports complex in Tirupattur.\nAlong with Collector K. Sivasoundaravalli, and Minister for Public Works E.V. Velu, Mr. Stalin inspected the  sports complex area. “The new facility will encourage youngsters in diverse sports activities in the district to compete at the State and national level competitions. The new facility will be ready in 2026,” R. Jayakumari, District Sports Officer (Tirupattur), told The Hindu.\nOfficials of the Public Works Department (PWD), which executes the work, said that until now, sports activities at the district level were conducted in colleges that have playgrounds.  Most of the playgrounds do not have modern facilities, training areas, civic amenities for sportspersons and visitors. “The new sports complex will help young sportspersons to train themselves throughout the year,” said B. Santhosh, a student.\nSpread over 10 acres, the new sports complex, which will be maintained by the Sports Development Authority of Tamil Nadu (SDAT) will be built on the temple land of HRCE. The new complex will have a spectator’s gallery with a seating capacity of over 3,500 to watch football games and athletic events.\nThe new sports facility will have eight separate tracks for 400 metres athletics training, two courts each for basketball, volleyball, table tennis, badminton, tennis, kabaddi, football. Javelin throw can also be practiced at the facility.\nAmong civic amenities, the new facility will have an administrative block, separate accommodation and changing rooms for sportspersons, washrooms, water taps, CCTV cameras, and a modern gym. Parking facilities for two-wheelers, cars, and buses will be provided. Rainwater harvesting system and storm water drains will be built.\nUnlike other district sports complexes, the new facility in Tirupattur will have an open-air theatre where award ceremonies, video presentations by coaches, and other events can be done. Around 200 persons can be accommodated in the theatre. Landscaping will be done and a hockey stadium will also be built.\nTamil Nadu\n/\nIndia",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/chief-minister-stalin-inspects-ongoing-work-on-sports-complex-in-tirupattur/article70632055.ece",
        "date": "Sun, 15 Feb 2026 08:11:19 +0530",
        "fetched_at": "2026-02-15 03:26:20.368220"
    },
    {
        "title": "What has government laid down on AI labelling? | Explained",
        "content": "The Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Amendment Rules, 2026 require social media platforms to “prominently” label “synthetically generated” content, or AI-generated images and videos. Image used for representation only.\n| Photo Credit: Reuters\nThe story so far: The Ministry of Electronics and Information Technology (MeitY) earlier this week notified an amendment to the IT Rules, 2021, that would require users and social media platforms to label AI-generated content, and tighten the takedown timelines for all content — not just AI-generated posts — from 24-36 hours to two to three hours. The rules come into effect on February 20.\nThe Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Amendment Rules, 2026 require social media platforms to “prominently” label “synthetically generated” content, or AI-generated images and videos. The requirement was first proposed in October last year, and was notified this week. Social media platforms with more than five million users are required to obtain a “user declaration [for AI-generated content] and [conduct] technical verification before publishing [AI-generated content]”.\nMeitY said in an explanatory document that this requirement was introduced to counter “deepfakes, misinformation, and other unlawful content capable of misleading users, causing users harm, violating privacy, or threatening national integrity,” and that it was important that users be aware whether what they are viewing is inauthentic.\nThe October draft definition of “Synthetically Generated Information” (SGI) was wider, encompassing any audiovisual content that was AI-modified or generated. The final rules carve out some exemptions: for instance, smartphone-clicked photos that are retouched automatically by the camera app will not be considered SGI, and special effects in films will not be considered something that needs to be labelled. The rules also prohibit certain types of SGI: child sexual exploitation and abuse material, forged documents, information on developing explosives, and deepfakes falsely representing a real person.\nThe government has asked large platforms to “deploy reasonable and appropriate technical measures to prevent unlawful SGI, and to ensure labelling/provenance/identifier requirements for permissible SGI”. A senior official at the IT Ministry argued that large platforms have sophisticated tools to detect SGI, and that this requirement merely requires them to perform detection that they are already doing. Additionally, some AI firms and platforms have participated in the Coalition for Content Provenance and Authenticity (C2PA), which offers technical standards to invisibly label AI-generated content in a way that can be read by other platforms, in case AI-based detection fails. The rules allude to this effort by requiring “provenance/identifier requirements,” but the official said they don’t want to endorse any single effort, but would like to formalise the aims of such collaborations.\nThe IT Rules enable some government authorities and police officials to issue takedown notices under Rule 3(1)(b), and users to send in grievances for “illegal” categories of content enumerated in the IT Rules. Those categories include misinformation, nudity, and threats to sovereignty. For both government- and court-issued takedown notices, the timelines have been reduced to 2-3 hours, while for all other categories of user complaints (like defamation and misinformation), the response timelines have been reduced from two weeks to one week. The timelines for responding to user reports (under Rule 3(2)(b)) on “sensitive” content has also been slashed from 72 hours to 36 hours. The government reasoned that the previous limits allowed a lot of damage to be done even within those timelines, necessitating a revisit of the time platforms have to act.\nEDITORIAL | Too fake to be good: On AI-generated imagery, labelling\nUsers will now have to receive a reminder of platforms’ terms and conditions more often. “The amendments include revisions to Rule 3(1)(c) of the Intermediary Rules, increasing the frequency of user notifications from once every year to at least once every 3 (three) months, and expanding the content of such notifications to clarify potential consequences of non-compliance and reporting obligations,” JSA Advocates and Solicitors said in an analysis.\nThe rules also require platforms to specifically warn users that harmful deepfakes and other illegal AI-generated content could expose them to legal action, including the disclosure of their identity to law enforcement agencies and “immediate disabling of access or removal of such content, suspension or termination of user accounts”, JSA said in its analysis.\nlaws\n/\nArtificial Intelligence\n/\ntechnology (general)\n/\ninternet\n/\nThe Hindu Explains",
        "link": "https://www.thehindu.com/sci-tech/technology/what-has-government-laid-down-on-ai-labelling-explained/article70633146.ece",
        "date": "Sun, 15 Feb 2026 08:16:00 +0530",
        "fetched_at": "2026-02-15 03:26:20.999334"
    },
    {
        "title": "Union, W.B. Education Ministers spar over NEP, funds",
        "content": "Union Education Minister Dharmendra Pradhan addressing a teachers’ conference in Kolkata on Saturday.\n| Photo Credit: ANI\nCriticising the Mamata Banerjee government on several fronts relating to education, Union Education Minister Dharmendra Pradhan on Saturday said that West Bengal lost Central funds worth ₹10,000 crore by not implementing the National Education Policy (NEP) in the State.\n“Despite repeated requests, the NEP was not implemented in West Bengal by the State government. The policy talks about education in the mother tongue, and in West Bengal, that would have been Bengali. The State government does not want to allow education in Bengali,” Mr. Pradhan said while addressing a teachers’ conference organised by the Bengal unit of the Bharatiya Janata Party (BJP) in Kolkata on Saturday.\nThe Union Minister said that had the NEP been implemented, additional funds would have been given to the State under the Samagra Shiksha Mission. Mr. Pradhan also accused the Mamata Banerjee government of siphoning off funds from the midday meal scheme.\nMr. Pradhan cited various statistics to argue that the education system in West Bengal had deteriorated during the Trinamool Congress regime in the state. The Minister said that West Bengal accounted for nearly 50 % of the total schools in the country that do not have a single teacher. “The maximum number of teacher-less schools in the country is in West Bengal. The figure is around 4,000, which is almost 50 % of the national figure,” he said.\nThe BJP leader said that internet penetration in state-run schools is just 16 % in West Bengal, compared to the national average of 70 %.\nState Education Minister Bratya Basu refuted the charges made by the Union Minister and said that the State Education Policy (SEP) was adopted in 2023, where all acceptable aspects of the NEP have been incorporated.\n“Policies that protect the interests of West Bengal and those already practised in the State have also been included. The State Education Policy is more advanced. Education being on the concurrent list, the Bengal government is empowered to follow its own policy,” the State Education Minister said.\nOn the charge of the Union Minister that the State has the highest number of teacher-less schools in the country, Mr. Basu claimed that there are inconsistencies in this information for various reasons.\n“The education portal includes several private aided schools whose teacher count became zero and were consequently shut down. However, due to their UDISE numbers, they are still shown as government schools on the portal. These have been identified, and a corrected portal will be published shortly,” the West Bengal Education Minister said.\nOn low penetration of internet, Mr. Basu said that all government upper primary, secondary and Higher Secondary schools in the state were provided internet facilities long ago.\nThe State Education Minister also refuted charges of siphoning out of mid day meal funds and said that the claims were “baseless and unfounded allegation”. “If any such complaint is found anywhere, anyone can file an FIR regarding the matter, none of which has come to the knowledge of the Government,” Mr. Basu.",
        "link": "https://www.thehindu.com/news/national/west-bengal/union-wb-education-ministers-spar-over-nep-funds/article70632896.ece",
        "date": "Sun, 15 Feb 2026 01:13:50 +0530",
        "fetched_at": "2026-02-15 03:26:21.606306"
    },
    {
        "title": "State level wrestling tournament begins in Bihar",
        "content": "A two-day state-level wrestling event titled “Maati Ka Bal - Dangal” commenced on Saturday (February 14, 2026) at Jamui’s Sri Krishna Singh Memorial Stadium in which nearly 200 wrestlers participated.\nDeputy Chief Minister Samrat Choudhary inaugurated the event in the presence of Sports Minister Shreyasi Singh and Vishal Singh, President of Wrestling Association of Bihar.\nThe tournament which has been jointly organised by Bihar State Sports Authority (BSSA) and Wrestling Association of Bihar has five men’s weight categories of 50 to 60 kg, 60 to 70 kg, 70 to 80 kg, 80 to 90 kg and 90 kg and above and two women’s categories of 50 to 60 kg and 60 kg and above. It is second edition of the tournament after being organised last year.\nMr. Choudhary in his address said, “I feel very happy and proud to witness this historic wrestling event on the land of Jamui.”\nHe further said, “The Mati Ka Bal: Dangal, being organised in Jamui for the first time, is a platform for social and cultural unity. This competition, which brings to life Bihar’s traditional wrestling, is a confluence of Bihar’s tradition, bravery, and culture.”\nMr. Choudhary asserted that infrastructure for the development of sports is being rapidly constructed throughout Bihar so that more international-level athletes can be produced in Bihar.\n“It is our resolve to promote prosperity in Bihar through a spirit of sportsmanship, and the Central and State governments are jointly making every possible effort and support to achieve this,”Mr. Choudhary said.\nA total of 188 wrestlers, 162 men and 26 women are participating in the tournament. Crafted in 1954, the mace has become a symbol of excellence in the sport since it was presented to wrestler Vishwanath Singh in 1975 on being conferred with the ‘Bihar Kesari’ title.\nMs. Singh, who is also the local MLA while greeting the people and thanking the organizers, said, “I was very excited when I heard about the Dangal competition being held in Jamui because the soil of Jamui is full of sporting talent. The athletes here are excelling in every sport.”\nShe further said, “Bihar is also establishing its own identity internationally in the field of sports. The government is committed to the all-round development of sports, and we are continuously providing every possible support and effort to achieve this.”\nCommonwealth Games gold medalist shooter Ms. Singh asserted that the dream and goal is to ensure the participation of as many players from Bihar as possible in the Olympics in the future.\n“As an athlete and sports minister, I assure you all that no effort will be spared to help Bihar reach new heights in the field of sports,”Ms. Singh said.\nMr. Singh, also greeted everyone present at the opening ceremony. Till the filing of the report, the details of first day matches was not shared by the BSSA.\nBihar\n/\nIndia\n/\nwrestling",
        "link": "https://www.thehindu.com/news/national/bihar/state-level-wrestling-tournament-begins-in-bihar/article70632665.ece",
        "date": "Sun, 15 Feb 2026 01:11:45 +0530",
        "fetched_at": "2026-02-15 03:26:22.244891"
    },
    {
        "title": "Karnataka govt. can give ‘water guarantee’ if Centre gives requisite permissions: DKS",
        "content": "Deputy Chief Minister D.K. Shivakumar and others during the inauguration of the State government's 1,000-day celebration and a programme to distribute title deeds to 1 lakh beneficiaries in Haveri on Saturday.\n| Photo Credit: PTI\nDeputy Chief Minister D.K. Shivakumar on Saturday said that if the Union government accords requisite permissions for major irrigation projects of Karnataka — Upper Krishna, Mekedatu , Mahadayi and Yettinahole — the Congress government would be able to provide “water guarantee” as the “seventh guarantee.”\nAddressing a rally in Haveri to distribute title deeds to beneficiaries, described as the “sixth guarantee”, which coincided with the Congress government completing 1,000 days in office, Mr. Shivakumar said that the government had decided to give compensation to the tune of ₹35 lakh to ₹40 lakh to farmers who part with their land for the Upper Krishna Project.\n“Owing to effective arguments in the Supreme Court, we have received a favourable order towards the balancing reservoir on Cauvery at Mekedatu. We are readying DPR for the project. On Mahadayi, the Forest Department has not given the necessary permissions,” he said. Speaking on the Yettinahold project, he said that if the permission is given within three months, then the State government would be able to complete the work of supplying drinking water to Chickballapur and Kolar.\nA host of Ministers including Krishna Byre Gowda, Shivanand Patil, H.K. Patil, Satish Jarkiholi, K.H. Muniyappa, G. Parameshwara and over 20 legislators took part in the convention at Haveri.",
        "link": "https://www.thehindu.com/news/national/karnataka/karnataka-govt-can-give-water-guarantee-if-centre-gives-requisite-permissions-dks/article70632527.ece",
        "date": "Sun, 15 Feb 2026 00:35:02 +0530",
        "fetched_at": "2026-02-15 03:26:22.863140"
    },
    {
        "title": "ISRO could relaunch PSLV by June or July: Jitendra Singh",
        "content": "Union Minister of State for Science and Technology Jitendra Singh interacting with M. Ravichandran, Secretary, Ministry of Earth Sciences, at the conclave held in Chennai on Saturday.\n| Photo Credit: R. Ravindran\nThe Indian Space Research Organisation hasn’t lost its confidence due to the recent consecutive failures of the Polar Satellite Launch Vehicle (PSLV) and may resume launches from June or July, Union Minister of State for Science and Technology Jitendra Singh said on Saturday.\n“We are doing the pre-runs. If all goes according to our timeline, [the launch] may be by June or July,” he told reporters after inaugurating a two-day Research, Industry, Startup, and Entrepreneurship Conclave 2026 organised by the Centre for Scientific and Industrial Research (CSIR) in Chennai. Gaganyaan, ISRO’s first crewed space mission, was slated for 2027 and would proceed as scheduled, he said. The organisation was in the final stages of test flights with humanoid robot Vyommitra on board. This would possibly happen before the end of the year, he added.\n“We have 18 launches in 2026. Not a single launch has been cancelled. Out of that, we have six private parties and they have also not withdrawn,” Dr. Singh said.\nSpeaking about the conclave, Dr. Singh said the Centre had announced a ₹1-lakh crore research, development, and innovation fund to help accelerate entrepreneurs to technology readiness level (TRL) 4. Similarly, soon after moving into his new office, the Prime Minister had announced a ₹10,000-crore fund for supporting deep tech start-ups. The CSIR too had relaxed conditions for deep tech start-ups having to sustain themselves for three years before qualifying for government financial support.\nTamil Nadu, he noted, had two vibrant entrepreneurship ecosystems in Chennai and Coimbatore. He said the Centre would coordinate with the Tamil Nadu government and the private sector to provide a fillip to the start-up ecosystem.\nEarlier, at the inaugural function, Dr. Singh said the Ministry had stopped working in silos and had adopted a more integrated approach to work in tandem with the industry and academia.\nM. Ravichandran, Secretary, Ministry of Earth Sciences, said that there were ample opportunities for start-ups in climate change-related research, services, sustainability, and disaster mitigation. The government, he said, had a lot of data and could enable startups to bring fast delivery of various services. Giving examples, he said there were opportunities for hyper local weather forecast, precision agriculture, carbon accounting tools, or user specific services of many things related to climate change.\nAt the event, the CSIR signed memoranda of understanding with academic institutions and their incubation centres to strengthen collaboration.\nAmong those who were present at the inaugural were N. Kalaiselvi, Secretary, Department of Scientific and Industrial Research and Director General, CSIR, K. Ramesha, Director, CSIR-Central Electrochemical Research Institute, N. Anandavalli, Director, CSIR-Structural Engineering Research Institute, P. Thanikaivelan, Director, CSIR-Central Leather Research Institute, and K.J. Sreeram, Scientist H, CSIR.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/isro-could-relaunch-pslv-by-june-or-july-jitendra-singh/article70632765.ece",
        "date": "Sat, 14 Feb 2026 22:55:07 +0530",
        "fetched_at": "2026-02-15 03:26:23.471864"
    },
    {
        "title": "Experts criticise Andhra Pradesh’s health budget allocation for 2026-27",
        "content": "Health experts have pointed out that the allocation of ₹19,264 crore to the Health Department in the Budget 2026–27 is disappointing, as it shows no significant increase compared with the revised estimates for 2025–26, which stood at ₹17,637.24 crore.\nWhile the allocations to the sector have increased significantly from ₹11,673 crore in the year 2020-21, experts said that the health outlay for the year 2026-27 is falling short of the requirements set by the National Health Policy-2017. The policy had suggested that the State governments spend more than 8 per cent of their total budget on health by 2020. However, the A.P. government is yet to reach the goal, as this year’s allocations are 5.81 per cent of the total Budget.\nKameswara Rao of Praja Arogya Vedika said, “The government does not seem to have factored in inflation and rising disease burden. We expected measures for special tribal packages and strengthening of Public Distribution System.” Last week, the organisation had urged the government to allocate at least 2.5 per cent of the State’s gross domestic product (GSDP) to health. “The Budget estimates for 2026-27 is nowhere near the goal,” he added.\nResponding positively to the Budget, D. Jayadheer Babu of the Government Doctors’ Association said that the State government has helped those in need beyond the Budgetary framework as well.\nThis year, the government allocated ₹4,000 crore for the Dr. NTR Vaidya Seva Trust, which is the same as the allocations made in the year 2025-26 and 2024-25. It may be noted that the State government already has outstanding dues amounting to ₹3,000 crore in the current financial year, payable to the network hospitals.\n“The annual budget of running the scheme itself is ₹4,000 crore. With a total budget of ₹4,000 crore for the scheme, how is the government intending to clear the pending dues? It appears that the government is not serious with the allocations, as they seem to have taken no corrective measures,” said Dr. Vijay Kumar, president of the A.P. Speciality Hospitals Association.\nThe association has approached the High Court for intervention in the matter. The members have said failure to address this issue promptly may severely affect the participation of specialty hospitals in government health schemes, ultimately impacting patient care.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/experts-criticise-andhra-pradeshs-health-budget-allocation-for-2026-27/article70632706.ece",
        "date": "Sat, 14 Feb 2026 22:53:10 +0530",
        "fetched_at": "2026-02-15 03:26:24.075573"
    },
    {
        "title": "Three MEMU trains in Kerala to add coaches from Feb. 23: Union Minister Suresh Gopi",
        "content": "Union Minister of State for Petroleum, Natural Gas, and Tourism Suresh Gopi inaugurating the new multi-level car parking facility at the Kollam railway station on Saturday.\n| Photo Credit: C. Sureshkumar\nUnion Minister of State for Petroleum, Natural Gas, and Tourism Suresh Gopi on Saturday said that the carrying capacity of three MEMU trains in Kerala will be permanently increased from February 23 onwards to benefit daily commuters.\nMr. Gopi made the announcement while inaugurating a newly constructed multi-level car parking (MLCP) facility at the Kollam Junction railway station. The MLCP is a key component of the major redevelopment works currently under way at the station to enhance passenger amenities and modernise infrastructure, the Southern Railway said in a press release.\nOn the occasion, Mr. Gopi announced that the number of coaches on three MEMU trains—Palakkad–Ernakulam–Palakkad, Kollam–Ernakulam–Kollam, and Kollam–Kottayam–Kollam—has been increased from eight to 12, boosting their carrying capacity and enhancing travel comfort.\nMainline Electric Multiple Unit (MEMU) trains are short- to medium-distance commuter services in India, operated by Indian Railways and designed for suburban, semi-urban, and rural areas.",
        "link": "https://www.thehindu.com/news/national/kerala/three-memu-trains-in-kerala-to-add-coaches-from-feb-23-union-minister-suresh-gopi/article70633225.ece",
        "date": "Sat, 14 Feb 2026 22:50:59 +0530",
        "fetched_at": "2026-02-15 03:26:24.688812"
    },
    {
        "title": "10 Osmania University students booked following protest",
        "content": "An FIR has been registered against 10 students following a protest on the Osmania University campus demanding allowing of outsiders inside the hostel and the removal of the Director of Campus Hostels for Women.\nThe case was booked by the Osmania University (OU) police under various sections of the Bharatiya Nyaya Sanhita based on a complaint lodged by the university’s Chief Security Officer, Raza Khan, said a senior officer from the OU police.\nAccording to the complaint, the female students residing in the Centenary Hostel staged a protest seeking the removal of Prof. Kalyani Laxmi, Director of Campus Hostels for Women. “The protest was reportedly triggered by her decision not to permit outsiders to stay in the campus hostel, which the complainant stated was against university rules,” said the officer.\nSources said that one of the woman student wanted her ailing mother to stay with her in the hostel, which was flagged as a health risk concern by the management.\nThe Chief Security Officer alleged that the students blocked the road opposite the Arts College and obstructed vehicular movement from the night of February 11 8 p.m. until 9 a.m. on February 12. He stated that despite requests from the police to clear the road, the students continued their protest and raised slogans against the police.\nHe further alleged that the protest was in violation of a university circular prohibiting demonstrations on campus. Police said an investigation is underway.",
        "link": "https://www.thehindu.com/news/national/telangana/10-osmania-university-students-booked-following-protest/article70632819.ece",
        "date": "Sat, 14 Feb 2026 22:43:19 +0530",
        "fetched_at": "2026-02-15 03:26:25.291407"
    },
    {
        "title": "DRDO Chairman highlights efforts to boost India’s defence research capacity",
        "content": "Union Minister of State for Parliamentary Affairs Arjun Ram Meghwal, along with the management of SRM University-A.P., presents an honorary doctorate to Dr. Samir V. Kamat, Secretary, Department of Defence R&D and Chairman of DRDO, during a special convocation held at the university campus in Amaravati on Saturday.\n| Photo Credit: G.N. RAO\nChairman of the Defence Research and Development Organisation (DRDO) and Secretary of Department of Defence R&D Samir V. Kamat on Saturday (February 14, 2026) said that the organisation was working towards enhancing intellectual capital and scientific advancements through five newly established labs and 15 new DRDO centres that work on underwater awareness and space awareness.\nSpeaking after he was conferred an honorary doctorate at the special convocation of SRM University-A.P., the defence scientist encouraged young talent in universities to work towards indigenous defence technology, strategic foresight, and advanced scientific weaponry that can position India as a global leader.\nDelivering the convocation address, Union Minister of State for Parliamentary Affairs Arjun Ram Meghwal highlighted the transition of India’s industrial strength and development. He urged the graduating students to  “increase your strength, minimise your weakness, see the opportunity and convert that to success”.\nFounder Chancellor T.R. Paarivendhar, Pro-Chancellor P. Sathyanarayanan, Vice-Chancellor Ch. Satish Kumar, Registrar R. Premkumar and members of the governing body, Board of Management and Academic and Research Council were present.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/drdo-chairman-highlights-efforts-to-boost-indias-defence-research-capacity/article70632910.ece",
        "date": "Sat, 14 Feb 2026 22:15:33 +0530",
        "fetched_at": "2026-02-15 03:26:26.199508"
    },
    {
        "title": "Congress pulls off a clean sweep in Dharmapuri municipal election, decimates BRS",
        "content": "Riding high on the development plank, the ruling Congress pulled off a clean sweep in Dharmapuri municipal election winning all the 15 wards in the civic body.\nThe civic body in the famous temple town of Dharmapuri in Jagtial district delivered a decisive mandate in favour of the Congress much to the delight of the rank and file of the ruling party.\nCongress circles claim the party’s emphatic victory in Dharmapuri as a strong endorsement of the State government’s governance model.\nDespite the no-holds-barred campaign by former minister Koppula Eshwar, the BRS failed to secure even a single ward in Dharmapuri municipality.\nPolitical analysts credit the massive scale of Congress victory in Dharmapuri to the vigorous election campaign by Social Welfare Minister Adluri Laxman Kumar, who represents Dharmapuri constituency in the Assembly.\nThe Congress election campaign centred around the State government’s welfare schemes, including women-centric programmes and development initiatives.\nElated over the party’s clean sweep in Dharmapuri municipality, Mr. Laxman thanked voters for their trust and promised accelerated development of the temple town.",
        "link": "https://www.thehindu.com/news/national/telangana/congress-pulls-off-a-clean-sweep-in-dharmapuri-municipal-election-decimates-brs/article70632993.ece",
        "date": "Sat, 14 Feb 2026 22:02:25 +0530",
        "fetched_at": "2026-02-15 03:26:26.801227"
    },
    {
        "title": "Left-leaning voters will vote for UDF in upcoming Kerala Assembly elections: K.C. Venugopal",
        "content": "All India Congress Committee (AICC) general secretary K.C. Venugopal, MP, said here on Saturday that a substantial portion of the United Democratic Front (UDF) votes would be from Left-leaning voters in the upcoming Assembly elections.\nHe said that the people in Kerala feared that yet another victory for the Communist Party of India (Marxist) [CPI(M)] would create a Bengal-like situation in the State.\n“After witnessing the State government’s failures, even its allies are under stress. Many who support Communist ideals may react without fully grasping the situation,” he said.\n“People like K. Satchidanandan and Premkumar reacted. Since Mr. Satchidanandan is a nationally recognised figure, he was spared; but Mr. Premkumar was sidelined,” he said.\nMr. Venugopal described the Global Ayyappa  Meet organised by the government as the biggest scam Kerala witnessed in recent times. “The CPI(M) must stop exploiting temples and religious centres for scams,” he said.",
        "link": "https://www.thehindu.com/news/national/kerala/left-leaning-voters-will-vote-for-udf-in-upcoming-kerala-assembly-elections-kc-venugopal/article70632894.ece",
        "date": "Sat, 14 Feb 2026 21:30:48 +0530",
        "fetched_at": "2026-02-15 03:26:27.418678"
    },
    {
        "title": "Kerala Tourism launches ‘Travel Now, Post Later’ digital campaign to promote ‘mindful travel’",
        "content": "Kerala Tourism has launched an international digital campaign titled ‘Travel Now, Post Later,’ encouraging travellers to immerse themselves fully in their experiences before sharing them online. The initiative promotes mindful travel, urging visitors to prioritise presence over performance and genuine emotional connection over instant digital validation.\nAs digital fatigue increasingly shapes travel behaviour, constant documentation often replaces lived experiences, leaving little room for travellers to truly absorb the places they visit and the people they meet. ‘Travel Now, Post Later’ envisions a mindful travel movement that fosters deeper connections and more intentional journeys — beyond destinations and borders.\nThe campaign will be rolled out across Kerala Tourism’s official digital platforms and supported by a dedicated microsite, which showcases the campaign’s philosophy, curated content, and practical tools designed to encourage more conscious travel. Through this initiative, Kerala Tourism aims to position itself as a thought leader by sparking a broader global conversation about how the world travels — reframing travel as an act of presence that nurtures awareness, reflection, and authentic connections with people and places.\nThe campaign’s core messaging centres on presence-led journeys, deeper emotional engagement, and alignment with wellness, slow living, and mindful exploration. It also underscores respect for local cultures, communities, and natural environments.\n“As a trendsetter, Kerala Tourism has embraced the concept of mindful travel to align future journeys through the State with the evolving global tourism landscape, where travellers increasingly seek immersive experiences and meaningful emotional connections with the communities they encounter,” Tourism Minister P.A. Mohamed Riyas said.\nDescribing the initiative as a movement that resonates with travellers worldwide, beyond destinations and borders, the Minister added that the dedicated microsite brings together the campaign philosophy, travel tips, and curated destinations across Kerala to inspire more conscious and responsible travel choices.",
        "link": "https://www.thehindu.com/news/national/kerala/kerala-tourism-launches-travel-now-post-later-digital-campaign-to-promote-mindful-travel/article70632768.ece",
        "date": "Sat, 14 Feb 2026 21:26:28 +0530",
        "fetched_at": "2026-02-15 03:26:28.368329"
    },
    {
        "title": "Sabarimala gold loss case probe in final stage, says Kerala State Police Chief",
        "content": "State Police Chief (SPC) Ravada Chandrasekhar on Saturday said the investigation being carried out by a Special Investigation Team (SIT) into the Sabarimala gold loss case is in its final stage and is progressing in a proper manner.\nThe probe is conducted under the supervision of the High Court, which is closely monitoring the investigation, the SPC told reporters here.\n“The SIT is doing a good job. They are investigating [the case] well. The High Court is conducting its proper supervision,” he said.\nThe SIT is almost coming to the end of their investigation, Mr. Chandrasekhar added.\nThe Sabarimala gold loss cases pertain to the alleged misappropriation of gold from the Dwarapalaka (guardian deity) idols and the Sreekovil (sanctum sanctorum) door frames at the Ayyappa temple following the replating of the claddings on the artefacts.",
        "link": "https://www.thehindu.com/news/national/kerala/sabarimala-gold-loss-case-probe-in-final-stage-says-kerala-state-police-chief/article70632081.ece",
        "date": "Sat, 14 Feb 2026 21:23:00 +0530",
        "fetched_at": "2026-02-15 03:26:29.017389"
    },
    {
        "title": "Seven doctors suspended in Rajasthan over fraud in State health scheme",
        "content": "Representative image.\n| Photo Credit: Getty Images/iStockphotos\nSeven doctors posted in Sikar district were suspended and criminal proceedings initiated against a hospital and a diagnostic centre in Rajasthan in a crackdown on fraud in the State government’s health scheme. The action followed an audit which detected discrepancies in the scheme’s implementation.\nRajasthan’s Principal Secretary for Health Gayatri Rathore said here on Saturday (February 14, 2026) that the doctors at Shri Kalyan Government Hospital and the Government Medical College, both in Sikar, and the Community Health Centre at Kheerwa were found involved in irregularities in the Rajasthan Government Health Scheme (RGHS) for government employees and pensioners.\nMs. Rathore said that first information reports (FIRs) were also being registered against the Bharatpur Nursing Home in Bharatpur and Bothra Diagnostic and Imaging Centre in Bikaner. Instructions for initiating criminal proceedings have been given to the Chief Medical and Health Officers of the two districts.\nThe investigation revealed a collusion between the Bharatpur Nursing Home and Kashish Pharmacy to generate fake claims using the RGHS beneficiary cards. The patients were treated without the RGHS approval and fraudulent claims were raised through the pharmacy, causing financial loss to the State exchequer.\nIn the case of Bothra Diagnostic Centre, the patients were subjected to unnecessary diagnostic tests, while the prescriptions carried forged signatures and seals of doctors who were either on leave or not posted in the hospital’s out-patient department during the relevant period.\nEarlier, 19 FIRs were registered regarding irregularities in RGHS by the hospitals, pharmacies and beneficiaries, 64 medical personnel were suspended, and about 500 RGHS beneficiary cards were blocked. Ms. Rathore said that over ₹32 crore was recovered from the hospitals found involved in irregularities and de-empanelled on these charges.",
        "link": "https://www.thehindu.com/sci-tech/health/seven-doctors-suspended-in-rajasthan-over-fraud-in-state-health-scheme/article70632637.ece",
        "date": "Sat, 14 Feb 2026 21:20:38 +0530",
        "fetched_at": "2026-02-15 03:26:29.637326"
    },
    {
        "title": "Good governance and collective work resulted in  Congress win: CM Revanth tells Ministers",
        "content": "Telangana Chief Minister A.Revanth Reddy. File\n| Photo Credit: SIDDHANT THAKUR\nChief Minister A. Revanth Reddy asked his Cabinet colleagues to focus their efforts on the 36 municipalities and municipal corporations that returned hung verdicts in the recent civic polls and ensure that the Congress emerges with control in the maximum number of urban local bodies.\nChairing a meeting with Ministers, MLAs and TPCC president Mahesh Goud, the Chief Minister said that the Congress was well placed to secure a majority in the hung bodies and assessed that the party could win around 20 municipalities and corporations through coordinated political efforts and dialogue with like-minded parties and Independents.\nThe Chief Minister also gave specific instructions regarding the Kothagudem Municipal Corporation, where the Congress and its ally Communist Party of India (CPI) won 22 seats each, resulting in a deadlock. He gave the responsibility to Revenue Minister Ponguleti Srinivas Reddy to resolve the issue amicably and ensure the formation of a stable council.\nSimilarly, Mahesh Goud and N. Uttam Kumar Reddy will be the in-charge for Nizamabad Corporation; Ministers Sridhar Babu and Ponnam Prabhakar for Karimnagar Corporation to discuss with the MIM and Independents to form the Council. In Jagityal, where Congress rebels under T. Jeevan Reddy have become crucial, Minister Adluri Laxman Kumar and AICC secretary Sawant were entrusted with the responsibilty.\nDuring the meeting, Mr. Reddy congratulated all Ministers for the Congress’s strong performance in the municipal elections and said the positive results were possible only because everyone worked collectively with discipline and coordination. He also lauded Congress party workers for their tireless efforts and commitment to the party’s victory.\nThe Chief Minister remarked that the Congress government had achieved in two years what the previous government failed to do in 10 years. The development works undertaken and welfare schemes implemented during this period had strengthened public faith in governance, and the civic poll results were clear evidence of that trust, he said.\nCalling upon Ministers to preserve and build on this confidence, he urged them to take the State further along the development path. He advised that all future elections should be approached with the same spirit and unity that marked the recent municipal polls.\nThe Chief Minister also stressed the need to continuously take government welfare and development programmes to the people and ensure effective outreach. He made it clear that the government’s goal was to transform Telangana’s municipalities and municipal corporations into models at the national-level.",
        "link": "https://www.thehindu.com/news/national/telangana/good-governance-and-collective-work-resulted-in-congress-win-cm-revanth-tells-ministers/article70632990.ece",
        "date": "Sat, 14 Feb 2026 22:10:38 +0530",
        "fetched_at": "2026-02-15 03:26:30.246857"
    },
    {
        "title": "Mulling need for exams in Class I, says Kerala Minister",
        "content": "The government will consider if examinations have to be conducted for Class I students, Minister for General Education V. Sivankutty has said.\nHe was speaking after inaugurating the valedictory of an anganwadi fete at Manjampara lower primary school, Vattiyurkavu, here on Saturday.\nThe Minister said examinations in Class I were currently a serious affair. The government was mulling whether to conduct examinations in Class I or not. Students’ mental health should not be compromised by making them fear examinations or become anxious about it. Students should learn things not only inside textbooks but also outside it.\nMr. Sivankutty said students should be allowed to play. Action was taken as soon as it came to his attention that they were being made to study during holidays. Children should enjoy the holidays even as they learn.\nV.K. Prasanth, MLA, who presided over the event said those who had made fun of the Minister for ensuring timely distribution of textbooks had become objects of ridicule themselves. A comparison of schools as they were a decade ago and their situation now would show that photostats of textbooks did not have to be taken today. The government in power before the Left Democratic Front formed the government had not been able to ensure that textbooks for the next academic year were ready in time, the MLA pointed out.\nVarious anganwadis took part in the fete.",
        "link": "https://www.thehindu.com/news/national/kerala/mulling-need-for-exams-in-class-i-says-kerala-minister/article70632856.ece",
        "date": "Sat, 14 Feb 2026 21:13:09 +0530",
        "fetched_at": "2026-02-15 03:26:30.851940"
    },
    {
        "title": "Register criminal cases against Devaswom Minister, TDB: Cong.",
        "content": "Kerala Pradesh Congress Committee (KPCC) president Sunny Joseph has sought registration of criminal cases against the Devaswom Minister and the Travancore Devaswom Board (TDB) for the “large-scale corruption” in the conduct of the Global Ayyappa Meet. He sought a comprehensive investigation into charges of misappropriation of funds, fabrication of documents, and criminal breach of trust.\nAddressing the media at the Kannur District Congress Committee office here, Mr. Joseph alleged that the audited expenditure figures of the event and the amounts claimed by the Minister and the Board did not match.\n“If he has integrity, the Devaswom Minister should resign. If he believes he can escape by shifting responsibility onto someone else, he is mistaken,” Mr. Joseph said.\nHe alleged that a conspiracy had been hatched to siphon off funds in the name of organising the meet, and that fabricated documents had been created for the purpose. Many of the vouchers submitted were bogus and prepared to justify fraudulent claims, he alleged and sought an inquiry to identify those who created false records.\nHe also alleged that those involved in the Sabarimala gold theft case were still being protected, and that delays in filing the chargesheet enabled the accused to secure bail on technical grounds.",
        "link": "https://www.thehindu.com/news/national/kerala/register-criminal-cases-against-devaswom-minister-tdb-cong/article70632606.ece",
        "date": "Sat, 14 Feb 2026 20:51:05 +0530",
        "fetched_at": "2026-02-15 03:26:31.471727"
    },
    {
        "title": "SNDP Samrakshana Samiti to initiate legal action against Vellappally over ‘election irregularities’",
        "content": "The SNDP Samrakshana Samiti will initiate both criminal and civil proceedings against Sree Narayana Dharma Paripalana (SNDP) Yogam general secretary Vellappally Natesan for preparing a fraudulent voters’ list in violation of High Court directives for the upcoming organisational elections, said the samiti leaders at a press conference here on Saturday. They also alleged that Mr. Natesan and his son are spreading misinformation regarding court orders to manipulate the  elections.\nThe controversy stems from a High Court judgment dated December 19, 2025, which instructed the Union Ministry of Corporate Affairs to determine whether the SNDP Yogam operates as a Kerala Non-Trading Company or under the Union Companies Act. The court explicitly mandated that this decision be reached only after serving notices to the plaintiffs, examining their documents, and hearing their arguments.\nHowever, the samiti leaders claimed that they have yet to receive a formal date for a hearing and they pointed out significant clerical discrepancies in the notices they did receive. “While the Ministry of Corporate Affairs has not yet heard the arguments or passed a final verdict, Vellappally Natesan and his son are falsely claiming to have received all necessary approvals to conduct the elections,” they said.\nAccording to the samiti, a fraudulent circular has been issued to union officials to begin the preparation of the voters’ list. “This action reportedly ignores a standing High Court order from August 8, 2024, which appointed a specific committee to regularise the SNDP Yogam membership register using valid identity proof,” they added.\nThe samiti members further alleged that this violation of the law is being committed with the silent support of Central and State authorities. “The State core committee of the SNDP Samrakshana Samiti has resolved to pursue rigorous legal and organisational countermeasures. A Special Leave Petition (SLP) has been filed in the Supreme Court challenging the appeal that granted voting rights in a previous case,” they said.\nThe press conference was attended by chairperson S. Chandrasenan, plaintiff V. Vijayakumar, and State committee member D. Sajeev Babu.",
        "link": "https://www.thehindu.com/news/national/kerala/sndp-samrakshana-samiti-to-initiate-legal-action-against-vellappally-over-election-irregularities/article70632602.ece",
        "date": "Sat, 14 Feb 2026 20:46:09 +0530",
        "fetched_at": "2026-02-15 03:26:32.071191"
    },
    {
        "title": "Mysuru hosts ‘Inspiring Women to Live Fulfilling Lives’ summit",
        "content": "The Confederation of Indian Industry (CII) Mysuru, through its CSR and DEI Panel, successfully organised the second edition of ‘Inspiring Women to Live Fulfilling Lives’ – 2026 at the Infosys Campus in Mysuru. The symposium organised here recently witnessed participation from over 200 delegates representing the IT sector, academia, healthcare institutions, and diverse industries.\nMs. Trishikha Kumari Wadiyar, chairperson, Bherunda Foundation, joined the symposium through a virtual presence and addressed the gathering, encouraging women to pursue holistic growth and a purposeful life.\nThe programme was structured around four core themes — Financial Well-being, Mental Well-being, Physical Well-being, and Emotional Well-being — offering practical insights aligned to both personal and professional excellence, according to a CII press release.\nMs. Savitha Mallappa, convenor, CII Mysuru CSR and DEI Panel, said, “This symposium was curated to move beyond dialogue and provide actionable frameworks on well-being and inclusion. When organisations consciously invest in financial awareness, mental resilience, physical health, and emotional strength, they build stronger and more sustainable workplaces.”\nMr. Nagaraja Gargeshwari, chairman, CII Mysuru Zone, said, “Inclusive growth and industrial competitiveness go hand in hand. As Mysuru continues to evolve as a knowledge and industry hub, it is essential that organisations create ecosystems where women can participate, progress, and lead with confidence. Such platforms convert intent into structured industry action.”\nThe symposium featured experienced panellists from diverse backgrounds who shared insights and best practices on financial independence, mental health awareness, preventive healthcare, and organisational health frameworks. The discussions emphasised the importance of breaking stigma, enabling open conversations and creating supportive environments that help women lead fulfilling personal and professional lives, the release stated.\nThis second edition also marked the launch of a Women Return-to-Work platform, aimed at connecting women aspiring to re-enter the workforce after a career break with industry partners, and enabling engagement in a phased approach. The symposium concluded with participant reflections and a strong appreciation for the depth of discussions, expert-led sessions, and the spirit of cross-sector collaboration.",
        "link": "https://www.thehindu.com/news/national/karnataka/mysuru-hosts-inspiring-women-to-live-fulfilling-lives-summit/article70631737.ece",
        "date": "Sat, 14 Feb 2026 20:36:49 +0530",
        "fetched_at": "2026-02-15 03:26:32.675312"
    },
    {
        "title": "Siddaramaiah launches ‘sixth guarantee’, questions silence of ex-CMs over ‘injustice’ to Karnataka",
        "content": "Chief minister Siddaramaiah, Deputy Chief Minister D.K. Shivakumar and others during the he 1000-day celebration of government in Haveri on Saturday.\nThe mega convention at Haveri on Saturday to launch “Bhoo Guarantee”, that coincided with the Congress government completing 1,000 days in office, also became a platform for raising the issue of “injustice” meted out to Karnataka by the Centre.\nAddressing a gathering of beneficiaries who were issued title deeds of properties, Chief Minister Siddaramaiah questioned the silence of the former Chief Ministers, who are now MPs, on the issue of “injustice”.\n“Former Chief Ministers and incumbent MPs Basavaraj Bommai and Jagadish Shettar and Union Minister Pralhad Joshi are not opening their mouths to speak on the injustice to Karnataka,” he said.\n“We have created a record by distributing title deeds to a total of 2.2 lakh beneficiary families, even as we have become number one in GDP. These have been achieved despite the injustice by the Centre in terms of release of funds,” he said.\nDescribing the title deed distribution as the “sixth guarantee”, he said that if what was due for the State was given by the Centre, the government would be able to initiate more development works.\nMr. Siddaramaiah claimed that in the last two years and nine months, the State government had fulfilled 243 assurances. “But the BJP which did not fulfil its assurances when in power, is now spreading canards about the exchequer being empty. So far we have directly credited ₹1,18,000 crore to bank accounts of people of the State through various guarantees,” he said.",
        "link": "https://www.thehindu.com/news/national/karnataka/siddaramaiah-launches-sixth-guarantee-questions-silence-of-ex-cms-over-injustice-to-karnataka/article70632130.ece",
        "date": "Sat, 14 Feb 2026 20:31:07 +0530",
        "fetched_at": "2026-02-15 03:26:33.279381"
    },
    {
        "title": "Badanavalu Satyagraha: Meeting resolves to strengthen villages, their economy",
        "content": "Theatre personality Prasanna speaking at a meeting on Badanavalu Satyagraha in Mysuru.\n| Photo Credit: Special Arrangement\nA consultative meeting of the ‘satyagrahis’ of the Badanavalu Satyagraha was held at the Indian Institute of Educational Theatre here on Saturday.\nThe Badanavalu Satyagraha primarily focused on issues such as excessive use of vehicles, extravagant programmes, and commercialisation, eventually taking the form of a movement. However, since the situation has not changed even today, theatre personality Prasanna emphasised that it is important to deliberate on how to carry this satyagraha forward. Hence, the meeting was organised.\nSpeaking on the occasion, Jayadev expressed the view that “The Village Satyagraha must continue as a non-violent movement.”\nRecently, the government has sanctioned ₹40 crore for the development of the Badanavalu Nanjangud Khadi Centre. The participants expressed that the government seems to consider the mere construction of buildings as development. “By centring activities around the Badanavalu Khadi Centre and promoting the sale of khadi products, it is possible to encourage rural cottage industries and provide employment to rural women within their own villages. The Khadi Centre has gained special significance because Mahatma Gandhi had visited Badanaval. There is a need to realise the dream of sustainable living that upholds the values of village life,” the organisers said in a note.\nAt the meeting, there was also a discussion on renaming the Badanavalu Satyagraha as ‘Grama Satyagraha’. Participants shared their views at length.\nThe meeting was attended by personalities who follow Gandhian principles, including Prasanna, Jayadev and Yatiraj from Tumakuru, Venkataraju from Chamarajanagar, Punajuru Doreswamy, A.D. Silva, Tagadur Mohan, Badanavalu Mahadevappa, Umashankar and Pavitra Muddayya from Bengaluru, Lavanya and Abhilash from Grama Seva Sangha, writer G.P. Basavaraju, journalist Rashmi Koti, and farmer Karunakara.\nPrasanna read out the draft resolution at the meeting, and all the participants expressed their consent to it. The historic Badanavalu Satyagraha of 2015 had passed several resolutions concerning a sustainable lifestyle and the economy. “Today, we have become more unsustainable than ever. The village economy is getting destroyed. Cities and machine-made cultures have grown to monstrous proportions, thus pushing humanity to the brink of extinction,” the resolution stated.\n“We resolve to rename Badanavalu Satyagraha as Gram Satyagraha and lead it towards the rejuvenation of the villages, the hand-made economy, natural farming, local culture, mother tongue, protection of deprived sections of the society, and for the protection of damaged natural resources. We shall lead a non-violent and constructive movement in the name of Gram Satyagraha,” the resolution added.",
        "link": "https://www.thehindu.com/news/national/karnataka/badanavalu-satyagraha-meeting-resolves-to-strengthen-villages-their-economy/article70632150.ece",
        "date": "Sat, 14 Feb 2026 20:25:56 +0530",
        "fetched_at": "2026-02-15 03:26:33.886723"
    },
    {
        "title": "Projects are being implemented balancing traditional sectors and industrial growth: K N Balagopal",
        "content": "The State government is implementing development projects by giving equal importance to traditional sectors and agriculture alongside modern industries, Finance Minister K.N. Balagopal said here on Saturday.  He was speaking after inaugurating a development seminar for Neduvathur grama panchayat’s 2026-27 People’s Plan campaign.\nHighlighting the local progress, the Minister observed that Neduvathur has evolved into a major development hub for the Kottarakara region. He pointed out that the establishment of the Zoho IT Park in Neduvathur has significantly contributed to an increase in professional tax revenue for the local body.\n“To safeguard employment within traditional sectors, specialised vocational training programmes have been implemented in unnathis. Authorised youth clubs will receive an annual financial assistance of ₹10,000 to support their activities,” he said.\nAddressing the grievances of the farming community, Mr. Balagopal also assured that effective solutions would be found to mitigate the recurring instances of human-wildlife conflict.\nProviding updates on some key infrastructure projects in the region, the Minister said that the construction of the Kottarakara Ayurveda Hospital, one of Kerala’s two integrated AYUSH hospitals, is moving forward steadily. “Funds have already been sanctioned for building modern markets in Veliyam and Mylam panchayats, while similar market construction projects are currently under way in Ezhukone and Kalayapuram. Also, the development of the Panayil-Paramukku road, being built at a cost of ₹3.75 crore, will be fast-tracked for completion,” he said.\nThe seminar was presided over by Neduvathur grama panchayat president V. Vidya, while standing committee chairperson K.S. Amrita presented the draft plan.",
        "link": "https://www.thehindu.com/news/national/kerala/projects-are-being-implemented-balancing-traditional-sectors-and-industrial-growth-k-n-balagopal/article70632430.ece",
        "date": "Sat, 14 Feb 2026 20:25:27 +0530",
        "fetched_at": "2026-02-15 03:26:34.494433"
    },
    {
        "title": "₹9,165 crore Budget boost for Home Department to curb online frauds, digital arrests",
        "content": "The State government has proposed a comprehensive plan to strengthen the Police Department to curb online frauds and so called digital arrests. In the Budget 2026-27 presented on Saturday, ₹9,165 crore has been allocated to the Home Department.\nWith a focus on crime prevention and modernisation, the government plans to build a technology driven police force by establishing SMART Policing Labs and implementing AI enabled policing projects. Upgradation of communication and security equipment, expansion of CCTV networks and deployment of drones have also been proposed to enhance surveillance and response capabilities.\nTo tackle cyber offences effectively, Cybercrime Police Stations will be set up in every district. The government has also announced induction of 3,000 new vehicles into the police fleet to improve mobility and field operations across the State.\nFinance Minister Payyavula Keshav said ₹15 crore has been earmarked for the proposed Andhra Pradesh Police Academy. The government has also sanctioned 3,920 posts for new APSP battalions to be raised in Rajahmundry, Chittoor, Ongole and Srikakulam.\nFor the Judiciary Department, 100 new courts have been sanctioned. Works estimated at ₹349 crore will be taken up during 2026-27 under Phase I to strengthen judicial infrastructure.\nAs part of the modernisation of Fire Services, 17 new fire stations will be established to reduce response time and improve emergency coverage. Advanced firefighting vehicles equipped with search and rescue tools will also be procured.\nThe State Training Centre will be strengthened by upgrading training infrastructure for personnel of the AP State Disaster Response and Fire Services, the Minister added.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/9165-crore-budget-boost-for-home-department-to-curb-online-frauds-digital-arrests/article70632559.ece",
        "date": "Sat, 14 Feb 2026 20:16:04 +0530",
        "fetched_at": "2026-02-15 03:26:36.073726"
    },
    {
        "title": "A.P. Ministers call Budget a balanced roadmap for development and welfare",
        "content": "The revenue deficit has reduced to 1.11%, and the fiscal deficit is contained at 3.84%, says I&PR Minister Kolusu Parthasarathy.\n| Photo Credit: File Photo\nMinisters of the Andhra Pradesh government on Saturday welcomed the ₹3.32 lakh crore Budget for 2026-27 financial year, describing it as a ‘balanced roadmap for development and welfare’ under the leadership of Chief Minister Nara Chandrababu Naidu.\nHousing and I&PR Minister Kolusu Parthasarathy said the Budget overcame a debt burden of ₹10 lakh crore inherited from the previous YSRCP regime, while reducing the revenue deficit to 1.11% and containing fiscal deficit at 3.84%.\nHe noted that capital expenditure had been stepped up to ₹48,697 crore and ₹57,868 crore worth of Amaravati works received administrative sanction.\nSocial Welfare Minister Dola Sree Bala Veeranjaneya Swamy highlighted ₹20,644 crore allocated for SC welfare and ₹300 crore for hostel infrastructure.\nHome Minister V. Anitha said the Budget aimed at fulfilling the aspirations of five crore people and announced 3,000 new police vehicles and cyber crime police stations in every district.\nTransport Minister Mandipalli Ramprasad Reddy welcomed the allocation of ₹9,856 crore for transport and roads.\nMinority Welfare Minister N. Mohammed Farook said ₹6,090 crore had been earmarked for minorities, including ₹3,133 crore under the Sub-Plan.\nTourism Minister Kandula Durgesh cited ₹439 crore for tourism and plans for seven anchor hubs.\nBC Welfare Minister S. Savitha said ₹51,021 crore was allocated for BC welfare. MLC B.T. Naidu underscored the higher allocations for education and agriculture.\nMinister for Roads and Buildings, Investments and Infrastructure B.C. Janardhan Reddy said equal priority has been given to all sectors in the Budget.\nReferring to the ₹9,856 crore earmarked for the Transport, Roads and Buildings, he said in nine months of assuming office, the coalition government has transformed Andhra Pradesh into a pothole-free State.\nHe said the government aimed to provide better roads to the people.\nHe said ₹1,280 crore was allocated for investments and infrastructure development and added that with improved infrastructure, investors’ confidence in the government had increased.\n“Though Andhra Pradesh does not even account for 25% of the country’s population, it has secured 25% of the nation’s investments and it is a testament to the Chief Minister N. Chandrababu Naidu’s efforts,” he said.\nClaiming that the budget reflects a balance, combining development and welfare measures, he cited allocation of ₹91,000 crore for welfare schemes for the underprivileged and ₹30,000 crore for developing Rayalaseema as a global horticulture hub.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/ap-ministers-call-budget-a-balanced-roadmap-for-development-and-welfare/article70632378.ece",
        "date": "Sat, 14 Feb 2026 21:12:40 +0530",
        "fetched_at": "2026-02-15 03:26:36.673089"
    },
    {
        "title": "Budget, a roadmap for Swarna Andhra: Lanka Dinakar",
        "content": "The ₹3.32 lakh crore State Budget is a roadmap aligning Swarna Andhra with Viksit Bharat, observed chairperson of the Twenty Point Programme Implementation Lanka Dinakar. Addressing a press meet at the Secretariat on Saturday (February 14), he said the Budget balances development and welfare while strengthening irrigation, industry and horticulture across regions.\nHe underlined the ₹8,365 crore allocation under VB-G Ram G for rural asset creation with 40% State and 60% Central share. Allocations include ₹28,000 crore for the Visakha Economic Council, ₹30,000 crore to develop Rayalaseema as a horticulture hub, ₹6,000 crore for Amaravati and ₹6,105 crore for phase-I of Polavaram Project.\nMr. Dinakar said ₹53,915 crore in capital expenditure would boost jobs and fiscal deficit was reduced to 3.84%.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/budget-a-roadmap-for-swarna-andhra-lanka-dinakar/article70632567.ece",
        "date": "Sat, 14 Feb 2026 20:13:50 +0530",
        "fetched_at": "2026-02-15 03:26:37.309364"
    },
    {
        "title": "Budget takes balanced approach to welfare, development: CII-AP",
        "content": "The Confederation of Indian Industry (CII-Andhra Pradesh) praised the Budget presented by Minister for Finance   Payyavula Keshav in the Assembly on Saturday (February 14), saying that it took a balanced approach to fulfilling welfare commitments and long-term development priorities.\nCII-A.P. chairperson Murali Krishna Gannamani said in a press release that the Budget created a positive ecosystem for industry through infrastructure development and by strengthening logistics and planning regional economic clusters.\nHe expressed confidence that the allocation of ₹28,000 crore for Visakhapatnam Economic Region would transform north Andhra into a major industrial, IT, maritime and services growth hub.\nVice-chairperson S. Narendra Kumar said the Budget attempted to strike a balance between the development of Amaravati and large-scale welfare spending, positioning both as parallel growth drivers for the State. Capital expenditure was being used as an investment multiplier to attract private investment, services sector growth and employment generation, he noted.\nCII-Vijayawada chairperson V. Nagalakshmi hailed the allocation of ₹19,306 crore for the health sector and observed that healthcare should be a major component of the State’s welfare and human development strategy.\nCII-AP former chairperson D. Ramakrishna said school education getting a major chunk of the budget (₹32,308 crore) reflected the government’s intent on strengthening the human capital. The substantial allocations for scholarships and skill development were a step in the right direction, he said.\nM. Lakshmi Prasad, former chairperson of CII-A.P., said the Budget has linked agricultural growth directly with rural prosperity and economic stability, and the provision of ₹20,000 each in annual assistance to 46.86 lakh farmers would strengthen farm income security, thereby help reduce farmer distress.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/budget-takes-balanced-approach-to-welfare-development-cii-ap/article70632273.ece",
        "date": "Sat, 14 Feb 2026 20:04:22 +0530",
        "fetched_at": "2026-02-15 03:26:38.836660"
    },
    {
        "title": "On Quad Summit, Jaishankar Says ‘Stay Tuned,’ Insists It Was ‘Never’ Cancelled",
        "content": "In his first remarks on the Quad Summit following the India-US trade deal developments, External Affairs Minister S Jaishankar on Saturday clarified that the Quad summit was “never cancelled,\" pushing back against speculation about the grouping’s trajectory.\nWhile speaking at the Munich Security Conference 2026, where he participated in a roundtable discussion titled ‘Delhi Decides: Mapping India’s Policy Calculus’ hosted by Ananta Aspen, Jaishankar addressed questions regarding the Quad saying that the summit was never cancelled, however it was never specifically scheduled.\n“The Quad summit was never cancelled. It was never specifically scheduled. Yes, it did not take place — but I won’t over read ‘Quad’ not happening at a summit level,\" he said.\nJaishankar further emphasised continued engagement within the group and highlighted that his first meeting with US Secretary of State Marco Rubio took place in the Quad Foreign Ministers’ Meeting (FMM) format.\n“We had two Quad FMMs. Other mechanisms are going on,\" he said, underlining that cooperation among the four countries remains active through multiple channels.\nDownplaying concerns over the absence of a leaders’ summit, the Union Minister signaled continuity rather than disruption in Quad engagements.\nThe Quadrilateral Security Dialogue, comprising India, the United States, Japan and Australia, has been central to Indo-Pacific cooperation on maritime security, supply chains, critical technologies and regional stability.\nJaishankar’s remarks are significant as they mark his first public statement on the QUAD following recent trade deal announcement.\nEarlier this month, US President Donald Trump announced that the United States and India have reached a trade deal to lower reciprocal tariffs. He said that following a phone call with Prime Minister Narendra Modi, the US would reduce tariffs on Indian goods from 25 per cent to 18 per cent with immediate effect. In return, Trump claimed India would cut its tariffs and non-tariff barriers on US products to “zero.\"\nAs part of the understanding, India has signalled plans to increase its purchases of US products in areas such as energy, aircraft parts, machinery and technology, with an overall trade engagement target of around $500 billion over the next few years. Both sides also agreed to work on reducing trade barriers and improving cooperation on areas like digital trade and supply chains.\nLater, the White House replaced its original fact sheet on the interim trade framework with a revised version. A reference to “certain pulses\" being included in tariff reductions has been removed, ensuring that India’s longstanding tariff protections for its farmers remain intact. Similarly, wording that said India had “committed to buy\" $500 billion worth of US goods has been replaced with “intends to buy,\" making it clear that these purchases are not legally binding obligations but part of a broader intent outlined in the joint statement.\nFurther, agriculture has been removed from the list of sectors from which India would purchase US goods, limiting perceived exposure of the farm sector. The earlier line stating that India would remove its digital services tax has also been deleted. Instead, the updated version says India has “committed to negotiate a robust set of bilateral digital trade rules,\" shifting the focus from unilateral concessions to future negotiations.\nLatest Blogs",
        "link": "https://www.news18.com/india/stay-tuned-jaishankar-on-quad-summit-status-says-it-was-never-cancelled-ws-l-9904185.html",
        "date": "Sat, 14 Feb 2026 21:11:04 +0530",
        "fetched_at": "2026-02-15 03:26:44.093495"
    },
    {
        "title": "PM RAHAT: Who Is Eligible And How The Cashless Road Accident Scheme Works?",
        "content": "The government has rolled out PM RAHAT (Road Accident Victim Hospitalisation and Assured Treatment), a nationwide scheme designed to provide cashless medical care to road accident victims and ensure that financial constraints do not delay life-saving treatment.\nThe initiative aims to strengthen India’s emergency response system by guaranteeing immediate medical support during the critical “Golden Hour\" — the first hour after an accident, when timely intervention can significantly improve survival chances.\nUnder PM RAHAT, every eligible road accident victim will be entitled to cashless treatment of up to ₹1.5 lakh for a period of seven days from the date of the accident, regardless of the category of road on which the incident occurred.\nIn non-life-threatening cases, stabilisation treatment will be provided for up to 24 hours. In life-threatening cases, it can extend up to 48 hours, subject to verification through an integrated digital system.\nThe scheme is integrated with the Emergency Response Support System (ERSS) 112. Accident victims, Good Samaritans (Rah-Veer), or anyone present at the scene can dial 112 to receive information about the nearest designated hospital and request ambulance assistance.\nThis linkage is expected to improve coordination between emergency responders, police authorities and hospitals, helping victims reach medical facilities more quickly.\nHospitals will be reimbursed through the Motor Vehicle Accident Fund (MVAF).\nIf the offending vehicle is insured, the payment will come from contributions made by general insurance companies. In cases involving uninsured vehicles or hit-and-run incidents, the government will cover the costs through budgetary allocations.\nApproved claims will be settled within 10 days by the State Health Agency, providing financial assurance to hospitals and encouraging uninterrupted treatment.\nThe scheme operates on a digital platform that integrates the Electronic Detailed Accident Report (eDAR) system of the Ministry of Road Transport and Highways with the National Health Authority’s Transaction Management System (TMS 2.0).\nThis ensures seamless digital tracking from accident reporting and police authentication to treatment delivery, claim processing and payment.\nEach district will have a designated Grievance Redressal Officer, nominated by the District Road Safety Committee, which is chaired by the District Collector or an equivalent authority, to address complaints and ensure accountability.\nIndia records a significant number of road accident deaths every year, many of which could be prevented with timely medical intervention. Studies indicate that nearly half of such fatalities can be avoided if victims receive hospital care within the Golden Hour.\nBy removing upfront payment barriers and ensuring faster emergency coordination, PM RAHAT seeks to reduce preventable deaths and strengthen the country’s emergency healthcare ecosystem.\nIn essence, the scheme ensures that accident victims receive immediate treatment without worrying about costs, a step aimed at saving lives and improving road safety outcomes nationwide.\nLatest Blogs",
        "link": "https://www.news18.com/india/pm-rahat-who-is-eligible-and-how-the-cashless-road-accident-scheme-works-ws-el-9904184.html",
        "date": "Sat, 14 Feb 2026 19:48:40 +0530",
        "fetched_at": "2026-02-15 03:26:44.854086"
    },
    {
        "title": "PM Modi Inaugurates Kumar Bhaskar Varma Setu In Guwahati: ‘Game-Changer For Connectivity’",
        "content": "Prime Minister Narendra Modi on Friday inaugurated the Kumar Bhaskar Varma Setu, a major bridge project across the Brahmaputra River, describing it as a vital infrastructure development for Guwahati and the surrounding areas.\nKumar Bhaskar Varma Setu across the Brahmaputra is a vital infrastructure project for Guwahati and areas around it. Connectivity, comfort and commerce will be significantly enhanced. It will enable devotees to go to the Kamakhya Temple with greater ease. pic.twitter.com/bdpjbW0oNk— Narendra Modi (@narendramodi) February 14, 2026\nSharing images from the site, the Prime Minister said the bridge would significantly enhance connectivity, comfort and commerce in Assam. He also noted that the project would make it easier for devotees to visit the revered Kamakhya Temple in Guwahati.\nThe Kumar Bhaskar Varma Setu is a key bridge constructed over the Brahmaputra, one of India’s largest rivers, aimed at easing traffic congestion and strengthening transport links in Assam’s largest city.\nNamed after the ancient Kamarupa king Kumar Bhaskar Varma, the bridge is designed to serve as an additional crossing over the Brahmaputra, supplementing existing bridges such as the Saraighat Bridge. The new structure is expected to decongest city traffic and improve travel time between north and south Guwahati, as well as nearby districts.\nImproved Connectivity:\nThe bridge will reduce travel time across the Brahmaputra and ease pressure on existing crossings, which often face heavy traffic.\nBoost to Commerce:\nBetter road connectivity is expected to enhance trade and logistics in the region, facilitating smoother movement of goods and services across Assam and the Northeast.\nReligious Tourism:\nWith Kamakhya Temple being one of the most prominent pilgrimage sites in the country, improved access is likely to benefit thousands of devotees who travel to Guwahati each year.\nUrban Expansion:\nThe new crossing is also expected to support urban development by opening up better connectivity to residential and commercial hubs on both sides of the river.\nThe project forms part of a broader push to strengthen infrastructure in the Northeast, aimed at improving economic integration and regional development.\nOfficials say the bridge will play a key role in shaping Guwahati’s future growth while easing daily commuting challenges for residents.\nLatest Blogs",
        "link": "https://www.news18.com/india/pm-modi-inaugurates-kumar-bhaskar-varma-setu-in-guwahati-game-changer-for-connectivity-ws-l-9903784.html",
        "date": "Sat, 14 Feb 2026 16:40:24 +0530",
        "fetched_at": "2026-02-15 03:26:45.495441"
    },
    {
        "title": "Andhra Pradesh Budget Highlights: Big Push For Capital Amaravati, Tirupati As Global Destination",
        "content": "The Andhra Pradesh government unveiled its budget proposals for 2026-27, focusing on regional development, urban infrastructure, and citizen welfare, with a strong emphasis on the capital region, Amaravati. The department of municipal administration and urban development has been allocated Rs 14,539 crore to drive development in the capital area. Additionally, the government has granted administrative sanction for 97 works worth Rs 57,868 crore across sectors.\nSwarna Andhra Vision 2047\nUnder the Swarna Andhra @2047 vision, the state has adopted a regional growth approach to ensure inclusive development. Three regions—Visakhapatnam, Amaravati, and Tirupati—have been identified as key engines of growth. Women are expected to play a pivotal role in achieving the vision, with policies aimed at enhancing women’s participation in development programmes and professional life.\nOf the total urban development and municipal administration fund of Rs 14,549 crore, the share allocated to Amaravati alone is Rs 6,000 crore. The amoount allocated for Vishakhpatnam economic development development – 28,000 crore\nEconomic and Tourism Initiatives\nThe budget also outlines plans for the Andhra Pradesh Wealth Fund, designed to emulate successful sovereign wealth funds like those of Norway and Abu Dhabi, potentially becoming a long-term revenue engine for the state.\nIn the tourism sector, the government aims to upgrade Tirupati as a global destination, improving tourist infrastructure, hotel capacity, and recreational facilities in coordination with the Union government. Meanwhile, the Visakhapatnam Economic Region (VER) will see a comprehensive economic master plan, covering 11 districts with 41 high-impact projects in manufacturing, services, infrastructure, urbanisation, and agriculture. Proposals worth Rs 28,000 crore, including metro rail projects, are being submitted to the Centre for funding and private investment.\nSocial and Environmental Programmes\nEducation initiatives like Talliki Vandanam, introduced under the Super Six programme, continue, providing Rs 15,000 per child annually to over 67 lakh students. Under Deepam 2.0, 1.08 crore women beneficiaries receive three free LPG cylinders per year, with Rs 2,897 crore credited directly to their accounts. Women employees will also benefit from expanded childcare leave without age limits, promoting work-life balance.\nThe Harita Andhra programme aims to achieve 37 per cent green cover by 2030 and 50 per cent by 2047, combating desertification, halting land degradation, and implementing the Green Cover Wall as an ecological buffer across the state.\nWith these initiatives, the Andhra Pradesh government is signalling a strong push for balanced regional development, infrastructure modernisation, environmental sustainability, and women’s empowerment, setting the stage for long-term economic growth and inclusive progress.\nLatest Blogs",
        "link": "https://www.news18.com/india/andhra-pradesh-budget-highlights-big-push-for-capital-amaravati-tirupati-as-global-destination-ws-kl-9903178.html",
        "date": "Sat, 14 Feb 2026 13:32:48 +0530",
        "fetched_at": "2026-02-15 03:26:46.200496"
    },
    {
        "title": "Andhra Pradesh Unveils Rs 3.32 Lakh Crore Budget, CM Credits Centre’s Support For Development",
        "content": "The Andhra Pradesh government on Saturday presented a Budget of Rs 3,32,205 crore for the financial year 2026-27, positioning it as a roadmap aimed at balancing welfare commitments with long-term economic growth and infrastructure development.\nFinance Minister Payyavula Keshav tabled the Budget in the State Assembly, marking the third consecutive time he has presented the state’s financial statement, including one Vote-on-Account and two full-fledged budgets.\nIn the budget presented, the revenue expenditure has been estimated at Rs 2,56,143 crore, while capital expenditure is projected at Rs 53,915 crore. The revenue deficit is pegged at Rs 22,002 crore, and the fiscal deficit at Rs 75,868 crore.\nAccording to news agency PTI, the budget seeks to balance welfare and development spending, with significant allocations across social and infrastructure sectors.\nThe government allocated Rs 32,308 crore for School Education and Rs 19,306 crore for the Health, Medical and Family Welfare Department.\nNearly Rs 23,000 crore has been earmarked for the Panchayati Raj and Rural Development Department, while Rs 51,021 crore has been proposed for the BC component.\nIn his Budget speech, Keshav said rebuilding Andhra Pradesh required sustained effort following challenges faced since its formation.\nHe stated that a short period was insufficient to rebuild a state affected first by the 2014 bifurcation and later by governance and financial difficulties between 2019 and 2024.\nHe described the Budget as “not just an account of figures, but as a roadmap aimed at fulfilling the dreams of five crore people.\"\nAGRICULTURE AND IRRIGATION PRIORITY\nThe budget places strong emphasis on agriculture and water security.\nAllocations include Rs 9,906 crore for major irrigation projects and Rs 6,105 crore for the Polavaram project.\nThe Annadata Sukhibhav scheme received Rs 6,600 crore.\nAdditional provisions include Rs 1,927 crore under the Rashtriya Krishi Vikas Yojana, Rs 500 crore for the Price Stabilisation Fund, Rs 260 crore for fisheries services, Rs 250 crore for crop insurance and Rs 190 crore under the PM Krishi Sinchai Yojana.\nCHIEF MINISTER CREDITS CENTRE’S SUPPORT\nIn posts shared on X, the Chief Minister Chandrababu Naidu’s Office expressed gratitude to the Union government, stating, “While financial challenges remain, the government continues to move forward with strong resolve and responsible fiscal management.\"\nThe post added that “continued support from Hon’ble PM Sri Narendra Modi garu and Hon’ble Union Finance Minister Smt. Nirmala Sitharaman garu has been instrumental in advancing key projects such as Polavaram, Amaravati capital development, and the Rayalaseema Global Horticulture Project.\"\nUNION BUDGET OPPORTUNITIES AND FUTURE PLANS\nThe Chief Minister’s Office also highlighted opportunities arising from the Union Budget, noting that under the Purvodaya initiative, Andhra Pradesh would leverage development prospects linked to the East Coast Industrial Corridor, tourism destinations and deployment of e-buses, while advancing the Rayalaseema Global Horticulture Hub.\nHe further said the state aims to maximise benefits from national initiatives such as Rare Earth Corridors, data centres, regional medical hubs, seaplane manufacturing, container manufacturing and the establishment of girls’ hostels in every district.\nReferring to new competitive project models, the Chief Minister’s Office mentioned, “The Union Budget 2026–27 has opened new opportunities for Andhra Pradesh through PPP and Challenge mode projects, promoting efficiency, innovation and competitive execution in public sector development.\"\nIt added that the state is prepared to compete for projects, including chemical parks, mega textile parks, city economic regions and university townships, with the Visakhapatnam Economic Region plan already prepared.\nLatest Blogs",
        "link": "https://www.news18.com/india/andhra-pradesh-budget-chandrababu-naidu-payyavula-keshav-andhra-state-assembly-health-family-welfare-ws-l-9902906.html",
        "date": "Sat, 14 Feb 2026 12:45:19 +0530",
        "fetched_at": "2026-02-15 03:26:46.851479"
    },
    {
        "title": "Maharashtra School Students Perform To Pakistani Military Song At Cultural Event, FIR Filed",
        "content": "A controversy erupted in Maharashtra’s Yavatmal district after students of a government-run Urdu school were allegedly made to perform to a Pakistani military song during a cultural programme, leading to police action against the school administration.\nAccording to multiple media reports, an FIR was registered against the headmaster and a teacher of Abdul Gafur Shah Municipal Urdu School No. 2 in Umarkhed town following a complaint over the performance held as part of a Republic Day-related cultural event.\nVideos from the programme, which surfaced on social media and were widely circulated in local groups, show students performing a choreographed dance while holding symbolic or mock swords.\nThe song playing in the background was believed to be “Ae Mard-e-Mujahid Teri Yalgaar Kahan Hai,\" described as a Pakistani patriotic or military-motivational anthem.\nVisuals seen in the viral clips show children dressed in stage costumes moving in formation, with the music played through loudspeakers and displayed on screens at the venue.\nThe performance appears to be part of a planned cultural presentation before an audience of parents and residents.\n[News18 chose not to share the video to protect the identities of the minors].\nThe videos triggered sharp reactions online after users alleged that the song had historical links to Pakistan’s armed forces.\nAs reported by The Times of India, BJP councillor Gopal Kalane filed a complaint stating that Class 6 students were dancing with symbolic swords to the song and that the performance hurt public sentiments and could negatively influence children.\nPolice subsequently registered an offence under Section 196(1)(c) of the Bharatiya Nyaya Sanhita, 2023, and launched an investigation.\nOfficials were quoted as saying that statements were being recorded and the role of school authorities in approving the programme was being examined.\nAuthorities were also probing how the song was selected and whether guidelines governing school functions were violated.\nThe school administration has not issued a detailed public statement so far.\nLatest Blogs",
        "link": "https://www.news18.com/india/maharashtra-yavatmal-school-students-perform-on-anti-india-songs-pakistani-military-song-viral-video-fir-registered-ws-l-9902787.html",
        "date": "Sat, 14 Feb 2026 11:01:10 +0530",
        "fetched_at": "2026-02-15 03:26:47.479355"
    },
    {
        "title": "'India Will Become Engine Of World Growth': PM Modi Highlights Nation's Agreements, Policy Shifts",
        "content": "Prime Minister Narendra Modi on Friday said India is poised to emerge as a major driver of global growth and a foundational force in the evolving world order, highlighting the country’s economic rise, reform agenda and technology-led transformation.\nAddressing the ET Now Global Business Summit 2026, PM Modi said the past decade had witnessed significant global upheavals, ranging from the pandemic to geopolitical tensions and supply chain disruptions, but asserted that India had turned challenges into opportunities.\n“The past decade of the 21st century has been disrupting the global pandemic. There is tension and war in different parts of the globe, and supply chain breakdowns are shaking the balance of the globe. The world has seen a lot in the past decade,\" he said.\nHe added that crises often reveal a nation’s true potential and said India had demonstrated resilience during this period.\n“I am very proud that in the midst of many disruptions, this decade has been a time of unprecedented development for India. It has been a time of great delivery and a time of strengthening democracy,\" the Prime Minister said.\nINDIA’S ECONOMIC RISE AND GLOBAL ROLE\nRecalling India’s economic position a decade ago, PM Modi said the country had moved steadily upward despite doubts about its trajectory.\n“When the last decade began, India was the 11th-largest economy. But today, India is rapidly becoming the third-largest economy in the world,\" he said.\nHe stressed that India would play a defining role in shaping global growth in the coming decades.\n“The century of change you are talking about, India is going to be a great foundation for it. India will drive the growth of the world. It will become a new engine for the growth of the world,\" he said.\nThe Prime Minister noted India currently contributes more than 16 per cent to global growth and expressed confidence that this contribution would continue to increase.\nNEW WORLD ORDER AND RESILIENCE\nPM Modi said the global order formed after the Second World War was transforming, as earlier assumptions about stable supply chains and uniform development models were breaking down.\n“The world is moving towards a new world order,\" he said, adding that the earlier system was based on a “one size fits all\" approach that is now losing relevance.\nHe said nations are increasingly focusing on building resilience, adding that India had adopted this vision early through the founding principles of NITI Aayog.\nFREE TRADE AGREEMENTS AND POLICY SHIFT\nThe Prime Minister said India’s free trade agreements were now widely discussed internationally, attributing the change to improved governance and clarity in policy.\n“There’s a lot of discussion these days about India’s FTAs. We are able to sign these trade deals because today’s India is full of self-confidence and ready to compete with the world,\" he said.\nHe said earlier policy uncertainty and governance challenges had weakened global confidence, but reforms had changed perceptions about India.\nREFORMS, TECHNOLOGY AND GOVERNANCE\nHighlighting reforms, PM Modi said his government had shifted policymaking towards outcomes rather than mere expenditure.\nHe described India as riding a “Reform Express,\" with technology and innovation serving as core drivers of growth. He cited the Unified Payments Interface (UPI) as a key example of reforms driven by conviction.\n“It’s not just an app; it’s a testament to the remarkable convergence of policy, process, and delivery,\" he said, adding that digital reforms had expanded financial inclusion.\nThe Prime Minister also highlighted increased capital expenditure, infrastructure investments and initiatives such as university townships, economic regions and high-speed rail corridors as steps aimed at strengthening productivity and employment.\nAI AND FUTURE PREPAREDNESS\nPM Modi underlined that artificial intelligence would bring transformative disruptions globally and said India was preparing itself for that future.\nReferring to the upcoming Global AI Impact Summit to be hosted in India, he said the gathering of world leaders and technology experts would help advance efforts toward building a better world.\nReaffirming the government’s long-term vision, PM Modi said India’s policies were guided by the goal of becoming a developed nation by 2047, stressing that decisions taken today were aimed at securing the future of coming generations.\nLatest Blogs",
        "link": "https://www.news18.com/india/pm-narendra-modi-global-business-summit-2026-global-growth-ai-transformation-free-trade-agreements-ws-l-9902719.html",
        "date": "Sat, 14 Feb 2026 09:26:41 +0530",
        "fetched_at": "2026-02-15 03:26:48.144429"
    },
    {
        "title": "Gangster Mukhtar Ansari’s Close Aide Shoaib Kidwai Shot Dead In UP's Barabanki",
        "content": "Shoaib Kidwai, alias Bobby, a known aide of slain gangster Mukhtar Ansari, was shot dead in broad daylight by unidentified motorcycle-borne assailants on the Ayodhya highway in Barabanki. The incident took took place on Friday afternoon near Asaini turn under the Kotwali area.\nShoaib Kidwai, a resident of the Civil Lines area in the district town, was travelling in a car from Lucknow to Barabanki when two motorcycle-borne assailants intercepted his vehicle and opened fire. He was rushed to a nearby hospital, where doctors declared him dead.\nKidwai was accused in several criminal cases, including murder, extortion, and gang-related offences.\nVIDEO | Barabanki, Uttar Pradesh: Shoaib Kidwai alias Bobby, a shooter associated with slain mafia don Mukhtar Ansari, shot dead by unidentified assailants in broad daylight. Visuals from the spot.#MukhtarAnsari(Full video available on PTI Videos – https://t.co/n147TvrpG7) pic.twitter.com/WvzHsIoWvD\n— Press Trust of India (@PTI_News) February 13, 2026\nKidwai’s name had earlier surfaced in the Lucknow jailer murder case, in which he was named as an accused by investigating agencies. Police said he had been facing multiple criminal cases and had long posed a law-and-order challenge.\nOfficials have indicated that early information points to potential internal rivalry and a gang war as the reasons behind the killing. This angle is also under investigation.\nIn response to the incident, security has been heightened throughout the district, with additional police personnel deployed in sensitive areas. Senior officers visited the crime scene and examined the location, while CCTV footage from nearby areas is being reviewed to identify the attackers.\nSuperintendent of Police Arpit Vijayvargiya mentioned that the initial investigation suggests the attack was premeditated. A forensic team has gathered evidence, and raids are underway to apprehend the suspects, he added.\nLatest Blogs",
        "link": "https://www.news18.com/india/gangster-mukhtar-ansaris-close-aide-shoaib-kidwai-shot-dead-in-ups-barabanki-ws-bl-9902096.html",
        "date": "Fri, 13 Feb 2026 19:23:52 +0530",
        "fetched_at": "2026-02-15 03:26:48.756436"
    },
    {
        "title": "End Of An Era: PM Modi Chairs Last Cabinet Meeting In South Block",
        "content": "Prime Minister Narendra Modi on Friday chaired the final meeting of the Union Cabinet at the South Block in New Delhi, marking the end of an era for the British-era Secretariat building.\nFollowing this meeting, the Prime Minister’s Office (PMO) officially shifted to a new complex, ‘Seva Teerth’, as part of the Central Vista redevelopment project.\nPHOTO | Delhi: PM Modi (@narendramodi) chairs the final Cabinet meeting at the South Block building, marking the end of operations at the premises.(Source: Third Party) pic.twitter.com/s1OUmJn0vW\n— Press Trust of India (@PTI_News) February 13, 2026\nSeveral Union Cabinet ministers, Ministers of State (independent charge) were present in the meeting, including:\nAmit Shah\nRajnath Singh\nNirmala Sitharaman\nS Jaishankar\nJP Nadda\nManohar Lal Khattar\nPiyush Goyal\nJitan Ram Manjhi\nKinjarapu Rammohan Naidu\nShivraj Singh Chouhan\nHD Kumaraswamy\nDharmendra Pradhan\nGajendra Singh Shekhawat\nPralhad Joshi\nThe cabinet meeting was followed by the PMO’s relocation to ‘Seva Teerth’. This marked the end of an era, as all government departments vacated the North and South blocks — the seat of power since 1921.\nThe North and South blocks have been the seat of power in the country since 1921. Earlier, the Home Ministry had moved out of the North Block complex at Raisina Hills in Lutyens’ Delhi.\nPrime Minister Narendra Modi on Friday inaugurated the Seva Teerth complex, the new Prime Minister’s Office (PMO), marking the end of nearly 80 years of operations from South Block at Raisina Hill in New Delhi.\nThis is the first time the PMO has shifted out of South Block, marking a historic administrative transition after nearly eight decades. Since Independence in 1947, the PMO had operated from South Block, part of the British-era Secretariat complex designed by Edwin Lutyens and Herbert Baker.\nThe Seva Teerth complex comprises three structures:\nSeva Teerth-1: Houses the PMO with modern workspaces and ceremonial meeting halls.\nSeva Teerth-2: Occupied by the Cabinet Secretariat.\nSeva Teerth-3: Will host the National Security Council Secretariat and the Office of the National Security Advisor.\nSeva Teerth features open-plan interiors, encrypted communications systems, advanced security frameworks and integrated administrative spaces aimed at improving coordination.\nThe North and South Blocks would be transformed into the world’s largest museum.\nThe Yuge Yugeen Bharat National Museum is a landmark project designed to document over 5,000 years of Indian civilisational history. Spanning a massive 1.55 lakh square metres, it is set to surpass the British Museum and the Louvre in scale. The name itself, “Yuge Yugeen Bharat\", translates from Sanskrit as “everlasting India,\" reflecting the nation’s unbroken heritage from the Vedic period to the digital age.\nLatest Blogs",
        "link": "https://www.news18.com/india/end-of-an-era-pm-modi-chairs-last-cabinet-meeting-in-south-block-ws-l-9901954.html",
        "date": "Fri, 13 Feb 2026 19:17:44 +0530",
        "fetched_at": "2026-02-15 03:26:49.409303"
    },
    {
        "title": "India Is Shaping Next Technological Revolution: Mauritius Minister On AI Impact Summit 2026",
        "content": "New Delhi is all set to host the India–AI Impact Summit 2026, announced by Hon’ble Prime Minister Narendra Modi at the France AI Action Summit, the first time in the Global South, from February 16-20.\nThe Summit charts a path towards a future where the transformative power of AI serves humanity, drives inclusive growth, fosters social development, and promotes people-centric innovations that protect our planet. It also seeks to amplify the voice of the Global South, ensuring that technological advancements and opportunities are shared broadly, not concentrated in a few regions.\nWith Prime Minister of Mauritius Navinchandra Ramgoolam set to participate, News18 spoke to Jyoti Jeetun, Mauritian Minister of Financial Services and Economic Planning.\nEdited excerpts:\nQ: India is hosting the AI Action Summit for the first time in the Global South. With Mauritius Prime Minister Dr Navinchandra Ramgoolam attending, how do you see Mauritius aligning with India’s AI vision? Can we expect deeper collaboration in areas like FinTech and digital services?\nA: India’s leadership in hosting the AI Action Summit for the Global South is both timely and visionary. We commend Prime Minister Narendra Modi and the Government of India for taking this initiative. The participation of our Prime Minister, Navinchandra Ramgoolam, underscores Mauritius’ strong commitment not only to artificial intelligence but also to strengthening our strategic partnership with India.\nIndia has long been a global technology leader. Its IT services exports, skilled technology professionals, and the presence of Indian-origin CEOs leading major global tech firms reflect its technological depth. It is only natural that India is now shaping the next technological revolution through AI.\nMauritius sees significant scope for collaboration in AI-driven financial services, FinTech innovation, digital governance, and cross-border digital infrastructure. We are keen to align with India’s digital transformation journey and explore joint initiatives that can benefit both our economies as well as the wider Global South.\nQ: Mauritius is often described as a gateway to Africa. How can India and Mauritius collaborate on trilateral initiatives involving Africa, especially in trade, financial services and technology?\nA: Mauritius is strategically positioned between India and Africa, both geographically and economically. We are a member of the African Union, COMESA and SADC, and we share deep historical and economic ties with India.\nIndia is one of the fastest-growing major economies in the world. On the other hand, Africa represents a continent of 1.4 billion people, and notably, 15 of the 25 fastest-growing economies last year were in Africa. This signals tremendous opportunity.\nMauritius offers a stable, transparent and well-regulated financial ecosystem that can serve as a bridge for Indian companies seeking expansion into Africa. We provide legal certainty, financial structuring expertise, and a professional services ecosystem that supports cross-border investments.\nWith the African Union now a permanent member of the G20 — inducted under India’s presidency — the potential for structured India-Africa engagement has become even stronger. Mauritius can play a catalytic role in enabling that partnership.\nQ: Mauritius has traditionally been seen as a tax-efficient jurisdiction for investments into India. How are you positioning the country today as a financial centre?\nA: Mauritius’ financial services sector has been built and consolidated over the past three decades. Today, we are ranked first in Africa in the Global Financial Centres Index (GFCI), reflecting the strength and credibility of our financial ecosystem.\nOur financial centre is built on substance, governance, regulatory rigour and quality. For decades, Mauritius has been among the largest sources of foreign direct investment into India, reflecting mutual trust and structured engagement.\nWe continue to enhance economic substance requirements, compliance standards and regulatory oversight. Governance and transparency are ongoing priorities, and we are committed to strengthening them further in partnership with global counterparts.\nQ: Following India’s recent tax scrutiny after the Tiger Global Management case, some foreign investors are reassessing structures routed through Mauritius. Should investors be concerned? How is Mauritius responding?\nA: It would not be appropriate for me to comment on specific judicial rulings. However, what I can say is that Mauritius has proactively strengthened its regulatory and economic substance framework over the past several years.\nOur financial sector today is robust, stable and well-regulated. We offer a strong ecosystem of experienced professionals, legal certainty, and a transparent regulatory environment.\nWe recognise that the global financial landscape is evolving, and Mauritius is continuously adapting to meet new standards and expectations. We are committed to ongoing reforms and engagement with international partners to ensure that investors continue to see Mauritius as a stable and credible financial jurisdiction.\nI would reassure investors that Mauritius is focused on reinvention, resilience and long-term sustainability.\nLatest Blogs",
        "link": "https://www.news18.com/india/india-is-shaping-next-technological-revolution-mauritius-minister-on-ai-impact-summit-2026-ws-kl-9902016.html",
        "date": "Fri, 13 Feb 2026 19:57:14 +0530",
        "fetched_at": "2026-02-15 03:26:50.038042"
    },
    {
        "title": "DGCA Imposes Rs 1 Crore Penalty On Air India For Flying Airbus Without Airworthiness Permit",
        "content": "Aviation watchdog Directorate General of Civil Aviation (DGCA) has imposed a penalty of $110,350 (around Rs 1 crore) for operating an Airbus aircraft on eight flights without a valid airworthiness permit, according to a confidential order issued earlier this month, news agency Reuters reported.\nAn Airbus A320 flew passengers between New Delhi, Bengaluru, Mumbai, and Hyderabad on November 24 to 25 without the mandatory Airworthiness Review Certificate, or ARC, a key permit issued annually by the regulator after a plane passes safety and compliance checks.\nAs per the order dated February 5, 2026, issued to Air India CEO Campbell Wilson, Joint Director General of Civil Aviation Maneesh Kumar noted that the security lapse had “further eroded public confidence and adversely impacted the safety compliance of the organisation.\"\nAn internal investigation conducted by Air India described the incident as a result of “systemic failures\" and acknowledged the urgent need to strengthen its compliance culture. The probe also reportedly blamed pilots who operated the eight flights, saying they did not follow standard operating procedures before take-off, the news agency reported.\nThe regulator held the airline’s accountable manager responsible for the breach and directed the carrier to deposit the penalty within 30 days.\nMeanwhile, Air India responded to the DGCA order and said that all flaws have been satisfactorily addressed and shared with the authority.\n“Air India acknowledges the receipt of a DGCA order in relation to an incident that was voluntarily reported back in 2025. All identified gaps have since been satisfactorily addressed and shared with the authority.\nAir India remains unwavering in its commitment to maintaining the highest standards of operational integrity and safety,\" an Air India spokesperson said.\nThe airline has faced increased scrutiny over safety practices in recent months. It had earlier received warnings from the watchdog for operating aircraft without checking emergency equipment and for other audit lapses.\nThe latest penalty came months after Air India suffered its worst disaster on June 12 after a London-bound Boeing Dreamliner, carrying 242 passengers and crew, including former Gujarat chief minister Vijay Rupani, crashed into a medical college complex shortly after taking off from Ahmedabad’s Sardar Vallabhbhai Patel International Airport. 275 people lost their lives, including 120 men, 124 women, and 16 children.\n(With inputs from Reuters)\nLatest Blogs",
        "link": "https://www.news18.com/india/aviation-watchdog-imposes-rs-1-crore-penalty-on-air-india-over-safety-lapses-report-9901838.html",
        "date": "Fri, 13 Feb 2026 18:59:53 +0530",
        "fetched_at": "2026-02-15 03:26:50.647728"
    },
    {
        "title": "Elephant Tusks Worth Rs 2 Crore Stolen From A Military Camp In Kerala",
        "content": "The Poojappura police have registered a theft case after two elephant tusks, estimated to be worth over Rs 2 crore, were reported missing from the high-security Pangode Military Camp in the Kerala capital.\nAccording to the complaint, the tusks were allegedly stolen from within the camp premises. A case has been filed under Sections 331(4) and 305(e) of the Bharatiya Nyaya Sanhita (BNS).\nPolice suspect the involvement of a person who had entered the camp premises to organise a DJ party. However, officials said details surrounding the theft remain unclear.\n“We currently don’t have any information about the theft. We are gathering the information,\" the Defence PRO told Onmanorama.\nA detailed investigation has been launched to determine how the tusks went missing from the tightly secured defence establishment.\nPangode Military Camp, located in Thirumala in Thiruvananthapuram, functions under the Southern Command of the Indian Army. The base conducts key training activities and hosts joint military exercises. Known for its strict access controls, the camp is considered one of Kerala’s major defence installations.\nLatest Blogs",
        "link": "https://www.news18.com/india/elephant-tusks-worth-rs-2-crore-stolen-from-a-military-camp-in-kerala-ws-el-9899842.html",
        "date": "Fri, 13 Feb 2026 15:45:00 +0530",
        "fetched_at": "2026-02-15 03:26:51.425627"
    },
    {
        "title": "'Matter Of Pride': UP Deputy CM Keshav Prasad Maurya Praises Govt's Vande Mataram Directive",
        "content": "Uttar Pradesh Deputy Chief Minister Keshav Prasad Maurya on Friday welcomed the Union Home Ministry’s directive mandating the singing of all six verses of the national song, Vande Mataram, before the national anthem, calling it a “matter of pride.\"\nSpeaking to news agency ANI, Maurya said, “Vande Mataram has been notified in the gazette; now all Indians should sing Vande Mataram as the national song. This is a matter of pride, and I congratulate the Home Minister for this.\"\nBJP MP Sudha Murthy also expressed support, stating, “I like Vande Mataram and Jana Gana Mana.\"\nThe reactions follow the Union Ministry of Home Affairs (MHA) releasing detailed guidelines for the national song, stating that when both the national song and the national anthem are performed at an event, all six stanzas of the official version of Vande Mataram must be presented first.\nEarlier on Thursday, Madhya Pradesh Chief Minister Mohan Yadav welcomed the directive, saying the state government would implement it immediately. Speaking to reporters, CM Yadav said, “I not only approve of the decision by the Home Ministry, under the leadership of the Prime Minister, to sing six verses of Vande Mataram before Jana Gana Mana, but also I feel joy that this decision by our Prime Minister will bring the entire nation together with us to remember all those who sacrificed their lives for the country before independence. We are fortunate that the Prime Minister has decided to sing the entire Vande Mataram. The Madhya Pradesh government also supports this decision, and we will implement it immediately in our state.\"\nMadhya Pradesh School Education Minister Uday Pratap Singh also praised the move, noting its potential to inspire nationalism among future generations. He said, “I believe this auspicious day has arrived quite late. The work that should have been done years ago has now been carried out by Prime Minister Modi. I proudly say that this decision will become a major role to inspire a sense of nationalism among the coming generations in India. I thank Prime Minister Modi from the bottom of my heart, and I feel proud that a decision which should have been taken much earlier was implemented during his tenure.\"\nOn implementation in schools, Singh added, “Most schools and institutions follow this on their own, but I believe that when something becomes law, it naturally becomes mandatory for every institution and school to implement it. I would say this is a very good decision.\"\nThe move has received widespread support, with leaders hailing it as a step toward fostering national pride and unity.\nLatest Blogs",
        "link": "https://www.news18.com/india/matter-of-pride-up-deputy-cm-keshav-prasad-maurya-praises-govts-vande-mataram-directive-ws-l-9901187.html",
        "date": "Fri, 13 Feb 2026 15:06:31 +0530",
        "fetched_at": "2026-02-15 03:26:52.132189"
    },
    {
        "title": "Ministers Assert India-US Trade Deal Safeguards Farmers' Interests, Call Rahul Gandhi 'Habitual Liar'",
        "content": "Prime Minister Narendra Modi has always been in favour of the farmers and continues to prioritise their welfare in international trade agreements, said Union Minister of Agriculture and Farmers Welfare, Shivraj Singh Chouhan.\nTaking to X, Chouhan said, “Prime Minister Narendra Modi has always been in favour of the farmers. All his decisions have been taken in favour of the farmers. His plans have changed their lives.\"\nTalking about the recent trade agreement signed with the United States, the Union Minister said that the deal is designed to protect the interests of the domestic agricultural sector.\nChouhan noted that the Prime Minister’s decisions consistently aim to improve the lives of those in the farming community through strategic planning and policy shifts.\nThe Agriculture Minister emphasised that the agreement specifically addresses the needs of farmers who produce various staples. “The farmers who produce grains like wheat, rice, corn, soya and other grains have been taken care of,\" Chouhan said.\nआदरणीय प्रधानमंत्री श्री @narendramodi जी के नेतृत्व में देश का अन्नदाता सुरक्षित भी है, समर्थ भी है और सशक्त भी है। pic.twitter.com/I79m3TsV27— Shivraj Singh Chouhan (@ChouhanShivraj) February 12, 2026\nHe further explained that the deal ensures protection for those involved in different segments of the industry. According to the Minister, “The farmers who produce fruits and vegetables have also been protected in this agreement.\"\nTalking about the exposure to the international market, Chouhan said that beyond spices, several other commodities are expected to benefit from increased international exposure. “Spices, coffee, tea, marine products, and many other things will get a new market,\" he said.\nUnion Minister Dharmendra Singh Pradhan also talked about PM Modi’s visionary leadership and said that “India will never compromise on the interests of our ‘Annadatas’.\"\n“Farmers’ interests are fully protected, dairy and poultry are safeguarded, and exports are expanding, directly strengthening livelihoods,\" Pradhan said, adding, “On the global stage, India has delivered a historic win by securing duty-free access to the US for garment and textile exports, injecting fresh momentum into industry, manufacturing, and India’s global economic presence.\nUnder the visionary leadership of Prime Minister Shri Narendra Modi, India will never compromise on the interests of our ‘Annadatas’.Farmers’ interests are fully protected, dairy and poultry are safeguarded, and exports are expanding, directly strengthening livelihoods.\nOn the…\n— Dharmendra Pradhan (@dpradhanbjp) February 13, 2026\nIn addition to this, the Minister also slammed Rahul Gandhi and Congress party for spreading misinformation, theatrics, and divisive politics.\nAccusing the Congress of doing nothing to address the real concerns of our farmers, Pradhan attacked them for repeatedly tying to downplay India’s global achievements. “Their politics thrives not on solutions, but on denial, distortion, and manufactured outrage,\" he added.\nUnion Commerce Minister Piyush Goyal also on Thursday hit out at Congress leader Rahul Gandhi, calling him a “habitual liar\" and accusing him of misleading farmers with what he termed a “fake narrative\" regarding the recent trade agreement with the United States.\nIn a self-made video posted on X, Goyal alleged that Rahul Gandhi had “broken all records of speaking falsehood\" and made “baseless allegations\" in a video released earlier in the day.\nAnnadata Devo Bhava!Under PM @NarendraModi ji’s leadership, our farmers will always be secure, empowered, and prosperous. pic.twitter.com/tkUCHCsa7w\n— Piyush Goyal (@PiyushGoyal) February 12, 2026\nHe further accused the Congress leader of attempting to provoke farmers.\n“Rahul Gandhi is a habitual liar…In a video released today, he has broken all records of speaking falsehood and made baseless allegations. He is misleading our farmers with his fake narrative and trying to provoke them,\" he said.\n“Prime Minister Narendra Modi has always been empathetic towards our farmers. He has always put the interest of farmers first and taken all decisions to ensure their prosperity…In the recent trade deal with the United States of America, the interests of farmers have been kept paramount and fully protected…,\" Goyal said in the video.\nLatest Blogs",
        "link": "https://www.news18.com/india/bjp-asserts-india-us-trade-deal-safeguards-farmers-interests-calls-rahul-gandhi-habitual-liar-9900922.html",
        "date": "Fri, 13 Feb 2026 16:08:56 +0530",
        "fetched_at": "2026-02-15 03:26:52.746185"
    },
    {
        "title": "Minister Ashish Shelar Receives UNESCO World Heritage Certificate For 12 Marata Forts",
        "content": "Maharashtra’s Cultural Affairs Minister, Ashish Shelar, has formally received the UNESCO World Heritage certificate recognising twelve forts associated with Chhatrapati Shivaji Maharaj. The certificate was accepted at the UNESCO headquarters in Paris, marking the completion of a long process that brought global recognition to the historic Maratha military network.\nThe forts were inscribed last year under the title ‘Maratha Military Landscapes of India’ during the 47th session of UNESCO held on July 11, 2025. After technical presentations and follow-up documentation by the Maharashtra government delegation, the official recognition document has now been handed over. Officials described it as an important cultural moment not only for the state but for the country’s historical legacy.\nMaharashtra Chief Minister, Devendra Fadnavis, also expressed joy over the development.\nA moment of joy and pride !The official certificate declaring 12 forts of Chhatrapati Shivaji Maharaj as UNESCO World Heritage Sites was formally handed over to Cultural Affairs Minister Ashish Shelar.\nThe recognition marks a historic and emotional moment for the people of…\n— Devendra Fadnavis (@Dev_Fadnavis) February 12, 2026\nThe group includes Raigad, Rajgad, Pratapgad, Panhala, Shivneri, Lohgad, Salher, Sindhudurg, Suvarnadurg, Vijaydurg, Khanderi and Gingee Fort in Tamil Nadu. Built across mountains and coastline, these forts formed a strategic defence system during Shivaji Maharaj’s rule. Historians regard the network as a unique example of military planning combined with governance and public welfare.\nThe state government said the recognition places India’s indigenous fort architecture on the global heritage map. During his visit, Shelar also paid tribute to B. R. Ambedkar at the UNESCO premises, where Maharashtra had installed his bust on Constitution Day last year. The memorial symbolises values of equality, education, and social justice, which align with UNESCO’s ideals.\nCalling the honour emotional and historic, the minister thanked national and state leadership for support throughout the nomination process. Officials present at the ceremony included India’s Permanent Representative to UNESCO, Vishal Sharma, and senior officers from the cultural and archaeology departments. The state government said the recognition will help conservation efforts and increase global awareness of Maharashtra’s heritage. For many in the state, the acknowledgement is seen as a tribute to Shivaji Maharaj’s vision and a reminder of the region’s enduring historical identity.\nTourism officials believe the World Heritage status will encourage responsible tourism while ensuring better preservation of the forts. Plans are being discussed to improve visitor facilities, signage, and guided interpretation without disturbing the original structures. Conservation experts say global recognition also brings stricter monitoring standards, which will help protect the sites from damage and unplanned development. For local communities living around the forts, the move is expected to create livelihood opportunities through heritage tourism and cultural activities.\nLatest Blogs",
        "link": "https://www.news18.com/india/minister-ashish-shelar-receives-unesco-world-heritage-certificate-for-12-marata-forts-ws-bl-9900495.html",
        "date": "Fri, 13 Feb 2026 12:16:12 +0530",
        "fetched_at": "2026-02-15 03:26:53.431367"
    },
    {
        "title": "Maharashtra Govt Unveils Multi-Sector Plan To Make Mumbai ‘Drug-Free And World-Class’",
        "content": "The Maharashtra government has announced a broad plan to improve living conditions in Mumbai, aiming to turn the city into what it described as a “drug-free and world-class\" urban centre. Deputy Chief Minister Eknath Shinde shared the roadmap after a meeting of the Mumbai City District Planning Committee on Wednesday.\nThe government said that the new approach will combine health, housing, civic works and enforcements measures at the same time. The coordinated action will bring quicker and more visible results for residents.\nOne major focus is tackling substance abuse. Every municipal hospital will open de-addiction, counselling and rehabilitation facilities under a city-wide anti-drug campaign. Authorities will also push stalled housing schemes and speed up cluster redevelopment, while continuing work on large affordable housing projects across Mumbai.\nWith monsoon approaching, civic agencies have been instructed to complete road repairs, desilting of drains and flood prevention work.\nThe Maharashtra Deputy CM said that the first phase of concrete roads has already been finished and the second phase is nearing completion, with the next phase to start soon.\n📍 #मुंबई |मुंबई शहर जिल्हा नियोजन समितीची बैठक आज जागतिक व्यापार केंद्रातील नियोजन समिती कक्षात पार पडली. या बैठकीत वर्ष २०२६ -२७ साठी वाढीव मागण्यांसह ८१३ कोटी ३५ लाख ७२ हजार रकमेच्या प्रारूप आराखड्यास मंजुरी देण्यात आली.\nयात प्रामुख्याने मुंबईला ड्रग्स-फ्री, झोपडपट्टीमुक्त… pic.twitter.com/ygXkEQkq0s\n— Eknath Shinde – एकनाथ शिंदे (@mieknathshinde) February 12, 2026\nWaterlogging points will get pumping systems, holding ponds will remain operational and damaged asphalt roads will be repaired.\nEncroachments on footpaths will be cleared through a special drive to improve pedestrian safety. At the same time, authorities have been told to consider the livelihoods of those affected.\nTraffic congestion near railway stations and markets will be addressed through coordination between multiple agencies. Mobile toilets and women-only “pink toilets\" will be placed in crowded areas, and maintenance of public toilets will be tightened.\nThe plan also includes pollution control measures. Construction sites, both private and government, will have to use sprinklers and protective netting to reduce dust and improve air quality.\nIn healthcare, the government aims to widen coverage under the public health scheme to include expensive treatments such as angiography and stent procedures. Hospitals have been directed to ensure medicines are provided free to patients after inspections found some were still purchasing them outside facilities.\nPolice and district authorities have additionally been instructed to identify illegal foreign nationals and take legal action where required.\nShinde said the government wants to provide immediate relief while also planning long-term improvements so that the city becomes cleaner, safer and better prepared through coordinated efforts rather than isolated projects.\nFor Mumbaikars, the announcement raises cautious hope. Many of these promises have been made before, but citizens say the real test will be daily experience — cleaner streets, smoother travel, and reliable public services. If departments work together and deadlines are met, the impact could be visible quickly. Otherwise, it risks becoming another plan on paper. The government now faces the challenge of turning intent into visible change across neighbourhoods.\nLatest Blogs",
        "link": "https://www.news18.com/india/maharashtra-govt-unveils-multi-sector-plan-to-make-mumbai-drug-free-and-world-class-ws-l-9900449.html",
        "date": "Fri, 13 Feb 2026 11:25:54 +0530",
        "fetched_at": "2026-02-15 03:26:54.080653"
    },
    {
        "title": "Telangana Local Body Election Results Live: Congress Crosses 900-Mark, BRS Leads On 521 Seats; BJP Trailing",
        "content": "Telangana Municipal Election Results 2026 Live Updates: Counting of votes for elections in 116 municipalities and seven municipal corporations in Telangana began on Friday, marking a key test of popularity for the ruling Congress, opposition BJP and BRS.\nCongress has crossed the 900-mark in overall leads and wins, consolidating a strong position in the early trends. Meanwhile, BRS is leading on 521 seats, the BJP on 174, and other parties and independents on 169 seats, indicating a decisive edge for Congress in the ongoing count.\nAhead of the counting, major parties moved their candidates to undisclosed locations to prevent poaching by rivals, according to PTI sources. Counting is being conducted at 123 centres across the state since 8 am. The process is expected to take time, as ballot papers were used in these elections. Voting took place on February 11.\nThe State Election Commission (SEC) stated that adequate security arrangements have been made to ensure peace and order. Section 163 of the BNSS (prohibitory orders) is in force around the counting centres.\nDirector General of Police (DGP) B Shivadhar Reddy said that comprehensive security measures are in place. Nearly 12,000 police personnel, supported by armed forces and Quick Response Teams, have been deployed to maintain law and order during the counting. Follow for live updates.\nTotal seats: 60\nTotal municipalities-19\nAs per the data announced by Telangana State Election Commission, Congress has won Yellandu, Aswaraopeta, Parakala, Dharmapuri, Korutla, Station Ghanpur, Bhupalapally, Yellareddy, Banswada, Bichkunda, Huzurabad, Choppadandi, Edulapuram, Wyra, Madhira, Kalluru, Sattupalli, Luxettipet, Chennur, Dornakal, Maripeda, Bhoothpur, Chevella, Shadnagar, Shankarpally, Kodangal, Tandur, Atmakur, Pebbair, Wanaparthy, Kalwakurthy, Kollapur, Nagarkurnool, Chandur, Chityal, Devarakonda, Haliya, Miryalguda, Nandikonda, Huzurnagar, Kodada, Neredcherla and Suryapet municipalities.\nAs of 6 pm, Telangana State Election Commission has announced results of 2,836 Wards. Check party wise result:\nTotal – 34\nTotal -24\nOut of the 2,996 Wards, Telangana State Election Commission has announced the results of 2,774 wards. Check party wise result below.\nTotal seats 30, check party wise results below:\nIn the Kothagudem Municipal Corporation, CPI emerged as the largest party with 21 seats, followed by Congress with 17, while BRS won six, Independents five, and BJP one.\nCongress is leading in Ramagundam, Nalgonda and Manchirial Corporations as counting of votes are underway.\nCongress has crossed the 900-mark in overall leads and wins, consolidating a strong position in the early trends. Meanwhile, BRS is leading on 521 seats, the BJP on 174, and other parties and independents on 169 seats, indicating a decisive edge for Congress in the ongoing count.\nIn Vikarabad district, results have been declared for 41 out of 100 wards across four municipalities, including seats decided unanimously. Congress emerged ahead with 20 wards, followed by BRS with 14. BJP secured 3 wards, while AIMIM and Independent candidates won 2 wards each.\nTelangana Congress leaders celebrated at the party office in Nampally, Hyderabad, distributing sweets, bursting crackers, beating drums and dancing as early trends in the municipal election results boosted their morale. Expressing confidence of securing more seats, party workers rejoiced after the State Election Commission announced that Congress had won 240 of the 448 Municipal Corporation wards declared so far.\n#WATCH | Telangana Congress leaders distribute sweets, burst crackers, beat drums and dance as they celebrate at the party office in Nampally, Hyderabad, expressing confidence that they will win more seats in today’s municipal election results.\nAs per the State Election… pic.twitter.com/1wOnuSyFEd\n— ANI (@ANI) February 13, 2026\nEarly trends indicate that Congress has crossed the 600-mark in total seats, establishing a strong lead. Meanwhile, BRS is ahead on 350 seats, and the BJP is leading in 102 seats, reflecting a competitive contest across several municipalities and wards in the state.\nSo far, Congress has secured victories in 27 municipalities, while BRS won in four, reflecting a strong lead for the ruling party in the local polls.\nEarly trends show that Congress has crossed the 430-mark in total seats, while BRS leads on 250 seats. The BJP is ahead on 64 seats, indicating a competitive race among the major parties.\nCongress has won Aswaraopeta Municipality in Bhadradri Kothgudem district of Telangana.\nCongress has won Nandikonda Municipality in Nalgonda district of Telangana.\nCongress has won ward number 15 in Sangareddy.\nBRS has won ward number 12 in Ibrahimpatnam Municipality with a margin of 100 votes.\nIn Sangareddy District, BRS emerged victorious in the Gaddapotharam Municipality elections, winning 14 seats, while Congress secured 3 seats and an independent candidate won 1 seat.\nRajanna Sircilla in-charge Collector Garima Agrawal inspected the ongoing municipal vote counting process, overseeing arrangements to ensure a smooth and orderly procedure.\nDirector General of Police B Shivadhar Reddy stated that robust security measures have been implemented for the vote counting. Around 12,000 police personnel, supported by Quick Response Teams, have been deployed at the counting centres, and prohibitory orders are in effect in and around these areas to ensure law and order, PTI reported.\nIn Warangal District’s Wardhannapet, counting of votes for the municipal elections is currently underway. Visuals have emerged from the counting centre. The police and Election Commission have put in place security and logistical arrangements to ensure the process is conducted smoothly and in an orderly manner.\n#WATCH | Telangana: Counting of votes for Municipal election is underway in Wardhannapet, Warangal District. The Police and Election Commission have made arrangements for the counting of votes at the centres. pic.twitter.com/ap8oW61TZH\n— ANI (@ANI) February 13, 2026\nThe counting of votes for elections in 116 municipalities and seven municipal corporations in Telangana began on Friday.\nLatest Blogs",
        "link": "https://www.news18.com/india/telangana-municipal-elections-results-2026-ts-local-body-polls-vote-counting-winners-list-telangna-election-commission-latest-news-liveblog-ws-l-9900279.html",
        "date": "Fri, 13 Feb 2026 19:30:40 +0530",
        "fetched_at": "2026-02-15 03:26:55.001341"
    },
    {
        "title": "MK Stalin's Big Pre-Poll Move: Rs 5,000 Each For 1.3 Crore Women Under Kalaignar Scheme",
        "content": "Tamil Nadu Chief Minister MK Stalin on Friday announced the disbursal of Rs 5,000 to women beneficiaries under the Kalaignar Women’s Rights Scheme, describing it as part of his government’s ongoing commitment to women’s welfare.\nIn a post on X, Chief Minister Stalin emphasised that the payments, covering February, March, and April, include Rs 3,000 as the standard monthly allocation and an additional Rs 2,000 as a “summer special\" bonus. He stated that the funds have already been credited to 1.31 crore women under the scheme.\nதமிழ்நாட்டு மகளிருக்கு இந்த ஸ்டாலின் தந்த உறுதிமொழிதான் உரிமைத்தொகை. யார் தடை ஏற்படுத்தினாலும் அதிலிருந்து பின்வாங்க மாட்டேன்.தேர்தலைக் காரணம் காட்டி, மூன்று மாதங்களுக்கு உரிமைத்தொகையை முடக்கப் பார்க்கிறார்கள். முந்திக்கொண்டது நமது #DravidianModel அரசு!\nபிப்ரவரி, மார்ச்,… pic.twitter.com/n7VrMqcrb7\n— M.K.Stalin – தமிழ்நாட்டை தலைகுனிய விடமாட்டேன் (@mkstalin) February 13, 2026\n“This promise given by this Stalin to Tamil Nadu women is the rights allocation. No matter who imposes obstacles, I will not back down from it. Using elections as an excuse, they are trying to stall the rights allocation for three months. What was promised was by our #DravidianModel government! As advance for February, March, April months: ₹3 thousand + as summer special allocation: ₹2 thousand!,\" he tweeted.\nStalin described the scheme as a hallmark of the Dravidian Model government, asserting that attempts to delay the disbursement by three months, allegedly citing elections as an excuse, would not deter his administration. “No matter who imposes obstacles, I will not back down from it,\" he wrote, highlighting his commitment to the programme.\nThe DMK leader also promised that in the proposed Dravidian Model 2.0, the monthly rights allocation would increase from Rs 1,000 to Rs 2,000, reinforcing his focus on expanding financial support to women. He concluded the post with a message of solidarity and electoral confidence, urging women to support the party in the upcoming assembly elections.\nThe tweet comes ahead of the Tamil Nadu assembly elections scheduled later this year, with Stalin’s government seeking to highlight welfare measures targeted at women as a key campaign plank.\nTamil Nadu Congress Chief Vows To Protect Scheme\nSelvaperunthagai K, President of the Tamil Nadu Congress Committee, welcomed the increase in monthly assistance for women household heads, noting that 1.31 crore families will benefit from the move.\nமகளிர் குடும்பத் தலைவர்களுக்கான மாதாந்திர உதவித் தொகை உயர்வு அறிவிப்பு மகிழ்ச்சி அளிக்கிறது.இதனால் தமிழ்நாடு முழுவதும் 1.31 கோடி குடும்பங்கள் நேரடியாகப் பயன் பெற உள்ளன.\nகடந்த மாதம் தமிழர் திருநாளான பொங்கல் முன்னிட்டு ஒரு குடும்பத்திற்கு ரூ.3,000 வழங்கப்பட்டதும், தற்போது…\n— Selvaperunthagai K (@SPK_TNCC) February 13, 2026\nIn a post on X, Selvaperunthagai wrote, “The announcement of the monthly assistance amount increase for women household heads brings joy. As a result, 1.31 crore families across Tamil Nadu will directly benefit. Last month, ahead of the Tamil harvest festival of Pongal, Rs 3,000 was provided per family, and now this month, with Rs 5,000 being provided under the women’s rights scheme, families will receive a total of Rs 8,000 in consecutive months, bringing about real change in the lives of families. This will serve as true relief for poor and middle-class families struggling under the burden of rising prices.\"\nHe praised the move as recognition of women’s labor and self-reliance, while accusing the Union government of attempting to “obstruct this people-welfare scheme.\"\n“We cannot accept this trend of disregarding state rights and the welfare of the people. The Tamil Nadu Congress Committee will firmly safeguard this scheme that ensures social justice and human compassion,\" he further wrote.\nCommentator Sumanth Raman Targets Tamil Nadu Govt Over Cash Scheme\nCommentator Sumanth Raman criticised the Tamil Nadu government over its announcement of Rs 2,000 for “summer expenses,\" questioning the timing ahead of elections. In a post on X, he alleged that the financial assistance amounted to voter inducement.\n“A Govt that claims to have transformed Tamil Nadu and fulfilled most of its promises has to resort to what is effectively a bribe to the voters before the elections. Rs 2000 for Summer expenses? What next? Monsoon expenses and Winter expenses?\" Raman wrote in a post on X.\nHe also pointed out that with Rs 3,000 given for Pongal and now Rs 2,000 for summer expenses, nearly Rs 10,000 crore is being distributed, suggesting the move is linked to the upcoming polls.\n“How is this any different from the BJP bribing Bihar voters with Rs 10,000 before the elections? Rs 3,000 for Pongal expenses and now Rs 2000 for summer expenses? Almost Rs 10,000 crore being distributed because elections are coming,\" he further wrote.\nLatest Blogs",
        "link": "https://www.news18.com/india/stalin-credits-rs-5000-to-1-3-crore-women-under-kalaignar-scheme-promises-hike-in-allocation-ws-l-9900228.html",
        "date": "Fri, 13 Feb 2026 09:08:04 +0530",
        "fetched_at": "2026-02-15 03:26:55.623497"
    },
    {
        "title": "Can You Be Penalised For Playing Loud Music On A Flight? Here's What Government Says",
        "content": "Playing loud music on an aeroplane without earphones may lead to penal action if such actions lead to unruly behaviour under aviation rules. Replying to a question raised in the Lok Sabha by Namakkal MP Matheshwaran, Minister of State for Civil Aviation Murlidhar Mohol said the action will be taken as per the Civil Aviation Requirements (CAR) issued by the DGCA.\nThe Directorate General of Civil Aviation (DGCA) issued CAR to deal with unruly passengers.\nWithout indicating any new penal provisions for people playing loud music on the aircraft, the minister clarified that the airlines provide in-flight entertainment and play soft instrumental music during boarding and disembarkation.\nHe further highlighted Rules 22, 23, and 29 of the Aircraft Rules of 1937 that cover disruptive behaviour on board an aircraft.\nRule 22 deals with refusal of carriage and disembarkation of passengers, Rule 23 empowers the pilot-in-command to restrain persons acting in a manner prejudicial to safety or good order, and Rule 29 provides for penalties for contravention of the Aircraft Rules.\nThe minister also responded to a query related to vlogging inside an aeroplane and underscored Rule 13 of the Aircraft Rules which restricts photography at DGCA-licensed aerodromes.\nLatest Blogs",
        "link": "https://www.news18.com/india/playing-loud-music-on-flight-an-offence-heres-what-government-says-ws-be-9899313.html",
        "date": "Thu, 12 Feb 2026 19:25:43 +0530",
        "fetched_at": "2026-02-15 03:26:56.839726"
    },
    {
        "title": "CNBC AWAAZ Sweeps Budget Day, Leads FM Speech And Budget Week Ratings",
        "content": "Cementing its position as the market leader in Hindi business news, CNBC AWAAZ emerged as the go-to destination for investors and market watchers during the Union Budget 2026 coverage.\nAccording to BARC data, CNBC AWAAZ captured a dominant 63% market share during the live telecast of Finance Minister Nirmala Sitharaman’s Budget speech on 1st February 2026, significantly outperforming Zee Business, which stood at 37%.\n(Source: BARC | MKT: HSM Urban | TG: 22-40 M | Period: 1st Feb 2026(1100-1230)\nThe leadership extended across the full Budget Day as well. On 1st February 2026, CNBC AWAAZ secured a 61.3% market share, while Zee Business registered 38.7%, highlighting CNBC AWAAZ’s dominance during one of the most competitive and high-stakes news events of the financial calendar. (Source: BARC | MKT: HSM Urban | TG: 22-40 M | Period: 1st Feb 2026)\nBudget Day traditionally drives intense viewer engagement, as audiences track policy announcements, taxation reforms, sectoral allocations, fiscal discipline measures, and their real-time impact on markets. CNBC AWAAZ’s comprehensive coverage, blending expert analysis, corporate voices, and live market decoding, resonated strongly with its core audience of investors and traders.\nThe momentum carried into Budget Week, where CNBC AWAAZ maintained a commanding lead with a 76.4% market share, compared to Zee Business at 23.6%,  less than half of CNBC AWAAZ’s share, reaffirming sustained viewer preference beyond the headline announcements. (Source: BARC | MKT: HSM 10L+ | TG: 22-40 M | Period: Wk 05’26)\nOn the digital front as well, CNBC AWAAZ emerged among the world’s top-viewed live news streams on Union Budget Day 2026. During the peak live window between 11:00 am and 12:40 pm, the channel emerged as the clear leader in digital viewership, registering a peak concurrency of 765.1K, recording 3.5x the viewership of Zee Business, highlighting its growing cross-platform strength. (Source: Databeings)\nWith sustained leadership across key market hours and critical policy moments, CNBC AWAAZ continues to strengthen its position as India’s most-watched Hindi business news channel, setting new benchmarks  year after year.\nLatest Blogs",
        "link": "https://www.news18.com/india/cnbc-awaaz-sweeps-budget-day-leads-fm-speech-and-budget-week-ratings-9899245.html",
        "date": "Thu, 12 Feb 2026 18:16:16 +0530",
        "fetched_at": "2026-02-15 03:26:57.611677"
    },
    {
        "title": "The Big Rafale Deal: How G2G Model Fast-Tracks India’s Largest Defence Acquisition",
        "content": "India has finalised one of its most significant defence acquisitions ever — a proposed Rs 3.25 lakh crore agreement with France to procure 114 additional Dassault Rafale fighter jets for the Indian Air Force (IAF). The deal, cleared by the Defence Acquisition Council (DAC) ahead of French President Emmanuel Macron’s visit to New Delhi next week, will dramatically expand India’s air combat strength and transform its aerospace industrial base.\nFor Indian pilots and planners, this procurement represents a pivotal leap in capability. The Rafale, a 4.5-generation multi-role fighter with integrated electronic warfare systems, advanced sensors, and precision weapons, has already proven itself in demanding operational conditions. Its deployment in recent missions and drills has reinforced confidence in its performance.\nA key feature of the deal is the use of a direct Government-to-Government (G2G) framework between New Delhi and Paris — a model similar to the earlier Rafale acquisition a decade ago, which is seen within defence circles as faster, cleaner and more predictable than traditional multi-vendor tenders. This approach is expected to significantly cut procedural delays that often slow down large defence procurements.\nThe G2G framework bypasses much of the bureaucratic layering. Instead of negotiating with multiple vendors, India negotiates directly with the French government, which then guarantees delivery through Dassault Aviation. This dramatically cuts procedural timelines and reduces the risk of future cancellations.\nThe supplying government, meanwhile, effectively stands behind the contract. This offers clearer pricing structures, state-backed performance guarantees, and better accountability on timelines\nUnder the current proposal, 18 Rafales would be delivered from France, while the remaining 96 are slated for final assembly and manufacture in India. Officials have stressed that this arrangement will not only enhance India’s combat fleet but also catalyse skilled jobs, robust supply chains, and long-term growth of the domestic aerospace sector.\nCrucially, the deal is designed to integrate Indian weapons systems into the Rafale platform, ensuring that indigenous technologies and armaments work seamlessly with the new jets — a requirement New Delhi has underscored during negotiations.\nThe pact also envisages substantial technology transfer from Dassault Aviation and its partners to Indian firms participating in production and support. Tata Advanced Systems, for example, has already signed production transfer agreements with Dassault to manufacture key structural parts — the first time such components will be made outside France — marking a milestone under the “Make in India\" initiative.\nIndian defence planners see this acquisition as a force multiplier, bridging capability gaps while indigenous fighters such as HAL Tejas and future platforms like the Advanced Medium Combat Aircraft (AMCA) mature. Once concluded and fully implemented, the deal will turn the Rafale from an imported asset into a partly Indian-made cornerstone of India’s combat aviation fleet.\nLatest Blogs",
        "link": "https://www.news18.com/india/the-big-rafale-deal-how-g2g-model-fast-tracks-indias-largest-defence-acquisition-ws-l-9898206.html",
        "date": "Thu, 12 Feb 2026 15:08:26 +0530",
        "fetched_at": "2026-02-15 03:26:59.100010"
    },
    {
        "title": "'Emphasised On Reform Express': PM Modi Praises Nirmala Sitharaman’s Reply On Budget In Lok Sabha",
        "content": "Prime Minister Narendra Modi on Thursday lauded Finance Minister Nirmala Sitharaman’s reply in Lok Sabha on Union Budget. In a social media post, PM Modi said Sitharaman outlined this year’s budget and emphasised on “Reform Express.\"\n“In her speech in the Lok Sabha, Finance Minister Smt. Nirmala Sitharaman Ji gave a comprehensive picture of how this year’s Budget will contribute to our nation’s economic transformation. She emphasised on Reform Express, the support to MSMEs, skilling, push to next-gen infrastructure, efforts to boost healthcare, education and more,\" PM’s post on X reads.\nIn her speech in the Lok Sabha, Finance Minister Smt. Nirmala Sitharaman Ji gave a comprehensive picture of how this year’s Budget will contribute to our nation’s economic transformation. She emphasised on Reform Express, the support to MSMEs, skilling, push to next-gen…— Narendra Modi (@narendramodi) February 12, 2026\nReplying to the debate in Lok Sabha on the Union Budget 2026-27, Union Finance Minister reiterated the government’s commitment to strengthening rural and agricultural sectors along with other areas. She began her speech by stressing on the importance of this year’s budget. “This budget is a budget which is prepared as the first budget that is prepared in the second quarter of the 21st century. Therefore, this budget includes various components from 2026 to 2050. We are also starting the new five-year cycle of new finance commission. The budget is largely based on the recommendations of the commission,\" Sitharaman said.\nShe also outlined various government initiatives, including skilling and infrastructure investment. The Budget 2026 has increased public capex from Rs 11.2 lakh crore in BE 2025-26 to Rs 12.2 lakh crore in FY2026-27, she said.\n“We have said that instead of waiting to qualify and finishing your education and coming out and seeking where should they go for acquiring skills, the skilling element can be brought into education itself and at the end of the day when they come out, students can say I can become an entrepreneur and this kind of a mega centre can be kept next to any industrial cluster that any state has,\" she said.\nLok Sabha took up discussion on the Union Budget on Wednesday. Sitharaman is expected to reply to the debate in the Rajya Sabha on Thursday.\nLatest Blogs",
        "link": "https://www.news18.com/india/emphasised-on-reform-express-pm-modi-praises-nirmala-sitharamans-reply-on-budget-in-lok-sabha-ws-bl-9898117.html",
        "date": "Thu, 12 Feb 2026 14:48:46 +0530",
        "fetched_at": "2026-02-15 03:26:59.792208"
    },
    {
        "title": "'Conspiracy, Clearance Bypassed’: FIR In Ex-Army Chief’s Book Leak Puts Focus On Overseas Sales",
        "content": "The controversy surrounding the former Army chief’s book has deepened, with sources indicating that the publication was allegedly released without mandatory clearance from the Ministry of Defence (MoD) and first sold on online platforms in Canada, Australia, Germany and the United States.\nAccording to sources, the initial investigation following the registration of a case points to a “well-planned conspiracy\". It is learnt that the book was leaked in a coordinated manner, bypassing the MoD’s mandatory clearance process for publications involving serving or former defence personnel.\nInvestigators have found that copies of the book began circulating on online platforms in Canada, Australia, Germany and the US before surfacing elsewhere. Sales are said to have started in these countries first, raising questions about the publishing and distribution chain.\nThe Special Cell has registered an FIR under sections pertaining to criminal conspiracy. The scope of the probe has now been expanded internationally, covering the US, Canada, Germany and Australia.\nA thorough investigation into the digital trail, publishing network and possible international links is currently underway. Sources said the probe is intensifying, with agencies examining overseas connections and coordination in the alleged leak and distribution of the book.\nDelhi Police’s Special Cell questioned members of Penguin India’s team on Thursday, following a notice issued to the publisher over its earlier statement on the book controversy. The questioning lasted for approximately two hours.\nThe Special Cell had served a notice seeking responses to specific queries and summoned representatives of the publishing house for examination. During the session, the team was reportedly asked around 15 questions.\nSources said some of the queries were answered during the questioning, while the Penguin India team sought additional time to respond to the remaining questions. The Special Cell is now expected to examine and analyse the responses submitted by the publisher.\nAmid the row, Penguin Random House India, which holds the publishing rights to Four Stars of Destiny, issued a clarification stating that the book has not been published in any format.\nThe publisher said that an announced title, a pre-order listing nd a published book are distinct stages, and that a book is considered published only when it is available for purchase across retail channels.\nThe entire row over the book erupted in Parliament when the Leader of the Opposition Rahul Gandhi referred to the alleged contents of General (Retd.) MM Naravane’s unpublished memoir and displayed what he claimed was a copy of the book in the Lok Sabha.\nHis remarks triggered strong objections from treasury benches, with BJP leaders questioning how an unpublished manuscript was accessed and cited in the House. The episode led to heated exchanges, walkouts and demands for clarification, bringing the status of the book’s publication and its alleged leak into sharp political focus.\nLatest Blogs",
        "link": "https://www.news18.com/india/conspiracy-clearance-bypassed-fir-in-ex-army-chiefs-book-leak-puts-focus-on-overseas-sales-ws-l-9898034.html",
        "date": "Thu, 12 Feb 2026 14:22:23 +0530",
        "fetched_at": "2026-02-15 03:27:00.426578"
    },
    {
        "title": "PM Modi To Inaugurate Seva Teerth And Kartavya Bhavan 1 And 2 On Feb 13",
        "content": "Prime Minister Narendra Modi is set to inaugurate the Seva Teerth, the new building of the Prime Minister’s Office, and Kartavya Bhawan 1 and 2, on February 13. The inauguration of the new buildings will mark a transformative milestone in India’s administrative governance architecture.\nAccording to a statement released by the Prime Minister’s Office, the structures also reflect PM Modi’s commitment to building a modern, efficient, accessible, and citizen-centric governance ecosystem.\nThe development came decades after several key government offices and ministries functioned from fragmented and ageing infrastructure spread across multiple locations in the Central Vista area causing operational inefficiencies, coordination challenges.\nThe old structures, with time, escalated maintenance costs and sub-optimal working environments. The new building complexes address these issues by consolidating administrative functions within modern, future-ready facilities, the statement added.\nSeva Teerth houses the Prime Minister’s Office, the National Security Council Secretariat, and the Cabinet Secretariat, all of which were previously located across different locations.\nMeanwhile, Kartavya Bhavan 1 and 2 will accommodate law, defence, finance, health, agriculture, and several other key ministries.\nIt has been learnt that the new building complexes feature digitally integrated offices, structured public interface zones and centralised reception facilities.\nThe building are designed in accordance with 4-Star GRIHA standards and will focus on incorporating renewable energy systems, water conservation measures, waste management solutions and high-performance building envelopes.\nThese measures significantly reduce environmental impact while enhancing operational efficiency, the PMO said.\nNotably, the building complexes will use comprehensive safety and security frameworks, such as smart access control systems, surveillance networks. It will also accomodate advanced emergency response infrastructure, ensuring a secure and accessible environment for officials and visitors.\n(With agency inputs)\nLatest Blogs",
        "link": "https://www.news18.com/india/pm-modi-to-inaugurate-seva-teerth-and-kartavya-bhavan-1-and-2-on-feb-13-9898036.html",
        "date": "Thu, 12 Feb 2026 14:10:52 +0530",
        "fetched_at": "2026-02-15 03:27:01.055887"
    },
    {
        "title": "Bihar ‘Paralysis Village’: Patients In Every Hamlet, Deaths Rise As Public Anger Mounts",
        "content": "A shocking health situation has emerged in Korjana village of Bihar’s Begusarai district, where residents claim a rising number of paralysis cases and deaths over the past year. Villagers allege that despite repeated incidents and mounting concern, authorities, from block-level officials to the local MLA, have not taken adequate notice of the situation.\nAccording to locals, the village has witnessed a sharp increase in paralysis cases, particularly in the last six months. Residents say more than five people in nearly every hamlet have been affected, and several families have performed last rites for relatives during this period.\nThe growing number of cases has led villagers to refer to Korjana as ‘Paralysis Village’.\nA team from Local18 visited the village to understand the ground reality. During the visit, residents spoke about sudden illnesses, rising treatment expenses, and what they describe as a lack of timely government intervention, raising serious questions about healthcare monitoring and administrative response in the area.\nOne of the villagers, Kiran Devi, said her father-in-law suddenly suffered a brain haemorrhage, after which he became paralysed. The family is arranging treatment on their own, but she believes timely government assistance could save his life.\nAnother villager, Pavitri Devi, who is battling paralysis, explained that her hands and feet gradually stopped functioning. She now travels to Chakva for treatment, as most patients from the village reportedly do. Despite this, lives continue to be lost. Speaking to Local18, she broke down in tears, alleging that officials remain unmoved by their suffering.\nDulari Devi stated that many paralysis cases have emerged in the last six months, yet no government aid has reached the village. Similarly, Badam Devi said she was suddenly struck by paralysis and did not even realise when the illness took hold.\nRanjay Yadav pointed out that having more than five paralysis patients in a single neighbourhood is highly unusual. Amarjeet Kumar Yadav echoed the same concern. Sanju Devi added that people from neighbouring villages now visit Korjana to witness the alarming situation themselves.\nA young villager, Dilkhush, said his grandfather’s treatment has already cost the family around Rs 50,000. They sought help from private hospitals in Chakva and Samastipur, yet no government doctor has visited Korjana so far.\nDai Rani, whose mother-in-law died after suffering from paralysis, claimed that most deaths have occurred within the past six months.\nDuring the course of reporting, another villager, Dunia Lal, reportedly died within three days of being paralysed.\nMost of the affected individuals are above 40 years of age.\nVillagers insist that no health department team has visited the area, nor has any formal investigation been initiated. They question why the Block Medical Officer is unaware of deaths and illnesses that have been occurring for nearly a year.\nIf a health sub-centre exists in the village, residents ask why no health assessment has been conducted. They also question whether the Block Development Officer (BDO) has fulfilled their responsibilities, or if their role has been limited to sanctioning funeral assistance.\nThe biggest concern raised by villagers is whether the local MLA has forgotten the community after securing votes.\nFrustration has led some residents to bitterly refer to Korjana as both ‘Paralysis Village’ and ‘Funeral Village’. Numerous questions are being directed at officials ranging from the BDO to the MLA, yet answers remain elusive.\nWhether the illness is the result of a mysterious disease or administrative negligence remains unclear and requires urgent investigation. Until the truth emerges, fear and mistrust towards the system will continue to grow in Korjana.\nThe central question remains: has empathy disappeared from governance, or are authorities simply waiting for a major inquiry before taking action?\nLatest Blogs",
        "link": "https://www.news18.com/india/bihar-paralysis-village-patients-in-every-hamlet-deaths-rise-as-public-anger-mounts-ws-l-9897732.html",
        "date": "Thu, 12 Feb 2026 13:17:15 +0530",
        "fetched_at": "2026-02-15 03:27:01.691490"
    },
    {
        "title": "News18 Afternoon Digest: BJP Seeks Suspension Of Rahul Gandhi's Parliament Membership; Bangladesh Elections & More",
        "content": "In today’s afternoon digest, News18 brings you the latest updates on the ongoing Parliament budget session, Bangladesh elections 2026, and more.\n‘Rahul Gandhi’s Membership Should Be Cancelled’: BJP Submits Notice Amid Parliament Row\nCongress MPs Entered Speaker’s Chamber, Threatened Him: Kiren Rijiju Shares Video\nTobacco Tycoon’s Son Shivam Mishra Arrested Four Days After Kanpur Lamborghini Crash\n‘New Bangladesh Begins Today’: Muhammad Yunus Casts Vote In Political Reset\nUN Report Links JeM To Delhi’s Red Fort Blast, Warns Group Remains Active | Exclusive\nNamibia Look To ‘Fight Hard’ Against Injury-Stricken India At Kotla\nAditya Dhar To Reunite With Ranveer Singh For A Mythological Drama: Report\nLatest Blogs",
        "link": "https://www.news18.com/india/news18-afternoon-digest-bjp-seeks-suspension-of-rahul-gandhis-parliament-membership-bangladesh-elections-more-ws-l-9897696.html",
        "date": "Thu, 12 Feb 2026 12:38:24 +0530",
        "fetched_at": "2026-02-15 03:27:02.502111"
    },
    {
        "title": "Arunachal Dam Project Gets Eco Go-Ahead After 3 Decades, At The Cost Of 23 Lakh Trees | Exclusive",
        "content": "The Centre’s expert panel has recommended environmental clearance for the Kamala hydroelectric project, a 1,720-MW storage dam proposed in the forested districts of Arunachal Pradesh.\nThree decades in the making, the dam project, however, comes with strong warnings over large-scale deforestation and the need for strict ecological safeguards as more than 23 lakh trees will have to be felled.\nThe dam project – proposed by NHPC Ltd – involves the construction of a concrete gravity dam at a height of 216 metres on Kamala River, which is a tributary of the Subansiri and part of the Brahmaputra basin.\nThe dam and its reservoir will spread across 3,858 hectares in Kamle, Kra Daadi and Kurung Kumey districts, most of which are covered by dense forests.\nAfter recently examining the proposal, the expert appraisal committee (EAC) noted that the dam project is in category ‘A’ of the Environmental Impact Assessment Notification, 2006 – this requires clearance at the central level.\nWhile recommending approval, the EAC flagged what it called a serious environmental concern: the proposed felling of over 23 lakh trees.\n“The project is located in a very dense forest area,\" the committee observed, stressing that such large-scale deforestation will require carefully planned mitigation and ecosystem restoration measures.\nIt said a detailed action plan must be prepared in consultation with state forest and wildlife departments, ecological experts and local communities before forest clearance can be considered.\nThe social footprint is also significant. According to official documents, 126 villages across three districts will be affected with at least 30,000 people living in the impacted area.\nThe broader study area covers 377 villages across four districts. The NHPC, however, has argued that the project serves strategic and economic goals.\nDesigned as a storage-based hydropower project, the Kamala dam is expected to provide daily peaking power and play a role in flood moderation in the downstream Brahmaputra basin. The design includes a 15-metre flood cushion above the full reservoir level to help manage monsoon floods.\nThe project has been in the pipeline for nearly three decades with initial investigations carried out by the Brahmaputra Board in 1996. This was followed by feasibility and detailed project reports by NHPC in 2004. Several alternative dam sites and designs were examined before the current alignment was finalised, with engineers citing better geology and safety as key reasons for the final choice.\nThe estimated cost of the Kamala hydroelectric project is Rs 23,764 crore. While the EAC’s recommendation clears a key regulatory hurdle, final forest clearance remains pending.\nEnvironmental groups and local residents are expected to closely monitor the next steps, as the project moves from paper approvals to decisions that will reshape large swathes of Arunachal Pradesh’s forest landscape.\nLatest Blogs",
        "link": "https://www.news18.com/india/arunachal-dam-project-gets-eco-go-ahead-after-3-decades-at-the-cost-of-23-lakh-trees-exclusive-ws-l-9897076.html",
        "date": "Thu, 12 Feb 2026 08:30:16 +0530",
        "fetched_at": "2026-02-15 03:27:03.171315"
    },
    {
        "title": "'Unauthorised': BJP Assam Sacks Social Media Member After AI Video Shows Himanta Aiming Gun At Men",
        "content": "The Assam unit of the Bharatiya Janata Party (BJP) removed one of four co-conveners from its social media department following backlash over a video that depicted Chief Minister Himanta Biswa Sarma aiming a rifle at two men, one of whom bears resemblance to Congress MP Gaurav Gogoi.\nThe video, posted last Saturday on the official X (formerly Twitter) handle of Assam BJP with the caption “Point blank shot\", was deleted the following day. The post showed digitally manipulated images of the Chief Minister appearing to shoot at a photograph of the two men, concluding with an image of Himanta Biswa Sarma dressed as a cowboy wielding a gun.\nAssam BJP president Dilip Saikia confirmed the removal to The Indian Express, characterizing the post as an “immature\" and “unauthorised\" action.\n“The party is concerned about illegal immigrant Bangladeshis in Assam, and for that, there has to be a movement in the society. But the party does not support the idea of a mala fide intent of targeting Muslims with bullets. It was mishandled by an immature and unauthorised person,\" Saikia stated.\nChief Minister Himanta Biswa Sarma distanced himself from the video, claiming no prior knowledge of its creation or posting.\n“We have registered an FIR,\" he said, referring to a complaint filed by Congress MLAs, adding, “In fact, one of our BJP people has also filed a case, saying that this is a video about which we are angry because in Assam, everybody knows that we are not against Assamese Muslims. We are against Bangladeshi Muslims, whom we call Miya Muslims.\"\nThe controversy marks the second time in recent months that the Assam BJP’s X handle has faced scrutiny. In September 2025, the account posted an AI-generated video titled “Assam without BJP\", accompanied by text references to “beef legalisation\" and “illegal immigrants.\" The Supreme Court subsequently issued a notice in October on a petition seeking removal of the video.\nLatest Blogs",
        "link": "https://www.news18.com/india/unauthorised-bjp-assam-sacks-social-media-member-after-ai-video-shows-himanta-aiming-gun-at-men-ws-l-9896997.html",
        "date": "Wed, 11 Feb 2026 23:54:54 +0530",
        "fetched_at": "2026-02-15 03:27:03.793186"
    }
]