[
    {
        "title": "Thailand votes in early election with 3 main parties vying for power",
        "content": "A voter casts his ballot at a polling station during general election in Bangkok, Sunday, Feb. 7, 2026. (AP Photo/Sakchai Lalit)\nVoters look at candidates listed on a display board before entering a voting station for the general election in Bangkok, on Sunday, Feb. 7, 2026. (AP Photo/Wason Wanichakorn)\nPolice officers and volunteers seal a ballot box at voting station before starting of Thailand's general election in Bangkok, Sunday, Feb. 7, 2026. (AP Photo/Wason Wanichakorn)\nPolice officers prepare for the general election at a voting station in Bangkok, on Sunday, Feb. 7, 2026. (AP Photo/Wason Wanichakorn)\nPolice officers and election volunteers prepare for the general election at a voting station in Bangkok, on Sunday, Feb. 7, 2026. (AP Photo/Wason Wanichakorn)\nA voter casts his ballot at a polling station during general election in Bangkok, Sunday, Feb. 7, 2026. (AP Photo/Sakchai Lalit)\nVoters look at candidates listed on a display board before entering a voting station for the general election in Bangkok, on Sunday, Feb. 7, 2026. (AP Photo/Wason Wanichakorn)\nPolice officers and volunteers seal a ballot box at voting station before starting of Thailand's general election in Bangkok, Sunday, Feb. 7, 2026. (AP Photo/Wason Wanichakorn)\nPolice officers prepare for the general election at a voting station in Bangkok, on Sunday, Feb. 7, 2026. (AP Photo/Wason Wanichakorn)\nPolice officers and election volunteers prepare for the general election at a voting station in Bangkok, on Sunday, Feb. 7, 2026. (AP Photo/Wason Wanichakorn)\nA voter casts his ballot at a polling station during general election in Bangkok, Sunday, Feb. 7, 2026. (AP Photo/Sakchai Lalit)",
        "link": "https://timesofindia.indiatimes.com/world/rest-of-world/thailand-votes-in-early-election-with-3-main-parties-vying-for-power/articleshow/128055178.cms",
        "date": "2026-02-08T07:12:03+05:30",
        "fetched_at": "2026-02-08 04:27:39.197942"
    },
    {
        "title": "16th Finance Commission identifies T.N. as one of top three States suffering heavy losses of public sector enterprises",
        "content": "As in the case of other non-north-eastern and hilly States, a substantial portion of the losses for Tamil Nadu were concentrated in the power sector. File\n| Photo Credit: The Hindu\nTamil Nadu has been identified as one of the top three States in the country, which suffer from heavy losses incurred by State Public Sector Enterprises (SPSEs).\nFor the year 2022-23, the top three States in this category were Uttar Pradesh (₹32,430 crore), Rajasthan (₹18,814 crore), and Tamil Nadu (₹16,048 crore), according to the volume 1 of the main report of the 16th Finance Commission. These States come under the broad group of non-north-eastern and hilly (non-NEH) States.\nAs in the case of other non-NEH States, a substantial portion of the losses were concentrated in the power sector. In the year in question, the now-defunct Tamil Nadu Generation and Distribution Corporation (Tangedco) had recorded a loss of about ₹9,192 crore. However, for 2024-25, the recently published Annual Integrated Rating of the Distribution Companies, compiled by the Power Finance Corporation, put the profit after tax (PAT) of the Tamil Nadu Power Distribution Corporation Limited (TNPDCL), one of the successors of the Tangedco, at ₹2,073 crore.\nBut this had become possible due to the State government’s largesse — the provision of tariff subsidy of ₹15,772 crore and the takeover of loss of ₹16,107 crore. More significantly, the accumulated deficit of the TNPDCL went down to ₹1,19,153 crore in 2024-25 from ₹1,66,944 crore of the Tangedco in 2023-24., thanks to the unbundling of the latter.\nDescribing the poor financial performance of SPSEs as “a burden on State budgets,” the Finance Commission stated that the State governments had to incur budgetary expenditure in the form of subsidies, grants, equity investments, and loans. Besides, they had to provide guarantees against the loans raised by the SPSEs. The financial support extended by State Governments to SPSEs in the form of equity, loans, and grants/subsidies through the budget during the year 2022-23 amounted to ₹2.5 lakh crore.\nThe Commission recorded that for 2022-23, the budgetary out go of the Tamil Nadu government to the SPSEs was ₹26,867 crore and till the end of the year in question, the outstanding guarantees stood at ₹89,768 crore.\nThe Commission did not include Tamil Nadu in the club of States with a high proportion of loss-making enterprises, a matter that provides solace to policy makers and people of the State.\nTamil Nadu\n/\neconomy, business and finance\n/\nstate politics\n/\npublic finance\n/\nIndia\n/\neconomy (general)",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/16th-finance-commission-identifies-tn-as-one-of-top-three-states-sufferingheavylosses-of-public-sector-enterprises/article70604668.ece",
        "date": "Sun, 08 Feb 2026 09:40:09 +0530",
        "fetched_at": "2026-02-08 04:27:41.881118"
    },
    {
        "title": "Mysterious gas leak causes panic in Jammu; probe launched to identify nature of substance",
        "content": "A mysterious gas leak from a cylinder at a scrap dealer’s shop triggered panic in a locality near the Jammu airport on Saturday (February 7, 2026), prompting authorities to rush joint teams of the National Disaster Response Force (NDRF) and State Disaster Response Force (SDRF) to the scene, officials said.\nSeveral residents of Rani Bagh complained of breathlessness following the sudden leakage of gas from an abandoned cylinder lying at the scrap dealer’s premises, they added.\nAccording to authorities, teams of the NDRF and SDRF, wearing protective gear, along with police and fire and emergency department personnel, reached the scene and successfully contained the leak.\nThey assured that the situation is well under control and there is no need to panic.\nAn investigation has been initiated to determine the nature of the gas and how the cylinder ended up at the scrap dealer’s shop, officials noted, adding that the substance will be identified through scientific analysis, and further action will be taken accordingly.\nHowever, officials did not rule out the possibility that the gas could be a hazardous chemical, including sulphur mustard.\nJammu and Kashmir\n/\nJammu",
        "link": "https://www.thehindu.com/news/national/jammu-and-kashmir/gas-leak-causes-panic-in-jammu-probe-launched/article70605441.ece",
        "date": "Sun, 08 Feb 2026 03:42:32 +0530",
        "fetched_at": "2026-02-08 04:27:42.531692"
    },
    {
        "title": "Minister opens memorial pillar for Mordhana dam in Vellore for completion of 25 years",
        "content": "Minister for Water Resources and Katpadi MLA Duraimurgan inaugurated a 25-ft high memorial pillar at Mordhana Dam.\nT.N. Minister for Water Resources and Katpadi MLA Duraimurgan on Saturday inaugurated a 25-ft high memorial pillar at Mordhana dam, which was built across the Koundinya river, a tributary of the Palar, in Gudiyatham town in Vellore to commemorate 25 years of the existence of the dam that helped to irrigate 8, 367 acres of farmland in the region.\nOfficials of the Water Resources Department (WRD), which maintains the dam, said that the foundation stone was laid more than three decades ago in December, 1990. when Mr. Duraimurugan was the Minister for Public Works and Forests. A decade later, the dam was inaugurated by former Chief Minister M. Karunanidhi in September 2000. “The dam reached its full storage capacity of 261.3 mcft for the tenth time during the 2025 monsoon. The dam also witnessed restoration works during that period,” V. Kalipriyan, Assistant Engineer (AE), WRD (Gudiyatham), told The Hindu.\nAccompanied by Collector V.R. Subbulaxmi and Vellore MP D.M. Kathir Anand, Mr. Duraimurugan inspected the canal, protection wall and bund area. “Water from the dam is a lifeline for irrigation and domestic use. It helps to cultivate crops for at least three seasons a year,” said G. Ramu, a farmer.WRD officials said that the restored left canal of the dam runs 31.84 kms distance, covering at least 19 villages with around 1,710.92 hectares of farmland.\nThe left canal, which is three metres wide, covers a large tract of land under cultivation. Water from the Koundinya river directly irrigates around 140 acres. Another 220 acres in the region are irrigated through water from the left canal of the dam alone. WRD officials said that under the Rehabilitation and Restoration of Lakes scheme 2024-25, the left canal of the dam was taken up for restoration where deposited silt on the canal bed was removed to a depth of three metres to ensure steady water flow on it. Growth of thick vegetation especially on bund and slope of the bund was also removed.\nWRD officials said that restoration of the key canal of the dam has helped for storage of excess rainwater in the dam to its full capacity during the 2025 monsoon since 2021 massive floods in the region. Excess water from the dam also overflows to 19 irrigation tanks on the downstream of the river, thereby providing adequate water for farmers in the area for cultivation. On the occasion, S. Pavalakannan, Superintending Engineer (SE), WRD, R. Venkatesh, Executive Engineer (EE), WRD, P. Gopi, Assistant Executive Engineer (AEE), WRD, and S. Ramkumar, AE (WRD) were present.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/minister-opens-memorial-pillar-for-mordhana-dam-in-vellore-for-completion-of-25-years/article70604514.ece",
        "date": "Sun, 08 Feb 2026 00:22:17 +0530",
        "fetched_at": "2026-02-08 04:27:43.157701"
    },
    {
        "title": "Budget allocates ₹30 crore for SMA treatment",
        "content": "The State government has  earmarked an amount of ₹30 crore in the Budget for ensuring continued treatment facilities for those suffering from Spinal Muscular Atrophy (SMA).\nThe government’s interventions in the area of rare diseases began in 2022 with the launch of an SMA pilot project at SAT Hospital, Thiruvananthapuram. The initiative began with the free distribution of Evrysdi – a medication which cost about ₹5.2 lakh – to SMA-afflicted children up to five years of age. In 2023, the coverage was expanded to include children up to seven years of age, according to Cure SMA, a SMA patient collective.\nThe Kerala United Against  Rare Diseases (KARE) scheme was introduced  in 2024 and  treatment support was further extended to children up to 12 years of age. At present, 110 children across the State are beneficiaries of the programme.\nThe government is also providing Scoliosis surgery free of cost through the Government Medical College Hospital, Thiruvananthapuram, to correct the spinal curvature\nCure SMA has welcomed the budgetary allocation made by the government for SMA care as it is a great support for parents struggling to ensure the survival and quality of life of  their SMA-afflicted children",
        "link": "https://www.thehindu.com/news/national/kerala/budget-allocates-30-crore-for-sma-treatment/article70604916.ece",
        "date": "Sat, 07 Feb 2026 23:44:40 +0530",
        "fetched_at": "2026-02-08 04:27:43.770936"
    },
    {
        "title": "Sabari rail: govt. steps rekindle hopes among people along proposed corridor",
        "content": "After years of uncertainty, recent steps by the Central and State governments on the Angamaly-Sabari rail project have rekindled hopes among people along the proposed corridor, despite a section of them sharing fears triggered by bitter experience from the past.\nOfficials claimed that the project, which remained stalled for over 25 years due to multiple hurdles, had entered the right track, with the State government announcing that it would bear 50% of the cost, including land acquisition expenses, and the Railway Ministry de-freezing the project.\nThousands of families, whose land parcels remain earmarked for the 110-km railway line covering parts of Ernakulam, Idukki and Kottayam districts, hope that with the latest steps their land will be acquired by the government, and that they will be paid due compensation without further delay.\n“Unlike earlier, I’m a bit hopeful now,” M.P. Viswanathan Nair, an ex-NRI with an earmarked property in Okkal panchayat, said. He said that the Central and State governments coming together for the project had increased his confidence. He added that he had not been able to sell or mortgage his land ever since it was earmarked for the project. “Those around me who share my fate are also by and large hopeful now, though there are doubts over how much progress will be made before the Assembly elections,” he said.\nSalim N.A. of Okkal shared the sentiments. “I’m hopeful too, but I will become confident only once the land acquisition offices are opened,” he said.\nSivan Kizhakkekara from Muvattupuzha, however, sounded pessimistic, though. He termed the latest developments an election stunt. He said even if land acquisition works resumed, he would demand compensation for the physical and mental agony caused by the 25-year delay.\nMeanwhile, the Sabari Rail Central Action Council demanded speedy action to acquire land for the project and pay compensation to the affected landowners.\nA total of 152 hectares will have to be acquired for the project in Ernakulam as per the revised land acquisition proposal, district officials said. They added that the procedures for land acquisition would resume once the Revenue department issued a notification, which was expected within a week.\nThe district authorities have also submitted proposals to open two more land acquisition offices, besides the existing one with bare minimum facilities. A total of 55 posts have been proposed for the three offices, officials said.",
        "link": "https://www.thehindu.com/news/national/kerala/sabari-rail-govt-steps-rekindle-hopes-among-people-along-proposed-corridor/article70604969.ece",
        "date": "Sat, 07 Feb 2026 23:24:41 +0530",
        "fetched_at": "2026-02-08 04:27:44.400671"
    },
    {
        "title": "As Union govt. gave ‘nothing’ to T.N. in Budget, NDA should be given a ‘zero’ in polls: Stalin",
        "content": "DMK president and Chief Minister M.K. Stalin greeting supporters attending the party’s’ South Zone Youth Wing conference in Kallakurichi on Saturday.\n| Photo Credit: R. ASHOK\nDMK president and Chief Minister M.K. Stalin said on Saturday that Tamil Nadu should give “zero”-seat tally to the National Democratic Alliance (NDA) in the Assembly election as the BJP-led Union government had given “zero” to Tamil Nadu in the Union Budget and did not fulfil the genuine demands of the State.\nAddressing the South Zone DMK Youth Wing conference near here, Mr. Stalin said Tamil Nadu had been the ‘numero uno’ State in the country in all departments during the last five-year rule of the DMK. “It has been ranked number one in the Union government’s ratings and also by national and international magazines. Tamil Nadu’s progress has no parallel,” he said.\nHowever, Tamil Nadu has got nothing in the Union Budget, belying the anticipation that the poll-bound State would get some benefits from the Union government. Mr. Stalin said all that Tamil Nadu demanded was more funds for disaster management, Metro Rail, drinking water schemes, and railway projects, permission for the new airport in Hosur, 50% devolution of Central funds to the State, exemption from NEET, expedited construction of the All India Institute of Medical Sciences in Madurai, and the promise of not reducing the number of Lok Sabha seats under delimitation. But nothing has been granted by the Union government. “They gave us zero. The BJP-led NDA should be given zero in the Assembly election, similar to what they got in the 2024 Lok Sabha election,” Mr. Stalin said.\nHe ridiculed AIADMK general secretary Edappadi K. Palaniswami for claiming that he was the head of the NDA in the State. However, the BJP has made the AIADMK a branch of the national party, and he was not raising his voice in the interest of Tamil Nadu, he alleged.\nMr. Stalin also criticised the AIADMK’s proposed protest against the DMK for preventing the Viksit Bharat-Guarantee for Rozgar and Ajeevika Mission (Gramin) (VB-G RAM G) scheme.\n“Does Mr. Palaniswami even know the name of this new scheme? The Union government did not give [funds for providing] jobs even for 50 days when the Mahatma Gandhi National Rural Employment Guarantee Scheme guaranteed jobs for 100 days. How will the Union government ensure that the jobs are given for 125 days as promised, this when the States have been made to contribute 40% of the funds [towards the scheme]?” he asked.\nThe BJP that has tasted only defeat in the State and the AIADMK, which has seen multiple defeats, should not only be defeated again in the upcoming Assembly election but also with a bigger margin to make the State more progressive, the Chief Minister added.",
        "link": "https://www.thehindu.com/news/cities/Madurai/tn-should-give-zero-seats-to-nda-in-assembly-election-for-providing-nothing-to-the-state-stalin/article70604569.ece",
        "date": "Sun, 08 Feb 2026 01:12:34 +0530",
        "fetched_at": "2026-02-08 04:27:45.019787"
    },
    {
        "title": "3,617 govt. schools closed in Karnataka between 2020-21 and 2025-26",
        "content": "Department of School Education and Literacy Minister Madhu Bangarappa had earlier claimed that no government school had been permanently closed in 2025-26, but only temporarily shut.\n| Photo Credit: FILE PHOTO\nWhile the Karnataka government claims that no government school has been closed in the State, two sources of official data indicate that as many as 3,617 government schools were shut down  between 2020-21 and 2025-26.\nData tabled by the Union Ministry of Education in the Rajya Sabha on February 4, in response to a question raised by a CPI(M) member John Brittas regarding school closures across the country, shows that 947 government schools shut down between 2020-21 and 2024-25. It came down from 49,791 in 2020-21 to 48,844 in 2024-25.\nFurther, an October 15, 2025, order by the Department of School Education and Literacy (DSEL), Karnataka, on establishing Karnataka Public Schools, pegs the number of government schools in the State at 46,174, indicating a drastic decline. Data for 2025-26, which saw the largest closures, pegged at 2,670, is not part of the data tabled in the Rajya Sabha.\nDSEL Minister Madhu Bangarappa had earlier claimed in the Karnataka Legislature session that no government school had been permanently closed in 2025-26, but only temporarily shut.\nThe enrolment of students in government schools in the State has declined from 47.1 lakh in 2015-16 to 38.2 lakh in 2025-26, recording a decline of 19%. The share of government schools in the total enrolment has declined from 46% to 38%.\nDuring the same period, enrolment in private unaided schools increased from 36.3 lakh to 47 lakh, recording an increase of 29%. The number of government schools with an enrolment of 50 or less students has increased to 25,683 in 2025-26. This trend clearly indicates why government schools were shutting down year on year.\nHowever, data tabled by the Union Ministry of Education in the Rajya Sabha shows that even the number of private unaided schools have decreased in Karnataka — from 19,915 in 2020-21 to 19,105 in 2024-25. Data for 2025-26 is not available in the public domain.\nPrivate schools that have not been renewed for Recognition Renewal (RR) are included in the closed schools list, sources said, explaining the anomaly, but also indicating the mushrooming of schools without regulation.\n“This year, about 98% of private schools in the State have not renewed their RRs. In addition, schools that have not appointed qualified teachers under the RTE Act and those that have not obtained the religious and linguistic minority certificate from National Commission for Minorities, will not be renewed,” explained developmental educationist V.P. Niranjanaradhya.\n“Education is on the concurrent list. Unless a State gets substantial funds from the Union government, none can improve public education. But, year on year, allocation for education from the Union government is declining. Whatever the funds are released, they put a lot of conditions in the name of PM Shree schools, Sarva Shiksha Abhiyan. Unless you comply with the National Education Policy (NEP-2020), funds are not released. RTE is a Central legislation. The share of Central and State funds for the Sarva Shiksha Abhiyan, which was 90:10 earlier, has now come down to 60:40. This should be reversed,” he said.",
        "link": "https://www.thehindu.com/news/national/karnataka/3617-govt-schools-close-in-karnataka-between-2020-21-and-2025-26/article70604394.ece",
        "date": "Sun, 08 Feb 2026 00:43:54 +0530",
        "fetched_at": "2026-02-08 04:27:45.644997"
    },
    {
        "title": "BJP claims Union govt. has put metro fare hike on hold; BMRCL says no such direction",
        "content": "Tejasvi Surya\nAmidst a political slugfest over who is responsible for the Namma Metro fare hike, at least two BJP leaders from the city on Saturday claimed that the Union government had intervened and put the proposed fare hike on hold at their behest. Tejasvi Surya, MP for Bengaluru South, and Leader of the Opposition in the Legislative Assembly R. Ashok claimed the revised fares will not come into effect from February 9, as was scheduled.\nHowever, Bangalore Metro Rail Corporation Ltd. (BMRCL) told The Hindu that they had received no such communication. “We can decide only when official communication comes to us. So far, we have not received any communication,” a senior BMRCL official said.\nThis has created confusion whether the new fares will come into effect from Monday or not.\nMr. Surya and Mr. Ashok on Saturday claimed to have spoken to Union Minister of Power and Housing and Urban Affairs Manohar Lal Khattar flagging the issue and that he had directed officials to put the implementation of the revised fares on hold.\nMr. Surya claimed that Mr. Khattar assured a review of anomalies in the Fare Fixation Committee’s (FFC) recommendations and indicated that a fresh FFC could be considered if the State government submits a formal request. Soon after Mr. Surya’s claim, Mr. Ashok claimed in a post shared on X that he too had a chat with Mr. Khattar and the Minister had made similar assurances.\nBoth the leaders put the ball in the State government’s court. “It is now up to the State government to act in the interest of the people. The Congress government led by Chief Minister Siddaramaiah must immediately abandon its rigid and insensitive approach and initiate the process of forming a new Fare Fixation Committee (FFC),” Mr. Ashok said.\nChief Minister Siddaramaiah had, in a statement issued on Friday, put the onus on the Union government to fix Namma Metro fares and the State was bound to implement the fares recommended by the FFC, an independent committee.\nDeputy Chief Minister D.K. Shivakumar claimed the State was not even consulted on fare revision. Contradictin this, Mr. Surya claimed it was based on letters from the State that the FFC was formed. Union Minister H.D. Kumaraswamy alleged that the State government was trying to mislead people and the Centre’s share in BMRCL was only 20%.\nThe BMRCL had, on Thursday, announced a zone-wise fare revision under its Annual Automatic Fare Revision mechanism, with the revised fares scheduled to take effect from February 9. The new structure involves a marginal increase of ₹1 to ₹5 across 10 fare zones, with fares recalibrated based on distance slabs across the Namma Metro network.\nThe announcement triggered strong backlash from commuters, as it came on the back of last year’s sharp fare hike. On February 9, 2025, BMRCL implemented a steep fare increase, with some slabs witnessing hikes of over 100%, leading to widespread protests across Bengaluru. Following public outrage, BMRCL later said the anomaly was due to technical issues in the fare calculation and capped the hike at 71% from February 14, 2025.\nAs commuter anger resurfaced after Thursday’s announcement, the issue soon turned into a political slugfest between the BJP and the Congress, with both sides trying to blame the other over the fare hike.",
        "link": "https://www.thehindu.com/news/national/karnataka/bjp-claims-union-govt-has-put-metro-fare-hike-on-hold-bmrcl-says-no-such-direction/article70604909.ece",
        "date": "Sat, 07 Feb 2026 22:15:08 +0530",
        "fetched_at": "2026-02-08 04:27:46.270670"
    },
    {
        "title": "State govt. introduces auto conversion of land use as per master plan in GBA area",
        "content": "Revenue Minister Krishna Byre Gowda at a meeting in Bengaluru on Saturday.\n| Photo Credit: SPECIAL ARRANGEMENT\nIn a big reform, the State government has introduced auto-conversion of land use in the notified Master Plan area within the Greater Bengaluru Authority (GBA) area. Now, one can directly apply for a plan approval as per the Master Plan, and conversion will be done as part of the process automatically. A new software to facilitate the same was launched by Revenue Minister Krishna Byre Gowda on Saturday.\n“With the enabling provision of auto conversion, GBA now has the legal framework to convert B-Khata properties into A-Khata,” Mr. Byre Gowda said, adding that this will help lakhs of property owners who have purchased unauthorised sites in the past. Getting A Khatha will add legal strength to such sites, enable them to obtain loans, increase the value of their property, ease transactions, and approvals.\nGBA is now running a one-time scheme to issue A-Khata to B-Khata properties, if the site owner pays 5% of the guidance value. Deputy Chief Minister and Bengaluru Development Minister D.K. Shivakumar recently said that the GBA had received 1.2 lakh applications, of which 45,000 had been rejected.\nEarlier, even lands falling within the Master Plan required separate conversion, despite the concept of “deemed conversion.” This process typically took 4 to 6 months and often led to delays, harassment, corruption, and increased costs due to middlemen, Mr. Byre Gowda himself acknowledged.\n“The auto conversion of land is intended to help legal, faster, and easier development of land. Thus, help common people to buy affordable sites. Ease of governance and compliance is hoped to reduce the cost and time of land development. This will benefit not only residential development, but is also available to industrial and other uses as permitted in the Master Plan. With this reform, the Revenue Department is hoping to plug bad governance and corruption at the source itself,” he said.\n“By bringing online transparent time-bound and automatic processes, discretion is reduced. All these steps, along with E-Khata and integration of different records, will reduce litigation and bring greater guarantee to property ownership,” he further said.",
        "link": "https://www.thehindu.com/news/national/karnataka/state-govt-introduces-auto-conversion-of-land-use-as-per-master-plan-in-gba-area/article70604834.ece",
        "date": "Sat, 07 Feb 2026 21:58:08 +0530",
        "fetched_at": "2026-02-08 04:27:46.894312"
    },
    {
        "title": "Karnataka High Court confirms death penalty for three men in gang rape and murder of minor",
        "content": "The High Court of Karnataka has confirmed the death sentence for three men convicted of the gang rape and murder of an eight-year-old girl at a tile factory in Mangaluru, declaring the 2021 crime as a “rarest of rare” cases.\nA Division Bench comprising Justice H.P. Sandesh and Justice Venkatesh Naik T. in its February 4 verdict has dismissed the appeals of the convicts, identified as Jayban Adivasi and Mukesh Singh, both natives of Madhya Pradesh, and Manish Thirki, a native of Jharkhand, and upheld the capital punishment awarded by a Mangaluru special court for cases registered under the provisions of the Protection of Children from Sexual Offences (POCSO) Act, in November 2024.\nThe incident occurred on November 21, 2021, on the premises of the tile factory where both the victim’s parents, who are natives of Jharkhand, and the accused persons worked.\nThe Bench found sufficient evidence to establish that the men, in a premeditated conspiracy, lured the child with sweets, took her to a secluded room on the tile factory premises, and subjected her to sequential rape and assault. And when she cried out due to bleeding injuries, Jayban Adivasi smothered her to death. Three of them then concealed her body in a drainage, the Bench noted.\nThe Bench affirmed the conviction by analysing a chain of circumstantial evidence, statements of eyewitnesses who had seen the victim girl with the three accused, conclusive DNA evidence linking the men to the crime, recovery of blood-stained clothing, and CCTV camera footage. The Bench noted the presence of chewed food particles in the victim’s teeth, corroborating the prosecution’s claim that she was lured with sweets.\nAssessing the materials on record, the Bench said that “there are no mitigating circumstances favouring the accused to reduce the sentence, since it is a gangrape of a minor girl, who was aged about 7 years and 7 months at the time of commission of the offence”.\n“If a lesser sentence is imposed, it will give a wrong message to society and the public at large, and this act of subjecting the minor girl to satisfy their lust would be encouraged as such act has to be curbed with iron hands,” the Bench observed.\nThe trial against another man, Munim Singh, a resident of Madhya Pradesh, who is arraigned as accused number-4 in the case, is pending as he absconded after obtaining bail from Mangaluru court before trial began.",
        "link": "https://www.thehindu.com/news/national/karnataka/karnataka-high-court-confirms-death-penalty-for-three-men-in-gang-rape-and-murder-of-minor/article70604414.ece",
        "date": "Sat, 07 Feb 2026 21:52:54 +0530",
        "fetched_at": "2026-02-08 04:27:47.520338"
    },
    {
        "title": "Tourism policy aimed at public welfare, says Minister",
        "content": "The State government’s tourism policy is aimed at public welfare, and it helps increase the income of local communities, Tourism Minister P.A. Mohamed Riyas has said.\nHe was inaugurating the Global Responsible Tourism Meet and declaring Beypore an international model responsible tourism destination at Cheruvannur in Kozhikode on Saturday (February 7).\nMr. Riyas said that by enabling planned and people-centric tourism, handicrafts, food, and traditional industries were getting importance. “This ensures that the benefits of tourism reach even the most ordinary sections of society,” he said.\nAs part of the Responsible Tourism initiative, 112 units are currently functioning, and many of which have been provided with financial assistance by the government, the Minister added.",
        "link": "https://www.thehindu.com/news/national/kerala/tourism-policy-aimed-at-public-welfare-says-minister/article70604883.ece",
        "date": "Sat, 07 Feb 2026 21:27:43 +0530",
        "fetched_at": "2026-02-08 04:27:48.154005"
    },
    {
        "title": "Electrification under way for Bengaluru–Mangaluru Vande Bharat, says Union Minister",
        "content": "Union Minister for Railways Ashwini Vaishnaw on Saturday said that electrification work on the Hassan–Mangaluru section is currently under way, paving the way for the launch of the Bengaluru–Mangaluru Vande Bharat train service. Once electrification is completed, train services will be introduced on the Karwar–Mangaluru–Bengaluru route, significantly improving rail connectivity to Karnataka’s coastal region.\nAddressing a press conference at the BJP office in Bengaluru, Mr. Vaishnaw said, “Karnataka is witnessing major railway modernisation. This includes the redevelopment of 51 Amrit Bharat railway stations at an estimated cost of ₹2,110 crore, alongside the operation of 12 Vande Bharat trains in the State”.\nReferring to projects announced in the Union Budget recently, the Minister said that the proposed high-speed rail corridors connecting Bengaluru with Chennai and Hyderabad would enhance connectivity among three of South India’s key economic centres. “Once operational, the travel time between Bengaluru and Chennai is expected to reduce to 73 minutes, while the Bengaluru–Hyderabad journey would take around two hours,” he said.\nOn the long-pending Bengaluru suburban railway project, Mr. Vaishnaw said that the work on all four phases is progressing. Dedicated suburban tracks will be built alongside existing railway lines, and a new design framework has been finalised to expedite execution of the project.",
        "link": "https://www.thehindu.com/news/national/karnataka/electrification-under-way-for-bengalurumangaluru-vande-bharat-says-union-minister/article70604233.ece",
        "date": "Sat, 07 Feb 2026 21:19:49 +0530",
        "fetched_at": "2026-02-08 04:27:48.788065"
    },
    {
        "title": "TGFDC launches eco tourism initiative for Ananthagiri Hills",
        "content": "The Telangana Forest Development Corporation Limited (TGFDCL), through its eco-tourism arm, Deccan Woods and Trails, is offering a curated resort experience to the public at Ananthagiri Hills.\nTitled, The Breeze, the initiative is designed to provide the citizens with a safe, structured and fully guided forest experience while promoting environmental awareness and responsible tourism, a statement from the TGFDCL said.\nOn offer is a stay in luxury tents with modern amenities, a structured orientation session, guided bird walks and safari tours by trained naturalists, scenic lunch, dinner around bonfire, tea and snacks, and an exclusive ‘bush breakfast’ in grasslands akin to Masai Mara.\nThe whole package starting from 1 p.m. every day up to 11 a.m the next day, will cost ₹5,000 per person, with discounted offers for couples and families.",
        "link": "https://www.thehindu.com/news/national/telangana/tgfdc-launches-eco-tourism-initiative-for-ananthagiri-hills/article70604523.ece",
        "date": "Sat, 07 Feb 2026 21:07:38 +0530",
        "fetched_at": "2026-02-08 04:27:49.448634"
    },
    {
        "title": "Cochin Cancer Research Centre to be inaugurated on February 9",
        "content": "World-class cancer care facilities will be available under one roof in central Kerala with the commissioning of the new building complex of the Cochin Cancer Research Centre (CCRC), constructed at a cost of ₹449 crore.\nChief Minister Pinarayi Vijayan will inaugurate the facility on Monday. Health Minister Veena George and Industries Minister P. Rajeeve will be present on the occasion.\nThe CCRC will be a valuable addition to the cancer care landscape of Kerala, which already boasts two major premier cancer care institutions in the public sector—the RCC in Thiruvananthapuram and MCC in Thalassery.\nThe CCRC will provide advanced and high-quality cancer care, marking a significant milestone in Kerala’s efforts to establish the best of cancer treatment and research in the State. The facility will be a source of great relief to hundreds of cancer patients in central Kerala who would not have to travel far to access care.\nThe CCRC has been developed on 12.63 acres within the Kalamassery Medical College campus, comprising nine buildings with a total built-up area of 6.3 lakh square feet.\nThe new building complex has 16 elevators, sophisticated and modern operation theatres, and parking facilities for 550 vehicles. It houses 12 fully equipped operation theatres designed for complex surgeries, including one reserved exclusively for future robotic surgical procedures.\nThe CCRC will also place a huge thrust on cancer research in the State, with a 10,000 square feet area allocated exclusively for research activities.\nThe new complex is equipped with sophisticated facilities for scanning, X-ray, radiation therapy, and other critical services, integrated with AI-led technologies.\nIt is the first hospital building in Kerala to receive EDGE certification. All current power requirements of the building will be met through solar energy, making it a green building that is 25% carbon-neutral. It also hopes to attain full carbon neutrality by 2050, aligning with the State government’s aspirations for the same.",
        "link": "https://www.thehindu.com/news/national/kerala/cochin-cancer-research-centre-to-be-inaugurated-on-february-9/article70604468.ece",
        "date": "Sat, 07 Feb 2026 21:05:13 +0530",
        "fetched_at": "2026-02-08 04:27:50.059000"
    },
    {
        "title": "Concern over move to reduce work days of government offices",
        "content": "Concerns have been raised over the government’s move to reduce the number of working days of government offices to five a week. It is feared that the decision would make it harder for the public to access administrative services.\nNational Janata Dal district leader K.U. Irshad described the move irrational. He warned that it could trigger public resentment at a time when people were already forced to make repeated visits to offices even for minor matters.\nHe said that in institutions such as village offices, panchayats, taluk offices and collectorates, people often have to wait for days to complete procedures related to certificates, land records, welfare scheme applications and pension processing.\nThe situation in courts is also worrying, he said, pointing to a large backlog of cases, including many that have been pending for years in consumer and family courts.\n“When procedures cannot be completed on time even with six working days a week, reducing working days will only push people into greater hardship,” said Mr. Irshad.\nHe noted that despite the widespread introduction of digital services, problems such as delays in file movement, unnecessary procedural complexities and unequal access to services continued to persist.\nAny move to cut working days would send a wrong message to society, he said. “Priority should instead be given to improving the quality and efficiency of public services,” he said. Mr. Irshad demanded that the government reconsider its decision.",
        "link": "https://www.thehindu.com/news/national/kerala/concern-over-move-to-reduce-work-days-of-government-offices/article70604457.ece",
        "date": "Sat, 07 Feb 2026 21:03:32 +0530",
        "fetched_at": "2026-02-08 04:27:50.687522"
    },
    {
        "title": "Resonance Educational Institutions launches new campus in Kurnool",
        "content": "Former MP T. G. Venkatesh, film actor Brahmanandam and Kurnool MP Bastipati Nagaraju at the launch of Resonance Schools and Resonance Colleges in Kurnool on Saturday.\n| Photo Credit: ARRANGEMENT\nResonance Educational Institutions, which has produced top ranks in IIT JEE and NEET examinations for over 25 years across the country, has expanded its presence to the Rayalaseema region with the launch of Resonance Kurnool.\nThe launch of Resonance Schools and Resonance Colleges in Kurnool was held at Kappal Nagar on Saturday. The institutions were inaugurated by former MP and industrialist T. G. Venkatesh, film actor Brahmanandam and Kurnool MP Bastipati Nagaraju.\nResonance Colleges, Kurnool, features a 20,000 sq. ft. fully air-conditioned campus with subject expert faculty from Resonance Hyderabad, a nationally proven curriculum and standardised study material aimed at ensuring academic excellence. Resonance Schools has established an 11-acre CBSE campus offering day scholar and residential facilities from Nursery to Class 10, with a focus on strong academic foundations, holistic development and a future-ready learning environment.\nThe speakers appreciated Resonance Educational Institutions for its long-standing contribution to academic excellence and student success nationwide. They expressed confidence that the launch of Resonance in Kurnool would create strong learning opportunities for students in Rayalaseema and stressed the need for quality education, expert guidance and a disciplined academic ecosystem at the local level to help students succeed in competitive examinations and build successful careers.\nSpeaking on the occasion, Managing Director of Resonance Educational Institutions for Telangana and Andhra Pradesh, Purnachandra Rao, and Chairman of K. J. Reddy Educational Society, K. J. Reddy, said that bringing Resonance to Kurnool was part of their vision to make nationally recognised academic systems accessible to students in Rayalaseema. They said the institution would offer structured academic programmes, expert faculty, disciplined learning environments and proven teaching methodologies that have helped thousands of students secure top ranks.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/resonance-educational-institutions-launches-new-campus-in-kurnool/article70604622.ece",
        "date": "Sat, 07 Feb 2026 20:53:57 +0530",
        "fetched_at": "2026-02-08 04:27:51.300437"
    },
    {
        "title": "Centre has significantly increased allocations for Kerala in Union Budget: Nitin Nabin",
        "content": "BJP president Nitin Nabin inaugurates party’s Assembly election campaign by writing slogans on a wall in Thrissur on Saturday.\n| Photo Credit: K.K. NAJEEB\nBJP president Nitin Nabin on Saturday (February 7, 2026) said the Union Budget 2026 has brought substantial gains to Kerala, with a sharp increase in the State’s tax devolution and Central grants, besides major allocations for infrastructure and railway development.\nHe was speaking at a discussion on the Union Budget organised by BJP Intellectual Cell here. Mr. Nabin said Kerala has received special consideration in railway development, including the allocation of Vande Bharat and Amrit Bharat trains.\nOn Kerala’s development, Mr. Nabin said the Union government is guided by Deendayal Upadhyaya’s philosophy of Antyodaya, which focusses on serving the last person in society. Benefits for agricultural sectors such as cashew and cocoa would reach Kerala, he said.\nHe said Kerala’s share in tax devolution has increased by 33%, amounting to around ₹8,973 crore, while Central grants doubled from ₹13,000 crore to ₹26,000 crore.\n“The Centre shows no parsimony when it comes to development of Kerala,” he asserted.\nHighlighting welfare schemes, Mr. Nabin said 1.55 crore beneficiaries in Kerala are covered under the Pradhan Mantri Garib Kalyan Yojana, 85 lakh people have Ayushman Bharat cards, 28 lakh farmers benefit from PM-Kisan, and over 10,000 Jan Aushadhi centres are functioning in the State. He also said the Centre is strengthening coastal shipping and inland waterways, which would provide economic support to the coastal State.\nMr. Nabin said the Prime Minister’s efforts to revive cultural centres such as Kashi and Ujjain have boosted tourism significantly, and similar support for Kerala’s heritage would energise the local economy. He reaffirmed the BJP’s commitment to protecting Kerala’s cultural heritage, including the sanctity of Sabarimala.\nExpressing concern over radicalism, Mr. Nabin said Kerala is passing through a difficult phase that has impacted local businesses. A secure environment is essential for business growth, and the BJP would not compromise on national security, he said.\nDrawing a parallel with Bihar’s improved business climate under the National Democratic Alliance (NDA), he said the BJP aims to transform Kerala into an investor-friendly State. “Under Narendra Modi’s leadership, I assure you that a BJP government will be formed in Kerala in 2026,” he said, adding that the party is committed to building a developed Kerala as part of a developed India by 2047.\nState president Rajeev Chandrasekhar, State general secretaries A.S. Suresh and Shobha Surendran, along with other party leaders and representatives from various walks of life, participated in the programme.",
        "link": "https://www.thehindu.com/news/national/kerala/centre-has-significantly-increased-allocations-for-kerala-in-union-budget-nitin-nabin/article70604446.ece",
        "date": "Sat, 07 Feb 2026 20:53:50 +0530",
        "fetched_at": "2026-02-08 04:27:51.918428"
    },
    {
        "title": "Patriotic fervour marks Tirupati Book Festival",
        "content": "Students in tricolour attire singing Vande Mataram at 18th Tirupati Book Festival in Pandit Nehru High School grounds in Tirupati on Saturday.\n| Photo Credit: K.V. POORNACHANDRA KUMAR\nTo mark the 150th anniversary of Vande Mataram, 150 students sang the national song at the 18th Tirupati Book Festival 2026, displaying patriotic fervour.\nIISER Tirupati Director Santanu Bhattacharya said that the habit of reading books would continue to thrive, despite the advent of artificial intelligence (AI). “Critical thinking can never become the job of AI, as the human intellect will always reign supreme,“ said Mr. Bhattacharya.\nSimilarly, Kolkata-based Netaji Research Bureau Executive Director Sumantra Bose, who is also a professor of International and Comparative Politics at Krea University, Sri City, recalled the manner in which Vande Mataram filled patriotism in the Indian minds and hearts during the freedom struggle.\nA grand nephew of Netaji Subhas Chandra Bose, Mr. Bose recalled that his entire family had dedicated their lives to the cause of freedom struggle. He also explained how the song bagged the approval of leading political personalities like Netaji and Rabindranath Tagore.\nBharatiya Vidya Bhavan (Mumbai) executive secretary Jagdish Lakhani and Tirupati Kendra director N. Satyanarayana Raju recalled the vision of Bhavan’s founder K.M. Munshi in perpetuating the habit of book reading by bringing out good publications.\nBhavan’s Guntur unit secretary P. Ramachandra Raju and Bhimavaram unit member D.V. Lakshmipati Raju also took part.\nAndhra Pradesh\n/\nTirupati",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/patriotic-fervour-marks-tirupati-book-festival/article70604565.ece",
        "date": "Sat, 07 Feb 2026 20:51:18 +0530",
        "fetched_at": "2026-02-08 04:27:52.531598"
    },
    {
        "title": "Manmohan Singh govt.’s plan to relocate Dal Lake dwellers shelved; families to stay on the lake",
        "content": "in the face of poor implementation of the plan and inability to offer basic infrastructure at the location of resettlement, the J&K government has decided that “58 existing hamlets within the Dal Lake will be developed as ‘eco-hamlets’.” File\n| Photo Credit: The Hindu\nThe Jammu and Kashmir government has abandoned the ₹416.72-crore resettlement plan for Dal Lake dwellers. To a question from National Conference (NC) legislator Tanvir Sadiq, it told the J&K Assembly that the project achieved “only 27% progress” in 17 years.\nThe plan was conceived by former Prime Minister Manmohan Singh and Congress leader Sonia Gandhi to preserve and restore the lake, which attracts tourists from across the globe. The Singh government approved the plan in 2009.\nThe project sought to relocate and rehabilitate around 9,000 families from the Dal Lake ecosystem to tackle growing pollution, mitigate impact on aquatic life and preserve the shrinking lake.\nHowever, in the face of poor implementation of the plan and inability to offer basic infrastructure at the location of resettlement, the J&K government has decided that “58 existing hamlets within the Dal Lake will be developed as ‘eco-hamlets’.”\n“Work on six hamlets has already been taken up under the UT Capex budget, with one – Kachri Mohalla – already completed as a modern village,” the J&K government told the Assembly.\nAccording to the new plan, an in-situ conservation model will replace the old scheme, and “residents will be allowed to stay in ‘eco-hamlets’ developed within the water body”.\nThe shift in the policy has come in the wake of a report submitted by a high-level committee, headed by the Divisional Commissioner of Kashmir, last year. It described the Dal Lake dwellers as an “integral part of the lake ecosystem”. The committee called for the continued stay of these dwellers on the lake, while also stating that it was “equally important to keep it [the lake] vibrant, dynamic and lively”.\nThe government claimed that a sewerage network for six hamlets had been laid, and detailed project reports for modular sewage treatment plants were under preparation. A ₹212.38-crore project, named ‘Integrated Management Programme for conservation of Dal-Nigeen Lake ecosystem’, had been accepted in principle by the Ministry of Environment, Forest and Climate Change, it said.\nThe five-year project aimed to address sewerage in 28 internal hamlets, treat inflow from catchment areas and dredge interior channels, the reply stated, adding that it awaited the final approval from the Finance Department.\nUnder the ManmohanSingh government’s plan, 7,526 kanals of land were acquired at Bemina in the outskirts of Srinagar, and the colony was named Rakh-e-Arth Resettlement Colony. Each Dal Lake dweller was issued a land plot, ₹1.05 lakh for structure and ₹3.91 lakh as one-time compensation. However, the project re-settled only 1,808 families of around 9,000 Dal lake families, officials said.",
        "link": "https://www.thehindu.com/news/national/jammu-and-kashmir/manmohan-singh-govts-plan-to-relocate-dal-lake-dwellers-shelved-families-to-stay-on-the-lake/article70604014.ece",
        "date": "Sat, 07 Feb 2026 20:51:12 +0530",
        "fetched_at": "2026-02-08 04:27:53.145547"
    },
    {
        "title": "Five chairpersons from Kalaburagi district accorded Cabinet rank",
        "content": "The State government has accorded Cabinet rank to the chairpersons of various boards, corporations and authorities with immediate effect, to remain in force until further orders.\nFifty-four chairpersons across the State have been granted the status of State Ministers, entitling them to  facilities and privileges applicable to Cabinet rank functionaries. Of these, five chairpersons from Kalaburagi district have been elevated to Cabinet rank.\nThose from Kalaburagi district include Syed Mohammed Ali Al Hussaini, Chairperson of the Karnataka State Wakf Board; Neelakantharao Mulge, Chairperson of the Karnataka State Spices Development Corporation; Arun Kumar Patil, Chairperson of the Kalyana Karnataka Road Transport Corporation; Syed Mohammed Chishti, Chairperson of the Pulses Development Board; and Devendrappa Martur, Chairperson of the Sheep and Wool Development Corporation.\nThe order was issued by N.R. Bandarangayya, Under Secretary in the Department of Personnel and Administrative Reforms, directing that all facilities entitled to Cabinet-rank Ministers be extended to the chairpersons with immediate effect.",
        "link": "https://www.thehindu.com/news/national/karnataka/five-chairpersons-from-kalaburagi-district-accorded-cabinet-rank/article70604632.ece",
        "date": "Sat, 07 Feb 2026 20:41:00 +0530",
        "fetched_at": "2026-02-08 04:27:53.765239"
    },
    {
        "title": "‘Budget Quest’ aims at empowering youth participation in nation-building",
        "content": "State Information Commissioner Gajula Adenna, MYBharat representative Bisathi Bharath, and others releasing the awareness posters on MYBharat Budget Quest 2026 in Anantapur on Saturday.\n| Photo Credit: ARRANGEMENT\nState Information Commissioner Gajula Adenna launched the MYBharat Budget Quest 2026 initiative by releasing awareness posters alongside MYBharat representative Bisathi Bharath, Anantapur Urban Bank director Sunkara Ramesh and others. The event is aimed at empowering youth participation in nation-building.\nSpearheaded by Union Ministry of Youth Affairs and Sports, the initiative aims to spark intellectual curiosity and encourage young minds to actively engage with the vision of Viksit Bharat. The launch signals a commitment to fostering informed, responsible, and visionary citizens dedicated to the nation’s development.\nMeanwhile, the MYBharat Budget Quest Quiz 2026 will offer a unique platform for youth to understand the Union Budget 2026-27 and offer the opportunity to interact with Prime Minister Narendra Modi. Under the guidance of Union Minister for Youth Affairs and Sports Mansukh Mandaviya, the programme is inviting participants between the age of 15-29 to register on the MYBharat portal from February 3 to 17.\nOutstanding participants will present essays on key Viksit Bharat themes, Mr. Bisathi Bharath said, and urged students to seize this opportunity.\nAndhra Pradesh\n/\nAnantapur",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/budget-quest-aims-at-empowering-youth-participation-in-nation-building/article70604401.ece",
        "date": "Sat, 07 Feb 2026 20:35:58 +0530",
        "fetched_at": "2026-02-08 04:27:54.385718"
    },
    {
        "title": "Polavaram project to be completed on schedule, says PPA CEO",
        "content": "Centre and the State are in constant coordination to expedite the Polavaram project, keeping in view its national importance, says PPA CEO Yogesh Paithankar\n| Photo Credit: File photo\nPolavaram Project Authority(PPA) Chief Executive Officer Yogesh Paithankar said on Saturday that the Centre and the State governments were committed to completing the Polavaram project within the stipulated timeframe. He instructed officials and the executing agency to prepare and strictly adhere to a structured action plan for timely execution of all components.\nAt a review meeting at the project site, Mr. Paithankar said that all necessary design approvals and statutory clearances would be granted at the earliest. He reiterated that the Centre and the State were in constant coordination to expedite the project, keeping in view its national importance.\nEarlier in the day, the PPA CEO inspected key construction components, including Gap-1, Gap-2 and Earth-Cum-Rock Fill dam works. Officials from the Andhra Pradesh Water Resources Department and Megha Engineering and Infrastructures Limited briefed him on the ongoing activities and milestones achieved so far.\nMr. Paithankar also reviewed the progress of rehabilitation and resettlement of project-affected families and stressed the need for time-bound completion. PPA Chief Engineer M. Ramesh Kumar, Deputy Director Praveen Verma, WRD Engineer-in-Chief K. Narasimha Murthy, Superintending Engineers R. Ramachandra Rao and Tirumala Rao, Chief Engineer (Quality Control) Seshu Babu, Executive Engineers Balakrishna, Srinivas, Narasimha Rao, and Prem Chand, along with MEIL General Manager A. Gangadhar and Deputy General Manager P. Murali, attended.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/polavaram-project-to-be-completed-on-schedule-says-ppa-ceo/article70604408.ece",
        "date": "Sat, 07 Feb 2026 20:34:35 +0530",
        "fetched_at": "2026-02-08 04:27:55.000358"
    },
    {
        "title": "Amaravati Quantum Valley a game-changing initiative, says Andhra Pradesh Chief Minister Chandrababu Naidu",
        "content": "Andhra Pradesh Chief Minister N. Chandrababu Naidu and Union Minister of State (Independent Charge) for Science and Technology Jitendra Singh laying the foundation stone for Amaravati Quantum Valley, at Uddandarayunipalem in the capital region on Saturday. Union Minister P. Chandra Sekhar and IT Minister N. Lokesh are seen.\nAndhra Pradesh Chief Minister N. Chandrababu Naidu on Saturday described the laying of the foundation for the Amaravati Quantum Valley (AQV) as a historic moment not only for the State but also for the country, asserting that the initiative would place India at the forefront of global quantum revolution.\nThe foundation stone for the first integrated quantum valley ecosystem was laid by Union Minister of State (Independent Charge) for Science and Technology Jitendra Singh and Mr. Naidu, at Uddandarayunipalem in Amaravati, where Quantum Valley Towers would be built in 50 acres.\nAddressing the gathering on the occasion, Mr. Naidu said, “It marks more than the construction of buildings, as it also symbolises the creation of a strong base of global talent that will drive the quantum transition in the decades to come.”\nNoting that the United Nations had declared 2025 as the International Year of Quantum Science and Technology (IYQ), Mr. Naidu said quantum technology would become a critical pillar as technological capabilities expanded worldwide.\nWhile India had missed the agricultural and industrial revolutions, it had successfully embraced the IT revolution, he observed.\nComparing it with the Hitec City in Hyderabad, which then was a game-changer, the Chief Minister asserted that Amaravati would be developed on similar lines as a global hub for quantum technology.\nMr. Naidu said the AQV would emerge as a centre for quantum designs, products and intellectual property, with research spanning defence, healthcare, energy, finance and climate modelling. He expressed the confidence that global discourse would soon shift from Silicon Valley in the U.S. to Quantum Valley in Amaravati.\nHighlighting the unique land pooling model adopted for building the capital city, with farmers as key stakeholders, the Chief Minister thanked the IBM, TCS and L&T for partnering with the State government to establish India’s first 133-qubit quantum computer centre.\nMr. Jitendra Singh, in his address, lauded Mr. Naidu’s long-term vision. “The Chief Minister has planned for technologies that will shape the future decades in advance,” he said. The Union government had launched the National Quantum Mission with an allocation of ₹6,000 crore to position India as a global technology leader, he added.\n“Amaravati will become a hub not only for quantum computers but also for quantum professionals, with advanced research in defence, healthcare and finance,” he said, adding that B.Tech courses in quantum studies were already underway and M.Tech programmes would be launched soon.\nUnion Minister of State for Rural Development Pemmasani Chandra Sekhar, Andhra Pradesh Ministers Nara Lokesh (IT and HRD), P. Narayana (MA&UD), and Kandula Durgesh (Tourism), representatives of IBM, TCS and L&T, professors from IITs in Tirupati and Chennai, and industry leaders were present.\nLater, the Chief Minister and the Union Ministers unveiled the Wiser Quantum Talent Hub, under which a Centre of Excellence would impart training to 35 lakh students in quantum computing by 2035, marking Wiser’s first such facility outside the United States.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/amaravati-quantum-valley-a-game-changing-initiative-says-andhra-pradesh-chief-minister-chandrababu-naidu/article70604241.ece",
        "date": "Sat, 07 Feb 2026 20:41:22 +0530",
        "fetched_at": "2026-02-08 04:27:55.807792"
    },
    {
        "title": "Delay in Teegalaguttapalli ROB construction comes under spotlight again ahead of KMC elections",
        "content": "Motorists wait in a long queue at the railway level crossing, where a Road Over Bridge is under construction near the railway station in Karimnagar.\n| Photo Credit: SPECIAL ARRANGEMENT\nThe inordinate delay in completing the Road Over Bridge (ROB) at Teegalaguttapalli in Karimnagar remains one of the major issues facing residents of 2nd and 3rd divisions in the Karimnagar Municipal Corporation (KMC) limits.\nThe pressing issue affecting commuters and local residents alike has come into the spotlight yet again ahead of the municipal elections slated for February 11.\nMotorists wait in a long queue at the railway level crossing, where a Road Over Bridge is under construction near the railway station in Karimnagar.\n| Photo Credit:\nSPECIAL ARRANGEMENT\nThe ROB, the foundation stone of which was laid in July 2023, is yet to be completed. The ROB works were subsequently taken up under the Central government’s Setu Bandhan programme at an estimated cost of ₹154 crore. It was designed to alleviate traffic snarls at the busy railway level crossing near Karimnagar railway station.\nEven as the blame game between the main political parties continue over its delay, traffic snarls at the busy stretch of Karimnagar-Luxettipet highway have become a daily ordeal at the incomplete structure. Additionally, the clouds of dust that emanate from the ROB construction site have become a matter of concern for motorists as well as residents in the surrounding areas.\nResidents of several colonies in the 2nd and 3rd divisions have created a WhatsApp group in pursuit of their efforts to prevail upon the authorities concerned to ensure speedy completion of the ROB.\nTraffic congestion is a common sight during peak hour traffic at the railway level crossing, points out Tirupathi, a resident of Teegalaguttapalli.\nThere were several instances where ambulances carrying critically-ill patients were stuck in massive traffic jams, he recalls.\nOur consistent queries with the personnel at the ROB worksite met with cryptic replies citing ‘land acquisition’ and other issues, laments Ramesh, a resident of Saraswathi Nagar.\n“We don’t want any further assurances and speedy completion of the ROB is the only solution to our daily ordeal,” he insists.\nThe officials concerned were not available for a comment on the exact reason for the delay in completing the ROB works.",
        "link": "https://www.thehindu.com/news/national/telangana/delay-in-teegalaguttapalli-rob-construction-comes-under-spotlight-again-ahead-of-kmc-elections/article70604310.ece",
        "date": "Sat, 07 Feb 2026 20:08:24 +0530",
        "fetched_at": "2026-02-08 04:27:56.428458"
    },
    {
        "title": "India Could Be One Of The Best Choices For Legal Migration To Europe: Greek Defence Minister",
        "content": "Greek Defence Minister Nikos Dendias on Saturday said India and the wider Indian subcontinent could become among Europe’s most viable partners for legal migration, as the continent grapples with an ageing population and shrinking workforce.\nSpeaking at the India-EU Forum 2026 in New Delhi, Dendias described migration as a long-standing global reality and stressed the need for Europe to design structured and balanced migration pathways to address its demographic challenges.\n“Migration is a global phenomenon. It existed in the past and will continue in the future,\" he said, adding that Europe’s population growth is “almost negative,\" creating an urgent demand for younger workers.\nAgainst this backdrop, he noted that the Indian subcontinent’s demographic profile makes it a strong candidate for legal migration partnerships.\n“With its current population structure, the subcontinent could be one of the best choices for legal migration,\" Dendias said, while noting that such frameworks must be carefully designed to ensure mutual benefits for both countries of origin and destination.\nThe Greek minister also flagged concerns over illegal migration, calling it a destabilising challenge fuelled by organised human smuggling networks.\nHe urged stronger international cooperation to counter what he described as a large-scale, profit-driven criminal activity.\nBeyond migration, Dendias reflected on the historical and cultural links between Greece and India, referencing Alexander the Great’s expedition to the region.\nHe described India as an enduring presence in Greek mythology and suggested that contemporary cooperation offers an opportunity to renew and deepen bilateral ties.\nThe inaugural India-EU Forum, organised by the Ministry of External Affairs in partnership with the Ananta Centre, concluded on Saturday after two days of discussions on trade, security, technology and geopolitics.\nHeld from February 6 to 7, the Track 1.5 forum brought together more than 200 policymakers, industry leaders and strategic experts from India and European Union member states.\nExternal Affairs Minister S Jaishankar delivered the opening address on February 6, while Commerce and Industry Minister Piyush Goyal participated in a special session the same day. Nikos Dendias addressed a dedicated fireside chat on February 7.\nLatest Blogs",
        "link": "https://www.news18.com/india/india-could-be-one-of-the-best-choices-for-legal-migration-to-europe-greek-defence-minister-9887619.html",
        "date": "Sun, 8 Feb 2026 07:43:07 +0530",
        "fetched_at": "2026-02-08 04:28:04.415226"
    },
    {
        "title": "‘Didn't Mean To Insult': MP Minister Apologises Again For Remarks On Col Sofiya Qureshi",
        "content": "Madhya Pradesh Tribal Affairs Minister Kunwar Vijay Shah has offered another apology for his objectionable remarks against Colonel Sofiya Qureshi amid a Supreme Court-mandated deadline for his prosecution, saying he did not intend to insult a woman officer.\nIn May last year, Shah sparked a political row for his remarks against Col Qureshi, who became one of the most prominent faces of media briefings when India launched Operation Sindoor against terror hideouts in Pakistan. In a viral video, Shah was seen referring to the woman army officer as a “sister of terrorists\".\nHis remarks were widely criticised by political leaders, and an FIR was filed against him. Speaking to reporters on Saturday, Shah said he had never intended to insult a woman officer, the armed forces or any section of society.\n“I have said this many times earlier, and I am reiterating it today that I did not intend to insult any woman officer, the Indian Army or any section of society,\" he was quoted as saying by NDTV, adding that his remarks were made in a “moment of patriotic excitement\".\n“It is extremely painful for me that such a controversy arose due to a small error on my part. I believe my feelings will be seen in the right context. I have always had immense respect for the Indian Army and will continue to do so,\" he added.\nShah said maintaining “decorum and sensitivity of words\" was extremely important in the public and vowed to exercise control over his speech in the future. The Madhya Pradesh High Court had ordered the police to file an FIR against him last year for the controversial remarks.\nSupreme Court Raps MP Govt For Delay\nOn January 19, the Supreme Court pulled up the Madhya Pradesh government to he delay in granting permission to prosecute Shah for his remarks. The bench of Chief Justice of India (CJI) Surya Kant, Justice Dipankar Datta and Justice Joymalya Bagchi directed the state government to take a call on the grant of sanction to prosecute Shah.\n“You are sitting over the SIT report since August 19, 2025. The statute casts an obligation on you and you must take a call. It is January 19 now,\" CJI Kant remarked.\nOn July 28, 2025, the top court had pulled up Shah for not placing a public apology over his remarks on record against Col Qureshi, saying he was “testing the court’s patience\". It had pointed out that the minister’s conduct was prompting it to doubt his intentions and bonafide.\nThe FIR was registered against Shah under sections 152, 196(1)(b) and 197(1)(c) of the Bharatiya Nyaya Sanhita (BNS). Since the top court’s view last month, the Congress has demanded Shah’s resignation from the Madhya Pradesh cabinet.\nLatest Blogs",
        "link": "https://www.news18.com/india/didnt-mean-to-insult-mp-minister-apologises-again-for-remarks-on-col-sofiya-qureshi-9887409.html",
        "date": "Sat, 7 Feb 2026 22:11:55 +0530",
        "fetched_at": "2026-02-08 04:28:05.045058"
    },
    {
        "title": "'If Intent Is Pure...': Piyush Goyal Credits PM Modi's 'Masterclass' For India-US Trade Deal",
        "content": "Union Commerce Minister Piyush Goyal on Saturday credited Prime Minister Narendra Modi’s “masterclass\" and US President Donald Trump’s leadership in securing a landmark India-US trade deal, emphasising that the two countries share a good relationship and mutual respect.\nSpeaking in an exclusive interview with CNN-News18, Goyal said it was PM Modi and Trump’s leadership that gave impetus to the trade deal and helped smooth engagement between the two sides. “If your intent is pure, if you believe in fair play on both sides and respect each other’s sensitivities, and are committed to the well-being of your nation while recognising strengths, it leads to mutual understanding,\" he said.\nHe called the deal a powerful “win-win\" arrangement for both countries to strengthen trade engagement. “When we look at the $30 trillion US economy and the $4 trillion Indian economy that is rapidly growing to become a $30 trillion economy in 2047, we both collectively provide a force multiplier, which helps us achieve the target of $500 billion purchases in five years,\" he said.\nHis remarks came after an interim deal between India and the US was announced on Saturday, culminating months of negotiations amid tariff-related tensions. The deal provides for a reduction in reciprocal US tariffs on Indian goods to 18 per cent.\nPM Modi’s ‘Masterclass’\nGoyal further lauded PM Modi, calling him a “pragmatic leader\" who recognises India’s comparative strengths and the sensitive areas, such as farmers and fishermen. “This unique and clear understanding of PM Modi has helped us navigate the whole process,\" he added.\nHe compared PM Modi to a “masterclass\" who is very practical and offers real-life solutions. “Over the last 12 years of working with him, we have all actually grown in terms of our understanding of principles of negotiation, and our understanding of how to look at the best interests of your nation. Most important is his holistic thinking,\" he told CNN-News18.\nThe Commerce Minister said India’s focus is on acquiring ICT products, data centres and quantum computing equipment from the US to become an international player in modern-day technological areas.\nIndia-US Ties\nHe also asserted that India shares a good relationship with the United States, who respected each other’s sensitive areas. He also rejected criticism that the deal could affect Indian farmers, adding that several Indian exports are facing zero tariffs.\nHe also said he foresaw no problems with the US in the future, citing the friendly relations between the two sides and the fact that teams had finalised all matters after months of negotiations. “We are not that much apart in terms of our abilities to conclude a good deal. We are not competitors, we complement each other. We respect each other’s sensitivities. Both leaders guided teams,\" he added.\nHe said India was already self-sufficient in rice, wheat, sugar, soyabean, corn, GM products, poultry, millets, certain fruits and green peas, groundnuts and non-alcoholic beverages. These products that were sensitive for the farmers and were protected under the new deal. “On other products, there has been a calibrated opening. In many cases, there has been some phasing out over a period of time and tariff rate quotas have been given.\"\nGoyal expressed confidence that the trade deal could generate several opportunities for collaboration between the two countries.\nLatest Blogs",
        "link": "https://www.news18.com/india/if-intent-is-pure-piyush-goyal-credits-pm-modis-masterclass-for-india-us-deal-ws-l-9887017.html",
        "date": "Sat, 7 Feb 2026 18:40:10 +0530",
        "fetched_at": "2026-02-08 04:28:05.681921"
    },
    {
        "title": "Prescription For Crises: Govt May Ask Pharma Firms To Fund Free Medicines For Emergencies",
        "content": "India is examining a proposal to mandate pharmaceutical companies to set aside a share of their profits for free medicines during health emergencies, News18 learned.\nThe proposal seeks an amendment to the Drugs Rules, 1945, to include a mandatory provision requiring pharmaceutical companies to spend “at least one per cent of their net profit for providing free medicines in medicine bank\" to be used by the central government during “health emergencies, disaster or any other circumstances considered necessary\".\nThe proposal is still under deliberation and has been placed before the country’s top statutory decision-making body on technical matters related to drugs and cosmetics, the Drugs Technical Advisory Board.\nThe move, according to the agenda document accessed by News18, is being examined to assess whether emergency access to free medicines can be strengthened through regulatory changes without conflicting with company law.\nThe proposal was deliberated at DTAB’s 90th meeting held on January 25, 2024, after which the board recommended that the Ministry of Health and Family Welfare may seek the opinion of the Ministry of Corporate Affairs on the matter.\nSubsequently, comments were received from the corporate affairs ministry, which flagged legal constraints. The agenda document notes that “the broad framework for CSR is laid down under Section 135 of the Companies Act, 2013\", along with Schedule VII of the Act and the Companies (CSR Policy) Rules, 2014.\nIt further clarifies that “the Government does not issue specific direction or intervention in the manner or geographical area in which companies choose to spend their CSR funds\", highlighting limits on directing CSR expenditure through sector-specific rules.\nThe corporate affairs ministry has indicated that any attempt to mandate CSR-linked spending through drug regulations would need to be legally aligned with company law. The document states that “CSR is governed by Companies Act, 2013,\" and therefore suggests that “the authority for CSR activity may be quoted from Schedule VII, Companies Act, 2013 and Companies (CSR Policy) Rules, 2014 and proposed amendment in Drugs Rules, 1945 need to be in sync\".\nMore significantly, it cautions that “any amendment in the CSR framework would require an amendment to the Companies Act\", suggesting that changes through the Drugs Rules alone may not be sufficient.\nThe matter has now been placed back before DTAB, with the agenda concluding that “DTAB may kindly deliberate and give its recommendations in the matter\".\nThe matter continues to be reviewed, with regulators weighing public health needs against existing corporate law provisions.\nLatest Blogs",
        "link": "https://www.news18.com/india/prescription-for-crises-govt-may-ask-pharma-firms-to-fund-free-medicines-for-emergencies-9885630.html",
        "date": "Sat, 7 Feb 2026 07:00:34 +0530",
        "fetched_at": "2026-02-08 04:28:07.046905"
    },
    {
        "title": "'Will Inspire Many Young Sportspersons': PM Modi's Message To U-19 Cricket Team On World Cup Win",
        "content": "Prime Minister Narendra Modi on Friday praised India’s Under-19 cricket team after their World Cup victory, saying the win would “inspire many young sportspersons\".\nIn a post on X, the Prime Minister said India’s cricketing talent had once again shone on the global stage. He congratulated the team for bringing home the U-19 World Cup and said they had played very well throughout the tournament.\n“Proud of our U-19 team for bringing home the World Cup. The team has played very well through the tournament, showcasing exceptional skill. This win will inspire several young sportspersons too. Best wishes to the players for their upcoming endeavours,\" PM Modi wrote.\nIndia’s cricketing talent shines!Proud of our U-19 team for bringing home the World Cup. The team has played very well through the tournament, showcasing exceptional skill. This win will inspire several young sportspersons too. Best wishes to the players for their upcoming…\n— Narendra Modi (@narendramodi) February 6, 2026\nIndia clinched the U-19 World Cup title for a record-extending sixth time after defeating England by 100 runs in the final held in Harare, Zimbabwe.\nWith this win, India strengthened their position as the most successful team in the history of the U-19 World Cup.\nA major highlight of the final was opener Vaibhav Sooryavanshi, who delivered a brilliant performance on the biggest stage of his young career. The teenage batter scored a stunning century, reaching the milestone in just 55 balls and playing a key role in India’s dominant win.\nThe 14-year-old Sooryavanshi smashed a record 80-ball 175, an innings comprising an astonishing 15 fours and 15 sixes as India also broke the record for the highest total ever in a U19 World Cup final. His innings is also the highest individual score in a summit clash of the tournament.\nLatest Blogs",
        "link": "https://www.news18.com/sports/will-inspire-many-young-sportspersons-pm-modis-message-to-u-19-cricket-team-on-world-cup-win-ws-l-9885509.html",
        "date": "Fri, 6 Feb 2026 21:49:28 +0530",
        "fetched_at": "2026-02-08 04:28:07.668976"
    },
    {
        "title": "Rent Promises, Red Flags & Runaway Dues: Saket Court Seeks Police Report On '32nd Milestone' Project Promoters",
        "content": "What began as a promise of guaranteed rentals and glossy commercial returns has now landed the promoters of Gurugram’s “32nd Milestone\" project in a Delhi courtroom, with a magistrate seeking a detailed police response to allegations of cheating, fund diversion, and large-scale financial irregularities.\nA Judicial Magistrate First Class at Saket Courts has issued notice on an application seeking registration of an FIR and a slew of stringent measures against the promoters and entities behind the commercial project, including freezing of bank accounts, a forensic audit of finances, suspension of passports, and issuance of Look Out Circulars. The order was passed on February 5 by JMFC Devanshi Janmeja, directing the police to file an Action Taken Report (ATR). The matter is scheduled for further hearing on March 13.\nThe application has been moved by investor Arvind Gupta, who has accused the promoters of financial misconduct, cheating, and siphoning of investors’ funds. Action has been sought against M/s 32nd Vistas Private Limited, Growth Hospitality LLP, and their promoters, including Dhruv Dutt Sharma, Shirin Sharma, Mamta Sharma, and others.\nAccording to the complaint, the investor had purchased a commercial unit in the project after being assured that the unit would be demarcated shortly. The promoters allegedly offered guaranteed lease rentals for a period of 30 years, along with a buyback option at any stage if the investor chose to exit. A leasing arrangement was subsequently executed, under which the unit was placed on a long-term lease with assurances of regular monthly rental income.\nHowever, the complaint alleges that lease rental payments stopped from August 2025 onwards. It further claims that the promoters failed to deposit Tax Deducted at Source (TDS) from September 2024 and defaulted on GST dues, statutory filings, and employee-related contributions such as ESI and PF, allegedly causing losses to investors, employees, and the public exchequer.\nThe complainant has alleged that investors were repeatedly told that rental payments and TDS deposits had already been credited but were not reflecting due to “technical issues\", claims that later turned out to be false. It is further alleged that fabricated TDS certificates were circulated among investors to create the impression that statutory deposits had been made, despite no such entries appearing in official records.\nWhen the investor sought demarcation and possession of the purchased unit or invoked the buyback option, the promoters allegedly expressed their inability to hand over possession. The application suggests that one possible reason could be multiple sales of the same commercial units.\nSerious allegations of diversion and siphoning of funds have also been raised. The plea claims that despite earning rental income from operational restaurants and commercial establishments at the project, the promoters failed to clear dues owed to investors, employees, financial institutions, and statutory authorities. It is also alleged that substantial borrowings were raised from banks and private investors and were misused.\nThe application further states that protests have been taking place outside the project premises, offices have allegedly been shut, and essential utilities such as electricity and water supply disconnected due to non-payment of dues, while the promoters are claimed to be untraceable.\nConcerns have also been raised regarding alleged expenditure on promotional campaigns and high-profile endorsements. The plea refers to associations involving public figures such as Malaika Arora, Abhay Deol, Karan Johar, Manish Malhotra, and Akshay Kumar, and seeks investigation into the financial trail of such promotional spending at a time when investor dues allegedly remain unpaid. No allegations have been levelled against these celebrities, and the plea confines itself to examining the source of funds used for such promotions.\nOn these grounds, the application seeks registration of an FIR, attachment of assets, forensic audit of accounts, suspension of passports of the promoters, and issuance of Look Out Circulars to prevent them from leaving the country.\nTaking note of the allegations, the Saket court has directed the police to submit a detailed status report and listed the matter for further consideration on March 13.\nThe company has said in a statement that recent delays in rental payments have been driven by a short-term vacancy in a limited portion of its Gurugram property, arising from normal tenant churn and a change in tenancy, and that “replacement leasing is already underway and being prioritised\".\nNotably, the legal action in Delhi follows recent FIRs registered by Gurugram Police against the owner and certain officials associated with “32nd Avenue\", the popular retail and entertainment hub, after investor protests.\nLatest Blogs",
        "link": "https://www.news18.com/india/rent-promises-red-flags-runaway-dues-saket-court-seeks-police-report-on-32nd-milestone-project-promoters-9885011.html",
        "date": "Fri, 6 Feb 2026 18:21:49 +0530",
        "fetched_at": "2026-02-08 04:28:08.300855"
    },
    {
        "title": "In Rare Move, Delhi Police Book IPS Officer, Others Over 'Illegal Detention & Unauthorised Raids'",
        "content": "Delhi Police’s vigilance unit has registered a case following an internal inquiry into a November 2023 police operation carried out in Mizoram. The case was registered after an inquiry concluded that there was prima facie material suggesting procedural and jurisdictional irregularities during the operation.\nAccording to the FIR, the case has been filed under Sections 166, 341, 342, and 409 of the Indian Penal Code to allow a formal criminal investigation into the conduct of officers involved against IPS Shankar Choudhary, a 2011 batch officer, along with others.\nThe inquiry examined a cross-state police action conducted between November 21 and 30 in 2023 by a Delhi Police team in Mizoram in connection with a narcotics investigation. The FIR records that the team stayed and conducted operations outside Delhi’s territorial jurisdiction and that questions were later raised by Mizoram authorities about authorisation and custody procedures.\nThe document talks about an unauthorised stay and operations without lawful written orders from a competent authority.\nThe inquiry reviewed CCTV footage, travel records, PCR logs, and witness accounts to reconstruct the events.\nAccording to the FIR, the vigilance inquiry found sufficient preliminary material to justify criminal registration, so the matter could be independently investigated.\n“These observations constitute prima facie material for registration of a case to enable fair and independent investigation,\" the report states. “The purpose of the present registration is to enable a fair and independent investigation into the circumstances of the operation.\"\nThe FIR names IPS officer Shankar Choudhary as part of the raiding team whose conduct is under review.\nThe document records, “Shankar Choudhary IPS… was part of the raiding team which stayed and conducted operations in Mizoram during the period under inquiry.\"\nOn authorisation, the inquiry notes, “The officer stayed in Mizoram and continued operational activity without obtaining written permission from the competent authority.\"\nThe report also raises concerns over detention procedures: “Illegal detention… demonstrates that Harrison House premises were taken under control and individuals were confined without lawful authority.\"\nInvestigators further recorded, “No proper documentation of seizure, custody or inter-state coordination was found at the time of inquiry.\"\nAccording to the FIR, the Delhi Police officials only provided assistance in conducting the raid under the bona fide impression that the Mizoram Police team, led by a senior police officer who earlier served as DCP/Dwarka, was carrying out the investigation legally.\n“The onus was on Mizoram Police to comply with the procedural safeguard, prepare all necessary documentation related to search, seizure and arrest/detention including case diaries,\" the FIR says.\nIt further states that the role of Delhi Police officials was limited to making an entry whenever the staff moved with Mizoram Police and a detainee was brought to the police station or Anti-Narcotic Squad of Dwarka/South West.\n“Upon holistic examination of the facts, evidence, and testimonies, the following findings emerge: Shankar Choudhary, IPS, acted beyond his legal and territorial authority. He conducted unauthorised raids and seizures within Delhi, violating legal and administrative protocols. He kept a suspect, Harrison, in illegal custody for four days at Mizoram House. He failed to document seized property, thereby violating legal, procedural and evidentiary norms. Delhi Police Officials (HC Shalju, HC Vikash, HC Prashant) accompanied the officer and participated in raids without requisite sanction. Their actions, while irregular, do not establish mens rea or criminal culpability but warrant departmental action,\" the report says.\nRecommendations were made to book Shankar Choudhary for abusing authority, wrongful confinement, and misappropriation of seized property.\nLatest Blogs",
        "link": "https://www.news18.com/india/in-rare-move-delhi-police-book-ips-officer-others-over-illegal-detention-unauthorised-raids-9884615.html",
        "date": "Fri, 6 Feb 2026 17:34:25 +0530",
        "fetched_at": "2026-02-08 04:28:08.930141"
    },
    {
        "title": "'Govt In Touch With Indians In Iran, Closely Monitoring Situation': Jaishankar To Parliament",
        "content": "External Affairs Minister S Jaishankar on Friday told the Parliament that the Indian government is closely monitoring the ongoing situation in Iran after a wave of protests triggered by economic stagnation, and its embassy in Tehran was in regular touch with Indian nationals.\n“The Government is closely monitoring the situation in Iran. The Embassy of India in Tehran is in regular contact with Indian nationals, including students, in Iran, and is providing them regular advice,\" he said in the Parliament. “The Embassy continues to assist, advise, and guide Indian citizens as required.\"\n“The Government does not currently view Indian nationals in Iran as stranded, given that Iranian airspace remains open and there is regular air connectivity between Iran and India and with the countries in the region. A special evacuation has therefore not been arranged by the Government so far. The Government continues to assess the situation as circumstances evolve,\" he also said.\nHe also informed the House that there were 9,000-10,000 Indian nationals across 16 provinces in Iran, mainly students (and their families), workers, pilgrims, tourists, business persons and seafarers. “Since Iranian airspace remains open as on date, Indian nationals wishing to leave Iran have been advised to do so using available means, including commercial flights,\" he said.\nHe also highlighted a telephonic conversation with his Iranian counterpart Abbas Araghchi, where they discussed the evolving situation in and around Iran. He also reaffirmed that India remains in touch with various interlocutors regarding the situation.\nThis came against the backdrop of the Iranian authorities’ deadly response to anti-government protests that began in late December and continued through last month, in which thousands of people were killed and tens of thousands arrested, prompting military threats from US President Donald Trump.\nThis came against the backdrop of the Iranian authorities’ deadly response to anti-government protests that began in late December and continued through last month, in which thousands of people were killed and tens of thousands arrested, prompting military threats from US President Donald Trump.\nRecently, in the Budget 2026 unveiled on February 1, India earmarked zero funds for the Chabahar port in Iran despite the landmark 10-year agreement signed in 2024 for India to operate the Shahid Beheshti terminal. Analysts suggest this withdrawal is a precautionary response to the renewed geopolitical friction involving the United States.\nFurthermore, Trump has also asserted that India will buy Venezuelan oil instead of Iranian crude, signalling a possible shift in global energy trade flows. However, India said it will prioritise its own energy needs and remains open to all crude deals.\nLatest Blogs",
        "link": "https://www.news18.com/india/govt-closely-monitoring-situation-in-iran-in-touch-with-indians-jaishankar-to-parliament-ws-kl-9884898.html",
        "date": "Fri, 6 Feb 2026 17:32:12 +0530",
        "fetched_at": "2026-02-08 04:28:09.562895"
    },
    {
        "title": "Delhi Govt Moves To Create Unified Transport Authority, Sets Up Task Force",
        "content": "In a major institutional reform aimed at transforming urban mobility in the national capital, the Delhi government has initiated the process of drafting a comprehensive Bill for the creation of the Delhi Unified Metropolitan Transport Authority (DUMTA) along with a dedicated Delhi Urban Transport Fund (DUTF).\nThe proposed legislation seeks to rationalise, integrate and coordinate Delhi’s presently fragmented transport ecosystem under a single, coherent planning and governance framework.\nThe move marks a significant milestone in the government’s vision to create a modern, efficient, people-centric and environmentally sustainable transport system for the Capital.\nTo fast-track and ensure inclusive drafting of the proposed law, the Chief Minister has set up a high-level task force chaired by the Chief Secretary to prepare and submit the draft Bill at the earliest. The move reflects the government’s urgency and responds to long-standing demands from experts and civic stakeholders for a unified transport authority to coordinate planning, investment and operations, a press statement said.\nRecognising that Delhi’s rapid urbanisation, rising population and mounting vehicular pressure demands systemic solutions rather than piecemeal interventions, the Chief Minister has taken a proactive step by setting the legislative process in motion.\nThe task force includes senior officials from key departments and representatives of major civic and transport bodies such as DDA, MCD, DMRC, DTC, NCRTC and Indian Railways. The Chief Minister has also proposed co-opting leading urban transport experts to integrate global best practices with local needs.\nExplaining the rationale behind the initiative, Chief Minister Rekha Gupta noted that Delhi’s transport agencies have historically functioned in silos, with limited coordination in route planning, infrastructure development and service delivery.\n“DUMTA will bring cohesion to Delhi’s entire urban mobility system. By placing all modes of transport like metro, buses, regional rail, railways and feeder services, within a single planning jurisdiction, we will ensure that mobility solutions are integrated, efficient and citizen-focused,\" the CM said.\nLatest Blogs",
        "link": "https://www.news18.com/cities/new-delhi-news/delhi-govt-moves-to-create-unified-transport-authority-sets-up-task-force-ws-kl-9884698.html",
        "date": "Fri, 6 Feb 2026 16:51:11 +0530",
        "fetched_at": "2026-02-08 04:28:10.205916"
    },
    {
        "title": "Weight Loss Drug Semaglutide Boom Pushes India To Consider Defining Biological Medicines",
        "content": "India is moving to formally define ‘biological drugs’ under its medicines law, as the category expands with the launch of some of the world’s top-selling therapies, including anti-obesity and diabetes blockbuster semaglutide, News18 learnt.\nThe move comes as drug regulators grapple with fast-evolving manufacturing technologies that blur the lines between synthetic medicines and biologically derived products, often produced within the same facility. The Drugs Technical Advisory Board (DTAB) is now set to deliberate on a proposal that seeks to introduce a legal definition of biological products, mandate origin-based labelling, and update legacy schedules under the Drugs Rules, 1945, to reflect modern biologics.\nThe matter has now been formally placed before the apex drug approval panel, Drugs Technical Advisory Board, with the agenda document concluding that “DTAB may kindly deliberate and give its recommendation in the matter.\"\nIf approved, industry experts believe the changes would mark a significant overhaul of India’s biological drug regulation, bringing long-overdue legal clarity at a time when biologics and peptide-based therapies are rapidly reshaping the pharmaceutical landscape. The move is also significant considering India itself is planning to become hub of biological and biosimilar drug making with finance minister Nirmala Sitharaman announcing the “BioShakti Pharma Hub\" scheme in the union budget last Sunday.\nAccording to the agenda document accessed by News18, the proposal has been triggered by a growing number of applications received by the Central Drugs Standard Control Organisation, where manufacturers are seeking regulatory approval to produce both synthetic and recombinant products at the same site. The document said that “CDSCO receives multiple applications wherein manufacturers seek permission to manufacture synthetic and r-DNA origin drug products in the same manufacturing facility.\"\nRegulatory agency in the document noted that this convergence has become especially prominent in peptide-based therapies. “Certain peptide-based therapeutic products, such as Semaglutide and similar products are available in both synthetic and r-DNA origin and in injectable as well as oral dosage forms,\" the agenda paper says, underlining the regulatory complexity such products pose.\nWhile the existing framework allows limited flexibility, the regulator acknowledges that the rules lack clarity on core definitions. “Schedule M of the Drugs Rules, 1945 provides provision for campaign-based manufacturing with appropriate cleaning validation and risk mitigation measures,\" the document said but adds that “the substantive provisions of the Drugs Rules do not define ‘Biological drugs’.\"\nThe absence of a formal definition has also created uncertainty around licensing, particularly when different categories of drugs are produced at the same location. The agenda paper flags that “currently, there are no provisions on licensing overlap between facilities licensed under Form 28 and Form 28D at the same site,\" raising concerns about regulatory oversight, inspections and compliance.\nTo address these gaps, the proposal recommends incorporating a definition of “biological products\" into both the Drugs Rules and the New Drugs and Clinical Trials (NDCT) Rules, 2019. Citing global standards, it reproduces the World Health Organization’s definition, describing biological products as “a product containing a substance produced by or extracted from biological sources, such as living cells or organisms, and which require complex manufacturing processes and control.\"\nThe document further clarifies that “biological products include vaccines, blood and blood components, allergenic, somatic cells gene therapies, tissues, recombinant therapeutic proteins and monoclonal antibodies.\"\nIn a move aimed at improving transparency, the regulator has also proposed mandatory origin-based labelling. The agenda note states that “mandatory labelling provisions may be introduced to clearly indicate the origin of the drug as ‘Synthetic Origin,’ ‘r-DNA Origin,’ ‘Human Origin,’ or ‘Animal Origin,’ as applicable.\"\nAdditionally, the proposal calls for “consequential amendments\" to Schedule C and Schedule C1 of the Drugs Rules, 1945, to explicitly include biological-origin products in both parenteral and non-parenteral forms, reflecting the growing diversity of modern biological therapies.\nLatest Blogs",
        "link": "https://www.news18.com/india/weight-loss-drug-semaglutide-boom-pushes-india-to-consider-defining-biological-medicines-ws-el-9884395.html",
        "date": "Fri, 6 Feb 2026 15:39:44 +0530",
        "fetched_at": "2026-02-08 04:28:10.846322"
    },
    {
        "title": "NIA Raids Government Medical College Anantnag Linked To 'White Collar' Terror Module",
        "content": "The National Investigation Agency (NIA) conducted a search operation at the Government Medical College in Anantnag district of Jammu and Kashmir on Friday. This was in connection with the “white collar\" terror module that was dismantled in November last year.\nAccording to officials, the NIA team arrived at GMC Anantnag to carry out the searches related to the recovery of a rifle found in a doctor’s locker in November of the previous year. Dr. Adeel Ahmad Rather was one of the nine individuals arrested during the investigation into the terror module, which also led to the discovery of a significant amount of explosives in Faridabad, NCR.\nIn a parallel development, security forces continued their search operations in the Koil Karewa area of Pulwama district. Officials stated that the operation was initiated following intelligence reports about the presence of terrorists in the region. No arrests or significant recoveries have been made so far in this ongoing operation.\nOne Terrorist Killed In J-K’s Kishtwar\nEarlier this week, a suspected Pakistani terrorist was killed in an operation in the snow-bound higher reaches of Jammu and Kashmir’s Kishtwar district. The operation took place on Wednesday.\n“In the continuing search and elimination of terrorists in the Kishtwar region, where the hunt has already led to several contacts in the dense forests and challenging terrain, a contact was re-established with the terrorists on the run in the ongoing joint operation (Trashi-I), by the troops of Counter-Insurgency Force Delta, White Knight Corps, J&K Police and CRPF at around 5:45 pm today in the general area of Dichhar, Kishtwar. One terrorist has been successfully neutralised. Operation is in progress,\" Army’s White Knight Corps said in a post on X.\nLatest Blogs",
        "link": "https://www.news18.com/india/nia-raids-government-medical-college-anantnag-linked-to-white-collar-terror-module-ws-l-9884205.html",
        "date": "Fri, 6 Feb 2026 15:46:15 +0530",
        "fetched_at": "2026-02-08 04:28:11.471955"
    },
    {
        "title": "'Ego-Driven Killing': How Overseas Gangsters Orchestrated AAP Leader's ‘Remote Control’ Murder",
        "content": "The killing of Aam Aadmi Party (AAP) leader Lucky Oberoi has once again exposed the growing challenge posed by overseas-based criminal networks directing violence in Punjab from thousands of kilometres away. CCTV visuals showed a hooded assailant shooting Oberoi at close range before fleeing the scene on a scooter, pointing to a well-planned execution rather than a spontaneous act.\nTop intelligence sources have told CNN-News18 that the murder was allegedly orchestrated by Jograj Singh, also known as Joga Pholriwal — a known gangster originally from the Jalandhar–Phulriwal belt — who is currently believed to be operating from either the United States or Canada. According to security agencies, the killing did not stem from a deep political conspiracy but was triggered by pride, online provocation, and the unchecked influence of criminals operating from abroad.\nIntelligence sources allege that a minor altercation between Oberoi and Jograj Singh escalated over social media in the days leading up to the murder. Investigators claim the online exchanges were not random and played a direct role in provoking the attack. “This was a classic case of ego-driven violence amplified through digital platforms,\" a source claimed.\nSources further revealed that Jograj Singh began his criminal journey as a small-time offender involved in intimidation, assault, and extortion-related activities in Punjab. Mounting pressure from law enforcement eventually forced him to flee the country. Once abroad, distance provided him a degree of immunity, allowing him to operate with greater confidence and reduced fear of immediate arrest.\nSecurity agencies have described the killing as a “remote control murder\" — an emerging pattern in Punjab’s crime landscape. According to Punjab Police and central intelligence agencies, overseas handlers no longer pull the trigger themselves. Instead, they use encrypted messaging apps, social media provocations, and digital payments to recruit and motivate local foot soldiers to carry out violent acts.\nJograj Singh is also said to be associated with Sonu Khatri, another gangster based overseas. Intelligence sources suggest that Khatri functions less as a street-level criminal and more as a network facilitator. Agencies believe his role includes connecting overseas gangsters with local shooters, arranging logistics, and routing money through informal channels to finance murders.\nThe Oberoi killing, intelligence sources warn, underscores a dangerous trend where digital reach and transnational criminal networks are turning minor disputes into deadly outcomes, posing a growing challenge for Indian law enforcement agencies.\nLatest Blogs",
        "link": "https://www.news18.com/india/ego-driven-killing-how-overseas-gangsters-orchestrated-aap-leaders-remote-control-murder-ws-l-9884114.html",
        "date": "Fri, 6 Feb 2026 14:59:33 +0530",
        "fetched_at": "2026-02-08 04:28:12.100589"
    },
    {
        "title": "Karnataka Cabinet Gives Nod To Use Of Ballot Papers In Panchayat Polls",
        "content": "The Karnataka government on Thursday gave its approval to use ballot papers and ballot boxes for upcoming panchayat elections. The decision clears the way for changes in the law ahead of the Panchayat polls.\nSpeaking about the same, State Minister HK Patil said that the approved Karnataka Gram Swaraj and Panchayat Raj (Amendment) Bill, 2026, will allow elections to be conducted using traditional voting methods instead of electronic machines.\nPatil stated that the existing law does not contain provisions for ballot papers and boxes, and necessary legal changes will now be made wherever required. He confirmed that the forthcoming Panchayat elections will be conducted through this method.\nThe state government has expressed concerns about the use of Electronic Voting Machines (EVMs). It believes public confidence in the machines has declined, prompting the shift to paper ballots.\nLast September, the Congress government had already decided to recommend to the State Election Commission that future panchayat and urban local body elections be held through ballot papers rather than EVMs, citing questions raised by people over their credibility.\nLatest Blogs",
        "link": "https://www.news18.com/india/karnataka-cabinet-gives-nod-to-use-of-ballot-papers-in-panchayat-polls-ws-l-9884272.html",
        "date": "Fri, 6 Feb 2026 14:56:06 +0530",
        "fetched_at": "2026-02-08 04:28:12.763027"
    },
    {
        "title": "405 Air Purifiers Bought For Parliament, Govt Offices, SC In Last Four Years: Minister Informs Lok Sabha",
        "content": "Amid the ongoing woes of Delhi air pollution, the Central Public Works Department (CPWD), a prime construction and maintenance agency of the central government, has procured 405 air purifiers between 2021 and 2025.\nAs per the official data, the highest number of air purifiers — 156 units — were purchased during the last financial year (2024-25), the Lok Sabha was informed on Thursday.\nThe data was provided in response to a question asked by TMC MP Mahua Moitra. Union Minister of State for Housing and Urban Affairs Tokhan Sahu informed that the air purifiers were issued to government offices, chambers, VVIP lounges and dining halls of judges and registrars of the Supreme Court of India.\nDetailing the use of the device, it was mentioned that the air purifiers were also installed in courtrooms and offices associated with the apex court.\nBesides this, the air purifiers were also provided to the offices of ministers, ministries at Nirman Bhawan, Sewa Bhawan, Vigyan Bhawan and key institutional locations such as the Constitution Club of India.\nAir purifiers were also issued to the Lok Sabha and Rajya Sabha secretariats, besides CPWD offices in Jodhpur and Varanasi.\nIn the written reply, it is clearly mentioned that in 2021-22, the CPWD purchased 24 air purifiers, which rose to 81 units in 2022-23. The numbers then grew in 2023-24 with the procurement of 144 air purifiers, followed by the highest purchase in 2024-25 in the last five years.\nThe reply included the details of the purchases made through the government’s online procurement portal, which showed air purifiers of Eureka Forbes, Honeywell, Phillips, Dyson and other brands being bought over the four years.\nApart from major construction projects, the CPWD, which comes under the Union Housing and Urban Affairs Ministry, also looks after the maintenance of central government buildings.\n(With agency inputs)\nLatest Blogs",
        "link": "https://www.news18.com/india/cpwd-purchased-405-air-purifiers-for-parliament-govt-offices-supreme-court-in-last-four-years-9883778.html",
        "date": "Fri, 6 Feb 2026 13:52:12 +0530",
        "fetched_at": "2026-02-08 04:28:13.397301"
    },
    {
        "title": "Delhi | Shocking That Delhi Authorities Have Not Learned A Lesson From Noida Techie's Death: Lawyer",
        "content": "| Delhi biker dies after falling into a massive pit dug by water board, murder angle also being probed\"Shocking that Delhi authorities have not learned a lesson from Noida techie's death\": Abhasinghlawyer Mobile App - https://onelink.to/desc-youtube\nLatest Blogs",
        "link": "https://www.news18.com/videos/india/delhi-shocking-that-delhi-authorities-have-not-learned-a-lesson-from-noida-techie-s-death-lawyer-9885298.html",
        "date": "Fri, 6 Feb 2026 13:13:41 +0530",
        "fetched_at": "2026-02-08 04:28:14.017603"
    },
    {
        "title": "Delhi Biker Dies After Crashing Into Jal Board Pit, Water Minister Announces Ex-Gratia Of Rs 10 Lakh",
        "content": "A motorcyclist was found dead inside a massive pit at a road construction site in West Delhi’s Janakpuri area on Friday morning, triggering allegations of negligence from his family. The deceased was identified as Kamal, a resident of Kailashpuri.\nThe Delhi government later ordered a probe into the case, Urban Development Minister Ashish Sood confirmed.\nWater Minister Parvesh Verma has announced an ex gratia of Rs 10 lakh for the family of the deceased. The Delhi Jal Board has also set up a committee to probe the death of the motorcyclist who allegedly fell into a construction pit dug by the water agency.\nAccording to the relatives of the man, he was returning home late on Thursday from his office in the Rohini area and had remained in touch with family members during the commute.\nWhen he failed to reach home, they began searching for him, visiting several police stations through the night, including those in Janakpuri, Sagarpur, Vikas Puri and Rohini.\nFamily members said they received a call from the police around 7.30 am informing them about an accident.\nWhen they reached the site, they found Kamal’s body inside the pit along with his motorcycle.\n#WATCH | Janakpuri, Delhi | A biker dies allegedly due to falling into a pit. Further details awaited. pic.twitter.com/7kja0wll1M— ANI (@ANI) February 6, 2026\nThey alleged negligence by the Delhi Jal Board, which was carrying out construction work at the location, and also raised the possibility of foul play, claiming someone might have killed Kamal and dumped his body in the manhole.\nPolice said all angles were being examined.\nResponding to the incident, Delhi Jal Board has expressed “deep sorrow\" over the tragic accident that occurred at the pipeline rehabilitation project site in Janakpuri and conveyed its condolences to the bereaved family.\nA serious view has been taken of the tragic accident at the Janakpuri Line Rehabilitation Project site.Delhi Jal Board has constituted a high-level Inquiry Committee to ensure a transparent investigation into the incident.\nThe Committee has been directed to:• Inspect the…\n— Parvesh Sahib Singh (@p_sahibsingh) February 6, 2026\nThe Board said a committee has been constituted to investigate the incident, and assured that strict action will be taken if negligence is found at any level. It added that regular inspections of safety measures are being carried out at all workplaces. The board has urged citizens to report any unsafe worksite on the toll-free helpline number 1916.\nAccording to news agency PTI, authorities received a call around 7 am about the incident in Janakpuri, following which personnel rushed to the spot.\nA senior officer told the agency that preliminary investigations indicated the pit was part of a Delhi Jal Board worksite and that it had been “properly barricaded.\"\n“We are investigating the matter to ascertain the exact sequence of events,\" the officer was quoted as saying.\nDELHI MAN FALLS TO DEATH IN PIT: THE POLICE’S VERSION\nAccording to the Delhi Police, the man worked at the HDFC Bank, and his daily shift usually ended at nearly 11 pm.\nOn Thursday, as his shift ended, he called his family and informed them that he was at Janakpuri District Centre and was on his way home.\nAs the police were informed about the family, at nearly 12.30 am, that Kamal had not reached home, a search for him began. Subsequently, the police traced his mobile phone’s location, which was nearly 200 mts away from the accident spot.\nThe Delhi Police conducted a search operation in the area for nearly two hours during the night, with head constables searching the surroundings for any clues.\nKamal’s body was found in the morning when someone reported that a man and a bike were lying in a pit.\nPolice reached the spot, and a team from the fire brigade was called.\nThe body was fished out at nearly 8.30 am.\nAAP BLAMES BJP\nSaurabh Bharadwaj, Delhi unit chief of the Aam Aadmi Party, shared the pictures of the accident on his official X handle.\nIn his post, Bharadwaj wrote, “Shocking !!! An innocent biker fell into a deep pothole on the road, got stuck, lay there all night, and died.\"\n“The BJP government in Delhi has learned nothing from the Noida incident. They just keep lying every day,\" he alleged.\nThe incident comes weeks after a similar case in Noida, where 27-year-old software engineer Yuvraj Mehta died after his car fell into a waterlogged pit near a construction site.\nThe incident had happened in Sector 150 area during the intervening night of January 16 and 17.\nIn the recent case, authorities in Delhi said forensic teams and local officers were reconstructing the sequence of events in Kamal’s case, examining whether safety barricades were intact, checking nearby CCTV footage and recording statements from witnesses and family members.\nOfficials stressed that no conclusion would be drawn until the probe is completed.\nLatest Blogs",
        "link": "https://www.news18.com/india/dehli-man-falls-into-pit-with-motorcycle-delhi-motorcyclist-dead-janakpuri-manhole-visuals-delhi-police-delhi-jal-board-ws-l-9883515.html",
        "date": "Fri, 6 Feb 2026 23:06:48 +0530",
        "fetched_at": "2026-02-08 04:28:14.661795"
    },
    {
        "title": "A Farmer, A Megaphone And His Radish Harvest Outside A Govt Office In Karnataka",
        "content": "On a recent morning in Tumakuru district, visitors to the Madhugiri taluk office were met with an unusual sight. A farmer stood outside the building with a megaphone, speaking calmly but firmly about a problem that, he said, had gone unresolved for months.\nBeside him was a scooter loaded not with files or placards, but with freshly harvested radish.\nThe farmer, Prasanna Kumar from Dodderi Jakkenahalli village, said he has been seeking a proper connecting road to his agricultural land. According to him, the absence of a motorable access road has made it difficult to transport produce and carry out routine farming work.\nPrasanna told officials and onlookers that he had repeatedly approached the local administration for help. Over time, the issue moved beyond the village level and reached higher authorities.\nOrders Issued, But No Action on Ground\nAccording to Prasanna, the matter was taken up with the Lokayukta, which directed officials to resolve the issue within a month. He also said he approached senior political leaders, including the chief minister and the revenue minister, following which letters were issued asking the local administration to act.\nDespite these directions, Prasanna claimed no work had begun even after nearly two months. The lack of progress, he said, pushed him to stage a public protest.\nAllegation of Bribe Demand\nStanding outside the taluk office, Prasanna alleged that officials linked to the village administration and revenue department demanded money to move the file forward. He accused the village accountant and panchayat-level revenue inspectors of seeking a bribe.\n“I don’t have cash to pay,\" he said through the megaphone, explaining why he chose to bring radish from his field. His message was symbolic: if money was the obstacle, he was willing to offer what he had grown instead.\nThe Radish Protest Goes Viral\nVideos and photographs of the farmer’s protest, radish stacked on a scooter and slogans amplified through a megaphone quickly spread on social media. The visuals drew widespread attention, with many users interpreting the protest as a reflection of frustration with bureaucratic delays and alleged corruption.\nFollowing the online attention, senior officials responded. Gotur Shivappa, assistant commissioner of Madhugiri, said he had instructed the tahsildar to look into the farmer’s complaint on priority.\nOfficials Deny Bribery Allegations\nRevenue officials, however, rejected the farmer’s claims. Srinivas, the current tahsildar of Madhugiri, said the issue was not administrative delay but a family dispute.\nAccording to him, a previous tahsildar had already arranged for an eight-foot-wide road, and an existing asphalted road already provided access to the land. Officials also said they had visited the village and that the remaining disagreement involved relatives and an adjacent plot.\nWhile the farmer maintains that official inaction and alleged bribe demands forced him to protest publicly, authorities insist the road issue has largely been addressed and that the conflict is personal rather than procedural.\nWith the matter now under scrutiny and senior officials involved, attention has shifted to what action follows and whether the farmer’s access road will finally move from paper to ground.\nThe farmer, Prasanna Kumar from Dodderi Jakkenahalli village, said he has been seeking a proper connecting road to his agricultural land. According to him, the absence of a motorable access road has made it difficult to transport produce and carry out routine farming work.\nPrasanna told officials and onlookers that he had repeatedly approached the local administration for help. Over time, the issue moved beyond the village level and reached higher authorities.\nOrders Issued, But No Action on Ground\nAccording to Prasanna, the matter was taken up with the Lokayukta, which directed officials to resolve the issue within a month. He also said he approached senior political leaders, including the chief minister and the revenue minister, following which letters were issued asking the local administration to act.\nDespite these directions, Prasanna claimed no work had begun even after nearly two months. The lack of progress, he said, pushed him to stage a public protest.\nAllegation of Bribe Demand\nStanding outside the taluk office, Prasanna alleged that officials linked to the village administration and revenue department demanded money to move the file forward. He accused the village accountant and panchayat-level revenue inspectors of seeking a bribe.\n“I don’t have cash to pay,” he said through the megaphone, explaining why he chose to bring radish from his field. His message was symbolic: if money was the obstacle, he was willing to offer what he had grown instead.\nThe Radish Protest Goes Viral\nVideos and photographs of the farmer’s protest, radish stacked on a scooter and slogans amplified through a megaphone quickly spread on social media. The visuals drew widespread attention, with many users interpreting the protest as a reflection of frustration with bureaucratic delays and alleged corruption.\nFollowing the online attention, senior officials responded. Gotur Shivappa, assistant commissioner of Madhugiri, said he had instructed the tahsildar to look into the farmer’s complaint on priority.\nOfficials Deny Bribery Allegations\nRevenue officials, however, rejected the farmer’s claims. Srinivas, the current tahsildar of Madhugiri, said the issue was not administrative delay but a family dispute.\nAccording to him, a previous tahsildar had already arranged for an eight-foot-wide road, and an existing asphalted road already provided access to the land. Officials also said they had visited the village and that the remaining disagreement involved relatives and an adjacent plot.\nWhile the farmer maintains that official inaction and alleged bribe demands forced him to protest publicly, authorities insist the road issue has largely been addressed and that the conflict is personal rather than procedural.\nWith the matter now under scrutiny and senior officials involved, attention has shifted to what action follows and whether the farmer’s access road will finally move from paper to ground.\nScan the QR code to download the News18 app and enjoy a seamless news experience anytime, anywhere.\nLatest Blogs",
        "link": "https://www.news18.com/india/a-farmer-a-megaphone-and-his-radish-harvest-outside-a-govt-office-in-karnataka-skn-ws-l-9883580.html",
        "date": "Fri, 6 Feb 2026 12:13:08 +0530",
        "fetched_at": "2026-02-08 04:28:15.295792"
    },
    {
        "title": "'People Rejected You': SC Rejects Prashant Kishor-Led Party's Plea Challenging Bihar Elections",
        "content": "The Supreme Court on Friday dismissed a petition filed by Jan Suraaj, the political party led by poll strategist-turned-politician Prashant Kishor, challenging the outcome of the Bihar Assembly elections held in November last year.\nRefusing to entertain the plea, a bench headed by Chief Justice Surya Kant made sharp remarks on the party’s electoral defeat, saying, “The people rejected you and now you are using this judicial platform to gain publicity?\"\nJustice Joymalya Bagchi also questioned the maintainability of the petition, asking Jan Suraaj’s counsel how such claims could be raised directly before the apex court.\nThe bench declined to hear the matter under Article 32 and asked the petitioner to approach the Bihar High Court instead.\nJan Suraaj had sought to have the election results declared null and void, alleging large-scale violations of the Model Code of Conduct by the ruling Janata Dal (United)–Bharatiya Janata Party alliance.\nThe party argued that the state government’s decision to disburse Rs 10,000 to one woman per family during the election period compromised the fairness of the polls.\nAccording to the petition, the benefit was extended to an estimated 25–35 lakh women voters while the Model Code was in force, amounting to “corrupt practices\" by the ruling coalition.\nKishor had earlier claimed that the JD(U) distributed crores of rupees per constituency and said the party should not have won more than 25 seats under normal circumstances.\nIn the election, however, Chief Minister Nitish Kumar’s JD(U) emerged as the largest party, winning 85 seats, far exceeding both its 2015 tally and Kishor’s own predictions.\nThe Supreme Court noted that the broader issue of election freebies is already under its consideration in a separate case.\nIn earlier observations, the court had warned that competitive promises of financial benefits could push states towards fiscal distress and has referred the issue to a three-judge bench.\nOn Friday, the court said it was serious about examining the matter but would prefer petitions from “public-spirited\" individuals rather than parties that had suffered a complete electoral defeat.\nJan Suraaj’s challenge follows a disappointing electoral debut for the party, which contested 238 seats but failed to win a single constituency, ending with a vote share of under four per cent.\nKishor, who had previously engineered successful campaigns for both the BJP and JD(U), had predicted a decisive outcome for his party, either a major breakthrough or total failure.\nLatest Blogs",
        "link": "https://www.news18.com/india/people-rejected-you-sc-rejects-prashant-kishor-led-partys-plea-challenging-bihar-elections-9883643.html",
        "date": "Fri, 6 Feb 2026 12:17:00 +0530",
        "fetched_at": "2026-02-08 04:28:15.925164"
    },
    {
        "title": "No Surge in Missing Cases: Delhi Police Warns Against Rumours for Monetary Gains | News18",
        "content": "'No need to panic, no surge in number of missing persons cases,' says Delhi Police\"Creating panic for monetary gains will not be tolerated,\" statement adds, , , , , , , , , n18oc_indiaNews18 Mobile App - https://onelink.to/desc-youtube\nLatest Blogs",
        "link": "https://www.news18.com/videos/india/no-surge-in-missing-cases-delhi-police-warns-against-rumours-for-monetary-gains-news18-9885304.html",
        "date": "Fri, 6 Feb 2026 12:07:18 +0530",
        "fetched_at": "2026-02-08 04:28:16.553779"
    },
    {
        "title": "Big Blow to Thalapathy Vijay Before 2026 Elections: Income Tax Penalty Upheld | News18 Breaking",
        "content": "| Madras High Court dismisses actor and TVK chief Vijay's plea challenging Rs 1.5 crore tax penalty ‌ n18oc_indiaNews18 Mobile App - https://onelink.to/desc-youtube\nLatest Blogs",
        "link": "https://www.news18.com/videos/india/big-blow-to-thalapathy-vijay-before-2026-elections-income-tax-penalty-upheld-news18-breaking-9885333.html",
        "date": "Fri, 6 Feb 2026 11:43:52 +0530",
        "fetched_at": "2026-02-08 04:28:17.210627"
    },
    {
        "title": "TVK's Vijay To Pay Rs 1.5 Cr Income Tax Penalty After Madras High Court Rejects Plea",
        "content": "The Madras High Court on Friday dismissed a petition filed by actor and Tamilaga Vetri Kazhagam (TVK) founder Vijay, who had challenged a Rs 1.5 crore penalty imposed by the Income Tax Department.\nJustice Senthilkumar Ramamoorty rejected the plea and upheld the demand notice issued by the department. The penalty relates to the assessment year 2015–16 and concerns alleged non-disclosure of income.\nAccording to the tax authorities, documents seized during a 2015 search at Vijay’s residence indicated that he had not declared Rs 15 crore earned from the film Puli. Based on these findings, the department issued an order on June 30, 2022 imposing the penalty.\nVijay, however, maintained that he had declared an income of Rs 35.42 crore for the financial year 2016–17 and challenged the department’s action in court.\nA single judge had earlier admitted his petition on August 16, 2022 and granted interim relief by staying the operation of the penalty order.\nWith Friday’s ruling, the High Court has now dismissed his challenge and allowed the tax department’s action to stand.\nVijay argued that the penalty order ought to have been issued before June 30, 2019 and claimed that the delay made it invalid. The Income Tax Department, however, maintained that the action was lawful under the provisions of the Income Tax Act and urged the court to reject his petition.\nAfter considering both sides, the court agreed with the department’s stand and dismissed Vijay’s plea.\nLatest Blogs",
        "link": "https://www.news18.com/india/tvks-vijay-to-pay-rs-1-5-cr-income-tax-penalty-after-madras-high-court-rejects-plea-9883505.html",
        "date": "Fri, 6 Feb 2026 11:26:34 +0530",
        "fetched_at": "2026-02-08 04:28:17.837007"
    },
    {
        "title": "Parliament Budget Session 2026 Highlights: Both Houses Adjourned Till Monday 11 AM",
        "content": "Parliament Budget Session Highlights: The Lok Sabha has been adjourned after witnessing a ruckus by the Opposition leaders on Friday. The MPs of the opposition walked out of the lower house and staged a protest against the government over the India-US trade deal.\nEarlier on Thursday, the Lok Sabha was adjourned amid the ruckus by the opposition.\nMeanwhile, Prime Minister Narendra Modi spoke on the Motion of Thanks on the President’s address in the Rajya Sabha. He also attacked Congress leader and Leader of Opposition in Lok Sabha Rahul Gandhi over a controversial “traitor” remark made against BJP MP Ravneet Singh Bittu, calling it an insult to the Sikh community and a reflection of Congress’ “arrogance at its peak.\n“What happened yesterday — the ‘Yuvraj’ of Congress, who has a ‘shaatir dimaag’ called a member of this House a traitor. His arrogance is at its peak. He did not call others who left Congress traitors, but he said it to this MP because he is a Sikh. This is an insult to Sikhs, an insult to the Gurus. This shows the hatred Congress carries,” PM Modi said.\nFollow live highlights here\nRaj Sabha proceedings began at 2 AM.\nBJP MP PP Chaudhary criticised the Congress over disruptions during the ongoing session, saying the party lacked facts and ideology. He urged the Opposition to adopt a constructive role in Parliament instead of what he called a destructive approach.\n“The way the Congress disrupted the House in this session, they have no facts and ideology… The Congress should take a constructive approach, but it has a destructive one,” he said.\nRajya Sabha has been adjourned till 2 PM.\nOpposition MPs are holding protest against the government at the Makar Dwar of the Parliament.\n#WATCH | Opposition MPs protest against the government at the Makar Dwar of the Parliament pic.twitter.com/xHHSmUcnio\n— ANI (@ANI) February 6, 2026\nLok Sabha proceedings continued with sloganeering by the Opposition.\nA ruckus began in Lok Sabha again after the proceedings began at 12 PM.\nShiv Sena (UBT) MP Priyanka Chaturvedi criticised personal remarks made against former Prime Ministers, calling them “reprehensible”. She said those aligned with the BJP and RSS ideology should also acknowledge the contributions of past Prime Ministers.\nLok Sabha proceedings adjourned till 12 PM amid ruckus by Opposition.\nReacting to the prime minister’s speech in the Rajya Sabha and the opposition’s walkout, BJP MP Shashank Mani Tripathi alleged that the Congress has disregarded the Sikh community since 1984. He demanded that Rahul Gandhi apologise for calling Union MoS Ravneet Bittu a “traitor” and termed the Opposition’s walkout as condemnable.\n#WATCH | On PM’s speech in Rajya Sabha & Opposition walking out, BJP MP Shashank Mani Tripathi says, “Since 1984, the Congress has disregarded the Sikh community. Rahul Gandhi should apologise for using the term ‘traitor’ (against Union MoS Ravneet Bittu). The walkout by the… pic.twitter.com/o68zv77ksa\n— ANI (@ANI) February 6, 2026\nFrom 3:30 pm, the Lok Sabha will take up Private Members’ Business, during which several Bills are set to be introduced. These include proposals for constitutional changes, electoral law amendments, and welfare measures for farmers, fishermen, students, senior citizens, women and workers, along with legislation related to education, healthcare, environment, artificial intelligence, digital platforms, labour reforms and social security.\nPrime Minister Narendra Modi criticised Congress leader and Leader of Opposition Rahul Gandhi in Rajya Sabha on Thursday over his alleged “traitor” remark against BJP MP Ravneet Singh Bittu, calling it an insult to the Sikh community and a sign of Congress’ “arrogance at its peak”.\nThe Lok Sabha will start the general discussion on the Union Budget at 11 AM, beginning with Question Hour. The House is also scheduled to take up Private Members’ Business later in the afternoon, where several proposed laws — including constitutional changes, electoral reforms and welfare measures — are expected to be introduced.\nLatest Blogs",
        "link": "https://www.news18.com/india/parliament-budget-session-2026-live-updates-pm-modi-lok-sabha-rajya-sabha-rahul-gandhi-bjp-congress-latest-news-liveblog-9883252.html",
        "date": "Fri, 6 Feb 2026 14:55:49 +0530",
        "fetched_at": "2026-02-08 04:28:18.705085"
    },
    {
        "title": "Delhi To Launch Double-Decker Tourist Buses For Key Heritage Sites Soon | Check Routes And Fares",
        "content": "The national capital is gearing up to introduce a new sightseeing experience for visitors with the launch of double-decker tourist buses later this month. The initiative, led by the Delhi government, will link major heritage and cultural landmarks through a specially designed tourism circuit across the heart of the city.\nSenior officials said the service, likely to start in February, is being developed primarily for domestic and foreign tourists, with a strong focus on the central vista and nearby national monuments. The aim is to make some of Delhi’s most prominent attractions easier to access through a single, organised route.\nMajor Heritage Sites To Be Linked Via This Service\nThe planned circuit will include destinations such as the Pradhanmantri Sangrahalaya, National War Memorial, Bharat Mandapam, the new Parliament complex, Kartavya Path and Dilli Haat. Officials said the project seeks to present these landmarks as part of a unified tourism experience rather than isolated sites.\nThe use of double-decker buses is expected to enhance sightseeing, with elevated seating offering wider views of monuments and ceremonial avenues. Authorities believe this format will provide a more engaging and relaxed way for visitors to explore the city.\nIn addition to daytime operations, the tourism department is also working on evening sightseeing services. While the night-tour route has largely been finalised, details on operating hours are yet to be announced.\nAn electric double-decker bus, along with two other buses, is expected to begin service around February 20, coinciding with the first anniversary of the Delhi government. The electric vehicle has been supplied by a private firm under a corporate social responsibility initiative. Originally housed at the Okhla depot under the transport department, the bus has now been transferred to the tourism department.\nCheck Fares\nAccording to officials, the service will operate from the Pradhanmantri Sangrahalaya and cover several major landmarks along the route. The fare has been fixed at Rs 500 for adults and Rs 300 for children aged between six and twelve years, news agency PTI reported.\nA guide will be on board to brief passengers about the historical and cultural significance of each location. Information on booking procedures and schedules will be released ahead of the official launch.\nDouble-decker buses were once a familiar sight on Delhi’s roads, run by the Delhi Transport Corporation under the name “Suvidha\", before they were discontinued in 1989 following the gradual withdrawal of the ageing fleet.\nLatest Blogs",
        "link": "https://www.news18.com/cities/new-delhi-news/delhi-to-launch-double-decker-tourist-buses-for-key-heritage-sites-soon-check-routes-and-fares-ws-l-9883094.html",
        "date": "Fri, 6 Feb 2026 08:21:55 +0530",
        "fetched_at": "2026-02-08 04:28:19.342197"
    },
    {
        "title": "Roads, Mining, Hydel Projects Claimed Nearly 1 Lakh Hectares Of India's Forest Land Since 2020",
        "content": "Nearly 97,050 hectares of forest land was diverted for non-forestry purposes in the last five financial years, starting 2020-21, the Union Environment Ministry told Parliament. Madhya Pradesh accounted for the largest share, with 902 such proposals for non-forestry use approved and only six rejected between 1st April 2020 and 31st March 2025.\nThe government said that it gave the go-ahead to as many as 10,026 proposals during this period and rejected just 120 proposals—an overwhelmingly high approval rate, with only a handful of rejections. Some regions, like the Andaman and Nicobar Islands, where 26 projects were approved, saw no rejection. Jammu and Kashmir, as well as Manipur, Meghalaya, Tripura, and Mizoram in the Northeast, also saw no rejections.\nOut of the total projects considered during the last five years, most of them were approved in Gujarat (1560), with Haryana (1424) and Uttar Pradesh (1188) following closely behind.\nRoads cut the deepest into India’s forests, with nearly 22,233 hectares of forest land diverted for construction of roads alone. Mining and quarrying followed close behind, claiming 18,913 hectares of forest land, while hydel and irrigation projects claimed 17,434 hectares, and power transmission lines nearly 13,859 hectares. Remaining diversions were mostly for Defence (6,041 hectares), railways (5,957 hectares), and other developmental projects.\nResponding to questions, Minister of State (Environment, Forests, and Climate Change) Kirti Vardhan Singh said the diversion was approved under the Van (Sanrakshan Evam Samvardhan) Adhiniyam, 1980. “The central government, following the prescribed statutory approval process, takes prompt decisions on proposals for diversion of forest land, including all development projects, that are complete in all respects,\" he told Parliament.\nAs per the conditions of approval, the states/UTs concerned have to ensure that a minimum number of trees are felled, and wherever feasible, translocation of trees is to be done, and the permission for felling of trees is given by the concerned states/UTs, he added.\nWhile Madhya Pradesh recorded the maximum diversion of forest land—24,346 hectares—it was followed by Odisha (12,875 hectares), Gujarat (6,850), and Arunachal Pradesh (6,656 hectares), as per the data from 2020-21 to 2024-25.\nThe government attributed the reduction in timelines observed in the processing of Environmental Clearance (EC) proposals to “comprehensive regulatory reforms undertaken by the Environment Ministry, supported by technology-driven interventions such as GIS layers, Decision Support System\". The minister also cited the recently launched online single-window system for processing such proposals, as well as amendments to the Environment Impact Assessment (EIA) Notification, 2006, and office memorandums issued from time to time for reducing the duration.\nThe government had also recently given appraisal powers to the State Environment Impact Assessment Authorities (SEIAAs) for sectors like mining, irrigation, and power projects, and also increased Expert Appraisal Committee meetings to at least twice a month to speed up proposal review.\nUnder the Environment Impact Assessment (EIA) Notification, 2006, project proposals are examined by an Expert Appraisal Committee (EAC), which reviews their environmental impacts. The committee recommendations are then placed before the ministry, which takes the final decision on granting or rejecting environmental clearance. Forest diversion proposals from states are reviewed by an advisory committee under the Van (Sanrakshan Evam Samvardhan Adhiniyam), 1980.\nLatest Blogs",
        "link": "https://www.news18.com/india/roads-mining-hydel-projects-claimed-nearly-1-lakh-hectares-of-indias-forest-land-since-2020-9882951.html",
        "date": "Fri, 6 Feb 2026 00:56:17 +0530",
        "fetched_at": "2026-02-08 04:28:20.005952"
    },
    {
        "title": "Centre, Nagaland Govt, Naga Tribes Body Sign Pact To Create Frontier Nagaland Territorial Authority",
        "content": "The Government of India, the Government of Nagaland and representatives of the Eastern Nagaland Peoples’ Organisation (ENPO) on Wednesday signed a historic agreement in New Delhi.\nThe pact paves the way for the creation of the Frontier Nagaland Territorial Authority (FNTA) for six eastern districts of Nagaland that include Tuensang, Mon, Kiphire, Longleng, Noklak and Shamator and provides for the devolution of powers over 46 subjects to the new authority.\nThe agreement was signed in the presence of Union Home Minister and Minister of Cooperation Amit Shah and Nagaland Chief Minister Neiphiu Rio.\nCalling the day “a very significant moment\" for a dispute-free Northeast, Shah said the Modi government is committed to resolving every long-pending issue through dialogue and democratic means. He noted that since 2019, the Centre has signed 12 major agreements in the region, stressing that, unlike earlier governments, the current administration ensures their implementation “in letter and spirit.\"\nShah assured ENPO representatives that the Centre would actively support the development of Eastern Nagaland and shoulder its responsibilities. A fixed amount will be allocated annually for the region’s development, while the Union Ministry of Home Affairs will bear the initial expenditure for setting up the FNTA.\nThe Home Minister said people of Eastern Nagaland had long felt deprived since the state’s formation and acknowledged the region’s strategic importance. He credited sustained efforts by the Ministry of Home Affairs for bridging differences between the ENPO and the Nagaland government, leading to the resolution of the dispute.\nExpressing gratitude to Chief Minister Neiphiu Rio and the Nagaland cabinet, Shah said their openness and cooperation helped take negotiations to a logical conclusion. “There will now be no obstacles in the path of Eastern Nagaland’s development,\" he said, adding that the agreement reflects the government’s commitment to fulfilling the genuine aspirations of the people.\nUnder the arrangement, a mini-secretariat for the FNTA will be set up, headed by an Additional Chief Secretary or Principal Secretary. Development outlay for Eastern Nagaland will be shared in proportion to population and area. The agreement clarifies that it does not affect the provisions of Article 371(A) of the Constitution.\nThe pact envisages accelerated development of Eastern Nagaland through greater financial autonomy, enhanced decision-making, improved infrastructure, economic empowerment and optimal use of resources. Senior officials from the Centre and the Nagaland government, along with the Deputy Chief Minister and other dignitaries, were present at the signing ceremony.\nLatest Blogs",
        "link": "https://www.news18.com/india/centre-nagaland-govt-naga-tribes-body-sign-pact-to-create-frontier-nagaland-territorial-authority-ws-l-9882805.html",
        "date": "Thu, 5 Feb 2026 21:40:18 +0530",
        "fetched_at": "2026-02-08 04:28:20.646011"
    },
    {
        "title": "204 Special Train Trips For Holi Announced By North Central Railway | Check Routes",
        "content": "To deal with heavy passenger rush likely during Holi festival, the North Central Railway (NCR) has released a comprehensive plan to ensure smooth travel across key corridors.\nAccording to the zonal railway, 204 trips of special trains have been notified.\nThe statement issued by the NCR, stated it will have primary ownership of five pairs of special trains, totalling 10 trains and 36 trips.\n“These trains will originate from key stations from NCR to accommodate travelers heading towards Mumbai, Pune, and South India. These services are scheduled to operate as per respective time tables from February 15, 2026, to March 31, 2026, facilitating travel during the peak festive period,\" it said.\nThe five pairs of originating trains are:\nThe 204 trips of special trains will pass through the NCR network, covering various stations including important stations like Agra, Kanpur, Prayagraj, and Jhansi, among others.\nThe NCR said that the ticket booking for these “Festival Specials\" will begin soon.\n“Passengers can check specific train numbers, timings, and availability on the IRCTC website or the NTES app. These are the trains notified till date and the services of more special trains will be notified as per the requirement and increase in rush,\" it said, adding that passengers should book early to secure confirmed berths.\nLatest Blogs",
        "link": "https://www.news18.com/india/204-special-train-trips-for-holi-announced-by-north-central-railway-check-routes-ws-l-9882787.html",
        "date": "Thu, 5 Feb 2026 21:31:57 +0530",
        "fetched_at": "2026-02-08 04:28:21.282042"
    },
    {
        "title": "'To Protect Buyers, Deliver Their Dream Homes': SC Asks NBCC To Take Over Stalled Supertech Projects",
        "content": "The Supreme Court on Thursday intervened to bring relief to thousands of Supertech homebuyers, issuing a landmark ruling for the state-owned National Buildings Construction Corporation to take over and finish 16 stalled projects under the real estate developer.\nThe court said this is to protect thousands who have waited over a decade for their Supertech housing units and to finally deliver their “dream homes\" to them.\nBy invoking its extraordinary powers under Article 142 of the Constitution, the SC said the National Buildings Construction Corporation (NBCC) must take over. A bench comprising Chief Justice Surya Kant and Justice Joymalya Bagchi used these plenary powers to uphold a December 2024 order by the National Company Law Appellate Tribunal (NCLAT).\nThe court said approximately 51,000 homes had been booked between 2010 and 2012, leaving families in limbo for years. To ensure progress remains uninterrupted, the bench has prohibited other legal bodies, including all high courts and tribunals, from issuing orders that might freeze the ongoing work. This is intended to allow the NBCC to complete the debt-ridden projects expeditiously and without further judicial interference.\nThe apex court said judicial priority is now focused entirely on the delivery of completed homes equipped with essential utilities, rather than the immediate demands of corporate creditors. Chief Justice Surya Kant made it clear that the interests and dues of financial and operational creditors will only be addressed after the delivery of fully-furnished houses to the buyers. These must have all the assured facilities, including water, electricity, sewage connections, roads, and parks.\nAs a result of this prioritisation, financial lenders are expected to accept reduced payments, or a “haircut\", to facilitate the recovery process. The bench described these reduced payments as “just and equitable\" and ruled that the NBCC’s takeover is not contrary to the Insolvency and Bankruptcy Code (IBC).\n“We find that the order passed by the NCLAT on December 12, 2024, in bringing the NBCC on record for the completion of the pending housing projects is neither unfair nor contrary to the provisions of the Insolvency and Bankruptcy Code (IBC),\" the bench ordered while taking recourse of Article 142, which grants the top court plenary power to pass any decree or order necessary for doing “complete justice\" in any case.\nThe NBCC will now undertake the projects – previously estimated to cost approximately Rs 9,500 crore – with the support of an expert committee. While disposing of the pleas, the bench noted that parties may still approach the court should any new developments obstruct the ongoing construction.\nOn February 21, 2025, the court had stayed an order appointing the NBCC as the project management consultant to complete the 16 housing projects of Supertech at a cost of nearly Rs 9,500 crore.\n(With PTI inputs)\nLatest Blogs",
        "link": "https://www.news18.com/india/to-protect-buyers-deliver-their-dream-homes-sc-asks-nbcc-to-take-over-stalled-supertech-projects-ws-l-9881884.html",
        "date": "Thu, 5 Feb 2026 20:05:13 +0530",
        "fetched_at": "2026-02-08 04:28:21.954249"
    },
    {
        "title": "Poll Body's Big Attack On TMC Govt, Cites 'Systematic Pattern Of Violence' Against Officials",
        "content": "The Election Commission of India (ECI) has accused the Trinamool Congress (TMC) government in West Bengal of “systematic pattern of violence and threats\" against election officials, while also alleging police of unwillingness to act against such incidents.\nAfter West Bengal Chief Minister Mamata Banerjee appeared in the Supreme Court and spoke against the Special Intensive Revision (SIR) of electoral rolls, the poll body filed a counter in the apex court, alleging numerous instances of violence, intimidation and obstruction against election officials engaged in the SIR process.\nSujeet Kumar Mishra, Secretary, ECI, alleged a “pervasive reluctance\" among local police authorities to register FIRs in response to grievances articulated by BLOs, and many of them were only filed after the direct intervention of the DEO (District Election Officer). While other states promptly adhered to ECI directives regarding SIR, West Bengal willfully neglected to do so.\nBengal CEO’s Office Gheraoed\nIn its response, the ECI claimed that protesters claiming to be BLOs attempted forceful entry into the office of Bengal’s Chief Electoral Officer (CEO), broke the police blockade and vandalised the office. It said officers were prevented from entering and leaving the office complex as the office was also gheraoed, resulting in significant impediments to the execution of duties by officers.\nThe ECI said it directed the Kolkata Police Commissioner to ensure that no untoward incident occurs again. Despite explicit directives to the police, the protesters were not removed and remained in the office premises for 28 hours. It further said that the CEO was the sole electoral official in the country who had been accorded ‘Y+’ category security.\nIt also detailed a disturbing pattern of conduct “previously unseen during electoral roll revision exercises\" in Bengal, including a statement by a cabinet minister that he will “break the legs of Election Commission\". The poll agency observed that groups of women, allegedly mobilised by political operatives, obstructed the activities of BLOs and EROs.\n‘Provocative’ Statements Of Mamata Banerjee, Police Inaction\nThe Election Commission also observed that Chief Minister Mamata Banerjee “persistently delivered a series of public addresses that are inherently provocative, thereby engendering an atmosphere of intimidation among the election officials tasked with the separation and revision of the electoral roll.\"\nIt also accused the CM of engaging in fear-mongering, disseminating misleading and erroneous information about the SIR process and threatening election officials, which prompted several observers to withdraw from their SIR responsibilities due to fear of violent assaults.\nIt also said BLOs are facing overwhelming stress due to systematic police indifference and the failure to register FIRs, interference by Booth Level Agents of political factions. A roll observer reported that women’s mob in Debipur shouting “BJP dalal\" slogans, chasing team with broomsticks after the CM’s “kitchen tools\" call.\nThe affidavit blamed “inadequacies of state machinery\" and “prevailing climate of political interference\" for a “singular and alarming breakdown\" in West Bengal SIR. The Commission warned that political rhetoric from TMC leaders vitiates conditions for a “free, fair and fearless\" revision process in West Bengal.\nMamata Banerjee has previously characterised the exercise as a vehicle for “unspeakable harassment\", alleging it has resulted in “as many as 140 deaths\" and violates the Representation of the People Act. In a series of letters addressed to the CEC, she has sounded an alarm on what she describes as “institutional overreach\" and a “dangerous erosion of trust\" in democratic processes.\nLatest Blogs",
        "link": "https://www.news18.com/india/ecis-big-attack-on-tmc-govt-claims-systematic-pattern-of-violence-against-poll-officials-ws-kl-9882552.html",
        "date": "Thu, 5 Feb 2026 20:14:32 +0530",
        "fetched_at": "2026-02-08 04:28:22.581210"
    },
    {
        "title": "News18 Evening Digest: PM Modi Slams Congress, Hails Govt's Big Trade Deals & Other Top News",
        "content": "In today’s evening digest, News18 brings you the latest updates on PM Modi’s address during Rajya Sabha as he hailed India’s trade deals with the United States and the European Union; Amit Shah launched Bharat Taxi, a cooperative-owned platform that enables drivers to operate as owners, and other top news.\n‘No Vision, No Willpower’: PM Modi Slams Congress, Touts Govt’s Big Trade Deals With US, EU\n‘Sahkar, Not Sarkar’: Amit Shah Launches Bharat Taxi Service, Promises Big Benefits For Drivers\n‘You Appear In Court To Defend Illegals’: PM Modi’s Jibe At Mamata Banerjee’s SIR Plea\n16 Labourers Killed, Several Trapped After Explosion Rocks Meghalaya Coal Mine\n‘Korean Was Our Life’: Ghaziabad Sisters’ Diary Flags Distress, Isolation Before Deaths\nHoneymoon Murder 2.0: Man Dies In Hit-And-Run Planned By Wife, Her Boyfriend\nOn a breezy Friday evening, a newlywed couple from Rajasthan – Ashish and Anju – went out for a walk, just when a vehicle hit them. While Ashish died on the spot, Anju was robbed of her gold jewellery and left unconscious on the road.\nPakistan’s ‘Brotherhood With Muslim Cousins’ Termed ‘Disaster’ For India: ‘We’re Not Going…’\nRanbir Kapoor Drops BIG Hint About Sandeep Reddy Vanga’s Animal Park: ‘There’s Another Character…’\nThe journey of Animal is far from over. Months after the film’s explosive run at the box office, Ranbir Kapoor and director Sandeep Reddy Vanga have begun openly speaking about its sequel, Animal Park, offering fans fresh insight into what lies ahead.\nLatest Blogs",
        "link": "https://www.news18.com/india/news18-evening-digest-pm-modi-slams-congress-hails-govts-big-trade-deals-other-top-news-ws-l-9882308.html",
        "date": "Thu, 5 Feb 2026 18:47:19 +0530",
        "fetched_at": "2026-02-08 04:28:23.210535"
    },
    {
        "title": "PM Modi Says Unmanned Railway Crossings Eliminated, Villages Electrified as He Attacks Congress",
        "content": "Prime Minister Narendra Modi said unmanned railway crossings have been eliminated, villages electrified, and defence preparedness strengthened, while accusing the Opposition of targeting him for pursuing welfare-driven governance during his Rajya Sabha address. n18oc_india News18 Mobile App - https://onelink.to/desc-youtube\nLatest Blogs",
        "link": "https://www.news18.com/videos/india/pm-modi-says-unmanned-railway-crossings-eliminated-villages-electrified-as-he-attacks-congress-9884127.html",
        "date": "Thu, 5 Feb 2026 18:37:39 +0530",
        "fetched_at": "2026-02-08 04:28:23.940317"
    },
    {
        "title": "PM Modi Escalates Attack On Congress, Highlights Banking, PSU and Agricultural Reforms | News18",
        "content": "Prime Minister Narendra Modi highlighted reforms in banking, public sector undertakings (PSUs), and agriculture while escalating his attack on the Congress during his address in Parliament. n18oc_india News18 Mobile App - https://onelink.to/desc-youtube\nLatest Blogs",
        "link": "https://www.news18.com/videos/india/pm-modi-escalates-attack-on-congress-highlights-banking-psu-and-agricultural-reforms-news18-9884088.html",
        "date": "Thu, 5 Feb 2026 18:24:32 +0530",
        "fetched_at": "2026-02-08 04:28:24.597726"
    },
    {
        "title": "PM Modi Quotes Indira Gandhi To Criticise Congress Govt's Functioning: ‘Knew Shortcomings But...'",
        "content": "Prime Minister Narendra Modi launched a sharp attack on former Prime Minister Indira Gandhi’s development record, citing what he called systemic rigidity in India’s planning apparatus that hampered infrastructure projects for generations. Addressing Parliament during the Motion of Thanks to the President’s Address, PM Modi invoked Indira Gandhi’s own acknowledgment of the disconnect between policymakers and ground realities, using it to criticize the Planning Commission she once chaired.\n“I had gone to Himachal Pradesh. When I returned, I told the Planning Commission that our workers need mules, not jeeps. But we were told that the funds are only available for jeeps; there is no policy to fund mules. They said, if there are no proper roads, then what use is a jeep,\" PM Modi said, quoting Indira Gandhi’s remarks.\nPM Modi said this reflected “a system that knew its shortcomings but did not reform itself.\"\nThe Planning Commission, established in 1950 with Jawaharlal Nehru- Indira Gandhi’s father- as its first chairman, was responsible for drafting and implementing India’s Five-Year Plans. The Planning Commission was dissolved in 2014 under PM Modi’s government and replaced with NITI Aayog.\nPM Modi highlighted the Congress party’s historical failure to deliver timely and efficient development, asserting, “A significant part of our energy is being spent on correcting the mistakes of the past. It takes great effort to erase the image that was created in the minds of the world during that period.\"\nThe Prime Minister also cited the Sardar Sarovar Dam on the Narmada River as a case study of delayed execution and policy inertia under previous administrations. The multipurpose dam’s foundation stone was laid in 1961 but it officially became operational only in 2017- more than five decades later and roughly 30 years after construction began in earnest.\nThe Sardar Sarovar Dam, part of the broader Narmada Valley development initiative, faced numerous obstacles over its decades-long journey. Construction was stalled in the 1990s by court orders related to rehabilitation and resettlement conditions for displaced communities. Procedural and clearance issues further bogged down progress, keeping it mired in administrative hurdles.\nPM Modi contrasted the delays and inefficiencies of past governments with his administration’s emphasis on future-ready policies, strategic governance and faster project execution, arguing that India is now on a more decisive development path.\n“That is why we have placed strong emphasis on future-ready policies. Today, the country is being governed on the basis of policy and strategy,\" PM Modi said.\nLatest Blogs",
        "link": "https://www.news18.com/india/pm-modi-quotes-indira-gandhi-to-criticise-congress-govts-functioning-knew-shortcomings-but-ws-l-9882188.html",
        "date": "Thu, 5 Feb 2026 18:26:59 +0530",
        "fetched_at": "2026-02-08 04:28:25.286666"
    },
    {
        "title": "Playing Obscene Songs In Public? Jail And Fines Await, Warns Bihar Govt",
        "content": "The Bihar government has announced a strict crackdown on the playing of obscene and double-meaning songs in public places and vehicles, warning of legal action, including fines and imprisonment, for violators.\nDeputy Chief Minister and Home Minister Samrat Choudhary has issued firm directions to the police headquarters, instructing officers across all districts to immediately stop the playing of vulgar songs, whether in Bhojpuri, Magahi, Maithili or any other language. He has asked the police to launch special drives to identify offenders and initiate strict legal action against them.\nMr Choudhary said the decision was taken in the interest of social decency and public safety, noting that obscene songs played in public spaces have a deeply negative impact on society, particularly on children. He added that such content not only promotes vulgarity but also undermines women’s safety and dignity. Banning obscene songs, he said, is essential to creating a secure and respectful environment for women.\nAs part of the move, obscene songs will no longer be permitted in buses, auto-rickshaws, taxis, trains or any other public place. Following the government’s directive, Bihar Police has launched a statewide campaign along with a public appeal under the slogan “No obscene songs, build a civilised society\".\nThe police have clarified that playing obscene or double-meaning songs in public will now be treated as a serious punishable offence. Drivers and vehicle owners found violating the order will face heavy fines and may also be sent to jail.\nUnder the new enforcement measures, police will register cases under Sections 296 and 79 of the Bharatiya Nyaya Sanhita (BNS), 2023, along with other applicable provisions. Citizens have been urged to oppose such acts and report violations to the nearest police station.\nThe state government has emphasised that public participation is crucial to eliminating obscenity from public life. Bihar Police, appealing to citizens, said a civilised and safe society can be achieved not only through strict laws but also through collective responsibility and cooperation.\nLatest Blogs",
        "link": "https://www.news18.com/india/playing-obscene-songs-in-public-jail-and-fines-await-warns-bihar-govt-ws-kl-9881890.html",
        "date": "Thu, 5 Feb 2026 18:04:18 +0530",
        "fetched_at": "2026-02-08 04:28:25.911718"
    },
    {
        "title": "India Has Become a Beacon of Hope, PM Modi Cites High Growth, Low Inflation In Rajya Sabha | News18",
        "content": "Prime Minister Narendra Modi said India has emerged as a “beacon of hope” amid global challenges while highlighting strong economic indicators, including high growth and low inflation, during his reply to the Motion of Thanks in Parliament. n18oc_india News18 Mobile App - https://onelink.to/desc-youtube\nLatest Blogs",
        "link": "https://www.news18.com/videos/india/india-has-become-a-beacon-of-hope-pm-modi-cites-high-growth-low-inflation-in-rajya-sabha-news18-9884091.html",
        "date": "Thu, 5 Feb 2026 17:26:25 +0530",
        "fetched_at": "2026-02-08 04:28:26.588850"
    },
    {
        "title": "'No Vision, No Willpower': PM Modi Slams Congress, Touts Govt's Big Trade Deals With US, EU",
        "content": "Prime Minister Narendra Modi said India’s recent trade agreements with the United States and the European Union have generated a sense of economic stability and forward momentum, while creating wide-ranging opportunities for the country’s youth. Addressing the Rajya Sabha during the Motion of Thanks to the President’s Address, PM Modi described the agreements as “future‑ready\" pacts that are strengthening India’s position in the global economy.\n“After the trade deal with the US, there is a feeling of stability and a sense of forward movement,\" he said.\nThe Prime Minister said India is increasingly signing major trade deals with key global partners.\n“In the past few days, we have signed agreements with nine significant nations. The most comprehensive of these is with a bloc of 27 countries, including the European Union,\" he added.\nPM Modi highlighted that major economies are keen to strengthen trade ties with India. “Countries around the world are eager to expand trade relations with India. Whether it is the EU deal or the recent pact with the US, these agreements are receiving broad international praise,\" he said.\nHe also stressed the global significance of these agreements.\n“When we signed the trade deal with the EU, the world became more confident about the greater likelihood of global stability. After the trade deal with the US, the world became even more confident that with stability, they can sense a speed too. This is a positive sign for the world,\" the Prime Minister said.\nHighlighting the domestic impact, PM Modi said the agreements would directly benefit India’s youth across regions and social groups.\n“The US trade deal will be most beneficial to the youth, including those from urban areas and rural, as well as for girls and boys. The demand for young professionals is growing around the world, and since so many foreign companies are setting up here, the opportunities are abundant for Indian young professionals as well,\" he said.\nPlacing India’s economic trajectory in a broader geopolitical context, the Prime Minister said the world is witnessing a major transition.\n“There was a new world order after the Second World War, and now the world is moving towards a new world order. The bent is towards India, which is a vishvabandhu,\" he said.\nLaunching a sharp attack on the Congress, PM Modi said past governments had left behind a damaged global image.\n“A significant part of our energy is being spent on correcting the mistakes of the past. It takes great effort to erase the image that was created in the minds of the world during that period. They left things in such a damaged state,\" he said.\nHe said this is why the NDA government has prioritised long-term policy planning.\n“That is why we have placed strong emphasis on future-ready policies. Today, the country is being governed on the basis of policy and strategy,\" PM Modi said, taking a swipe at past controversies.\n“Even now, when people speak about them, they don’t talk about trade deals. They talk about deals like Bofors,\" he said.\nAsserting that global confidence in India is steadily rising, the Prime Minister said, “Global trust in India is growing. Guided by the mantra of ‘reform, perform, transform,’ we have moved forward, and the reality today is that the nation has boarded the Reform Express.\"\nDescribing the current decade as a defining phase for India, he added, “The first quarter of the 21st century has completed. But this second quarter is decisive, just like the second quarter of India’s freedom struggle in the last century was. I can clearly see that in the direction of building Viksit Bharat, this second quarter is going to be equally capable.\"\nLatest Blogs",
        "link": "https://www.news18.com/india/no-vision-no-willpower-pm-modi-slams-congress-touts-ndas-big-trade-deals-ws-l-9882048.html",
        "date": "Thu, 5 Feb 2026 18:12:47 +0530",
        "fetched_at": "2026-02-08 04:28:27.220134"
    },
    {
        "title": "Asaram's Ashram To Be Demolished? Gujarat HC Allows Govt To Take Over Rs 500-Crore Land",
        "content": "The long-running dispute over nearly 45,000 square metres of land at Asaram’s ashram in Motera, Ahmedabad, has reached a decisive end, with the Gujarat High Court allowing the state government to reclaim the land, paving the way for the removal of illegal constructions and future development.\nFollowing the ruling, authorities have accelerated preparations to clear unauthorised structures from the ashram complex. The land has been earmarked for expansion of the Sardar Patel Sports Enclave, a key project linked to the state’s preparations for the Commonwealth Games 2030.\nAccording to official records, the premises contained at least 32 illegal structures, valued at around Rs 500 crore. Investigations found that these structures were not only illegal but were also being used for commercial purposes. Citing violations of building rules and encroachment on government land, the collector’s office had earlier issued notices to the ashram trust.\nThe trust subsequently sought to regularise the constructions by paying an “impact fee\", but the request was rejected by the authorities, leading to the legal battle. Delivering the verdict, Justice Vaibhavi Nanavati ruled in favour of the state, observing that the government’s action was justified in view of serious rule violations and the larger public interest involved in development projects.\nWith the court’s clearance, the Ahmedabad Municipal Corporation is now authorised to remove the illegal structures at any time after completing security and procedural formalities. Officials said the land would be utilised for a modern sports complex, training facilities and a proposed Olympic village as part of the Sports Enclave project.\nThe verdict is being seen as a significant boost to Gujarat’s infrastructure plans, particularly its ambition to host the Commonwealth Games 2030. State officials have maintained that world-class sports facilities are essential for the event and that the Motera land is strategically critical to these preparations.\nAsaram, who is serving a life sentence in a rape case and was recently granted conditional bail on medical grounds, visited the Surat ashram on January 2 after nearly 13 years. Videos showing followers welcoming him with music and celebrations had drawn public attention.\nLatest Blogs",
        "link": "https://www.news18.com/india/asarams-ashram-to-be-demolished-gujarat-hc-allows-govt-to-take-over-rs-500-crore-land-ws-kl-9881465.html",
        "date": "Thu, 5 Feb 2026 15:43:06 +0530",
        "fetched_at": "2026-02-08 04:28:27.867367"
    },
    {
        "title": "'Sahkar, Not Sarkar': Amit Shah Launches Bharat Taxi Service, Promises Big Benefits For Drivers",
        "content": "Union Home Minister Amit Shah on Thursday launched Bharat Taxi, a cooperative-owned platform that enables drivers to operate as owners, ensuring zero commission and eliminating surge pricing. The service aims to compete with apps like Uber and Ola.\nThe Cooperation Ministry described Bharat Taxi as a transformative initiative in the mobility sector, placing drivers —referred to as sarathis (charioteers) — at the centre of ownership, operations, and value creation, thereby freeing them from exploitative aggregator-based models.\nSpeaking at the launch event, Amit Shah said the Bharat Taxi service will provide major convenience for taxi drivers, saying that “sahkar (helper), not Sarkar (government)\" is formally entering the taxi sector.\n“In this system, every driver (Sarathi) is the owner of the taxi, and this structure will bring a revolutionary economic transformation. Like Amul in Gujarat, this is a unique cooperative model of its kind in the world. The wheels of your taxi will run for the benefit of the Sarathi community—this is the spirit of cooperation,\" he said.\nShah further revealed that Bharat Taxi was envisioned as a unified mobility platform that offered two-wheelers, three-wheelers and four-wheelers. “Bharat Taxi “Sarathi Didi\" will play a key role in ensuring the safety, dignity, and empowerment of women riders and drivers,\" he added.\nNo Commissions, Lower Fares\nThe Home Minister said the taxi service will be rolled out in three years, and the government will charge 20% of the revenue earned by the platform, while the rest will be transferred into the accounts of each Sarathi.\n“Until now, fares were first credited to the company’s account and a commission was deducted. That system ends here. Bharat Taxi will charge zero commission. Not even one percent,\" he added. “All payments will be transferred directly from the customer to the Sarathi’s account — no middleman, no delays.\"\nFurthermore, the platform will also exclude booking fees, heavy platform charges, and hidden commissions from the Sarathi app, making it more convenient for drivers and travellers. All the profits earned will be directly transferred into accounts of the drivers associated with the Bharat Taxi service. However, Amit Shah also cautioned drivers to maintain professional standards and behaviour with travellers.\nThe event was also graced by Union Minister of State for Cooperation Krishan Pal Gurjar; Union Minister of State for Cooperation Murlidhar Mohol; Dr. Ashish Kumar Bhutani, Secretary, Ministry of Cooperation and other senior dignitaries.\nThe Cooperation Ministry said Amit Shah will distribute share certificates to the top six performing Sarathis, further reinforcing the core principle of ‘Sarathi Hi Malik’. Each honoured Sarathi will be provided with a personal accident insurance cover of Rs 5 lakh and a family health insurance cover of Rs 5 lakh, reflecting Bharat Taxi’s commitment to driver welfare and long-term social security.\nBharat Taxi prioritises social security for Sarathis through health insurance, accident insurance, retirement savings, and a dedicated driver support system. Support centres are being operated at seven key locations in Delhi. The platform provides rapid emergency assistance, verified ride data, and allows drivers the freedom to work on other platforms without any exclusivity clauses. To promote women’s empowerment, initiatives such as “Bike Didi\" are being implemented, under which more than 150 women drivers have joined Bharat Taxi so far.\nLatest Blogs",
        "link": "https://www.news18.com/india/sahkar-not-sarkar-amit-shah-launches-bharat-taxi-service-promises-big-benefits-for-drivers-9881648.html",
        "date": "Thu, 5 Feb 2026 15:59:27 +0530",
        "fetched_at": "2026-02-08 04:28:28.519105"
    },
    {
        "title": "SC Directs West Bengal Govt To Recalculate DA, Pay Pending Arrears, 1st Installment By March 31",
        "content": "In a major relief for West Bengal Government employees, the Supreme Court on Thursday directed the Mamata Banerjee-government to refix Dearness Allowance (DA) for its employees for the period 2008 to 2019, holding that DA must be calculated as per the formula laid down in the ROPA Rules.\nThe court said DA is a statutory right as it forms part of the calculation of total emoluments under these rules. SC ordered that arrears of DA from 2009 to 2019 be released to the employees.\nConsidering the financial implications, the Supreme Court set up a committee headed by former Supreme Court judge Justice Indu Malhotra. The panel will also include two retired High Court Chief Justices and the Comptroller and Auditor General (CAG) or a senior officer deputed by the CAG to determine the payment of DA to Bengal state employees.\nThe bench comprised Justice Sanjay Karol and Justice P K Mishra.\nThe committee will calculate the total dearness allowance due and set a payment schedule in consultation with state authorities. The Supreme Court directed completion of this exercise before March 6, 2026. It also ordered the first installment to be paid by March 31, 2026, extending benefits to retired employees.\nThe appeals were filed by the state of West Bengal after it faced adverse orders in earlier litigation.\nThe court framed and examined 13 questions, including the scope of powers under Article 309 of the Constitution, the scope of the ROPA Rules, whether state rules on DA align with ROPA, whether DA is static or dynamic, and whether employees’ legitimate expectations were violated.\nIt also examined the impact of directions of the Central Administrative Tribunal to follow AICPI rules, whether financial capacity can be grounds to deny DA, and whether DA is a fundamental right.\nThe court held that DA is not static and is subject to change under the rules. It said DA is necessary for computing total emoluments.\nThe Supreme Court said the West Bengal government’s decision to change DA rules was a deviation without underlying reasons or principles and described the decision as “capricious\".\nLegitimate expectations of employees\nThe court observed that employees had legitimate expectations due to changes in the ROPA and AICPI rules.\nIt rejected the state’s argument that the Centre was imposing its power, calling it a “figment of imagination\".\nOn judicial review, the court said that once a right is conferred on employees, fiscal policy cannot stand in the way of granting it.\nThe court, however, left the question of whether DA is a fundamental right to be decided in an appropriate forum.\nIt also noted that DA cannot be granted twice in a year.\nLatest Blogs",
        "link": "https://www.news18.com/india/sc-directs-west-bengal-govt-to-recalculate-da-pay-pending-arrears-1st-installment-by-march-31-9881147.html",
        "date": "Thu, 5 Feb 2026 14:03:44 +0530",
        "fetched_at": "2026-02-08 04:28:29.160710"
    }
]