[
    {
        "title": "18,791 government schools in Karnataka have no land records",
        "content": "Shivamogga, the in charge district of Minister for School Education Madhu Bangarappa, has the highest number of pending registration of government school properties, with 1,192 schools.\n| Photo Credit: K. MURALI KUMAR\nThough the Department of School Education and Literacy (DSEL) has been running a ‘Government School and Educational Institutions Property Protection Campaign’ for the last three years to protect the properties of government schools, it has been found that  18,791 government schools across the State do not have any land records.\nThe government has now taken steps to bring “The Karnataka School Education Department Properties Protection Bill 2025, or The Karnataka Protection of Government School/Colleges Properties Bill”  to register the properties of government schools in the name of the DSEL.\nResponding to a question raised by expelled BJP member Basanagouda R. Patil Yatnal in the recent session, School Education Minister Madhu Bangarappa said the properties of 17,356 government primary schools and 1,435 high schools across the State were not registered in the name of the department and don’t have revenue documents. “Therefore, the proposal to enact a separate bill related to the registration of these properties is under review,” he said.\nThere are currently 48,436 government schools in the State, including 43,564 primary and 4,872 high schools. Most of these schools have been allotted land by the government, while many donors have donated land and sites to many schools.\nHowever, out of these, a total of 18,791 government school lands and sites have not been registered in the name of the DSEL and do not have any other revenue records, including khata extracts. As a result, many school lands have been encroached upon and cases have also been registered in the court. In addition, it has also become difficult to undertake school development work, including building construction, without the necessary documents.\nThe DSEL has been conducting government School and Educational Institutions Property Protection Campaign every year since 2022-23.\nThe Deputy Commissioners had been instructed to collect the land records of the respective government schools and register them in the name of the school, and if the said lands were encroached upon, they should have the lands surveyed by the authority concerned and remove the encroachment.\nHowever, so far only 25,339 primary and 3,437 high schools have been registered in the name of the DSEL.\nShivamogga, the in charge district of Minister for School Education Madhu Bangarappa, has the highest number of pending registration of government school properties, with 1,192 schools, followed by 1,124 in Mandya, 1,063 schools in Tumakuru, 958 in Kalaburagi, and 877 in Bengaluru South (earlier Ramanagara) district.\nUmesh G. Gangavadi, State president of School Development and Monitoring Committee (SDMC), said, “Most of the properties of government schools have been encroached upon due to the neglect of previous governments. Many cases are pending in court. A few years ago, there was an incident in Kolar where some private individuals took possession of a government school and demolished it on the orders of the court. If there are no records for the properties, it is also difficult to carry out development work in such schools. The government should complete the pending property registration of government schools on a war footing. A request will be made to the Chief Minister in this regard.”",
        "link": "https://www.thehindu.com/news/national/karnataka/18791-government-schools-in-karnataka-have-no-land-records/article70610529.ece",
        "date": "Mon, 09 Feb 2026 20:09:44 +0530",
        "fetched_at": "2026-02-10 04:14:10.067910"
    },
    {
        "title": "Three-language panel submits report to Maharashtra government",
        "content": "The Maharashtra government had to scrap its decision of implementing three languages in primary educationin 2025 , after there was opposition about the compulsion of Hindi in Maharashtra in primary education. (Representational image)\n| Photo Credit: Getty Images/iStockphoto\nThe eight-member committee appointed by the Maharashtra government in 2025 to recommend on the implementation of three-language formula in primary education, submitted its report to Chief Minister Devendra Fadnavis at the State Secretariat on Monday (February 9, 2026). The committee, headed by economist Narendra Jadhav, gave a 10-minute presentation on it, and also submitted another report on how to introduce Artificial Intelligence and ICT (Information and Communication Technology) in school education from Grade 1.\n“I have suggested that the recommendations should be implemented from the coming academic year. The main report about the recommendations on three language formula consists of 65 pages, and 60 pages of annexture. The executive summary of the report is 23 pages. I am not at liberty to discuss our recommendations at this stage. But I will hold a press conference once the report is tabled before the cabinet and once I hear back from them,” Narendra Jadhav told The Hindu on Monday (February 9, 2026).\nHe also said that supplementary report on the use of AI in primary education was 25 pages long. Except Sadanand More and Bhushan Shukla, all other members of the committee were present during report submission.\n“The committee has submitted its report to us. We will discuss it in the cabinet first. We will go over the recommendations and decide if anything needs to be modified. The Cabinet will give its suggestions. We will give a briefing about the contents of the report after that,” Chief Minsiter Devendra Fadnavis said.\nLast year, the Maharashtra government had to scrap its decision of implementing three languages in primary education, after there was opposition from all quarters of the society about the compulsion of Hindi in Maharashtra in primary education. Children in the State learn three languages from Grade 5 as per the current education system. The government’s decision to bring the three-language policy in primary education was perceived as an imposition of Hindi.\nWhile educationists had contested the government’s decision on the grounds that it will overburden children in primary education with an additional language when the State education system was not equipped to handle the current subjects in schools due to lack of teachers. Several cultural, social and political organisations had hit the ground against the government against the imposition of Hindi at the cost of Marathi.\nBowing to public pressure, after the government scrapped its decision, it appointed an eight-member committee under Narendra Jadhav to study the matter and to give its recommendations last year. The terms of reference had stated that the committee will study the Raghunath Mashelkar committee report which had advocated three-language policy in primary education, and give its suggestions. The government also said that the committee should look into the broad tenets of the National Education Policy.\nAccordingly, amid opposition by several linguists and experts that the committee was being appointed under an economist, and not under a linguist or a specialist in child psychology, the committee had started its functioning. It had engaged with several political leaders and socio-cultural organisations, and held meetings in different parts of the State to gather suggestions. After receiving extensions, the committee submitted its report on Monday (February 10, 2026), a day when the results of the final phase of local body elections were declared.\nlanguage\n/\neducation\n/\nschool",
        "link": "https://www.thehindu.com/news/national/maharashtra/three-language-panel-submits-report-to-maharashtra-government/article70613605.ece",
        "date": "Tue, 10 Feb 2026 06:45:51 +0530",
        "fetched_at": "2026-02-10 04:14:10.670888"
    },
    {
        "title": "Naveen Patnaik attacks Mohan Majhi government over paddy procurement",
        "content": "Former Odisha Chief Minister Naveen Patnaik said farmers, desperate to clear their debts, are being forced into distress sales far below the MSP. File\n| Photo Credit: ANI\nThe Biju Janata Dal (BJD) has accused the Bharatiya Janata Party (BJP) government of throwing the paddy procurement process in the Kharif season into disarray, leaving thousands of farmers sleepless as they wait to sell their harvest.\nIn a sharply-worded letter addressed to Chief Minister Mohan Charan Majhi on Monday (February 9, 2026), BJD supremo and former Chief Minister Naveen Patnaik says, “agriculture is the lifeline of Odisha, yet the current Kharif procurement season has become a period of profound struggle for our farmers due to administrative apathy and the blatant violation of promises made to the people.”\n“During the 2024 elections, as per Point No. 2 of your Party’s (BJP’s) manifesto, you made solemn commitments to the farming community regarding enhanced minimum support price and stopping of Katni-Chhatni (deduction of paddy on account of fair average quality). However, the ground reality across Mandis tells a story of betrayal,” Mr. Patnaik mentioned in his letter.\n“Thousands of farmers are spending sleepless nights under the open sky, guarding their paddy from dew and theft, as the lifting of stocks remains agonisingly slow. The lack of basic facilities, the failure of the token system, and the delay in payment — which was promised within 48 hours through direct benefit transfer but is taking weeks in many cases — have pushed the farmers to the brink of agitation,” the former Chief Minister drew attention to.\n“Is it not a failure in fulfilment of electoral promises of BJP? It may be mentioned here that payment to farmers through DBT within 48 hours of procurement was promised in Point-2 of the BJP election manifesto,” he asked.\n“Despite repeated assurances of a hassle-free procurement, farmers are being subjected to arbitrary deductions of 5 kg to 7 kg per quintal under the guise of moisture content or poor quality. In many districts, this exploitation is happening in broad daylight, often with the alleged collusion of millers and local officials, forcing farmers into a mutual agreement that robs them of their hard-earned income,” said Mr. Patnaik.\n“Your government promised an input subsidy of Rs 800 per quintal to support all farmers. However, the recent decision to cap this subsidy at a maximum of 150 quintals per farmer is a clear breach of trust,” he remarked.\nStating that the combination of Katni Chhatni, the 150-quintal cap, and the slow pace of procurement has created a vacuum being exploited by unscrupulous traders and millers, the former CM said farmers, desperate to clear their debts, are being forced into distress sales far below the MSP.\nThe BJD supremo demanded lifting of the 150-quintal ceiling on the input subsidy, payment to farmers through DBT within 48 hours of procurement and 100% lifting of paddy lying in the open sky within a fixed 72-hour window.\nReacting to the letter, BJP State president Manmohan Samal said, “during Mr. Patnaik’s regime, the government struggled to give ₹100 input subsidy per quintal, whereas the BJP government is paying ₹800. They are deceiving people with false information out of jealousy.”\nBhubaneswar\n/\nOrissa",
        "link": "https://www.thehindu.com/news/national/odisha/naveen-patnaik-attacks-mohan-majhi-government-over-paddy-procurement/article70611619.ece",
        "date": "Tue, 10 Feb 2026 04:05:49 +0530",
        "fetched_at": "2026-02-10 04:14:11.272527"
    },
    {
        "title": "‘BJP leader’ booked for beating woman in M.P.; video goes viral",
        "content": "Screen grab of the viral video in which Santosh Pathak is seen punching and kicking Hema Singh and beating her with a stick. | Photo: Screengrab via X/@INCIndia.\nA case has been registered against an alleged Bharatiya Janata Party (BJP) leader for beating a woman in Madhya Pradesh’s Sidhi district, police said on Monday (February 9, 2026).\nAccording to the police, the incident took place on Sunday morning (February 8, 2026), around 10.30 a.m. at Bhanwaar village in the Bahri police station area over a vegetable stall.\nSidhi’s Additional Superintendent of Police, Arvind Shrivastava, told The Hindu that an FIR was lodged shortly after the incident against two men — Santosh Pathak and Rahul Dwivedi — who are absconding. The duo has been charged under Sections 296(b), 115(2), and 351(3) of the BNS.\nA purported video of the incident has also gone viral on the internet in which Mr. Pathak is seen punching and kicking Hema Singh and beating her with a stick.\nSharing the video on X, the Congress said, “Madhya Pradesh’s Jungle Raj. This is BJP leader Santosh Pathak, who is brutally beating a woman in the middle of the road. On one hand, Narendra Modi pontificates constantly on women’s honour from the election podium; on the other hand, BJP leaders tear women’s honour to shreds.”\nमध्य प्रदेश का 'जंगलराज'ये BJP नेता संतोष पाठक है, जो एक महिला को बीच सड़क पर बुरी तरह से पीट रहा है।एक तरफ नरेंद्र मोदी चुनावी मंच से महिला सम्मान का ढोंग करते हैं, दूसरी तरफ BJP नेता महिला सम्मान की धज्जियां उड़ाते हैं।लेकिन ये पहली बार नहीं है। लगातार ऐसी खबरें सामने आ… pic.twitter.com/mhjaRfjwQB\n“But this isn’t the first time. Such instances are reported constantly; BJP leaders, drunk on power, are seen perpetrating atrocities against women. This is the true nature of the BJP,” the Opposition party said, demanding to know if the BJP government would act against Mr. Pathak.\nMr. Shrivastava, however, denied that the accused was linked to any political party and said that it was a case of “sudden provocation”.\n“The FIR was lodged within an hour of the incident. The accused are currently absconding but we have teams looking for them,” he said.\nAccording to the FIR, Ms. Singh alleged that Mr. Dwivedi had threatened her, warning her not to place her stall at the spot, which he claimed belonged to Mr. Pathak. She alleged that Mr. Pathak arrived at the scene, soon after, and the two men began to abuse and assault her.\nMadhya Pradesh\n/\nBharatiya Janata Party\n/\nIndian National Congress",
        "link": "https://www.thehindu.com/news/national/madhya-pradesh/bjp-leader-booked-for-beating-woman-in-mp-video-goes-viral/article70612260.ece",
        "date": "Tue, 10 Feb 2026 02:03:58 +0530",
        "fetched_at": "2026-02-10 04:14:11.871252"
    },
    {
        "title": "U.P. Budget Session: Opposition disrupts Governor’s address",
        "content": "Opposition creating a ruckus in the Assembly during the first day of the Uttar Pradesh Budget Session in Lucknow on Monday.\n| Photo Credit: ANI\nThe Uttar Pradesh Budget Session began on Monday on a stormy note, with Samajwadi Party (SP) legislators staging a protest, highlighting issues such as the Special Intensive Revision (SIR) of electoral rolls, UGC regulations, inflation, and unemployment.\nThe uproar began when Governor Anandiben Patel began her address in the House even as the Opposition leaders shouted slogans including “Governor go back”.\nAfter Ms. Patel’s speech, Finance Minister Suresh Khanna presented the government’s Economic Survey, outlining an investment-led growth strategy to position the State as a $1-trillion economy. This is the first time the State has presented a review before tabling the budget.\nSpeaking to reporters, Chief Minister Yogi Adityanath said he hoped for constructive discussions to ensure the smooth functioning of the House. “The legislature is an important pillar of democracy. If any member has to raise any issue, then instead of disrupting the proceedings, they can hold a dialogue, because the government believes in dialogue to resolve problems.”\n“The Budget for 2026-27 will be presented on February 11. After this, there will be a discussion. The Budget Session will run from February 9-20,” the CM said.\nHitting out at the government, Bahujan Samaj Party president Mayawati claimed that people from all sections of society across the State are distressed due to the Yogi Adityanath government’s “poor” policies.\nIn an X post, Ms. Mayawati noted that the Governor’s speech didn’t focus on the upliftment of society or the State’s development.\n“But above all these, they are worried about their life, property and religion, towards which the Hon’ble Governor should have drawn the attention of the government so that the people of the State as well as the Opposition could have got some assurance,“ the BSP chief stated in the X post.",
        "link": "https://www.thehindu.com/news/national/uttar-pradesh/up-budget-session-opposition-disrupts-governors-address/article70611788.ece",
        "date": "Tue, 10 Feb 2026 01:30:06 +0530",
        "fetched_at": "2026-02-10 04:14:12.495059"
    },
    {
        "title": "Haryana Oppn. alleges cut in no. of old age pension scheme beneficiaries",
        "content": "Politics over the ‘Old Age Samman Allowance Scheme’ in Haryana has heated up with the Opposition parties accusing the ruling Bharatiya Janata Party government of cutting the number of beneficiaries under the scheme in a “well-planned manner”, terming it “attack on the rights and the dignity of the elderly” in the State.\nIn a battle of political one-upmanship, both the Congress and the Indian National Lok Dal (INLD) have announced to hold mass protest demonstrations in Sonipat and Panchkula respectively later this month.\nAs per the latest figures, 20,05,367 beneficiaries – 10,44,069 men and 9,61,298 women – were paid the monthly ₹3,000 pension in February this year.\nRubbishing the allegations of the Opposition as “baseless” and “an attempt to regain the lost political ground”, Haryana BJP media in-charge Arvind said the old age pension in Haryana was more than in neighbouring Punjab and Himachal Pradesh, ruled by the Aam Aadmi Party and the Congress respectively. “Most importantly, Chief Minister Nayab Singh Saini has stated that no one’s pension has been cut,” he asserted.\nINLD national president Abhay Chautala claimed that names of more than 75,000 pensioners across the State had been cut. In a video message, he accused the Chief Minister of lying on the issue and gave a call for a State-level protest in Panchkula on February 20. Mr. Chautala also directed the party’s workers and office-bearers to record the videos of those whose pension had been cut and send it directly to the Chief Minister to nail his “lie”.\n“[Party founder] Chaudhary Devi Lal had started an old age pension of ₹100 without any conditions, which is equivalent to ₹15,000 today. The Congress party, while in power, tried to cut pensions by imposing certain conditions, but the INLD fought for the respect of the elderly then,” Mr. Chautala said, also accusing the BJP government of not increasing the pension by ₹200 as promised.\nAnnouncing a major protest in Sonipat on February 15, Congress’s Rohtak MP Deepender Hooda said old age pension is not charity. “After the elections, the BJP first cut the ration cards of the poor, and now they are cutting the pensions of the elderly,” he said.\nAccusing the BJP of a hatching a conspiracy to dismantle “an excellent and long-standing social welfare scheme”, former Deputy CM and Jannayak Janta Party leader Dushyant Chautala said even if there were minor errors in someone’s documents, the government should rectify them by visiting their homes instead of cutting their pensions.\nThe old age pension scheme was initially started on April 1, 1964 in undivided Punjab, of which Haryana was a part. The rate of pension, which was ₹15 per month, was increased from time to time. The Haryana government implemented this scheme on November 1, 1966 after its creation and 2,382 beneficiaries were paid the pensions. The old age pension scheme was expanded in 1987 at ₹100 per month for those aged 65 years or more. The State government further enhanced the scheme and introduced ‘Old Age Pension Scheme-1991’, now renamed as Old Age Samman Allowance Scheme. It was implemented from July 1y, 1991 and the age of eligibility was reduced from 65 to 60 years.",
        "link": "https://www.thehindu.com/news/national/haryana/haryana-oppn-alleges-cut-in-no-of-old-age-pension-scheme-beneficiaries/article70611665.ece",
        "date": "Tue, 10 Feb 2026 00:43:42 +0530",
        "fetched_at": "2026-02-10 04:14:13.094135"
    },
    {
        "title": "Hosur airport not recommended to prioritise defence projects of national importance, says Civil Aviation Minister",
        "content": "Union Minister Kinjarapu Rammohan Naidu.\n| Photo Credit: File photo\nUnion Minister for Civil Aviation Kinjarapu Rammohan Naidu said on Monday that the Hosur airport project proposal mooted by Tamil Nadu has not been recommended “in order to prioritise defence projects of national importance” executed by Hindustan Aeronautics Limited (HAL) Airport.\nHe was responding to a question raised by DMK MP S. Kalyanasundaram in the Rajya Sabha on whether the Centre has examined the Hosur airport proposal sent by the State government and the reasons for the delay in granting in-principle approval, airspace clearance and other such permissions. His party colleague Kanimozhi N.V.N Somu too posed a similar query.\nMr. Naidu said: “In order to prioritise defence projects of national importance, being carried out by HAL Airport and to enable operational preparedness of defence forces, the proposal has not been recommended.”\nIn November last year, the Tamil Nadu Industrial Development Corporation (TIDCO) sent the site-clearance for the Hosur airport. “The proposal was circulated to the Airports Authority of India (AAI), the Directorate General of Civil Aviation (DGCA) and the Ministry of Defence (MoD) for comments/observations,” Mr. Naidu added.\nBefore that, in June, TIDCO had requested the MoD for airspace relaxation to construct the Hosur airport. When it was rejected, the Tamil Nadu government yet again wrote to the Centre, but it was turned down again in January. Sources said the State government had been drafting a justification for this project and will resubmit the request soon.",
        "link": "https://www.thehindu.com/news/cities/chennai/hosur-airport-not-recommended-to-prioritise-defence-projects-of-national-importance-says-civil-aviation-minister/article70611947.ece",
        "date": "Tue, 10 Feb 2026 00:31:45 +0530",
        "fetched_at": "2026-02-10 04:14:13.682257"
    },
    {
        "title": "Hyderabad and Cyberabad traffic police book over 900 drunk driving cases in special drives",
        "content": "The Hyderabad Traffic Police conducted a two-day special drive against drunk driving on February 6 and February 7, booking 604 motorists for driving under the influence of alcohol.\nOf the total offenders booked in Hyderabad, 492 were two-wheeler riders, 42 were three-wheeler drivers and 70 were driving four-wheelers or other vehicles.  Police said cases were registered across multiple blood alcohol concentration levels, with 141 motorists recording BAC levels between 30 and 50, 238 between 51 and 100, and 127 between 101 and 150. Another 61 cases fell in the 151 to 200 range, while 25 drivers recorded levels between 201 and 250, seven between 251 and 300, and five above 300.\nTraffic police said there would be zero tolerance towards drunk driving and that such special drives would continue. Commuters were urged to cooperate with enforcement teams.\nIn a parallel weekend enforcement drive, the Cyberabad Traffic Police apprehended 314 offenders for drunk driving between February 6 and February 7.  According to data released by the police, 245 cases involved two-wheelers, 10 involved three-wheelers, 58 involved four-wheelers, and one involved a heavy vehicle.\nPolice data also showed that 272 offenders recorded BAC levels between 36 mg per 100 ml and 200 mg per 100 ml, while 27 offenders fell in the 201 to 300 range and 15 recorded BAC levels above 300. All the offenders will be produced before the court.\nAge wise analysis of the 314 offenders showed that the majority were in the 21 to 30 age group, accounting for 137 cases, followed by those aged 31 to 40 with 108 cases. Another 45 offenders were aged between 41 and 50. Eleven cases each were recorded in the 18 to 20 and 51 to 60 age groups, while two offenders were above 61.  No cases were booked involving minors.\nPolice station wise figures showed that Miyapur Traffic Police Station recorded the highest number of cases at 54, followed by Jeedimetla with 37, Balanagar with 34, and Gachibowli - 31. Other stations where cases were booked include Madhapur, Narsingi, Raidurgam, Medchal, Patancheru, Kukatpally, KPHB and Ramachandrapuram.\nCyberabad Traffic Police said that in the previous week from February 2 to February 7, a total of 266 drunk driving cases were disposed of by courts.  Of these, three offenders were sentenced to fine and jail, 19 were given fine along with social service, while 244 were imposed fines only.",
        "link": "https://www.thehindu.com/news/national/telangana/hyderabad-and-cyberabad-traffic-police-book-over-900-drunk-driving-cases-in-special-drives/article70607790.ece",
        "date": "Tue, 10 Feb 2026 00:24:06 +0530",
        "fetched_at": "2026-02-10 04:14:14.289156"
    },
    {
        "title": "TMC welcomes Supreme Court intervention in SIR exercise, calls it big victory for West Bengal",
        "content": "People get their documents verified under the Special Intensive Revision of electoral rolls in Nadia, West Bengal. File\n| Photo Credit: PTI\nThe Trinamool Congress on Monday (February 9, 2026) welcomed the intervention of the Supreme Court in the case involving Special Intensive Revision (SIR) of electoral rolls in West Bengal and called it a big victory for the State.\nThe Supreme Court said micro observers appointed by the Election Commission of India (ECI) cannot take decisions and directed the West Bengal government to make Group B officers available for the SIR. Chief Minister Mamata Banerjee, who appeared before the top court in person on February 4, had said that micro observers had been engaged only in West Bengal and not in any other State where the SIR exercise was under way.\nThe top court has asked the ECI to extend the deadline for the claims-and-objections phase of the West Bengal SIR for a week beyond the current deadline of February 14.\n“The Hon’ble Supreme Court has delivered a stinging rebuke to @ECISVEEP’s arbitrary overreach. In unequivocal terms, the Court has ordered that micro-observers can only assist EROs/AEROs and that final authority rests solely with EROs. Further, the Court has directed that 8,505 Bengal officials be tagged to EROs to support the SIR process,” the Trinamool Congress posted on social media.\nThe ruling party in the State said that the development blew apart the “ECI’s unilateral move to parachute micro-observers exclusively into Bengal, to influence, intimidate, and manipulate the process. That Constitutional vandalism has now been struck down by the highest court of the land. This is a big victory for democracy.”\nThe SIR exercise is on its last legs in West Bengal. The Chief Electoral Officer West Bengal had earlier sought an extension of seven days for the SIR process. The Trinamool Congress leadership, led by Chief Minister Mamata Banerjee, has opposed the exercise in the State and has described it as an attempt to remove names of genuine voters from the electoral rolls.\n“This is a big victory for democracy. A big victory for Bengal. And a big defeat for those who thought institutions could be weaponised against the people. The fight for citizens’ rights, dignity, and the sanctity of the vote will rage on,” read the Trinamool Congress statement on social media.\nLeader of the Opposition in West Bengal Assembly Suvendu Adhikari said it had now been proved that the Trinamool Congress made desperate attempts to remove micro observers.\n“The doors that Mamata Banerjee and TMC have opened at the Supreme Court will leave all the responsibility with AERO and EROs if suspicious voters are included in the voter list... As a party and as individual voters, we also have the full right to challenge this after the final voter list is published,” Mr. Adhikari said.\nThe BJP, which demands “purification” of electoral rolls in the State, said that it would not allow Assembly polls in West Bengal due in next few months unless the SIR was held properly.\nIn the first draft electoral roll published in December, around 58 lakh voters had been deleted under categories such as death, permanent address shift, and untraceable. There were over 1.36 crore people marked under the ‘logical discrepancy’ category and were sent notices from the CEO office asking them to appear for a hearing.\nWest Bengal\n/\nKolkata\n/\nSpecial Intensive Revision of electoral rolls\n/\nElection Commission of India\n/\nSupreme Court\n/\nelection",
        "link": "https://www.thehindu.com/news/national/west-bengal/tmc-welcomes-supreme-court-intervention-in-sir-exercise-calls-it-big-victory-for-west-bengal/article70612379.ece",
        "date": "Tue, 10 Feb 2026 00:06:46 +0530",
        "fetched_at": "2026-02-10 04:14:14.890337"
    },
    {
        "title": "Workers, employers found Labour Codes credible, forward-looking: government report",
        "content": "The results were released by Union Labour Minister Mansukh Mandaviya on February 9, 2026. Picture: vvgnli.gov.in\nA survey conducted by the Union Labour Ministry’s research arm, V.V. Giri National Labour Institute, among 5,720 workers and 715 employers has found “a broad-based and constructive acceptance” of the four Labour Codes.\n“The overall perception scores indicate that stakeholders view the Labour Codes as a credible and forward-looking reform, reflecting confidence in their long-term relevance despite the acknowledged transitional nature of the current phase,” a report based on the survey said.\nThe results were released by Union Labour Minister Mansukh Mandaviya on Monday (February 9, 2026). Ten Central trade unions have given a call for general strike on February 12 against the implementation of the four Labour Codes.\nIt added that the Labour Codes are increasingly regarded as a shared institutional framework rather than as a unilateral regulatory intervention. “The study finds a consistently positive assessment of the potential impact of the Labour Codes on working conditions, wages, and income security. Workers perceive that the Codes will lead to improved regulation of working hours, better rest and leave practices, and greater regularity in wage payments,” it added.\nSixty per cent of workers, who participated in the survey, believed that overall working conditions will improve as implementation matures. “In addition, 63% of workers perceive that the provisions will lead to better regulation of working hours, while 60% believe the Codes will improve rest periods and leave practices. Regarding remuneration, 54% of workers believe the Labour Codes will improve the timely payment of wages,” the report said.\nAlso, 64% of workers believed that the new provisions will improve income security; 76% of employers believed that workforce flexibility is essential for business sustainability, and 64% believed timely wage payment provisions will improve workplace discipline. “Fixed-term employment and adaptable workforce structures are viewed as compatible with business sustainability, particularly in a competitive and evolving economic environment, with 64% of employers stating that fixed-term employment suits their business model,” the report added.\nIt further said: “71% of employers express confidence that the Labour Codes support women’s participation in employment, while 66% of workers believe that safety, transport, and monitoring requirements will improve protection for women workers.”\nlabour\n/\nlaws",
        "link": "https://www.thehindu.com/news/national/workers-employers-found-labour-codes-credible-forward-looking-government-report/article70612036.ece",
        "date": "Mon, 09 Feb 2026 23:13:13 +0530",
        "fetched_at": "2026-02-10 04:14:15.486526"
    },
    {
        "title": "Karnataka Government will recalculate Namma Metro fares using Delhi Metro formula: DKS",
        "content": "Amid a political confrontation between the ruling Congress and the BJP over the proposed hike in Namma Metro fares, Deputy Chief Minister D.K. Shivakumar on Monday announced that metro fares would be recalculated afresh using the formula followed by the Delhi Metro.\nThe announcement came a day after the BMRCL put the fare hike, scheduled to come into effect on Monday, on hold following public protests and political pressure.\nMr. Shivakumar asserted that it was the State government that had taken the decision to halt the fare revision, rejecting claims by BJP leaders that the Union government had intervened to stop the hike. Addressing a press conference at Vidhana Soudha, Mr. Shivakumar said, “A letter purportedly sent by the Centre directing BMRCL to defer the fare hike has no legal value.”\n“There is no politics on this issue. The Union government has no authority to issue directions or interfere in metro fare matters. I have instructed officials to freshly calculate fares based on the formula followed by the Delhi Metro,” he said.",
        "link": "https://www.thehindu.com/news/national/karnataka/karnataka-government-will-recalculate-namma-metro-fares-using-delhi-metro-formula-dks/article70612325.ece",
        "date": "Mon, 09 Feb 2026 23:04:14 +0530",
        "fetched_at": "2026-02-10 04:14:16.085032"
    },
    {
        "title": "India, Greece to strengthen defence partnership, expand capacity of military industries",
        "content": "Defence Minister Rajnath Singh, right, during a Bilateral meeting with his Greek counterpart Nikolaos Georgios Dendias, in New Delhi. A Joint Declaration of Intent with a five-year roadmap was signed and a Bilateral Military Cooperation Plan 2026 was exchanged during the meeting. Photo Credit: X/@SpokespersonMoD Via PTI Photo\nDefence Minister Rajnath Singh held a bilateral meeting with Greece’s Minister of National Defence, Nikolaos-Georgios Dendias, in New Delhi on Monday (February 9, 2026). The meeting focused on strengthening defence cooperation under the India–Greece Strategic Partnership.\nAccording to the Ministry of Defence, both Ministers reiterated that the partnership is rooted in shared values of peace, stability, freedom and mutual respect. They agreed to expand the capacities of their indigenous defence industries by aligning India’s Aatmanirbhar Bharat initiative with Greece’s defence reforms under Agenda 2030.\nA Joint Declaration of Intent on strengthening defence industrial cooperation was signed, marking the beginning of work on a five-year roadmap. The two sides also exchanged a Bilateral Military Cooperation Plan for 2026, outlining future military engagements between the armed forces of both countries, the Ministry added.\nThe discussions covered regional peace and security, with both leaders acknowledging the steady deepening of bilateral defence cooperation and strategic ties. Convergence on key maritime issues was highlighted, reflecting the shared outlook of the two ancient seafaring nations.\nThe Greek side announced the deployment of a Greek International Liaison Officer at the Information Fusion Centre–Indian Ocean Region (IFC-IOR) in Gurugram, underlining enhanced maritime cooperation.\nEarlier in the day, Defence Minister Dendias laid a wreath at the National War Memorial and paid homage to fallen soldiers. He also inspected a Tri-Service Guard of Honour at the Manekshaw Centre.\nThe Hellenic delegation travelled to Bengaluru to visit key defence and industrial establishments and interacted with DPSUs, defence industry representatives, and start-ups in New Delhi. The visit reaffirmed the India–Greece Strategic Partnership, built on long-standing and close ties between the two countries and their peoples.\npolitics\n/\ngovernment\n/\nsecurity measures\n/\nnational security\n/\ndefence",
        "link": "https://www.thehindu.com/news/national/india-greece-to-strengthen-defence-partnership-expand-capacity-of-military-industries/article70611898.ece",
        "date": "Mon, 09 Feb 2026 22:41:21 +0530",
        "fetched_at": "2026-02-10 04:14:16.723115"
    },
    {
        "title": "Kanpur pan masala baron’s son booked after reckless car crash",
        "content": "Police personnel inspect a luxury car parked at a police station after it allegedly hit and injured six pedestrians, in Kanpur on February 9, 2026.\n| Photo Credit: PTI\nKanpur Police on Monday (February 9, 2026) booked pan masala baron K.K. Mishra’s son, Shivam Mishra, in a case of overspeeding of a Lamborghini sports car that rammed into pedestrians and two-wheelers on the VIP Road in Kanpur’s upscale Gwaltoli area, injuring six persons and triggering local outrage.\nThe First Information Report (FIR) was registered at the Gwaltoli police station under Sections 125 (a & b) (rash or negligent acts endangering human life or personal safety), 281 (rash or negligent driving/riding on a public way that endangers human life or personal safety), and 324 (4) (mischief) of the Bharatiya Nyaya Sanhita, 2023.\n“Necessary action is being taken regarding the road accident that occurred on February 8, 2026, within the jurisdiction of the Gwaltoli police station. The accident occurred with a Lamborghini car. The vehicle struck a parked motorcycle, causing it to be crushed under the vehicle. The motorcycle belonged to a man named Taufiq, who suffered injuries in the arms and legs in the accident. He was taken to a hospital for first aid and released after treatment. The victim came to the police station and submitted a petition, based on which an FIR has been registered. Initially, the case was registered based on the vehicle’s description, as the driver’s name was unknown. The vehicle has been seized,” said Raghubir Lal, Police Commissioner, Kanpur Nagar.\nHe said preliminary investigations revealed that the vehicle was being driven by Shivam Mishra, son of K.K. Mishra. Following the accident, the driver was extricated from the vehicle by two bouncers present in the vehicle. It was reported that the driver had a medical issue and was also sent for first aid. Now that the driver’s identity had been established, legal action was being taken against him. The vehicle was in police custody and an investigating officer was investigating all aspects. The law applied equally to all. There would be no partiality, and strict action would be taken against those found guilty. If anyone attempted to conceal or mislead facts, legal action would be taken against them as well, said Mr. Raghubir Lal.\nAt least six persons were injured on Sunday (February 8, 2026) after a speeding Lamborghini, allegedly driven by Shivam, rammed into pedestrians and two-wheelers on the VIP Road in Kanpur’s upscale Gwaltoli area. The car first hit an autorickshaw and then crashed into a parked motorcycle, flinging its rider nearly 10 feet into the air. After the incident, angry locals gathered at the spot and surrounded the car, the locals alleged that private bouncers accompanying the accused tried to push back the crowd and behaved aggressively, escalating tensions.\nroad accident\n/\naccident (general)\n/\nLucknow",
        "link": "https://www.thehindu.com/news/national/uttar-pradesh/kanpur-pan-masala-barons-son-booked-after-reckless-car-crash/article70612206.ece",
        "date": "Mon, 09 Feb 2026 22:28:31 +0530",
        "fetched_at": "2026-02-10 04:14:17.323621"
    },
    {
        "title": "Mediation training programme launched at Andhra Pradesh High Court",
        "content": "The Andhra Pradesh High Court Judge and State AP Legal Services Authority (APSLSA) executive chairman Justice Cheekati Manavendranath Roy, along with AP High Court Legal Services Committee chairman Ravi Nath Tilhari inaugurated the 40-days mediation training programme for advocates at the High Court on Monday. Justices R. Raghunandhan Rao, Cheemalapati Ravi, T.C.D. Sekhar, and other officers participated in the programme.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/mediation-training-programme-launched-at-andhra-pradesh-high-court/article70611790.ece",
        "date": "Mon, 09 Feb 2026 22:23:42 +0530",
        "fetched_at": "2026-02-10 04:14:17.917414"
    },
    {
        "title": "Opposition corners Centre over unemployment, farmers’ woes during discussion on Budget in Rajya Sabha",
        "content": "Congress MP P. Chidambaram speaks in the Rajya Sabha during the Budget Session of Parliament, on February 9, 2026. Photo Credit: Sansad TV via PTI\nThe Opposition members highlighted issues such as unemployment, sluggish economy, and the impact of the bilateral trade with the United States on the agriculture sector during the debate on the Union Budget in the Rajya Sabha on Monday (February 9, 2026). The BJP said the country signed six trade pacts recently, which is an indication that India is becoming a global hub.\nSenior Congress MP P. Chidambaram initiated the debate and termed the Budget as “forgettable”, which had been prepared by “a Finance Minister who forgot her promises made in this House last year.” He attacked the Union Government for not addressing unemployment, particularly among youth.\n“Youth unemployment is 15%. Less than 25% of the workforce is in regular employment. There is a shift to self-employment, and more workers are in the agriculture sector than they were four or five years ago,” he said, pointing out the decrease in regular employment in the country. “In a country with 144 crore people, only 195 lakh, that is less than two crore, are employed in a factory. Manufacturing, which is largely factories, is stuck at 16% for many, many years,” he said.\nThe Prime Minister’s Internship Scheme, announced in the last Budget, could offer 1,65,000 positions, the Congress leader said. “Only 33,000 were accepted. Are there no young men and women to accept an internship in big companies? And of the 33,000 that were accepted, 6,000 left the job. What is wrong with the internship scheme?” he asked and sought an explanation from Finance Minister Nirmala Sitharaman.\nOn the decrease in capital investment, he said that for almost 12 years, capital investment, gross fixed capital formation, is stuck at 30% of GDP. “Net FDI in 2024-25 collapsed to less than 0.09%. FPIs, [that is] foreign portfolio investors are pulling out. Private investment, although companies are cash rich, is stuck at 22% of GDP. In this situation where neither the public sector nor the private sector nor the foreign investor is investing in India, this government has cut capital expenditure. In the year 2025-26, they have cut capital expenditure by a whopping ₹1,44,376 crore,” he said.\nIn his speech, senior BJP MP Arun Singh said the whole world was turning towards India. “From credit rating agencies to global institutions, everyone is applauding India’s schemes, policies and systems, and they are seeing that the country is becoming a global hub. As a result of that, within a year, India has inked six pacts,” he said, mentioning the deals signed with Oman, New Zealand, the U.K., the EU, and the U.S. as examples. “The biggest among these deals is the India-U.S. trade deal, which shows India’s power, potential and ability that it is emerging as a global hub,” Mr. Singh said.\nDMK MP P. Wilson said the Centre surrendered to the United States, and the entire nation was concerned about the “one-sided” trade deal. India is a proud nation and civilisation. This weaponisation of tariff should (would) have pressurised the government into submission,” he said. Mr. Wilson said the Budget had nothing for Tamil Nadu, which was retorted by Ms. Sitharaman.\nSamajwadi Party MP Jaya Bachchan too raised the issue of unemployment, particularly among women. She demanded reforms in the tax structure for the entertainment industry. National Conference MP Chowdry Mohammad Ramzan raised the problems faced by the tourism sector in Jammu and Kashmir. Alleging that the Centre had sacrificed the rights of farmers in front of the United States, senior Congress MP Randeep Singh Surjewala said the Union Government failed to utilise around ₹1.17 lakh crore in six years from 2018-19 to 2023-24. “If we count till 2024-25, ₹1.7 lakh crore has been surrendered,” he said.\neconomy, business and finance\n/\nlabour\n/\nAgriculture\n/\nagriculture\n/\nUnion Budget\n/\nemployment",
        "link": "https://www.thehindu.com/news/national/opposition-corners-centre-over-unemployment-farmers-woes-during-discussion-on-budget-in-rajya-sabha/article70611942.ece",
        "date": "Mon, 09 Feb 2026 21:57:35 +0530",
        "fetched_at": "2026-02-10 04:14:18.512930"
    },
    {
        "title": "Mysuru Sandal Soap to be relaunched today as Tamannaah’s tenure as brand ambassador begins",
        "content": "Actor Tamannaah Bhatia who has been signed as KSDL brand ambassador for two years.\n| Photo Credit: Special Arrangement\nThe two-year tenure of noted film actor Tamannaah Bhatia as the brand ambassador of the State-owned Karnataka Soaps and Detergents Limited’s (KSDL) to strengthen the market presence its products will commence from Tuesday.\nDisclosing this to mediapersons, Minister for Large and Medium Industries M.B. Patil said that on the occasion the iconic heritage product Mysuru Sandal Soap would be relaunched with a refreshed and contemporary look.\nThe Minister said that KSDL had set a target of scaling up its annual turnover to ₹5,000 crore by 2030. In line with this objective, a comprehensive promotional campaign is being undertaken to reach the youth. Tamannaah Bhatia, who enjoyed considerable star appeal and has over three million followers on social media, had been engaged as part of this strategy. The initiative was expected to help create a strong market for the company’s products, including Mysuru Sandal Soap, in North India as well, he said.\nKSDL has a rich legacy spanning over a century. The enterprise was established with the vision of the Maharaja of Mysuru, Nalwadi Krishnaraja Wadiyar, the then Dewan M. Visvesvaraya, and industrial chemist S.G. Shastri, popularly known as ‘Soap Shastri’.\nThe organisation, which was witnessing healthy turnover and profits, recorded an all-time high production last month across its three divisions — soaps, detergents and cosmetics, Mr. Patil explained.\nAt present, the organisation manufactures a total of 57 premium products, ranging from Mysuru Sandal Soap to packaged drinking water.\nHe said there was a strong demand for the organisation’s products such as shower gels, talcum powder, hand wash, agarbathis, sambrani, dhoop, Millennium Soap and bathing soaps.\nPromotional videos and other campaign material would be released to coincide with the commencement of the brand ambassador’s tenure.\nIn addition, production units would soon be commissioned in the Vijayapura and Dobbspet industrial areas, with the necessary procedures currently under way. Plans were also in place to double the export turnover, which presently stood at around ₹25 crore to ₹30 crore a year, Mr. Patil said.\nSpeaking on the occasion, KSDL chairman C.S. Appaji Nadagouda said that production activities were being carried out using existing machinery, without purchasing any new equipment.\nTo facilitate this, a strict three-shift work system had been implemented. Markets in Europe and West Asia were also being explored, and efforts were under way to ensure that KSDL products reached non-resident Kannadigas as well, he said.\nKSDL managing director Prashanth said that the menace of counterfeit Mysuru Sandal Soap had been effectively curbed. While KSDL products were currently more popular in South India, greater emphasis was now being placed on market expansion in regions such as Delhi and Central India. The organisation’s turnover was expected to touch ₹2,000 crore in 2025-26.",
        "link": "https://www.thehindu.com/news/national/karnataka/mysuru-sandal-soap-to-be-relaunched-today-as-tamannaahs-tenure-as-brand-ambassador-begins/article70612346.ece",
        "date": "Mon, 09 Feb 2026 21:49:10 +0530",
        "fetched_at": "2026-02-10 04:14:20.370714"
    },
    {
        "title": "KASE to implement 25 programmes to modernise skill development sector",
        "content": "The Kerala Academy for Skills Excellence (KASE) will implement 25 programmes to modernise the skill development sector to make it suitable for the job market, Minister for General Education V. Sivankutty has said.\nAt a press conference here on Monday to explain some of the programmes, the Minister said a ‘Skill Secretariat’ would be set up to transform KASE into a single-window mechanism for skill development activities .\nA decentralised skill development mechanism on the model of People’s Plan and smart skill budgeting would be implemented for the first time in the country, the Minister said.\nA comprehensive plan had been prepared to use the resources of local government institutions for skill training as part of the 15th five-year-plan.\nThe Minister said a skill gap report that studied the labour complexities in each district would be submitted soon. Formal inauguration of the district-level policy would be held in Thiruvananthapuram.\nA policy to provide accreditation to private training institutions had been formed to ensure quality. In the first phase, 200 institutions would be given accreditation.\nThe State Council for Vocational Training had been reconstituted into the State Council for Vocational Education and Training to form a State quality cell. The best institutions would be given a State quality seal.\nThe Minister said training centres of international standards would be set up in the State. An agreement for starting a Skill India International Centre along with a migration facilitation centre in Thiruvananthapuram was ready. An ‘Institute for Metro and Rail Technology would be set up in Kochi. The Indian Institute for Foreign Languages would be completed in two months. A drone technology innovation and research park would come up at Kottarakara. Its transit campus would be inaugurated at Ezhukone. The Minister said a human resource survey would be held in all Assembly constituencies in the State.",
        "link": "https://www.thehindu.com/news/national/kerala/kase-to-implement-25-programmes-to-modernise-skill-development-sector/article70612175.ece",
        "date": "Mon, 09 Feb 2026 21:41:24 +0530",
        "fetched_at": "2026-02-10 04:14:20.967778"
    },
    {
        "title": "Retired GST official robbed of gold ring",
        "content": "Warasiguda police arrested three persons on Sunday in connection with an attention diversion theft reported from Lalitha Nagar earlier this month, in which a gold ring was stolen from a retired GST superintendent.\nThe accused were identified as Subhash Nath, 23, Karan Nath, 21, and Sohan Nath, 23, all natives of Madhya Pradesh. Police said the complainant, Venigalla Ravi, 62, a retired GST superintendent residing in Lalitha Nagar, was cheated on February 5.\nAccording to the police, the incident occurred between 12.15 p.m. and 12.30 p.m. when two of the accused approached Ravi outside his residence, reportedly asking for drinking water. They then persuaded him to hand over a gold ring with a green stone, weighing about five grams, claiming they would perform prayers.\nPolice said that after taking the ring, one of the accused allegedly swallowed it, following which the two fled the spot and joined a third accomplice waiting nearby in an autorickshaw.\nBased on the complaint, the Warasiguda police analysed CCTV footage from the surrounding area and gathered local inputs to trace the suspects. All three accused were later apprehended, and the stolen gold ring was recovered.\nPolice said the accused had migrated to Hyderabad for livelihood and were staying in makeshift huts near Jalpally Road at Pahadishareef. They allegedly targeted elderly persons by posing as individuals offering spiritual remedies and committing thefts under the pretext of prayers.\nThe arrests were made by the Warasiguda police crime team under the supervision of senior officers of the Secunderabad zone.",
        "link": "https://www.thehindu.com/news/national/telangana/retired-gst-official-robbed-of-gold-ring/article70611514.ece",
        "date": "Mon, 09 Feb 2026 21:34:42 +0530",
        "fetched_at": "2026-02-10 04:14:21.564147"
    },
    {
        "title": "Delhi CM Rekha Gupta launches new air monitoring stations, calls for year-round pollution control",
        "content": "Delhi Chief Minister Rekha Gupta on Monday said pollution control needs sustained, year-round action as she inaugurated six new Continuous Ambient Air Quality Monitoring System (CAAQMS) stations across the capital.",
        "link": "https://www.thehindu.com/videos/delhi-cm-rekha-gupta-launches-new-air-monitoring-stations-calls-for-year-round-pollution-control/article70612339.ece",
        "date": "Mon, 09 Feb 2026 23:16:35 +0530",
        "fetched_at": "2026-02-10 04:14:22.168355"
    },
    {
        "title": "State government rolls out GBA afresh to improve governance in the city: DKS",
        "content": "Deputy Chief Minister D.K. Shivakumar\n| Photo Credit: ALLEN EGENUSE J.\nDeputy Chief Minister D.K. Shivakumar on Monday said the State government has rolled out the GBA afresh to improve governance in the city and is proceeding with elections in line with court verdicts and directions.\nAddressing concerns over civic administration, Mr. Shivakumar said the government has undertaken large-scale digitisation of municipal records to plug revenue leakage. This includes scanning of documents and the introduction of the e-Khata system. He said the Cauvery software has been implemented to prevent tax leakage and that records of around 25 lakh properties have been digitised so far, with 9.5 lakh e-Khata documents already issued to property owners.\nThe Deputy Chief Minister said steps have been taken to ensure transparency and prevent corruption in the system. He added that officials have been instructed to provide access to the application free of cost, noting that several property owners were earlier unaware of details related to their own properties.\nMr. Shivakumar also claimed that the Centre had acknowledged the digitisation efforts, stating that Central government officials had appreciated the implementation, interacted with State officials and issued certificates in recognition of the work done.\nOn property regularisation, he said the process of converting B-Khata properties to A-Khata has begun, with around 7,000 applications received so far, and more expected in the coming days. A time limit of 15 days has been fixed for completing the conversion process, he added.\nRejecting the  criticism that development initiatives in Bengaluru had slowed down, the Deputy Chief Minister  said several infrastructure works are underway. He said the government is carrying out white-topping of roads across 1,600 km, has taken up street-lighting works and has prioritised traffic improvement measures.",
        "link": "https://www.thehindu.com/news/national/karnataka/state-government-rolls-out-gba-afresh-to-improve-governance-in-the-city-dks/article70611803.ece",
        "date": "Mon, 09 Feb 2026 21:20:25 +0530",
        "fetched_at": "2026-02-10 04:14:22.758728"
    },
    {
        "title": "Producer of Rajinikanth’s Kochadaiiyaan should pay fine of ₹2.52 crore or go to jail, orders Madras High Court",
        "content": "A poster of Kochadaiiyaan.\nThe Madras High Court has directed the producer of Rajinikanth-starrer Kochadaiiyaan to pay ₹2.52 crore, within four weeks, as compensation to an advertising agency that had financed the photorealistic motion capture movie in 2014, or end up serving a six-month simple imprisonment sentence in a cheque bounce case.\nJustice Sunder Mohan passed the orders while partly allowing a criminal revision case filed by J. Murali Manohar and his production house, MediaOne Global Entertainment Limited, against the conviction and sentence imposed on them by a metropolitan magistrate in 2021 and confirmed by a city civil court in 2023.\nAccording to the complainant, Abirchand Nahar, of AdBureau Advertising Private Limited, his firm had entered into a Memorandum of Understanding (MoU) with MediaOne Global Entertainment on April 25, 2014 for extending a loan of ₹20 crore for the post-production work on Kochadaiiyaan.\nThe production house had reportedly told the financier that the sale of the lease rights of the movie for a particular area would fetch nothing less than ₹20 crore, and promised to pay 20% of the sale proceeds or a minimum guaranteed profit of ₹2.40 crore to the financier before selling the rights to any third party.\nAccordingly, the ad agency transferred ₹10 crore to the bank account of MediaOne on April 28, 2014. However, in December 2014, a cheque issued by the production house got returned with the endorsement, ‘stop payment by the drawer’, and hence the complaint was filed under Section 138 of the Negotiable Instruments Act of 1881.\nOn December 4, 2021, a metropolitan magistrate in Egmore convicted the producer and sentenced him to six months of imprisonment. Further, the magistrate had directed him to pay a compensation of ₹7.70 crore to the advertising agency or undergo six more months of imprisonment.\nThe conviction as well as the sentence was confirmed by an Additional City Civil Court on August 4, 2023 and therefore, the producer had approached the High Court by way of the present revision, claiming to have repaid ₹12.75 crore. He also accused the ad agency of having used a cheque given as guarantee at a much later date.\nHowever, after finding several inconsistencies in the version of the complainant and that of the producer, the judge came to the conclusion that there were enough material to rule that the ad agency had lent only ₹10 crore, and that it had been repaid ₹8.74 crore, leaving a balance of ₹1.26 crore.\nObserving that the object of Section 138 of the NI Act was essentially to recover the money covered under a cheque, the judge confirmed the conviction imposed on the film producer, but modified the sentence to a fine of ₹2.52 crore (twice the existing liability), which the producer was ordered to pay the ad agency as compensation.\n“In default, the second petitioner/second accused (Mr. Manohar) shall undergo simple imprisonment for six months,” the judge said.\nTamil cinema",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/producer-of-rajinikanths-kochadaiiyaan-should-pay-fine-of-252-crore-or-go-to-jail-orders-madras-high-court/article70611651.ece",
        "date": "Mon, 09 Feb 2026 22:33:51 +0530",
        "fetched_at": "2026-02-10 04:14:23.353814"
    },
    {
        "title": "Bhatti appeals to voters for a massive victory for Congress in municipal polls to ‘give a fillip to development and welfare initiatives’",
        "content": "Deputy Chief Minister Mallu Bhatti Vikramarka appealed to voters to elect Congress candidates with a thumping majority in the municipal elections across the State, ‘to ensure that development programmes move forward rapidly and welfare benefits reach all sections of society.’\nAddressing the media in Madhira town on the final day of electioneering for the February 11 civic polls on Monday, Mr. Vikramarka said the Congress government is following a holistic approach to development by according top priority to education, health, power generation, irrigation and other crucial sectors to propel the State on the path of progress. The key portfolios of Municipal Administration and Education are being directly handled by Chief Minister A. Revanth Reddy with utmost priority, he added.\nThe State government sanctioned large-scale Sewage Treatment Plants (STPs) across the State to treat sewage. Urban infrastructure development works are under way in various urban local bodies to improve civic amenities, he noted.\nThe urban local bodies were grossly neglected by the BRS government, he alleged, saying the Congress government, soon after coming to power, laid special focus on developing towns and cities, providing self-employment opportunities to women and youth through skill development initiatives. The ITIs had been upgraded into Advanced Technology Centres, he added.\nHe said the State government is committed to resolving employees’ issues and is introducing a ₹1 crore accident insurance scheme for employees’ welfare.\nListing out the government flagship schemes, he added that the Congress government is at the forefront of implementing multifarious initiatives to promote women’s economic empowerment, foster entrepreneurship by involving women SHGs in solar power generation among other enterprises.\nMr. Vikramarka said a massive retaining wall is being constructed in Madhira to prevent flood water from entering into the town. Underground drainage and underground power cable works are under way in Madhira.\nHe said an ambitious project has been designed to explore the tourism potential of Wyra river by developing parks and recreational facilities.",
        "link": "https://www.thehindu.com/news/national/telangana/bhatti-appeals-to-voters-for-a-massive-victory-for-congress-in-municipal-polls-to-give-a-fillip-to-development-and-welfare-initiatives/article70612190.ece",
        "date": "Mon, 09 Feb 2026 21:16:18 +0530",
        "fetched_at": "2026-02-10 04:14:23.942658"
    },
    {
        "title": "PanIIT Hyderabad Summit 2026 on March 8",
        "content": "Pan IIT, a society representing alumni associations of the 23 IITs, will conduct the PanIIT Hyderabad Summit 2026 on March 8. With over 600 delegates, from leaders and innovators to stakeholders, the event will discuss AI-led transformation and nation building with an aim to shape high-impact dialogue on emerging technologies, policy frameworks and cross-sector collaborations.\nThe event will be held at The Westin Hyderabad Mindspace, preceded by a half-day pre-conference to be held at IIT Hyderabad, Sangareddy, on March 7.\nThe summit agenda, organisers informed, will feature in-depth deliberations across several priority sectors, including pharma and healthcare systems, defence and aerospace technologies, infrastructure and urban development, and energy and telecommunications.\nPAN-IIT Alumni India chairman Prabhat Kumar, who addressed mediapersons here, said the summit is envisioned as a national platform bringing together thought leaders from government, industry, academia and the IIT alumni community to shape AI-led solutions for the country. The focus is on responsible innovation, technology-enabled governance and sector-specific transformation aligned with India’s long-term national priorities.\nGeneral Secretary Ashok Kumar, summit convener Sudhakar Gande and co-chair Muralikrishna were present during the address.",
        "link": "https://www.thehindu.com/news/cities/Hyderabad/paniit-hyderabad-summit-2026-on-march-8/article70611832.ece",
        "date": "Mon, 09 Feb 2026 21:04:45 +0530",
        "fetched_at": "2026-02-10 04:14:24.536278"
    },
    {
        "title": "Minister criticises KU V-C over youth festival row",
        "content": "Higher Education Minister R. Bindu has strongly criticised Kerala University Vice Chancellor in-charge Mohanan Kunnummal for allegedly disallowing the conduct of the University Youth Festival.\nSpeaking to media persons here on Monday, Dr. Bindu said it was unbecoming of a Vice Chancellor to oppose the conduct of such a festival, as arts festivals play a major role in encouraging students’ creativity, leadership skills and organisational abilities. Denying students the opportunity to participate would set a wrong precedent, she cautioned. She added that students should not be denied a chance to compete due to unnecessary disputes.\nReferring to the complaint submitted against Syndicate members and Students Federation of India (SFI) activists for allegedly vandalising the Vice Chancellor’s chamber, the Minister accused Prof. Kunnummal of adopting an antagonistic and rigid approach towards the academic community and students. While a healthy coordination between the Vice Chancellor and the Syndicate was essential for the smooth functioning of the university, such cooperation was unfortunately lacking, she said.\nThe SFI also conducted a day-and-night agitation over the purported denial of allocated funds for the purpose.",
        "link": "https://www.thehindu.com/news/national/kerala/minister-criticises-ku-v-c-over-youth-festival-row/article70611785.ece",
        "date": "Mon, 09 Feb 2026 21:00:17 +0530",
        "fetched_at": "2026-02-10 04:14:26.552407"
    },
    {
        "title": "Logistics Policy 2.0, Master Plan to drive TG plans to be inland hub on cards",
        "content": "Telangana is readying an integrated Logistics Master Plan that will take stock as well as chart the roadmap and a Logistics Policy 2.0 to guide long-term multimodal planning.\nTogether, they will give wings to the State’s aspirations to emerge as a leading inland cargo and logistics hub. At the heart of the Logistics Policy will be a six-pillar approach — infrastructure and multimodal integration; digital and smart logistics; regulatory simplification; sustainability and green logistics; skill development, including encouraging women in logistics; and investment promotion and innovation. The focus will be on lowering logistics costs and building a resilient and inclusive supply-chain ecosystem, people in the know of the policy initiative the State government is putting together said.\nOn the Logistics Master Plan, the sources said Telangana aims to become India’s top logistics destinations by 2047 on the back of high-value manufacturing, MSME competitiveness, agri-value chains and nextgeneration e-commerce. The plan will map current and projected freight flows, industrial clusters, consumption centres and export corridors besides enabling demand-driven and future-ready infrastructure creation.\nA comprehensive framework based on the mapping outcome will guide a phased development of logistics parks, warehousing zones, and air-cargo facilities, integrated with road, rail, and air networks. Leveraging the strong tech ecosystem of Hyderabad, the government will lay emphasis on automation and adoption of green logistics practices. Logistics will be key to achieving the State’s aspirations to become a $3 trillion economy and form an integral part of Chief Minister A. Revanth Reddy’s Telangana Rising 2047 vision.\nOnly land-locked State in southern India, Telangana wants to turn its central location into a strategic advantage by shaping into an inland logistics and distribution hub. It has already announced intent to develop a dry port near the Regional Ring Road and a 297 km greenfield expressway and rail link connecting the facility to Bandar Port in Machilipatnam, Andhra Pradesh.\nThe Peri-Urban Region Economy (PURE) region, between existing Outer Ring Road and the upcoming RRR is earmarked for growth corridors in manufacturing, MSME clusters and logistics connecting rural and urban economies. Besides the dry port, the State government is keen on building on existing infrastructure like the logistics parks in Mangalapally and Batasingaram on the outskirts of Hyderabad. The government plans to develop 10–12 more logistics parks, along with dry ports and bonded warehousing zones. The upcoming Mega Multimodal Logistics Park at Manoharabad will integrate road and rail freight services.\nThe State government wants to integrate air cargo with road and rail networks, along with the redevelopment of Warangal Airport and expansion of regional air connectivity.\nThe Rajiv Gandhi International Airport (RGIA) Hyderabad is already India’s leading air-cargo hubs for pharmaceuticals, Life Sciences, perishables, electronics and other high-value goods.",
        "link": "https://www.thehindu.com/news/national/telangana/logistics-policy-20-master-plan-to-drive-tg-plans-to-be-inland-hub-on-cards/article70612031.ece",
        "date": "Mon, 09 Feb 2026 20:59:14 +0530",
        "fetched_at": "2026-02-10 04:14:27.164338"
    },
    {
        "title": "Will urge Centre to increase reservation as per population: Chief Minister",
        "content": "Chief Minister Siddaramaiah.\n| Photo Credit: FILE PHOTO\nReiterating that the State government is in favour of social justice, Chief Minister Siddaramaiah said that the government will urge the Union government to increase the percentage of reservation for Scheduled Castes and Tribes based on their population.\nHe was addressing a large gathering after inaugurating the ‘Sri Maharshi Valmiki Jatre-2026’ at Sri Maharshi Valmiki Valmiki Guru Peetha in Rajanahalli near Harihar on Monday.\nThe Chief Minister emphasised the need for the oppressed communities, including the Valmiki community, to remember their respective histories. “It is important to know history, as without knowing history, building the future is not possible. Only through education, organisation, and agitation can the oppressed protect their rights. And only through education, the communities can stay away from superstitions and blind faith,” he said.\nMr. Siddaramaiah said that it was education that helped Maharshi Valmiki to author Ramayana. “Vyasa Muni who wrote Mahabharata belonged to the fishing community. The system of four varnas deprived the oppressed of education. It was after Constitution came into existence that equal opportunities were provided. Education helps the oppressed to come to the mainstream, so the government has given importance to education which will empower the oppressed economically, socially and educationally,” he said.\nThe Chief Minister said that the caste system, created by vested interests, had led to inequalities in society. Only through economic and social empowerment can inequalities be removed, he said.\nBasavanna had tried vehemently to alleviate the caste system. However, because of vested interests, the caste system had continued and superstitions had spread.\nMr. Siddaramaiah said that the scheme of providing welfare grants to SC/STs based on their population was first introduced by the State government in 2013 and none of the BJP-ruled states had such a law, which had been upheld by the Supreme Court.\nThe Chief Minister then listed out the various welfare schemes and measures taken by the State government for the benefit of the oppressed communities. He also promised to fulfilled the demands the communities in a phased manner.\nThe event was attended by Prasannanand Puri Swami, Vachananand Swami, Ministers Satish Jarkiholi, H.C. Mahadevappa, legislators Yathindra Siddaramaiah, N.Y. Gopalkrishna, Raghu Murthy, and others.",
        "link": "https://www.thehindu.com/news/national/karnataka/centre-to-be-urged-to-increase-reservation-as-per-population-chief-minister/article70612014.ece",
        "date": "Tue, 10 Feb 2026 00:49:44 +0530",
        "fetched_at": "2026-02-10 04:14:27.755662"
    },
    {
        "title": "Amaravati expansion, irrigation projects likely to dominate A.P. Budget session starting Feb. 11",
        "content": "Andhra Pradesh Legislative Assembly building at Amaravati\n| Photo Credit: File photo\nThe Andhra Pradesh Legislature’s Budget session will commence at 10 a.m. on February 11 with Governor S. Abdul Nazeer addressing the joint session of the Legislative Assembly and the Legislative Council at the Assembly Hall in Velagapudi, Amaravati. Following the Governor’s address, both Houses will take up a discussion on the motion of thanks.\nFinance Minister Payyavula Keshav is scheduled to present the second full Budget of the NDA government during the session. The government will also place before the House several recent policy decisions for discussion.\nAccording to leaders of the ruling Telugu Desam Party, the session will witness deliberations on the progress of key irrigation projects, including Polavaram and Velogonda. They said allegations of corruption in the Rayalaseema Lift Irrigation project would be raised through a short-duration discussion.\nThe TDP has finalised around 20 agenda points for short discussions in the House. These include the implementation of the party’s election promise Super Six, the ongoing controversy over alleged adulterated ghee supplied to the Tirumala Tirupati Devasthanams, land-related allegations, the status of land reforms, assigned lands and issues concerning Pattadar Passbooks.\nGovernment sources said the progress of Amaravati as the capital city, the proposed expansion of its jurisdiction under Land Pooling Scheme 2.0, and developments in the industrial sector would also come up for discussion. Outcomes of Chief Minister Nara Chandrababu Naidu’s recent visit to the World Economic Forum in Davos are expected to be highlighted.\nMeanwhile, NDA leaders indicated that they would seek to hold the YSR Congress Party accountable for the attendance of its members during the session.\nIn a statement issued on Monday, Legislative Assembly Speaker Chintakayala Ayyannapatrudu announced that students from schools, colleges and other educational institutions across the State would be allowed to watch the Assembly proceedings live from the visitors’ gallery. He said the initiative was aimed at creating awareness about the functioning of the Legislature while reinforcing accountability and transparency in governance.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/amaravati-expansion-irrigation-projects-likely-to-dominate-ap-budget-session-starting-feb-11/article70611505.ece",
        "date": "Mon, 09 Feb 2026 20:55:51 +0530",
        "fetched_at": "2026-02-10 04:14:28.350608"
    },
    {
        "title": "Railway officers asked to enforce smoking ban in trains to prevent fire mishaps",
        "content": "South Central Railway (SCR) general manager Sanjay Kumar Srivastava has directed officers to take measures to prevent smoking and consumption of liquor in moving trains and within the railway premises.\nIn a review meeting held online on safety with Divisional Railway Managers (DRMs) of Vijayawada, Guntur, Guntakal and other divisions on Monday, the GM asked the officers to conduct safety drives and inspections regularly.\nMr. Srivastava reviewed the fire safety precautions and maintenance of equipment to check fire accidents. He also took stock of the CCTV cameras installed at railway stations, goods sheds and non-interlocked level crossings (railway gates).\nThe GM instructed the Railway Protection Force (RPF) and on-duty staff to be vigilant to ensure passenger safety.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/railway-officers-asked-to-enforce-smoking-ban-in-trains-to-prevent-fire-mishaps/article70611663.ece",
        "date": "Mon, 09 Feb 2026 20:55:11 +0530",
        "fetched_at": "2026-02-10 04:14:28.945147"
    },
    {
        "title": "Tamil Nadu Minister launches free meal scheme for Cuddalore Corporation sanitation workers",
        "content": "Tamil Nadu Minister for Agriculture and Farmers Welfare M.R.K. Panneerselvam serving food to sanitation workers of Cuddalore Corporation on Monday.\n| Photo Credit: SPECIAL ARRANGEMENT\nMinister for Agriculture and Farmers’ Welfare M.R.K. Panneerselvam on Monday launched the free meal scheme for sanitation workers of Cuddalore Corporation.\nFollowing the launch of the initiative earlier in Tiruvallur district by Chief Minister M.K. Stalin, the programme — aimed at ensuring nutritious food for sanitation workers across the State — was rolled out in Cuddalore district. Food distribution commenced in the Corporation, covering 623 persons, including sanitation workers, drivers, and mosquito control workers.\nMr. Panneerselvam said the scheme would be extended to sanitation workers in town panchayats and panchayats. Collector Sibi Adhithya Senthil Kumar was present.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/minister-launches-free-meal-scheme-for-cuddalore-corporation-sanitation-workers/article70610811.ece",
        "date": "Mon, 09 Feb 2026 20:57:40 +0530",
        "fetched_at": "2026-02-10 04:14:30.364459"
    },
    {
        "title": "Govt. to look into demand for Tribal University: CM",
        "content": "Chief Minister Siddaramaiah on Monday said that the government would look into the demand for establishing a tribal university in the State.\nSpeaking to presspersons at Rajanahalli Sri Maharshmi Valmiki Guru Peetha, near Harihar, on Monday, the Chief Minister said that after verification an appropriate decision would be taken.\nThe Chief Minister’s reply has rekindled the hope of establishment of separate university for studying tribal culture.\nIn fact in 2017, the Department of Kannada and Culture had proposed the tribal university in order to encourage further studies and research on tribal communities and subsequently the State government had asked the Department of Higher Education to initiate the process.\nHowever in December 2022, the Karnataka State Higher Education Council (KSHEC) under Department of Higher Education, rejected the proposal at its general body meeting.\nThe meeting had favoured offering courses or subjects related to tribal studies at the existing Janapada (Folklore) University and other State-run universities.",
        "link": "https://www.thehindu.com/news/national/karnataka/govt-to-look-into-demand-for-tribal-university-cm/article70611795.ece",
        "date": "Mon, 09 Feb 2026 20:45:38 +0530",
        "fetched_at": "2026-02-10 04:14:30.958451"
    },
    {
        "title": "Outreach programme launched to boost public bus ridership",
        "content": "In a bid to strengthen public transport operations and improve bus ridership across India, a national communications and outreach programme titled Reaching Your Riders (RYR) has been launched. The initiative is being led by GIZ with the support of the Ministry of Housing and Urban Affairs (MoHUA), in collaboration with ITDP India.\nDesigned as a six-month intervention, the initiative aims to improve how public bus systems communicate and engage with passengers in day-to-day operations. “With ridership gradually recovering in the post-COVID period and bus fleets expanding in several cities, the programme is a timely opportunity to enhance public confidence and increase usage of public transport,” said a release.\nDespite the addition of thousands of buses annually, gaps in information dissemination continue to act as barriers for passengers. Manjunath Sekhar, director, Sustainable Urban Mobility, GIZ India, said today’s riders expect real-time information at their fingertips, and knowing when the next bus will arrive has become almost mandatory for new-generation users.\nThe release further highlighted that bus travel in many Indian cities is often perceived as uncertain and stressful due to poor communication. By improving how agencies interact with riders, the initiative seeks to transform bus services into reliable, trustworthy systems where passengers feel seen, informed and heard.\nThe programme will be implemented in three phases. The first phase includes a kick-off and assessment of existing communication mechanisms within selected State Transport Undertakings (STUs). The second phase will involve an international exposure visit to study best practices, followed by an application process for pilot implementation. In the third and final phase, four STUs or Special Purpose Vehicles (SPVs) with the highest potential for improvement will receive technical support to implement pilot projects.",
        "link": "https://www.thehindu.com/news/cities/Hyderabad/outreach-programme-launched-to-boost-public-bus-ridership/article70611270.ece",
        "date": "Mon, 09 Feb 2026 20:44:55 +0530",
        "fetched_at": "2026-02-10 04:14:31.546585"
    },
    {
        "title": "21-Year-Old Maharashtra Woman Administered Injections By Ward Boy Posing As Doctor, Dies",
        "content": "In a shocking incident from Navi Mumbai, police have arrested a ward boy who allegedly posed as a doctor and administered injections to a 21-year-old woman, resulting in her death, an official from the Vashi police station said on Monday.\nThe incident occurred on February 5 in Sector 11 of Vashi. The victim was identified as Prachiti Bhikuram Bhuvad.\nA police official told news agency PTI that the accused, Sandesh Yashwant Pashte, was contacted by the woman’s family after she complained of irregular menstrual cycles.\nAccording to the police, Pashte introduced himself as a doctor and examined the young woman at her residence.\nAs the woman narrated her health issues, the ward boy allegedly informed her that she was suffering from Polycystic Ovary Disorder (PCOD).\nThe ward boy then proposed a treatment plan involving a course of five injections, for which he charged the family Rs 15,000, assuring them that he would personally administer the medication.\nOn February 5, Pashte visited the woman’s home and gave her two injections, the police said.\nShortly after receiving the shots, her condition reportedly worsened rapidly, and she fell unconscious.\nThe Vashi police station official said that the accused appeared panicked following the woman’s collapse, and allegedly asked the woman’s father to dispose of a bag containing used syringes and other medical waste in the trash.\nFamily members then rushed the woman to a nearby hospital, where doctors declared her dead nearly two hours later.\nThe police further said that when confronted by the woman’s relatives, Pashte admitted that he was not a doctor.\nAccording to the official, he confessed to being a ward boy employed at a private nursing home in Andheri in Mumbai and acknowledged that he did not possess any recognised medical qualification or medical certificate.\nFollowing a complaint filed by the family, the police registered a case against Pashte and arrested him on February 6.\nThe accused was booked under the Bharatiya Nyaya Sanhita on charges including culpable homicide not amounting to murder, cheating by personation and other offences.\nPolice said an investigation was underway to determine the exact nature of the injections administered to the woman and to establish further circumstances surrounding her death.\nOfficers were also examining whether the accused had treated other people in a similar manner.\nLatest Blogs",
        "link": "https://www.news18.com/india/navi-mumbai-vashi-ward-boy-poses-as-doctor-administers-injections-to-woman-patient-dies-navi-mumbai-hospital-ward-boy-arrested-ws-l-9891401.html",
        "date": "Tue, 10 Feb 2026 09:28:24 +0530",
        "fetched_at": "2026-02-10 04:14:34.971896"
    },
    {
        "title": "'Not Satisfied With Response': Maithili Thakur Questions Minister Over Condition Of Bihar Hospitals",
        "content": "BJP MLA Maithili Thakur took on her own party’s Health Minister, Mangal Pandey, in the Bihar assembly over the condition of a government hospital in her Alinagar constituency, saying official records did not reflect what she had personally seen on the ground and urging immediate corrective action.\nDuring Question Hour, Thakur rejected the minister’s written reply that suggested the hospital building was not in a severely bad state and only required repairs.\nIn her intervention, she told the House, “I am not completely satisfied with the minister’s response, because it states that the building is not in a bad condition, it just needs to be repaired.\"\n“But I myself have gone and seen that the building is in a bad condition,\" she said.\nShe went on to describe how limited infrastructure and manpower were affecting patient care, saying, “There is a health care system running in a small room there. There is no MBBS doctor, there were two MBBS doctors there in the past, but not now.\"\nReferring to the reply’s mention of another category of doctor, she added, “It is written in the answer that there is another specialist, to which I agree, but we need two MBBS doctors there.\"\nFraming her remarks, the legislator said, “I am not ordering the minister, I am just making a request to him.\"\nShe underlined Pandey’s long association with the health department, noting, “Because I was very young, and since then I have been seeing the health minister as a minister. I have been seeing him working in the health department. So I want him to do it for the benefit of the public, because it is very important.\"\nStressing the scale of dependence on the facility, Thakur told the House, “Five to seven panchayats depend on this hospital. It is clearly believed that 40,000 to 50,000 people benefit from this hospital.\"\nShe also highlighted its strategic location within her constituency, saying, “And this hospital is in the centre of my entire committee, with which the two branches, Ghanshyampur and Alinagar, both can benefit from it.\"\nConcluding her intervention, she urged focused attention on the matter.\n“So I would like to request him to pay special attention to this. Thank you.\"\nThe episode drew attention because it came from a ruling-party legislator of the Bharatiya Janata Party publicly pressing a senior minister from her own side.\nIn his response placed before the House, Pandey had maintained that the government was addressing infrastructure concerns, pointing to approvals for new hospital buildings in several areas, ongoing construction at some sites, and a phased plan to repair or renovate facilities identified as extremely dilapidated.\nLatest Blogs",
        "link": "https://www.news18.com/india/maithili-thakur-questions-bihar-mangal-pandey-over-condition-of-hospitals-need-more-doctors-ws-l-9891333.html",
        "date": "Tue, 10 Feb 2026 08:41:07 +0530",
        "fetched_at": "2026-02-10 04:14:35.560788"
    },
    {
        "title": "'No Copies Published': Penguin India On Row Over Circulation Of Ex-Army Chief's Pre-Print Book",
        "content": "Penguin Random House India has issued a formal clarification on social media platform X, stating that it holds the sole publishing rights for ‘Four Stars of Destiny’, the memoir of former Army chief Manoj Mukund Naravane, and emphasising that the book has not yet been published in any format.\nIn its post, the publisher said it was responding to “recent public discourse and media reporting\" around the alleged circulation of a pre-print version of the manuscript.\n“We wish to make it clear that the book has not gone into publication. No copies of the book, in print or digital form, have been published, distributed, sold, or otherwise made available to the public by Penguin Random House India,\" the company said.\nThe publisher added that it “shall be exercising remedies available in law against the illegal and unauthorised dissemination of the book,\" concluding that the note was being issued “to place the publisher’s position on record.\"\nStatement from the publisher. pic.twitter.com/pksacg3EeT— Penguin India (@PenguinIndia) February 9, 2026\nThe post comes amid a police investigation into claims that an unpublished version of the memoir is being shared online.\nA political fallout was also trigerred and a row erupted after Congress leader Rahul Gandhi attempted to quote from what he described as the pre-print book during his speech in the Lok Sabha on the motion of thanks to the President’s Address, drawing strong objections from treasury benches and repeated adjournments before the motion was eventually adopted by voice vote.\nGandhi was later seen flashing a purported copy of the book in the Parliament complex, and the issue led to major disruptions in the House, culminating in the suspension of eight MPs for the remainder of the Budget session.\nThe Delhi Police said it had taken cognisance of information circulating on social media platforms and news forums alleging that a pre-print copy of ‘Four Stars of Destiny’ was available without mandatory clearance from relevant authorities.\nAn official told news agency ANI that on verification, police found that “a PDF copy of a typeset book with the same title, apparently prepared by M/S Penguin Random House India Pvt. Limited, is available on certain websites,\" and that some online marketing platforms had displayed the finished book cover “as if it is available for purchase.\"\nThe Special Cell subsequently registered a case to investigate what was described as a “purported leak/breach of a yet to be approved publication.\"\n“The Delhi Police has taken cognisance of information circulating on social media platforms and online news forums claiming that a pre-print copy of a book titled ‘Four Stars of Destiny’ is being circulated without mandatory clearance from competent authorities,\" the police statement said.\nPolice reiterated that the required clearance for publication was still awaited and that the probe would examine how the material surfaced in the public domain.\nLatest Blogs",
        "link": "https://www.news18.com/india/four-stars-of-destiny-naravane-unpublished-book-penguin-random-house-india-clarification-sole-publishing-rights-rahul-gandhi-parliament-row-ws-l-9891217.html",
        "date": "Tue, 10 Feb 2026 07:01:09 +0530",
        "fetched_at": "2026-02-10 04:14:36.152648"
    },
    {
        "title": "‘Book Not Published’: MM Naravane's Memoir Publisher Reacts After Delhi Police's FIR",
        "content": "Penguin Random House India on Monday issued a statement clarifying that the memoir of former Indian Army Chief General Manoj Mukund Naravane, ‘Four Stars of Destiny‘, has not been published, following a Delhi Police FIR over the alleged circulation of the book online.\nThe publisher said it holds the sole publishing rights for the memoir and stressed that no copies—printed, digital, or otherwise—have been released to the public.\n“We wish to make it clear that the book has not gone into publication. No copies of the book – in print or digital form – have been published, distributed, sold, or otherwise made available to the public by Penguin Random House India,\" the statement said.\nStatement from the publisher. pic.twitter.com/pksacg3EeT— Penguin India (@PenguinIndia) February 9, 2026\nThe publisher also said it would pursue all legal remedies available against unauthorised dissemination. “Penguin Random House India shall be exercising remedies available in law against the illegal and unauthorised dissemination of the book. This statement is being issued to place the publisher’s position on record,\" it added.\nThe FIR comes after reports emerged that a pre-publication version of ‘Four Stars of Destiny‘ was circulating online without the mandatory clearances. Delhi Police said they acted after information surfaced on social media and news forums suggesting the book was being shared before official approval.\nDuring verification, investigators found a PDF version of a typeset book with the same title available on certain websites. Some online platforms were also displaying the finished book cover as if it were available for purchase.\nThe memoir, written by General Naravane, who served as the 28th Chief of Army Staff from 31 December 2019 to 30 April 2022, is expected to cover his nearly four-decade-long career, from Second Lieutenant to Army Chief.\nIt reportedly offers insights into key moments, including India’s most serious military standoff with China since 1962.\nLatest Blogs",
        "link": "https://www.news18.com/india/book-not-published-mm-naravanes-memoir-publisher-reacts-after-delhi-polices-fir-ws-l-9891099.html",
        "date": "Mon, 9 Feb 2026 23:22:19 +0530",
        "fetched_at": "2026-02-10 04:14:37.041026"
    },
    {
        "title": "Heatwave Grips Kerala, Disaster Authority Issues Safety Advisory",
        "content": "The Kerala State Disaster Management Authority (KSDMA) has issued a public advisory warning residents of rising temperatures across Kerala and urging people to take precautions to avoid heat-related illnesses.\nAccording to the advisory, several parts of the state are experiencing above-normal temperatures, with conditions expected to worsen during peak daytime hours. The authority cautioned that prolonged exposure to heat could lead to dehydration, heat exhaustion and heatstroke, particularly among vulnerable groups such as children, the elderly, outdoor workers and those with pre-existing health conditions.\nThe KSDMA advised people to avoid direct sunlight between late morning and afternoon, drink plenty of water even if not feeling thirsty, and wear light, loose cotton clothing. Residents have also been asked to limit strenuous physical activity during the hottest parts of the day and ensure proper ventilation indoors.\nSpecial instructions were issued for schools, construction workers and those employed in agriculture and other outdoor occupations. Employers were urged to adjust work timings, provide shaded rest areas and ensure access to drinking water.\nThe disaster management authority also warned against leaving children or pets inside parked vehicles and advised the public to check on elderly neighbours and those living alone. In case of symptoms such as dizziness, nausea, headaches or confusion, people were asked to seek medical help immediately.\nOfficials said the situation is being closely monitored and further advisories may be issued depending on how weather conditions evolve in the coming days.\nLatest Blogs",
        "link": "https://www.news18.com/india/heatwave-grips-kerala-disaster-authority-issues-safety-advisory-ws-el-9890969.html",
        "date": "Mon, 9 Feb 2026 21:47:45 +0530",
        "fetched_at": "2026-02-10 04:14:37.902614"
    },
    {
        "title": "“Unprecedented Ghee Adulteration”: Dairy Adulterated Nearly 7 Million Kg, Says Author Ranganathan",
        "content": "| \"This dairy had adulterated close to 7 million kilograms of ghee, this is unprecedented\": @ARanganathan72 n18oc_indian18oc_politicsNews18 Mobile App - https://onelink.to/desc-youtube\nLatest Blogs",
        "link": "https://www.news18.com/videos/india/unprecedented-ghee-adulteration-dairy-adulterated-nearly-7-million-kg-says-author-ranganathan-9890776.html",
        "date": "Mon, 9 Feb 2026 19:36:15 +0530",
        "fetched_at": "2026-02-10 04:14:38.482813"
    },
    {
        "title": "Delhi Police File FIR Over Circulation Of Ex-Army Chief’s Unpublished Book Amid Parliament Row",
        "content": "Delhi Police on Monday registered a case over the alleged leak of a pre-publication copy of Four Stars of Destiny, the memoir of former Army Chief General Manoj Naravane, after reports surfaced that the book was circulating online without mandatory clearances.\nAccording to the police, they took cognisance of information found on social media platforms and news forums claiming that a pre-print version of the book was in circulation, even though official approval for its publication had not yet been granted by the competent authorities.\nDuring verification, investigators found that a PDF version of a typeset book bearing the same title, apparently prepared by publisher Penguin Random House India Pvt. Ltd., was available on certain websites.\nIn addition, some online marketing platforms were found displaying the finished book cover as if the title were available for purchase.\nIn view of the suspected breach and unauthorised circulation of an unpublished work, Delhi Police said a case has been registered with the Special Cell and a detailed investigation is underway to ascertain the source of the leak and the extent of the violation.\nFour Stars of Destiny is a memoir chronicling nearly four decades of General Naravane’s service in the Indian Army, tracing his journey from a Second Lieutenant to Chief of the Army Staff.\nThe book reportedly offers insights into key moments of his career, including India’s most serious military standoff with China since the 1962 conflict.\nPenguin Random House India is the publisher of the memoir.\nThe controversy surrounding the book gained attention during the post-Budget session of Parliament.\nAs Prime Minister Narendra Modi was set to move the Motion of Thanks on the Union Budget, Lok Sabha proceedings were disrupted after Congress leader Rahul Gandhi read out portions of a magazine article said to be based on General Naravane’s unpublished memoir.\nThough Gandhi spoke for only a few minutes, his remarks drew sharp reactions from the BJP leadership.\nUnion Home Minister Amit Shah and Defence Minister Rajnath Singh accused the Leader of the Opposition of citing material from an unpublished book.\nSingh questioned the propriety of referring to content that had not formally entered the public domain.\nWithin days, Gandhi returned to Parliament holding a copy of Four Stars of Destiny, saying he intended to “gift it to the Prime Minister\", further fuelling the political controversy.\nLatest Blogs",
        "link": "https://www.news18.com/india/delhi-police-file-case-over-alleged-leak-of-former-army-chief-naravanes-four-stars-of-destiny-9890754.html",
        "date": "Mon, 9 Feb 2026 20:04:32 +0530",
        "fetched_at": "2026-02-10 04:14:39.070162"
    },
    {
        "title": "‘More Will Get It’: DK Shivakumar Defends Cabinet Rank For Party Workers, BJP Objects",
        "content": "Karnataka Deputy Chief Minister DK Shivakumar on Monday defended the decision to give cabinet rank to party workers, saying it was a matter of status and recognition for those who helped bring the party to power.\nResponding to criticism, Shivakumar questioned what the BJP had done during its time in power and dismissed the objections raised by the opposition.\n“They have got us to power, they will get power. It’s about status. More will get it,\" he said.\nReacting to the move, BJP leader and Chief Whip in the Legislative Council, N Ravikumar criticised the government, saying that the Congress had 139 MLAs but cabinet rank had been given to 150 individuals.\n“Some of them are MLAs, some are not. Whoever complained that they did not get cabinet ranks, to appease them, the state government has given them the status. Whose money are they spending on it? It’s the people’s tax money. How can they do this?\" Ravikumar said.\nHe demanded that the Chief Minister release a list of all those given cabinet rank and disclose how much money was being spent on them.\n“There is no development in the state. Bengaluru has turned into a pothole city. Funds are not being given to MLAs for development, but they are spending people’s tax money to appease some individuals,\" he added.\nAccording to details, the Siddaramaiah government has handed out cabinet and minister of state ranks to a total of 149 individuals so far.\nThis includes 32 full-fledged ministers who are constitutionally appointed cabinet ministers, 43 MLAs granted cabinet rank as chairpersons of various corporations and boards, and 11 MLAs given minister of state status as heads of smaller corporations.\nAmong non-MLAs, cabinet rank has been granted to nine advisers and special representatives, while minister of state rank has been given to 54 Congress leaders and workers.\nRecently, 54 more people serving as heads of boards and corporations were given minister of state status, raising serious questions over the burden on the exchequer.\nThose granted cabinet or minister of state rank are entitled to a monthly salary of Rs 50,000, a hospitality allowance of Rs 3,000, daily travel allowance of Rs 2,000 within the state and Rs 2,500 outside the state, and a fuel allowance of 1,000 litres of petrol or diesel per month.\nThey are also provided house rent allowance of Rs 80,000 per month, house maintenance and staff allowance of Rs 20,000 per month, medical expense reimbursement, and staff facilities including a personal secretary, personal assistants, drivers and an attender.\nAt government programmes, they are given seating arrangements and protocol equivalent to those of state ministers.\nLatest Blogs",
        "link": "https://www.news18.com/india/more-will-get-it-dk-shivakumar-defends-cabinet-rank-for-party-workers-bjp-objects-ws-l-9890604.html",
        "date": "Mon, 9 Feb 2026 19:03:50 +0530",
        "fetched_at": "2026-02-10 04:14:39.659001"
    },
    {
        "title": "Home Minister Amit Shah To Inaugurate CBI's New Cybercrime Branch Tomorrow",
        "content": "Union Home Minister and Minister of Cooperation Amit Shah is set to deliver the keynote address at the National Conference on “Tackling Cyber-Enabled Frauds & Dismantling the Ecosystem\" on Tuesday in New Delhi.\nAccording to a PIB press release, at the event, Shah will also preside over an Investiture Ceremony of CBI officers, inaugurate the new Cybercrime Branch of the Central Bureau of Investigation (CBI), and launch the S4C Dashboard under the Indian Cyber Crime Coordination Centre (I4C), Ministry of Home Affairs.\nThe two-day conference, organised by the CBI in collaboration with I4C, Ministry of Home Affairs, will run from February 10 and 11 at Bharat Mandapam in the national capital.\n“The conference is being convened at a time when, under the leadership of Prime Minister Shri Narendra Modi, India’s rapid digital transformation has significantly improved access to banking, governance, and communication, while simultaneously creating new vulnerabilities that are being exploited by organized cybercriminal networks,\" the release noted.\nThe CBI has been investigating cybercrime since 2000 and enhanced its capabilities by setting up the Cybercrime Investigation Division in 2022. The agency serves as the nodal body for cybercrime cases affecting the Central Government and its offices, handling both cyber-dependent crimes and cyber-enabled frauds.\nThe conference aims to build a shared understanding of the scale, trends, and evolving nature of cyber-enabled fraud in India. It will examine three critical pillars of the cyber-fraud ecosystem: the financial pillar (mule accounts and money laundering), the telecom pillar (misuse of SIM/eSIM and digital infrastructure), and the human pillar (cyber slavery and trafficking into scam compounds).\nKey objectives include strengthening inter-agency and public–private collaboration among law enforcement, banks, telecom providers, regulators, and technology platforms; exploring the use of artificial intelligence and data analytics to scale investigations; and improving mechanisms for faster fraud reporting, real-time fund tracing, timely evidence preservation, and better victim protection.\nSenior officials and experts from Central and State law enforcement agencies, the Department of Telecommunications, Reserve Bank of India, public and private banks, FinTech firms, telecom and social media companies, cybersecurity experts, and international representatives are expected to participate.\nLatest Blogs",
        "link": "https://www.news18.com/india/home-minister-amit-shah-to-inaugurate-cbis-new-cybercrime-branch-tomorrow-ws-l-9890635.html",
        "date": "Mon, 9 Feb 2026 18:57:42 +0530",
        "fetched_at": "2026-02-10 04:14:40.247583"
    },
    {
        "title": "Pregnant Cat Allegedly Kidnapped, Sold To Breeders In Bengaluru: 9 Booked",
        "content": "A case has been registered by Bengaluru police after a pregnant cat was reported missing from a residential neighbourhood, prompting concern among residents and animal welfare supporters. Authorities are investigating the circumstances surrounding the animal’s disappearance and have booked several people in connection with the incident.\nThe development has drawn attention locally, as pet owners and neighbours seek clarity on what happened to the cat and its expected litter.\nThe matter came to light when a woman residing in the area filed a complaint with local police, stating that her cat, which was due to give birth shortly, had vanished from outside her home. The animal had been well-known in the neighbourhood, and its unexpected disappearance alarmed residents, who feared for its safety given its condition.\nUpon receiving the complaint, police initiated an inquiry and began gathering information from people living nearby.\nDuring the early stages of the investigation, the police examined eyewitness accounts and available surveillance footage to identify individuals who might be linked to the cat’s disappearance. Based on this evidence, authorities identified nine persons allegedly involved in taking the animal.\nA first information report was filed, and the accused were booked under relevant sections of the law. Police said the group was detained and taken into custody for questioning as part of the ongoing investigation.\nThe identities and ages of the nine individuals have not been publicly disclosed, as investigators continue to piece together details of the case.\nNews of the pregnant cat’s disappearance and the subsequent police action drew reactions from residents, particularly pet owners and animal lovers in the vicinity. Many described the situation as distressing, noting the vulnerability of the animal given its advanced pregnancy.\nSeveral neighbours expressed hope that the cat would be located unharmed and returned to its home. Some criticised the alleged act as needless and cruel, saying that the community had formed a bond with the animal over time.\nAnimal welfare groups in the city have also taken note of the case, offering to assist with efforts to find the cat and ensure it receives any veterinary care it may need. Police confirmed that they are coordinating with such organisations as part of their efforts.\nAuthorities have appealed to anyone with additional information related to the incident to come forward and assist with the investigation. Additional statements are being recorded, and police are collecting further evidence to establish the facts and determine the motive behind the alleged act.\nOfficials said the investigation is ongoing and that appropriate action will be taken based on the findings. As of the time this article is published, the police haven’t found the cat and are continuing questioning related individuals.\nThe matter came to light when a woman residing in the area filed a complaint with local police, stating that her cat, which was due to give birth shortly, had vanished from outside her home. The animal had been well-known in the neighbourhood, and its unexpected disappearance alarmed residents, who feared for its safety given its condition.\nUpon receiving the complaint, police initiated an inquiry and began gathering information from people living nearby.\nDuring the early stages of the investigation, the police examined eyewitness accounts and available surveillance footage to identify individuals who might be linked to the cat’s disappearance. Based on this evidence, authorities identified nine persons allegedly involved in taking the animal.\nA first information report was filed, and the accused were booked under relevant sections of the law. Police said the group was detained and taken into custody for questioning as part of the ongoing investigation.\nThe identities and ages of the nine individuals have not been publicly disclosed, as investigators continue to piece together details of the case.\nNews of the pregnant cat’s disappearance and the subsequent police action drew reactions from residents, particularly pet owners and animal lovers in the vicinity. Many described the situation as distressing, noting the vulnerability of the animal given its advanced pregnancy.\nSeveral neighbours expressed hope that the cat would be located unharmed and returned to its home. Some criticised the alleged act as needless and cruel, saying that the community had formed a bond with the animal over time.\nAnimal welfare groups in the city have also taken note of the case, offering to assist with efforts to find the cat and ensure it receives any veterinary care it may need. Police confirmed that they are coordinating with such organisations as part of their efforts.\nAuthorities have appealed to anyone with additional information related to the incident to come forward and assist with the investigation. Additional statements are being recorded, and police are collecting further evidence to establish the facts and determine the motive behind the alleged act.\nOfficials said the investigation is ongoing and that appropriate action will be taken based on the findings. As of the time this article is published, the police haven’t found the cat and are continuing questioning related individuals.\nScan the QR code to download the News18 app and enjoy a seamless news experience anytime, anywhere.\nLatest Blogs",
        "link": "https://www.news18.com/cities/bengaluru-news/pregnant-cat-allegedly-kidnapped-sold-to-breeders-in-bengaluru-nine-booked-skn-ws-l-9890328.html",
        "date": "Mon, 9 Feb 2026 16:55:33 +0530",
        "fetched_at": "2026-02-10 04:14:40.872873"
    },
    {
        "title": "'If This Is The Quality Of Banking...': SC Raps Banks Over Handling Of 'Digital Arrest' Fraud Cases",
        "content": "The Supreme Court on Monday strongly criticised banks for their handling of “digital arrest\" fraud cases, questioning their professionalism and asking why suspicious transactions are not flagged in time, even as customers lose their life savings.\nA bench led by Chief Justice of India Suryakant was hearing the matter after the Centre placed status reports filed by the Ministry of Home Affairs (MHA) and the Ministry of Electronics and Information Technology (MeitY) outlining steps to curb such cyber frauds.\nThe Attorney General informed the court that data on these cases is being compiled and standard operating procedures are under preparation.\nHighlighting the human cost of such crimes, the CJI observed that losses cannot be viewed merely as statistics.\nFor elderly couples and small depositors, he noted, the amounts siphoned off often represent their entire lifetime savings.\nThe court underlined that banks have a clear duty of care towards customers and questioned why red flags are not raised when suspicious transactions occur.\n“If this is the professionalism and quality of banking they are showing, then it is serious,\" the CJI remarked, expressing concern over delays by both public and private sector banks in responding to customer complaints.\nThe bench asked why digital arrest transactions cannot be immediately frozen and alerts sent to customers as well as cybercrime police stations when unusual activity is detected.\nThe Attorney General told the court that discussions are underway to finalise SOPs specifically for handling digital arrest fraud cases and to fast-track responses.\nWhile MHA and MeitY have submitted status reports, the Reserve Bank of India has also drafted an SOP detailing the steps banks should take upon receiving complaints.\nDirecting MHA to formally adopt and implement the SOP finalised on January 2, 2026, the court stressed the need to strengthen coordination among agencies to ensure recovery of stolen funds.\nIt also said High Courts should oversee compliance to prevent multiple, overlapping proceedings.\nThe amicus curiae assisting the court flagged systemic gaps, pointing out that banks often refuse compensation by claiming victims transferred money “voluntarily\", an argument he said ignores the coercive nature of such frauds.\nHe added that while RBI’s AI-based “Mule Hunter\" tool has been rolled out in 86 banks, other mandated safeguards, such as velocity checks to detect rapid fund movements, remain largely unimplemented.\nThe Supreme Court also questioned why the RBI has not taken tougher policy measures despite reports suggesting that over ₹54,000 crore has been siphoned off abroad.\nThe CJI asked whether such massive losses stem from negligence, collusion, or a reluctance to inconvenience customers.\nLatest Blogs",
        "link": "https://www.news18.com/india/if-this-is-the-quality-of-banking-sc-raps-banks-over-handling-of-digital-arrest-fraud-cases-9890124.html",
        "date": "Mon, 9 Feb 2026 16:14:08 +0530",
        "fetched_at": "2026-02-10 04:14:41.472104"
    },
    {
        "title": "‘Won’t Create Impediments To Completion Of SIR’: Supreme Court To Bengal Govt",
        "content": "The Supreme Court on Monday told the West Bengal government that it would not create any impediments to the completion of the Special Intensive Revision (SIR) of electoral rolls, even as it assured that hurdles in the process would be addressed.\n“We will remove hurdles, but we will not create any impediments in the completion of SIR. Let us be very clear about it,\" Chief Justice of India Surya Kant said during the hearing.\nSenior advocate DS Naidu, appearing in the matter, flagged concerns over the appointment of Electoral Registration Officers (EROs), arguing that they perform quasi-judicial functions and must be adequately trained and qualified. He said only 64 officers with adjudicatory experience were appointed, while others were selected based on pay parity, despite SIR decisions being open to challenge in appellate forums.\nThe bench also discussed the role of micro observers in the process. Senior advocate Shyam Divan argued that large-scale deletion of voter names could not be carried out through micro observers.\nThe CJI, however, noted that micro observers were part of a system created to assist EROs and AEROs, and that the final decision-making authority rested with the EROs. The court observed that if additional officers joined the process, the quality of decisions could improve.\nDuring the hearing, Divan highlighted the urgency of the matter, pointing out that the SIR process is scheduled to conclude on February 14. He said the draft electoral list contains 7.08 crore voters, of which 6.75 crore are mapped, while around 32 lakh remain unmapped and 1.36 crore fall under the “logical discrepancy\" category. The court said it would continue hearing the matter.\nLatest Blogs",
        "link": "https://www.news18.com/india/wont-create-impediments-to-completion-of-sir-supreme-court-to-bengal-govt-ws-l-9890162.html",
        "date": "Mon, 9 Feb 2026 16:09:16 +0530",
        "fetched_at": "2026-02-10 04:14:42.060629"
    },
    {
        "title": "Karnataka Govt's 'Generous' Distribution Of Cabinet Ranks Puts Strain On State Exchequer",
        "content": "The Siddaramaiah-led Congress government has sparked a heated debate regarding fiscal responsibility after significantly expanding the number of individuals holding ministerial status in Karnataka. In a recent move that has drawn sharp criticism from the opposition and fiscal watchdogs, the administration granted the status of Minister of State (MoS) to 54 additional individuals. CNN-News18 has exclusively accessed the documents giving MoS rank to Congress workers. This latest round of appointments brings the total number of people enjoying either Cabinet or MoS rank in the state to a staggering 149, raising serious concerns about the burgeoning burden on the public exchequer.\nThe vast majority of these new designees are Congress party leaders and workers currently serving as heads of various state-run boards and corporations. While the constitutional limit restricts the actual Cabinet to 34 ministers, the government has bypassed these constraints by according “ministerial status\" to a wide array of functionaries. A detailed breakdown reveals that beyond the 32 constitutional ministers, Cabinet rank has been bestowed upon 43 MLAs and 9 non-MLAs, including various advisors and special representatives. Furthermore, 11 MLAs and 54 non-MLAs have been elevated to the rank of Minister of State.\nThe financial implications of these appointments are substantial, as those with ministerial status are entitled to an extensive suite of perks and allowances. Each appointee receives a monthly salary of Rs 50,000, supplemented by a hospitality allowance of Rs 3,000 and a monthly house rent allowance of Rs 80,000. Maintenance and staff allowances add another Rs 20,000 per month. Additionally, the government provides for 1,000 litres of fuel per month — valued at approximately Rs 1,00,000 at current market rates — alongside daily travel allowances ranging from Rs 2,000 to Rs 2,500.\nThe perks extend into the administrative realm, with each rank-holder entitled to a personal secretary, multiple personal assistants, drivers, and attenders.\nFurthermore, the state covers full medical expense reimbursements and ensures these individuals receive protocol honors equivalent to state ministers at official government functions. Critics argue that at a time when the state is navigating significant financial commitments for its guarantee schemes, the generous distribution of such high-ranking statuses to nearly 150 individuals represents an unnecessary and avoidable drain on taxpayer money.\nLatest Blogs",
        "link": "https://www.news18.com/india/karnataka-govts-generous-distribution-of-cabinet-ranks-puts-strain-on-state-exchequer-ws-l-9889710.html",
        "date": "Mon, 9 Feb 2026 14:06:27 +0530",
        "fetched_at": "2026-02-10 04:14:42.653350"
    },
    {
        "title": "Chandrayaan-4: ISRO Has Found Safe Landing Site On The Moon For Vikram Lander",
        "content": "In a significant development for the ambitious Chandrayaan-4 mission, scientists at the Indian Space Research Organisation (ISRO) have identified a safe and relatively flat landing area in the Moon’s southern polar region, bringing the country a step closer to its first attempt at bringing lunar samples back to Earth.\nThe potential landing site has been located near the Mons Mouton mountain and is currently considered the safest option for the mission. According to a report by The Times of India, researchers from ISRO‘s Space Applications Centre carried out a detailed analysis using high-resolution images captured by the camera aboard Chandrayaan-2’s orbiter. Their study identified a stretch of nearly 1 sq km that appears most suitable for a safe landing.\nChandrayaan-4 is being described as ISRO’s most complex lunar mission so far. The mission architecture will include a propulsion module, descender, ascender, transfer module and a re-entry module. As per the plan, the Vikram lander will touch down on the lunar surface, after which samples will be collected with the help of robotic systems similar to the Pragyan rover. These samples will then be carried by the ascender module to lunar orbit and eventually transported back to Earth.\nSelecting the landing site remains the most critical and challenging part of the mission. ISRO engineers have laid down strict criteria for the location, including a ground slope of less than 10 degrees, minimal presence of large rocks, continuous sunlight availability for 11-12 days, direct radio communication with Earth and a surface with very few craters.\nEarlier studies had identified multiple potential regions near the Moon’s south pole. In the latest phase, scientists closely examined five areas around Mons Mouton. One of these was ruled out because it remains in permanent darkness. The remaining four sites, labelled MM-1, MM-3, MM-4 and MM-5, were studied in detail.\nUsing digital elevation models created at a fine resolution of 32 centimetres, researchers assessed each area for slope, height variations, sunlight exposure and potential risks. Among them, MM-4 emerged as the safest and most balanced choice. Located at 84.289 degrees south latitude and 32.808 degrees east longitude, the site has an average slope of around 5 degrees, considered ideal for landing operations.\nThe overall risk level at MM-4 was calculated at just 9.89%, with 568 safe landing grids identified in the area. Scientists also noted that shadows from nearby hills are limited, ensuring sufficient sunlight for powering the lander’s solar panels. By comparison, MM-1 and MM-3 showed risk levels above 12%, while MM-5 had very few safe grids for landing.\nResearchers say the study demonstrates how high-resolution imaging can support extremely precise landing decisions for future lunar missions. If the site is approved by the landing selection committee, the region could become the location where India attempts its first lunar sample return.\nA successful Chandrayaan-4 mission would place India among a select group of nations that have managed to bring back samples from the Moon or other celestial bodies.\nLatest Blogs",
        "link": "https://www.news18.com/india/chandrayaan-4-isro-has-found-safe-landing-site-on-the-moon-for-vikram-lander-ws-kl-9889412.html",
        "date": "Mon, 9 Feb 2026 12:30:41 +0530",
        "fetched_at": "2026-02-10 04:14:43.250020"
    },
    {
        "title": "Unauthorised Balloon Enters Restricted Airspace, Triggers Security Scare At Bengaluru Airport",
        "content": "A safety and security breach was reported at Kempegowda International Airport in Bengaluru after an unauthorised air balloon drifted into the highly restricted airfield, triggering an immediate safety scare.\nThe balloon, which reportedly belonged to a private construction company, BCD, based in Hoskote, was initially launched from the area but veered off course after operators allegedly lost control.\nThe unexpected entry of the aerial object into the airport perimeter led to heightened activity among security agencies, given the strict aviation protocols governing the airspace.\nUnder regulations set by the Directorate General of Civil Aviation (DGCA), the operation of any unmanned aerial vehicles, including drones and balloons, is strictly prohibited in the vicinity of airports to prevent potential collisions with aircraft.\nCentral Industrial Security Force (CISF) personnel intercepted and seized the balloon after it was spotted over the airport premises. A formal complaint has been lodged at the Kempegowda International Airport Police Station against the private entity responsible for the launch.\nDevanahalli police have registered a case and are investigating possible technical failures or negligence that led to the incident.\nLatest Blogs",
        "link": "https://www.news18.com/india/unauthorized-balloon-enters-restricted-airspace-triggers-security-scare-at-bengaluru-airport-ws-l-9889376.html",
        "date": "Mon, 9 Feb 2026 12:12:33 +0530",
        "fetched_at": "2026-02-10 04:14:43.836960"
    },
    {
        "title": "PM Modi Extends Birthday Wishes To Eknath Shinde: 'Working Tirelessly Towards Maharashtra's Development'",
        "content": "Prime Minister Narendra Modi on Monday wished Maharashtra Deputy Chief Minister Eknath Shinde a happy birthday and hailed his work for the state’s development.\nPM Modi said Shinde is working diligently to advance Maharashtra’s development and realise the vision of Shiv Sena founder Bal Thackeray.\n“Birthday wishes to Shri Eknath Shinde Ji. He is working tirelessly towards furthering Maharashtra’s development and realising the dreams of Pujya Balasaheb Thackeray and Dharamveer Anand Dighe. Praying for his long life and good health,\" Modi said in a post on X.\nBirthday wishes to Shri Eknath Shinde Ji. He is working tirelessly towards furthering Maharashtra’s development and realising the dreams of Pujya Balasaheb Thackeray and Dharamveer Anand Dighe. Praying for his long life and good health.@mieknathshinde— Narendra Modi (@narendramodi) February 9, 2026\nMeanwhile, Maharashtra Chief Minister Devendra Fadnavis also took to X and extended birthday greetings to Shinde.\n“Heartiest birthday greetings to Deputy Chief Minister of Maharashtra, Shri Eknath Shinde ji Wishing you a long life and good health!,\" he wrote on X.\nHeartiest birthday greetings to Deputy Chief Minister of Maharashtra, Shri Eknath Shinde ji!Wishing you a long life and good health!महाराष्ट्राचे उपमुख्यमंत्री श्री. एकनाथ शिंदे जी यांना वाढदिवसाच्या हार्दिक शुभेच्छा!@mieknathshinde pic.twitter.com/o6uVRsrMo7\n— Devendra Fadnavis (@Dev_Fadnavis) February 9, 2026\nShinde, leader of the Shiv Sena and a member of Maharashtra’s Mahayuti government, turned 62 on Monday.\nLatest Blogs",
        "link": "https://www.news18.com/india/pm-modi-extends-birthday-wishes-to-eknath-shinde-working-tirelessly-towards-maharashtras-development-9889140.html",
        "date": "Mon, 9 Feb 2026 11:01:41 +0530",
        "fetched_at": "2026-02-10 04:14:44.447458"
    },
    {
        "title": "Parliament Budget Session 2026 Live: Lok Sabha Adjourned After Rahul Gandhi Rakes Up China Again",
        "content": "Budget Session Parliament 2026 Live Updates: Lok Sabha has been adjourned for the day and will resume proceedings on Tuesday at 11 am. On Monday, Opposition parties also announced plans to move a no-confidence motion against Lok Sabha Speaker Om Birla, citing a lack of alternatives. The development comes amid growing tensions and repeated disruptions in the Lower House.\nParliament had reconvened today following a stormy week marked by repeated disruptions over the India-US trade agreement and references to an unreleased book by former Army chief General MM Naravane on the 2020 Galwan clash with China.\nLoP Rahul Gandhi again raked up the 2020 Galwan clash today. Addressing the Lower House, he said, “The Speaker commited to us that I will be allowed before budget discussion. So I want to know from Chair if I will be allowed to make those points,” referring to an unreleased book by former Army Chief General MM Naravane on the Galwan clash with China. Speaker Om Birla replied that no such notice had been received and urged MPs to proceed with the Budget discussion. Soon after the House was adjourned for the day.\nWith much of last week’s legislative business disrupted, Opposition leaders, including Rahul Gandhi, held a coordination meeting at Rajya Sabha Leader of the Opposition Mallikarjun Kharge’s office at 10 am. The first phase of the Budget Session is scheduled to conclude on February 13, after which Parliament will break for recess before resuming on March 9. Follow for live updates.\nFinance Minister Nirmala Sitharaman addresses the Rajya Sabha amid debate on Union Budget.\nDMK MP P Wilson addressed the Rajya Sabha on Monday.\nAfter Rahul Gandhi claimed he was allowed to speak in the House on Monday again, Parliamentary Affairs Minister Kiren Rijiju clarified that the Speaker had taken the initiative to resolve the deadlock and that Rahul Gandhi’s remarks were “not 100 percent correct.” He added that the Speaker had assured all parties, not just the Congress MP, that if a solution was reached, Gandhi, followed by other party leaders and the Parliamentary Affairs Minister, would speak. Following the exchange, the Lok Sabha was adjourned until the next day.\nThe Lok Sabha proceedings resumed at 2 pm after being adjourned twice on Monday amid continued protests by Opposition MPs. Rahul Gandhi addressed the House, stating, “The Speaker commited to us that I will be allowed before budget discussion. So I want to know from chair if I will be allowed to make those points,” referring to an unreleased book by former Army Chief General MM Naravane on the 2020 Galwan clash with China. Speaker Om Birla replied that no such notice had been received and urged MPs to proceed with the Budget discussion.\nCongress leader and LoP Rahul Gandhi addressed the Lok Sabha on Monday.\nBoth Houses of Parliament, Lok Sabha and Rajya Sabha, congratulated the Indian Under-19 cricket team for their ICC Under-19 World Cup 2026 victory, achieved by defeating England in the final in Harare, Zimbabwe.\nLok Sabha on Monday continued to see repeated disruptions by the Opposition benches as they demanded a discussion the India-US trade framework in Parliament. Opposition MPs demanded that the Leader of Opposition, Rahul Gandhi, be allowed to speak on the India-US interim deal.\nUnion Parliamentary Affairs Minister Kiren Rijiju on Monday blamed the Congress for repeated disruptions in the Lok Sabha, saying the debate on the Motion of Thanks to the President’s Address could not be held due to the Opposition’s conduct. He said the Speaker was “hurt” by the behaviour of Congress MPs and accused Leader of Opposition Rahul Gandhi of deliberately stalling proceedings. “The House is stalled solely due to Rahul Gandhi’s stubbornness,” Rijiju said. He warned that if disruptions continue and the Budget is passed by a voice vote, Opposition MPs would lose their opportunity to speak, holding the Congress responsible for the impasse.\nThe Lok Sabha has been adjourned until 2 pm amid a walkout by Opposition MPs.\nOpposition MPs staged a walk out from the Rajya Sabha on Monday, alleging Leader of Opposition in Lok Sabha, Rahul Gandhi, was prevented from speaking in the lower house. The walkout was staged in protest against what the Opposition described as unfair treatment and suppression of its voice during proceedings.\nThe Opposition has cited multiple reasons for moving a no-confidence motion against Lok Sabha Speaker Om Birla, alleging “partisan” conduct. They claim the Speaker’s rulings have consistently favoured the government, leaving the Opposition with little room to influence proceedings. They further stated that women MPs in the Opposition feel slighted after the Speaker reportedly stated that he prevented Prime Minister Narendra Modi from entering the House out of concern over potential disruptions by female MPs. Additionally, the Leader of the Opposition has been repeatedly denied the opportunity to speak, and several rulings from the Chair are seen as inconsistent with previous decisions, undermining parliamentary norms and prompting calls for accountability, they added.\nOpposition parties have announced plans to move a no-confidence motion against Lok Sabha Speaker Om Birla, citing a lack of alternatives. “We are planning to bring no-confidence against Speaker….since we are left with no other option,” sources in the Opposition said. The development comes amid growing tensions and repeated disruptions in the House over key legislative issues.\nThe Lok Sabha has been adjourned until 12 noon following disruptions caused by opposition MPs, who raised slogans during the proceedings. Lawmakers from several parties staged a protest over ongoing issues, forcing the Speaker to temporarily suspend the House to restore order.\nThe Lok Sabha Proceedings have resumed on Monday.\nBoth Houses of Parliament are set to begin discussion on the Union Budget 2026-27 on Monday, which was presented by Finance Minister Nirmala Sitharaman on February 1. Sitharaman presented the Union Budget 2026-27 in Lok Sabha, for the ninth consecutive time.\nThe Lok Sabha will begin with Question Hour, after which ministers from culture, finance, education, environment, labour and other ministries will table official papers. The House will then take up issues raised under Rule 377 before continuing the general debate on the Union Budget 2026–27.\nDMK MP TR Baalu moved an Adjournment Motion notice in the Lok Sabha on Monday, seeking a discussion on the framework of the Bilateral Trade Agreement (BTA) between India and the United States.\nAfter disruptions wiped out much of last week’s agenda, Opposition leaders will meet at Rajya Sabha Leader of Opposition Mallikarjun Kharge’s office at 10 am, ahead of today’s session.\nLatest Blogs",
        "link": "https://www.news18.com/india/parliament-budget-session-2026-live-lok-sabha-rajya-sabha-rahul-gandhi-mallikarjun-kharge-pm-modi-congress-bjp-latest-news-liveblog-9888806.html",
        "date": "Mon, 9 Feb 2026 20:38:47 +0530",
        "fetched_at": "2026-02-10 04:14:45.350247"
    },
    {
        "title": "‘Kerala Will See Change’: Amit Shah Slams ‘Failed Development’ Under Communists Ahead Of Polls",
        "content": "With months left for the Kerala Assembly elections, Union Home Minister Amit Shah on Sunday criticised the communist government in the state and said India must move away from communist ideology. He said Kerala would soon see change.\nSpeaking at an event titled ‘Chhattisgarh@25: Shifting The Lens’, the Union Home Minister said the government intends to completely eliminate Maoist influence and urged people to recognise what he described as the damaging effects of communist ideology.\nAccording to him, regions under communist rule have lagged in development. He also alleged that, in the name of tribal welfare, people were pushed towards armed activity, calling the ideology destructive in nature.\nShah said, “We will uproot the Maoist problem from its roots. But the public of this country must understand this ideology. Wherever communist rule has existed, development has failed to take place. In the name of tribal welfare, people were instead handed weapons. This ideology itself is a symbol of destruction.\"\nHe added that communists barely exist today. “Today, communists have to be searched for with a telescope- they barely exist anymore. Only Kerala remains, and this time that too will come to an end. The people themselves will do it. The people of Thiruvananthapuram have already begun,\" he said.\nShah also appealed to Maoists to surrender and said the government would welcome them. He said the country needs to get rid of the “destructive\" communist ideology at the earliest.\nLatest Blogs",
        "link": "https://www.news18.com/politics/kerala-will-see-change-amit-shah-slams-failed-development-under-communists-ahead-of-polls-9888819.html",
        "date": "Mon, 9 Feb 2026 08:27:46 +0530",
        "fetched_at": "2026-02-10 04:14:45.993263"
    },
    {
        "title": "After Poll Setback, Prashant Kishor Launches ‘Bihar Navnirman Yatra’ To Rebuild Jan Suraaj",
        "content": "Jan Suraaj founder Prashant Kishor on Sunday launched the ‘Bihar Navnirman Yatra’ from West Champaran, saying the campaign aims to rebuild and strengthen the organisation across the state.\nEven after attracting significant public attention, Jan Suraaj failed to win a single seat in the 2025 Bihar Assembly elections, where it contested 238 seats.\nAfter launching the yatra, Kishor said, “The yatra will focus on rebuilding and strengthening the party’s organisation across the state to present an honest and accountable political alternative in Bihar.\"\nHe said the party has continued its engagement with the public even after the Assembly elections and that the yatra will help expand and reorganise its grassroots network at the district level.\n“To ensure that our Bihar Navnirman Abhiyan materialises seamlessly on the ground, I will spend some time in each district, and meet old associates and new aspiring ones to strengthen the party’s organisational structure,\" Kishor said.\nHe said that during his yatra, the party will address the issue of a poll promise related to financial assistance for women under the Mukhyamantri Mahila Rozgar Yojana.\nUnder the scheme, the state government transferred Rs 10,000 each to 1.56 crore women in Bihar in multiple phases, with a large number receiving the amount ahead of the elections. The government has said the beneficiaries will later be eligible to receive up to Rs 2 lakh each to expand their businesses.\n“Jan Suraj workers would reach households across the district to ensure that the benefit is delivered to women. Government’s failure to fulfil the commitment would indicate that the announcement was made only for electoral gains,\" Kishor claimed.\nThe Bihar cabinet on January 29 cleared up to Rs 2 lakh in additional assistance for selected beneficiaries of the Mukhyamantri Mahila Rozgar Yojana after a six-month review.\n“The amount will be given in phases to the women entrepreneurs who will properly utilise the Rs 10,000 fund at the end of the assessment period,\" a statement issued by the government noted.\n(With inputs from PTI)\nLatest Blogs",
        "link": "https://www.news18.com/india/after-poll-setback-prashant-kishor-launches-bihar-navnirman-yatra-to-rebuild-jan-suraaj-ws-l-9888664.html",
        "date": "Sun, 8 Feb 2026 23:09:07 +0530",
        "fetched_at": "2026-02-10 04:14:46.585694"
    },
    {
        "title": "Delhi CM Rekha Gupta Launches 500 EV Buses, DTC Fleet Touches 4,286",
        "content": "Chief Minister Rekha Gupta said that the Delhi government on Sunday launched 500 electric buses, taking the total EV fleet of the Delhi Transport Corporation (DTC) to 4,286.\nShe attended the launch of 500 EV buses and the Delhi–Panipat inter-state bus service at Ramlila Maidan.\nRekha Gupta said that Ramlila Maidan symbolises a turning point in Delhi’s political history, recalling how previous governments had “deceived the people and betrayed their trust\" at the same venue. She added that it was now through Ramlila Maidan that her government had earned the confidence of Delhi’s citizens and presented them with a promise of development.\nVIDEO | Delhi Chief Minister Rekha Gupta attends the launch of 500 EV buses and the Delhi–Panipat inter-state bus service at Ramlila Maidan. Rekha Gupta says, “This is the very Ramlila Maidan where previous governments deceived the people of Delhi and betrayed their trust. Today,… pic.twitter.com/GMZyB16L59— Press Trust of India (@PTI_News) February 8, 2026\n“This step will not only boost transportation and connectivity in the city but also help in cutting down air pollution,\" Gupta said at the launch event which was also attended by BJP president Nitin Nabin.\nShe said by 2028, the DTC plans to increase its total bus fleet to 14,000. “These EV buses will help improving the air quality and the transport needs of the city. These are AC buses, low-floor with panic buttons and several other features,\" she added.\nTransport Minister Pankaj Singh said that three inter-state bus services connecting Delhi and Panipat have also been launched.\n“Delhi government is constantly working on the transport sector. One such measure is providing last mile connectivity to residents. We have recently signed an MoU with Bharat Taxi in this regard and soon a new EV policy and an E-rickshaw policy will also be in place,\" the chief minister said.\nDelhi Minister Parvesh Verma on Sunday spoke about the launch of 500 electric buses and the Delhi–Panipat inter-state bus service at Ramlila Maidan, saying the developments marked the beginning of a larger transformation.\nHe said the initiatives were “just the trailer\" and that the “full picture is yet to come,\" recalling that exactly one year ago the people of Delhi had given the Bharatiya Janata Party 48 seats.\nThanking the public for their support, Verma added that several projects had already been initiated and many more would be rolled out in the coming months.\nLatest Blogs",
        "link": "https://www.news18.com/cities/new-delhi-news/delhi-cm-rekha-gupta-launches-500-ev-buses-dtc-fleet-touches-4000-ws-l-9888405.html",
        "date": "Sun, 8 Feb 2026 20:00:34 +0530",
        "fetched_at": "2026-02-10 04:14:47.241689"
    },
    {
        "title": "‘Not Surrender, It’s Negotiation’: Pakistani Analyst Decodes India-US Trade Agreement | Exclusive",
        "content": "Pakistani analyst Najam Sethi called the India-US interim trade agreement “a negotiation\".\n“It is not a surrender. It is a negotiation. These decisions don’t happen overnight. The negotiations must have gone on for months. PM Modi was quiet throughout,\" said Sethi.\n“It is not zero tariff on all items…It includes items that are no threat to Indian industries,\" he said\nThe analyst said PM Modi negotiated smartly while the Indian opposition is creating unnecessary fuss. Sethi said that India’s zero-tariff concessions apply only to a small, specific list of US items such as certain wines, cosmetics, soybean oil, tree nuts, and processed fruits, not a broad flood of goods These reductions cover very few products and won’t significantly hurt domestic sectors or undermine Make in India, as the deal protects sensitive areas like dairy, grains, and key agriculture, he said.\nMany in Pakistan, including analysts like Sethi, see this as a smart bargain by Modi and India gains better access without losing much, making the opposition’s noise seem unnecessary and politically motivated.\nUnion Commerce Minister Piyush Goyal on Saturday underlined the government’s commitment to farmers while concluding the framework of the bilateral trade agreement with the US. In his statement, the Minister said that dairy, fruits, vegetables, spices, and other grains have been protected in the India-US trade deal to safeguard the interests of domestic farmers.\nIn a post on X, Piyush Goyal said the trade deal will mark a powerful step forward in the direction of a self-reliant India.\n“Farmers Safe, Country Developed… In the India-US trade agreement, dairy, fruits, vegetables, spices, and other grains have been protected. This will safeguard the interests of domestic farmers, strengthen local agriculture through preferential access to such a large market, and mark another powerful step forward in the direction of a self-reliant India,\" he said.\nBoth India & US are working to create resilient supply chains for an uninterrupted supply of critical minerals to support industries.#IndiaUSJointStatement pic.twitter.com/urzZFtZF3S— Piyush Goyal (@PiyushGoyal) February 7, 2026\n“India is not losing anything in trade deal and even Pakistani voices have openly admitted that India lost nothing but only the Indian opposition spreading fear. Domestic political outrage is not linked from actual economic impact and the opposition is creating anxiety unnecessarily,\" said Indian government sources.\nPakistani commentators see continuity in India’s trade posture and they also feel it was India’s calculated move without losing anything.\nLatest Blogs",
        "link": "https://www.news18.com/india/not-surrender-its-negotiation-pakistani-analyst-decodes-india-us-trade-agreement-exclusive-ws-l-9888326.html",
        "date": "Sun, 8 Feb 2026 18:57:26 +0530",
        "fetched_at": "2026-02-10 04:14:47.847348"
    },
    {
        "title": "Bengaluru–Mangaluru Vande Bharat Express Soon? Here's What Railway Minister Said",
        "content": "Currently, Karnataka is served by 22 Vande Bharat services (11 pairs), operating on both originating and terminating routes, which connect multiple cities across the state. Of these, 14 services either originate from or terminate in the Bengaluru region, highlighting the city’s role as a major rail hub.\nThe proposed new service will run on the Bengaluru–Mangaluru route and is expected to significantly cut travel time between the state capital and the coastal city.\nAddressing a press conference in Bengaluru on Saturday, Union Railway Minister Ashwini Vaishnaw said the service would be launched once key preparatory work is completed.\n“A new Vande Bharat service connecting Bengaluru and Mangaluru will be launched soon after the completion of electrification and safety certifications,\" Vaishnaw said.\nThe minister added that Karnataka is witnessing major upgrades in railway infrastructure, noting that a record ₹7,748 crore has been allocated for the state’s rail sector.\nThe upcoming Vande Bharat Express is expected to be equipped with several advanced safety and comfort features, including:\nOnce operational, the new Bengaluru–Mangaluru Vande Bharat is expected to modernise rail travel in Karnataka further and improve connectivity between the state’s interior and its coastal belt.\nLatest Blogs",
        "link": "https://www.news18.com/india/bengaluru-mangaluru-vande-bharat-express-soon-heres-what-railway-minister-said-ws-l-9888220.html",
        "date": "Sun, 8 Feb 2026 16:15:22 +0530",
        "fetched_at": "2026-02-10 04:14:48.438339"
    },
    {
        "title": "IWT Paused, Infra Fast-Tracked, Pakistan Irked: A Look At India’s Projects On Chenab",
        "content": "As India placed the Indus Waters Treaty (IWT) in abeyance in April 2025 following the Pahalgam attack, it has shifted from a policy of “restraint\" to one of “strategic execution\".\nBy treating the treaty as suspended, India is no longer following data-sharing or prior-notification requirements with Pakistan for new or existing projects on the Chenab River.\nThe IWT is a landmark water-sharing agreement signed on September 19, 1960 between India and Pakistan, brokered by the World Bank. It established a framework for managing and distributing the waters of the Indus River system, which has remained largely functional despite decades of regional conflict.\nThe treaty divides the six major rivers of the Indus basin into two groups:\nEastern Rivers (Ravi, Beas, Sutlej): Allocated to India for unrestricted use.\nWestern Rivers (Indus, Jhelum, Chenab): Allocated to Pakistan.\nIndia is permitted limited “non-consumptive\" use of these rivers for domestic, agricultural, and run-of-the-river hydroelectric power generation, provided it follows strict design specifications to avoid harming Pakistan’s interests.\nIt provides for a Permanent Indus Commission (PIC), abilateral body with a commissioner from each country tasked with data exchange, annual meetings, and initial conflict resolution. In case of disputes, it has a three-tiered mechanism starting with the PIC, followed by a Neutral Expert for technical issues, and finally an ad-hoc Court of Arbitration for major disputes.\nAs India held the IWT in abeyance, it has halted meetings of the Permanent Indus Commission and fast-tracked projects on western rivers (like Ratle and Pakal Dul) without the previously required technical notifications to Pakistan.\nIt has also rejected rulings from the Court of Arbitration, which India currently labels as “illegal.\"\nSawalkote HEP (1,856 MW): This is the first major new project to receive a “green light\" post-IWT halt. On February 5, 2026, NHPC invited international tenders worth ₹5,129 crore for its construction. It has been designated a “Project of National Importance\" and will be the largest in J&K once completed (estimated 9-year timeline).\nDulhasti Stage-II (260 MW): Approved by a Ministry of Environment panel in December 2025. This project is an extension of the existing Stage-I and was cleared specifically under the logic that IWT notification requirements are currently void.\nPakal Dul HEP (1,000 MW): Being fast-tracked for a “non-negotiable\" commissioning deadline of December 2026. Crucially, this is India’s first storage project on a western river, giving it the ability to regulate water flow timing into Pakistan.\nKiru (624 MW) & Kwar (540 MW): Both are run-of-the-river projects being accelerated. Kiru is targeted for December 2026, while Kwar is now set for March 2028.\nRatle HEP (850 MW): Long-contested by Pakistan, this project’s construction is now being treated as a sovereign decision. It is being fast-tracked for a 2028 completion.\nIndia has initiated desilting and reservoir enhancement at the Salal and Baglihar projects to improve storage and power generation, activities previously restricted by the treaty.\nSince the halt, India has reportedly restricted or fluctuated water flows from existing dams like Baglihar and Salal. In May 2025, downstream flows at Pakistan’s Marala headworks reportedly dropped by up to 90% during maintenance operations.\nIn June 2025, India initiated a feasibility study for a 113-km canal to divert surplus water from the Chenab basin in J&K toward the Ravi and Beas systems in Punjab and Rajasthan.\nWith Agency Inputs\nLatest Blogs",
        "link": "https://www.news18.com/india/iwt-paused-infra-fast-tracked-pakistan-irked-a-look-at-indias-projects-on-chenab-ws-kl-9888041.html",
        "date": "Mon, 9 Feb 2026 11:03:33 +0530",
        "fetched_at": "2026-02-10 04:14:49.086634"
    },
    {
        "title": "TVK Chief Vijay Likely To Contest From These Two Seats In 2026 Tamil Nadu Elections",
        "content": "A top Tamilaga Vettri Kazhagam (TVK) source has confirmed that actor-turned-politician and party chief Vijay is likely to contest from two seats in the Tamil Nadu 2026 assembly elections.\nAccording to the sources, Vijay has finalised Virugambakkam constituency in Chennai as his electoral battleground. The actor-turned-politician is also expected to file his nomination from Trichy East, signaling a strategic push to expand his party’s presence across key urban and regional strongholds.\nThe confirmation comes amid widespread speculation about the actor’s political debut at the state level.\nEarlier, Vijay stated that his party, the TVK, has emerged as a major political force with the backing of the people and claimed it is the only party capable of defeating the DMK in the upcoming elections.\nVijay dismissed speculations of a triangular or multi-cornered contest, stating that the true electoral battle would be a straight fight between the TVK and the ruling DMK, which he confidently predicted would face defeat.\n“People talk about triangular or four-corner contests. One is represented by the TVK backed by the people, the second is DMK, and the third is BJP and its many allies. Only the TVK, which is a people’s force alone can defeat the DMK,\" he added.\nLatest Blogs",
        "link": "https://www.news18.com/politics/tvk-chief-vijay-likely-to-contest-from-these-two-seats-in-2026-tamil-nadu-elections-ws-kl-9888129.html",
        "date": "Sun, 8 Feb 2026 17:38:54 +0530",
        "fetched_at": "2026-02-10 04:14:49.676576"
    },
    {
        "title": "BJP's Devyani Rana Slams J&K Budget In Maiden Assembly Speech, Yet Wins NC Applause",
        "content": "BJP MLA Devyani Rana made a strong impression in her maiden speech in the Jammu and Kashmir Assembly on Saturday, launching a pointed critique of the Union Territory’s budget while drawing rare applause from members of the ruling National Conference (NC).\nAs Rana rose to speak on the budget presented by Chief Minister Omar Abdullah, NC legislators were seen thumping their desks in encouragement, a gesture that was repeated at the end of her address, despite her sharp criticism of the government’s financial priorities.\nAhead of the speech, Speaker Abdul Rahim Rather urged members to support the first-time legislator, who won the recent by-election from Nagrota following the death of her father, senior political leader Davinder Singh Rana.\nDavinder Singh Rana, once a prominent NC leader and close associate of Omar Abdullah, had joined the BJP a few years ago, a move the chief minister has publicly described as one of his biggest political regrets.\nFollowing Rana’s death after the October 2024 Assembly elections, Abdullah had delivered an emotional tribute in the House, recalling their long association.\nReflecting this personal history, the NC had mounted only a symbolic contest against Devyani Rana in the Nagrota by-election, with Abdullah notably refraining from criticising her during campaigning.\nOn Friday, Abdullah, who also holds the finance portfolio, presented a Rs 1.13 lakh crore budget for Jammu and Kashmir. A day later, the House listened in near silence as Devyani Rana delivered a detailed, data-backed critique of the proposals.\nIn her 12-minute address, Rana questioned reduced allocations across several critical sectors, including disaster management, education and welfare schemes.\nShe highlighted that funding for disaster management and relief had been cut to Rs 350.76 crore from Rs 719 crore in the previous year.\nShe argued that such a reduction was particularly troubling in light of recent natural disasters.\n“This contraction comes in a year marked by unprecedented and relentless rainfall that caused severe destruction, especially in rural areas like Nagrota,\" Rana said, recalling the flash floods, landslides and cloudbursts that hit Jammu and Kashmir last August and September, claiming dozens of lives and leaving hundreds of families homeless.\nMore than 100 pilgrims were killed in landslides during the Vaishno Devi and Machail Yatra in Kishtwar.\nRana called for enhanced investment in disaster mitigation and relief, saying it should have been a central focus of the budget. She also criticised cuts in the education sector, warning of their long-term social impact.\n“If we spend Rs 193 crore less on education than last year, schools will be shut or merged. How will the child of a poor family move ahead?\" she asked.\nThe BJP legislator further flagged gaps in welfare implementation, citing the free bus service for persons with disabilities, which she said lacked vehicles equipped with disabled-friendly infrastructure.\nDespite her pointed attack on the government’s budget and policies, Rana concluded her speech to applause from both treasury and opposition benches, an unusual moment of bipartisan appreciation in the Jammu and Kashmir Assembly.\nLatest Blogs",
        "link": "https://www.news18.com/india/bjps-devyani-rana-slams-jk-budget-in-maiden-assembly-speech-yet-wins-nc-applause-9887959.html",
        "date": "Sun, 8 Feb 2026 13:36:22 +0530",
        "fetched_at": "2026-02-10 04:14:50.528777"
    },
    {
        "title": "News18 Afternoon Digest: Govt Kicks Off Mega Dam Project On Chenab; PM Modi Vows 'No Compromise' On Terrorism & More",
        "content": "In today’s afternoon digest, News18 brings you the latest updates on the mega dam project on the Chenab river after pausing the Indus Waters Treaty with Pak, PM Modi on terrorism, and more.\nModi Govt Kicks Off Mega Dam Project On Chenab After Pausing Indus Treaty With Pakistan | Exclusive\n‘No Double Standards, No Compromise’: PM Modi On Terrorism, Peace In Indo-Pacific Region\nFather Of Ghaziabad Teens Married Three Sisters; 2015 Live-In Partner Suicide Case Resurfaces\nDelhi Biker Remained In Pit For 8 Hours; Five People Knew, But No One Tried To Rescue\nNeo-Nazi Slogans, ‘Blood’ Swastika: Teen Attacks Russian University Students, Including Indians\n‘Indian Media Circulating Fiction’: Naqvi’s PCB Begins New Drama, Denies Talks With ICC\nAmitabh Bachchan Recalls Being Called A ‘3rd Rate Actor From A 3rd World Country’: ‘That Hurt Me’\nLatest Blogs",
        "link": "https://www.news18.com/india/news18-afternoon-digest-govt-kicks-off-mega-dam-project-on-chenab-pm-modi-vows-no-compromise-on-terrorism-more-ws-l-9887877.html",
        "date": "Sun, 8 Feb 2026 12:43:16 +0530",
        "fetched_at": "2026-02-10 04:14:51.194012"
    },
    {
        "title": "Modi Govt Kicks Off Mega Dam Project On Chenab After Pausing Indus Treaty With Pakistan | Exclusive",
        "content": "India has started work on the mega Rs 5,129 crore worth Sawalkote Hydroelectric Project on the River Chenab in Jammu and Kashmir—the first such new project to get the green light from the Narendra Modi government after the abrogation of the Indus Water Treaty.\nNews18 has accessed the documents of the National Hydroelectric Power Corporation (NHPC) Limited inviting companies on February 5 to build this mega project in the Udhampur and Ramban districts of Jammu and Kashmir. The Sawalkote Hydroelectric Project, which in Stage One will see a 1,406 MW project coming up and a 450 MW project in Stage Two, is located on the Chenab River between the Baglihar Project to its upstream and the Salal Project to its downstream. This will be a “run of the river\" project.\n“Construction methodology and selection of equipment have been planned with the aim to commission the project as early as possible,\" reveal the documents accessed by News18, showing the urgency. Acting swiftly on projects of strategic significance following the suspension of the Indus Water Treaty, an expert committee of the environment ministry cleared the 1,856 MW project last October. Now, NHPC has invited bids to build it.\nThe documents say that the major construction works shall start after necessary initial mobilisation. “Available working season in a year in the project area shall be 12 months for all underground works & for surface works with full progress rate during non-monsoon period and with 50% progress rate in monsoon period.\"\nThe project could take 9 years to complete, as per the documents.\nNews18 reported last month that the Centre has issued firm directions to fast-track four major hydropower projects on the Chenab river system. Officials had been asked to commission the Pakal Dul and Kiru projects by December 2026, complete the Kwar project by March 2028, and accelerate construction on the strategically sensitive Ratle Dam.\nThe most consequential of the projects is the Pakal Dul hydropower project in Kishtwar. At 1,000 MW, it is the largest project in the Chenab basin and, at 167 metres, the highest dam in India. Crucially, it is India’s first storage project on a western river that flows into Pakistan. Built on a tributary of the Chenab, the project was inaugurated by Prime Minister Narendra Modi in May 2018.\nWith the Indus Waters Treaty effectively in abeyance, the Centre has now ordered that Pakal Dul be commissioned by December 2026. Once operational, it will give India the ability not just to generate power but to regulate the timing of water flows—a capability Pakistan has long viewed with concern.\nRunning parallel is the Kiru project, also located in the Kishtwar district. The Kiru Dam, rising 135 metres on the Chenab, is a run-of-the-river project, but its strategic value lies in how it fits into a chain of projects upstream and downstream.\nThe Centre has set the same December 2026 deadline for Kiru, making it clear that both projects are expected to come online together.\nThe third pillar of this push is the Kwar project, another run-of-the-river dam on the Chenab with a height of 109 metres. A major engineering milestone was achieved in January 2024 when the Chenab was successfully diverted to enable construction. That diversion was closely tracked in Pakistan. The Centre has now directed that Kwar be commissioned by March 2028, locking in a firm timeline.\nThen there is the Ratle project, perhaps the most contentious of them all. The 850 MW project involves a 133-metre-high dam on the Chenab and has been opposed by Pakistan for years, particularly over the design of its spillways. During his recent visit, the Power Minister laid the foundation stone for the dam’s concreting works, signalling that Ratle is now being fast-tracked. The Chenab was diverted through tunnels for this project in 2024, and the dam is expected to be ready by 2028.\nBeyond these headline projects, India is also moving ahead with Dulhasti Stage-2 on the Chenab. The project received clearance from the Environment Ministry’s panel last December and will come up after Dulhasti-I, which is already operational. Pakistan has recently objected to this clearance as well, arguing it was not informed—an objection India has rejected.\nThe Chenab is part of the Indus basin—Pakistan’s lifeline. Nearly three-fourths of Pakistan’s water originates from the western rivers that flow from India into Pakistan. Over 90 per cent of Pakistan’s agriculture depends on this basin, and almost the entire network of its dams and canals is built around it. In effect, nine out of ten Pakistanis rely on water that first flows through Indian territory.\nIndia has skipped all Indus Waters Treaty (IWT) proceedings following the Pahalgam attack.\nLatest Blogs",
        "link": "https://www.news18.com/india/modi-govt-kicks-off-mega-dam-project-on-chenab-after-pausing-indus-treaty-with-pakistan-exclusive-9887566.html",
        "date": "Sun, 8 Feb 2026 10:00:04 +0530",
        "fetched_at": "2026-02-10 04:14:51.913865"
    },
    {
        "title": "India Could Be One Of The Best Choices For Legal Migration To Europe: Greek Defence Minister",
        "content": "Greek Defence Minister Nikos Dendias on Saturday said India and the wider Indian subcontinent could become among Europe’s most viable partners for legal migration, as the continent grapples with an ageing population and shrinking workforce.\nSpeaking at the India-EU Forum 2026 in New Delhi, Dendias described migration as a long-standing global reality and stressed the need for Europe to design structured and balanced migration pathways to address its demographic challenges.\n“Migration is a global phenomenon. It existed in the past and will continue in the future,\" he said, adding that Europe’s population growth is “almost negative,\" creating an urgent demand for younger workers.\nAgainst this backdrop, he noted that the Indian subcontinent’s demographic profile makes it a strong candidate for legal migration partnerships.\n“With its current population structure, the subcontinent could be one of the best choices for legal migration,\" Dendias said, while noting that such frameworks must be carefully designed to ensure mutual benefits for both countries of origin and destination.\nThe Greek minister also flagged concerns over illegal migration, calling it a destabilising challenge fuelled by organised human smuggling networks.\nHe urged stronger international cooperation to counter what he described as a large-scale, profit-driven criminal activity.\nBeyond migration, Dendias reflected on the historical and cultural links between Greece and India, referencing Alexander the Great’s expedition to the region.\nHe described India as an enduring presence in Greek mythology and suggested that contemporary cooperation offers an opportunity to renew and deepen bilateral ties.\nThe inaugural India-EU Forum, organised by the Ministry of External Affairs in partnership with the Ananta Centre, concluded on Saturday after two days of discussions on trade, security, technology and geopolitics.\nHeld from February 6 to 7, the Track 1.5 forum brought together more than 200 policymakers, industry leaders and strategic experts from India and European Union member states.\nExternal Affairs Minister S Jaishankar delivered the opening address on February 6, while Commerce and Industry Minister Piyush Goyal participated in a special session the same day. Nikos Dendias addressed a dedicated fireside chat on February 7.\nLatest Blogs",
        "link": "https://www.news18.com/india/india-could-be-one-of-the-best-choices-for-legal-migration-to-europe-greek-defence-minister-9887619.html",
        "date": "Sun, 8 Feb 2026 07:43:07 +0530",
        "fetched_at": "2026-02-10 04:14:52.518430"
    },
    {
        "title": "‘Didn't Mean To Insult': MP Minister Apologises Again For Remarks On Col Sofiya Qureshi",
        "content": "Madhya Pradesh Tribal Affairs Minister Kunwar Vijay Shah has offered another apology for his objectionable remarks against Colonel Sofiya Qureshi amid a Supreme Court-mandated deadline for his prosecution, saying he did not intend to insult a woman officer.\nIn May last year, Shah sparked a political row for his remarks against Col Qureshi, who became one of the most prominent faces of media briefings when India launched Operation Sindoor against terror hideouts in Pakistan. In a viral video, Shah was seen referring to the woman army officer as a “sister of terrorists\".\nHis remarks were widely criticised by political leaders, and an FIR was filed against him. Speaking to reporters on Saturday, Shah said he had never intended to insult a woman officer, the armed forces or any section of society.\n“I have said this many times earlier, and I am reiterating it today that I did not intend to insult any woman officer, the Indian Army or any section of society,\" he was quoted as saying by NDTV, adding that his remarks were made in a “moment of patriotic excitement\".\n“It is extremely painful for me that such a controversy arose due to a small error on my part. I believe my feelings will be seen in the right context. I have always had immense respect for the Indian Army and will continue to do so,\" he added.\nShah said maintaining “decorum and sensitivity of words\" was extremely important in the public and vowed to exercise control over his speech in the future. The Madhya Pradesh High Court had ordered the police to file an FIR against him last year for the controversial remarks.\nSupreme Court Raps MP Govt For Delay\nOn January 19, the Supreme Court pulled up the Madhya Pradesh government to he delay in granting permission to prosecute Shah for his remarks. The bench of Chief Justice of India (CJI) Surya Kant, Justice Dipankar Datta and Justice Joymalya Bagchi directed the state government to take a call on the grant of sanction to prosecute Shah.\n“You are sitting over the SIT report since August 19, 2025. The statute casts an obligation on you and you must take a call. It is January 19 now,\" CJI Kant remarked.\nOn July 28, 2025, the top court had pulled up Shah for not placing a public apology over his remarks on record against Col Qureshi, saying he was “testing the court’s patience\". It had pointed out that the minister’s conduct was prompting it to doubt his intentions and bonafide.\nThe FIR was registered against Shah under sections 152, 196(1)(b) and 197(1)(c) of the Bharatiya Nyaya Sanhita (BNS). Since the top court’s view last month, the Congress has demanded Shah’s resignation from the Madhya Pradesh cabinet.\nLatest Blogs",
        "link": "https://www.news18.com/india/didnt-mean-to-insult-mp-minister-apologises-again-for-remarks-on-col-sofiya-qureshi-9887409.html",
        "date": "Sat, 7 Feb 2026 22:11:55 +0530",
        "fetched_at": "2026-02-10 04:14:53.120773"
    },
    {
        "title": "'If Intent Is Pure...': Piyush Goyal Credits PM Modi's 'Masterclass' For India-US Trade Deal",
        "content": "Union Commerce Minister Piyush Goyal on Saturday credited Prime Minister Narendra Modi’s “masterclass\" and US President Donald Trump’s leadership in securing a landmark India-US trade deal, emphasising that the two countries share a good relationship and mutual respect.\nSpeaking in an exclusive interview with CNN-News18, Goyal said it was PM Modi and Trump’s leadership that gave impetus to the trade deal and helped smooth engagement between the two sides. “If your intent is pure, if you believe in fair play on both sides and respect each other’s sensitivities, and are committed to the well-being of your nation while recognising strengths, it leads to mutual understanding,\" he said.\nHe called the deal a powerful “win-win\" arrangement for both countries to strengthen trade engagement. “When we look at the $30 trillion US economy and the $4 trillion Indian economy that is rapidly growing to become a $30 trillion economy in 2047, we both collectively provide a force multiplier, which helps us achieve the target of $500 billion purchases in five years,\" he said.\nHis remarks came after an interim deal between India and the US was announced on Saturday, culminating months of negotiations amid tariff-related tensions. The deal provides for a reduction in reciprocal US tariffs on Indian goods to 18 per cent.\nPM Modi’s ‘Masterclass’\nGoyal further lauded PM Modi, calling him a “pragmatic leader\" who recognises India’s comparative strengths and the sensitive areas, such as farmers and fishermen. “This unique and clear understanding of PM Modi has helped us navigate the whole process,\" he added.\nHe compared PM Modi to a “masterclass\" who is very practical and offers real-life solutions. “Over the last 12 years of working with him, we have all actually grown in terms of our understanding of principles of negotiation, and our understanding of how to look at the best interests of your nation. Most important is his holistic thinking,\" he told CNN-News18.\nThe Commerce Minister said India’s focus is on acquiring ICT products, data centres and quantum computing equipment from the US to become an international player in modern-day technological areas.\nIndia-US Ties\nHe also asserted that India shares a good relationship with the United States, who respected each other’s sensitive areas. He also rejected criticism that the deal could affect Indian farmers, adding that several Indian exports are facing zero tariffs.\nHe also said he foresaw no problems with the US in the future, citing the friendly relations between the two sides and the fact that teams had finalised all matters after months of negotiations. “We are not that much apart in terms of our abilities to conclude a good deal. We are not competitors, we complement each other. We respect each other’s sensitivities. Both leaders guided teams,\" he added.\nHe said India was already self-sufficient in rice, wheat, sugar, soyabean, corn, GM products, poultry, millets, certain fruits and green peas, groundnuts and non-alcoholic beverages. These products that were sensitive for the farmers and were protected under the new deal. “On other products, there has been a calibrated opening. In many cases, there has been some phasing out over a period of time and tariff rate quotas have been given.\"\nGoyal expressed confidence that the trade deal could generate several opportunities for collaboration between the two countries.\nLatest Blogs",
        "link": "https://www.news18.com/india/if-intent-is-pure-piyush-goyal-credits-pm-modis-masterclass-for-india-us-deal-ws-l-9887017.html",
        "date": "Sat, 7 Feb 2026 18:40:10 +0530",
        "fetched_at": "2026-02-10 04:14:53.853815"
    },
    {
        "title": "Prescription For Crises: Govt May Ask Pharma Firms To Fund Free Medicines For Emergencies",
        "content": "India is examining a proposal to mandate pharmaceutical companies to set aside a share of their profits for free medicines during health emergencies, News18 learned.\nThe proposal seeks an amendment to the Drugs Rules, 1945, to include a mandatory provision requiring pharmaceutical companies to spend “at least one per cent of their net profit for providing free medicines in medicine bank\" to be used by the central government during “health emergencies, disaster or any other circumstances considered necessary\".\nThe proposal is still under deliberation and has been placed before the country’s top statutory decision-making body on technical matters related to drugs and cosmetics, the Drugs Technical Advisory Board.\nThe move, according to the agenda document accessed by News18, is being examined to assess whether emergency access to free medicines can be strengthened through regulatory changes without conflicting with company law.\nThe proposal was deliberated at DTAB’s 90th meeting held on January 25, 2024, after which the board recommended that the Ministry of Health and Family Welfare may seek the opinion of the Ministry of Corporate Affairs on the matter.\nSubsequently, comments were received from the corporate affairs ministry, which flagged legal constraints. The agenda document notes that “the broad framework for CSR is laid down under Section 135 of the Companies Act, 2013\", along with Schedule VII of the Act and the Companies (CSR Policy) Rules, 2014.\nIt further clarifies that “the Government does not issue specific direction or intervention in the manner or geographical area in which companies choose to spend their CSR funds\", highlighting limits on directing CSR expenditure through sector-specific rules.\nThe corporate affairs ministry has indicated that any attempt to mandate CSR-linked spending through drug regulations would need to be legally aligned with company law. The document states that “CSR is governed by Companies Act, 2013,\" and therefore suggests that “the authority for CSR activity may be quoted from Schedule VII, Companies Act, 2013 and Companies (CSR Policy) Rules, 2014 and proposed amendment in Drugs Rules, 1945 need to be in sync\".\nMore significantly, it cautions that “any amendment in the CSR framework would require an amendment to the Companies Act\", suggesting that changes through the Drugs Rules alone may not be sufficient.\nThe matter has now been placed back before DTAB, with the agenda concluding that “DTAB may kindly deliberate and give its recommendations in the matter\".\nThe matter continues to be reviewed, with regulators weighing public health needs against existing corporate law provisions.\nLatest Blogs",
        "link": "https://www.news18.com/india/prescription-for-crises-govt-may-ask-pharma-firms-to-fund-free-medicines-for-emergencies-9885630.html",
        "date": "Sat, 7 Feb 2026 07:00:34 +0530",
        "fetched_at": "2026-02-10 04:14:55.168231"
    }
]