[
    {
        "title": "‘The 2028 Global Intelligence Crisis’: Who is author Alap Shah?",
        "content": "Determine the monthly installment amount for a loan\nEstimate the returns on investments made through SIPs\nFind out maturity amount and interest earned on PPF\nCheck maturity amount and interest earned on an FD\nEstimate the pension amount and corpus accumulated under NPS\nA Mutual Fund Calculator helps estimate the future value of investments",
        "link": "https://timesofindia.indiatimes.com/business/international-business/the-2028-global-intelligence-crisis-who-is-author-alap-shah/articleshow/128722260.cms",
        "date": "2026-02-23T22:50:53+05:30",
        "fetched_at": "2026-02-24 03:59:59.903083"
    },
    {
        "title": "Meerut Namo Bharat train crosses 1 lakh riders on first full day after launch",
        "content": "Representational image of the Namo Bharat train\n| Photo Credit: Special arrangement\n\"Bharat Mata ki Jai\" echoed inside the coaches as commuters thronged the Namo Bharat Regional Rapid Transit System (RRTS) on its first full day of operations, with the NCRTC on Monday (February 23, 2026) recording its highest-ever ridership, which crossed the 1 lakh mark.\nThis came a day after Prime Minister Narendra Modi formally inaugurated the complete 82-km Delhi-Meerut corridor and the new Meerut Metro link, marking the first full day of commercial services on the entire stretch.\nThe National Capital Region Transport Corporation had earlier said, \"On Monday, with the last train scheduled to depart at 10 pm, NCRTC expects the total ridership to surpass 1 lakh commuters.\"\nThis was the highest ridership recorded on the corridor so far, the corporation said.\nA video from Begumpul station in Meerut showed passengers eager to experience the new service. Large crowds were seen gathering on the spacious concourse early in the day, with many families and young people taking selfies and photos inside the train and station.\nAnother video showed commuters chanting \"Bharat Mata ki Jai\" while taking their first ride on the Meerut Rapid train, reflecting the festive mood among passengers.\nSome commuters were also seen scattering flower petals on the platform as the RRTS train approached, while others waved enthusiastically.\nThe visuals showed orderly queues at ticket counters and platform entrances, with station staff assisting first-time riders and explaining safety protocols.\nMr. Modi on Sunday inaugurated the remaining sections of the RRTS—the 5-km stretch between Sarai Kale Khan and New Ashok Nagar in Delhi and the 21-km extension from Meerut South to Modipuram in Uttar Pradesh.\nDesigned for speeds of up to 180 kmph, the Namo Bharat system is aimed at significantly reducing travel time between Delhi and key urban centres such as Sahibabad, Ghaziabad, Modinagar and Meerut.\nrailway",
        "link": "https://www.thehindu.com/news/national/meerut-namo-bharat-train-crosses-1-lakh-riders-on-first-full-day-after-launch/article70669598.ece",
        "date": "Tue, 24 Feb 2026 08:55:56 +0530",
        "fetched_at": "2026-02-24 04:00:02.245302"
    },
    {
        "title": "On the independence of the Election Commission",
        "content": "Activists from various groups stage a protest against the SIR at Freedom park in Bengaluru on February 7.\n| Photo Credit: ALLEN EGENUSE. J\nFree and fair elections are key to a successful and vibrant democracy, a maxim included in the Basic Structure of the Constitution via  Indira Gandhi versus Raj Narain (1975). However, in recent times, the fairness of the electoral process in India has been under question for many reasons, culminating in  a resolution by the Opposition alliance to remove the Chief Election Commissioner (CEC). These controversies centre around the issue of alleged ‘vote theft’, and the manipulation of electoral rolls  in the much-talked about Special Intensive Revision (SIR).\nIt has been alleged that the Election Commission (EC) has allowed massive irregularities in voter lists, specifically targeting minority and Opposition-supporting voters. It was alleged  that the SIR in Bihar was rushed and designed to delete voters in order to target minorities. The names of approximately 65 lakh voters have been deleted during the SIR exercise which was challenged in the Supreme Court.\nThis is quite a  casual way of doing away with a citizen’s ‘right to vote’. Adult franchise as provided in Article 326 of the Constitution is the bedrock of democracy. Any procedural impropriety would affect its merit and sanctity.\nThe process of appointing election commissioners had caused  controversy when the Government passed the Chief Election Commissioner and other Election Commissioners (Appointment, Conditions of Office and Terms of Office) Act, 2023, which regulates the appointment and removal of the CEC and election commissioners, replacing the 1991 Act. The 2023 Act stipulates that election commissioners should be appointed by the President based on a selection committee comprised of the Prime Minister, a Union Minister and the Leader of Opposition. It was alleged that the passing of the Act was in contravention of the decision of the Supreme Court in Anoop Baranwal versus Union of India, 2023 in which the Court held that the Chief Justice of India should also be included in the committee.  However, this provision was removed which created a controversy on the grounds that the independence of the EC would be adversely affected. The Act has been challenged again in Jaya Thakur versus Union of India, 2024. The next hearing for the same  is scheduled for March 2026.\nThe Constitution of India, under Article 324, provides for a permanent Election Commission with powers of superintendence, direction and control of the elections of the President, Vice-President, Parliament and of the legislature of the States. This constitutional basis and permanency of the Commission creates a background for its independence. The 2023 Act provides that the CEC will hold office for six years or until the age of 65, whichever is earlier. By far the most significant provision ensuring independence of the EC is the provision for the removal of the CEC and other election commissioners. Clause (5) of Article 324 says that the CEC can be removed only in the manner  prescribed for the removal of a Supreme Court judge under Article 124(4), which are either proved misbehaviour or incapacity. Under Article 324(5), the CEC’s conditions of service cannot be varied to their disadvantage during their tenure.\nThe removal of other election commissioners is done by the President on the advice of the CEC. However, the Supreme Court in Vineet Narain versus Union of India, 1997 held that the CEC shall not give his advice suo motu. This provision strikes a balance between the executive power and the independence of the election commissioners.\nArticle 324 provides for an EC with a CEC and other commissioners, and also includes a provision for regional commissioners. In 1989, the commission was made multi-member but the two additional posts were abolished in 1990. Again on October 1, 1993 after drawing strength from clause (2) of Article 324, it was made a multi-member commission permanently which was validated by the Supreme Court in T. N. Seshan versus Union of India (1995).\nInterestingly, Clause (3) of Article 324 provides that when any  Election Commissioner is so appointed the CEC, he/she shall act as the Chairman of the EC.  The language of Article 324 makes it crystal clear that the CEC is appointed and commissioned as the commissioner  having certain exclusive powers, and in case of making the Commission multi-member, he shall preside over the meeting as its chairman. The idea behind this provision is to ensure that the conduct of elections is done by an administrator and at the same time to make the decision of the Commission consensus-based or democratic. Such provisions also ensure the independence of this constitutional body.\nThe procedure to remove the CEC is very complex and rigorous. It is a quasi-judicial Parliamentary procedure. The complexity of the process ensures its independence from any possible arbitrary action by the government. While the Representation of the People Act of 1950 and 1951 focuses on electoral procedures, voter registration, and candidate qualifications, Section 11 of the CEC and other ECs (Appointment, Conditions of Service and Terms of Office) Act, 2023 gives the procedure to remove the CEC and other Commissioners.\nFor the removal of the CEC, Article 324 (5) shall be read with Article 124(4) in order to understand the grounds for removal and the procedure.\nSection 3 of the Judges (Inquiry) Act, 1968, deals with the investigation into misbehaviour or incapacity by a commission member. It says that if notice is given to the Lok Sabha, at least 100 members must sign, while in the case of the Rajya Sabha, the minimum number of signatories to such a motion shall not be less than 50. Following this, the Speaker or, as the case may be, the Chairman may admit or refuse the motion.\nThe Speaker or Chairman thereafter constitutes a three-member committee comprising the Chief Justice of India or a Supreme Court Judge, the Chief Justice of a High Court and a distinguished jurist.\nIn order to ensure coordination between the two Houses of Parliament, a provision is made that if the notice is given to both Houses on the same day, the committee shall be constituted only after both Houses accept the motion.\nFurther, definite charges must be framed and communicated on which investigation needs to be conducted. The CEC should be given reasonable time and opportunity to present his statement of defence.  This is a provision which ensures the protection of the Doctrine of Natural Justice by way of protecting the ‘Rule of Fair Hearing’.  This is again one of the most significant features of India’s Constitution. In the case of allegations of any physical or mental incapacity, medical examination by a medical board appointed by the Speaker or Chairman, as the case may be, needs to be conducted.\nThough the Opposition has said that it will adopt democratic tools to move the motion against  the CEC, it is unlikely to get passed as the ruling alliance holds sufficient majority in Parliament. The ruling government has rejected the allegations of any bias. The moot point is that constitutional bodies must be well-respected by all, be it citizens, ruling parties or the Opposition; otherwise, it sends a wrong signal to the masses across the country.\nAll political parties need to consider that constitutional or statutory bodies operate according to the provisions provided in the Constitution or in the respective statutes. While dissent against the actions of such bodies is not wrong, it should also be considered that the politicisation of the Constitution or constitutional bodies would be detrimental to  Indian democracy.\nThe political safeguard provided by the Constitution must be taken care of and any dilution would be politically sensitive mainly because it would affect fairness in the electoral process and in the balance of power between the Government and independent and credible democratic institutions. The rule of thumb in Indian democracy is that it thrives on a blend of liberality and command, by balancing the authority of the state with the liberty of its citizens.\nC.B. P Srivastava is President, Centre for Applied Research in Governance, Delhi.\nText and Context\n/\nThe Hindu Explains\n/\nlaws\n/\nparliament\n/\nconstitution",
        "link": "https://www.thehindu.com/news/national/on-the-independence-of-the-election-commission/article70666857.ece",
        "date": "Mon, 23 Feb 2026 22:38:56 +0530",
        "fetched_at": "2026-02-24 04:00:02.897621"
    },
    {
        "title": "Rally held to urge political parties to add Tamil language conservation in their election manifestos",
        "content": "Under the banner of World Tamil Conservation Collective, the members took out the rally on Saturday to mark International Mother Language Day.\n| Photo Credit: Special Arrangement\nTamil scholars, linguists, practitioners, writers, teachers, and people from various walks of life participated in a rally urging political parties to add conservation of Tamil language and culture as part of their election manifestos.\nUnder the banner of World Tamil Conservation Collective, the members took out the rally on Saturday to mark International Mother Language Day. Among the demands of the Collective was a push for mother tongue as the medium of instruction in schools across the country, temple rituals in Tamil Nadu to be conducted in Tamil, and Tamil to be included as a compulsory subject at all colleges.\nTamil will forever remain my breath, says Kamal Haasan\nAmong those present were Ramananda Kumaragurupara Adigal of Gowmara Madalayam Coimbatore and C. Subramaniam, former vice chancellor or Tamil University and the first Coordinator of the Collective.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/rally-held-to-urge-political-parties-to-add-tamil-language-conservation-in-their-election-manifestos/article70668045.ece",
        "date": "Tue, 24 Feb 2026 08:40:23 +0530",
        "fetched_at": "2026-02-24 04:00:03.543565"
    },
    {
        "title": "Punjab government announces ‘Meri Rasoi’ scheme; Akali Dal terms it poll gimmick",
        "content": "Chief Minister of Punjab Bhagwant Mann. File picture\n| Photo Credit: ANI\nAhead of the upcoming Assembly elections in Punjab, due in early 2027, the Aam Aadmi Party government in the State on Monday (February 23, 2026) announced to provide wheat, sugar, oil and salt to families covered under the National Food Security Act (NFSA), even as the Shiromani Akali Dal (SAD) termed it another attempt to trick the people in the run up to the impending polls.\nThe decision was taken in the cabinet meeting held here, under the chairmanship of Chief Minister Bhagwant Mann. Talking to media persons, he said under ‘Meri Rasoi Yojna’, 40 lakh families will receive free quarterly food kits starting April, in addition to wheat provided under the National Food Security Act.\n“Under this scheme, the State government will provide food kits to 40 lakh families. Each kit will contain two kilograms of lentils, two kilograms of sugar, one kilogram of salt, 200 grams of turmeric powder and one litre of mustard oil for monthly consumption. These food kits will be provided in addition to the wheat already being distributed to eligible beneficiaries under the National Food Security Act,” he said.\nTerming the announcement of the new scheme as a part of the AAP’s tricks, SAD president Sukhbir Singh Badal said the people of Punjab understand the AAP’s tricks very well. “They are aware that this is also another false promise made in an election year, which will never be fulfilled, just like after 48 months, having Rs 1,000 in every woman’s account is still a dream!,” he said in a statement.\nPunjab",
        "link": "https://www.thehindu.com/news/national/punjab/punjab-government-announces-meri-rasoi-scheme-akali-dal-terms-it-poll-gimmick/article70667799.ece",
        "date": "Tue, 24 Feb 2026 01:36:28 +0530",
        "fetched_at": "2026-02-24 04:00:04.189831"
    },
    {
        "title": "Herders fined ₹10 lakh for grazing sheep in Kawal Tiger Reserve",
        "content": "The Forest Department has imposed a compounding fine of ₹10 lakh on two groups of sheep herders from Gujarat for letting around 600 migratory herds of sheep to illegally graze in the Kawal Tiger Reserve, damaging a large tract of plantation in the reserve forest area in Utnoor division of Adilabad district.\nActing on specific information from the local villagers about illegal sheep grazing by some non-locals, a team of forest officials rushed to the site and found a group of sheep herders using the plantation area for settling, grazing and lopping. A detailed investigation revealed that the sheep herders from Gujarat’s Kutch region had been staying in the forest area for the past few days with a large number of sheep and five camels, according to forest officials.\nIt was found that the 70-hectare plantation taken up in the Sirchelma section had been badly damaged. Grassland developed to increase the herbivorous population and prey base for tigers was also found to be damaged. A herd of 600 goats was driven away from the forest area by the staff to avoid further damage to the forest.\nJadhav Karan Singh and Jadhav Rama, both from Gujarat, were arrested with their separate herds of sheep. A total of ₹10 lakh (₹5 lakh each) was collected as compounding fees.\nIn a statement, Adilabad District Forest Officer Prashanth Bajirao Patil said illegal grazing of goats and sheep, and lopping, is a punishable offence under the Forest Act with three years of punishment. To report any incident of illegal sheep grazing or any forest offence, contact toll free number 1926, 8004255364.",
        "link": "https://www.thehindu.com/news/national/telangana/herders-fined-10lakhfor-grazing-sheep-inkawaltiger-reserve/article70667925.ece",
        "date": "Tue, 24 Feb 2026 00:55:20 +0530",
        "fetched_at": "2026-02-24 04:00:04.848656"
    },
    {
        "title": "Govt. driving Mana Ooru–Mana Badi contractors to distress: Harish Rao",
        "content": "HYDERABAD\nFormer Minister and Deputy Floor Leader of BRS in the Assembly T. Harish Rao has demanded that the government clear long-pending bills of civil contractors who executed works under the “Mana Ooru–Mana Badi” programme immediately.\nIn a statement issued after a delegation of the contractor met him here on Monday, Mr. Harish Rao said the continued delay would push small contractors into financial distress and in some cases to tragic ends. The delegation explained their plight due to non-payment of dues by the government.\nMr. Harish Rao said the “Mana Ooru–Mana Badi” programme was launched by the previous BRS government to improve infrastructure and basic amenities in government schools.\n“After the change of the government, about 1,500 small contractors have not received a single rupee for the works completed. Many of them had borrowed money on interest to complete the works and are now unable to repay loans. It is sad that some of them have succumbed due to debt pressure and lost their lives,” he said.\nDespite repeated representations made at Prajavani, making rounds to the Education Department offices and requests for appointment with the Chief Minister and Deputy Chief Minister, the contractors had not received any response so far, the BRS leader said.",
        "link": "https://www.thehindu.com/news/national/telangana/govt-driving-mana-oorumana-badi-contractors-to-distress-harish-rao/article70667940.ece",
        "date": "Tue, 24 Feb 2026 00:50:26 +0530",
        "fetched_at": "2026-02-24 04:00:05.497075"
    },
    {
        "title": "First-time MLAs’ letter to Congress high command seeking Cabinet berths surfaces",
        "content": "Karnataka Chief Minister Siddaramaiah\nAn undated letter, purportedly signed by 31 first-time Congress legislators demanding at least five Cabinet berths during the proposed reshuffle, surfaced on Monday, even as the Congress government battles an internal crisis over leadership.\nThe letter, believed to be written last year, has been confirmed to be authentic by several legislators who had signed it.\nIt has been addressed to Chief Minister Siddaramaiah, Deputy Chief Minister D.K. Shivakumar, Congress president Mallikarjun Kharge, Leader of Opposition in Lok Sabha Rahul Gandhi, AICC general secretary (organisation) K.C. Venugopal, and AICC general secretary in charge of Karnataka Randeep Singh Surjewala.\nThe letter has been signed by legislators who have identified with camps of both the Chief Minister and the Deputy Chief Minister, as well as those who are believed to be neutral.\nWhile the idea of a Cabinet reshuffle is being apparently pushed by the Chief Minister to send a signal that he is firmly in the saddle, it is believed that the Deputy Chief Minister, who is seeking rotation of power, is opposed to the idea. Currently, of the 34 Cabinet berths, two are vacant owing to the resignations of B. Nagendra and K.N. Rajanna.\nPointing out that 38 first-time legislators have been elected on the Congress ticket, the letter said that none of them had been accommodated during the Cabinet formation. The letter sought Cabinet berths to “young, dynamic and proactive” first-time legislators. It said that accommodating them legislators was not new since in several States, first-time legislators have been made Chief Ministers and cabinet Ministers, and a mix of young and experienced always provides the right balance.\n“All of us are strongly connected to the Congress ideology and strive to ensure clean, transparent and credible governance enabling us to bounce back to power in 2028,” it read.\nHome Minister G. Parameshwara said that the Opposition is raking up the Dalit Chief Minister issue to cover its own shortcomings.\n“Is the Chief Minister not running the administration? He has been discussing with Ministers and officials for the last 12 days on the Budget preparation,” he said, adding that the Opposition is unnecessarily bringing out the Dalit Chief Minister issue.\n“Only the Congress can make a Dalit the Chief Minister. Who else can? The high command will take a decision at the right time,” he said.\nInterestingly, Social Welfare Minister H.C. Mahadevappa on Sunday raised the issue of a Dalit leader being made the Chief Minister, while Chief Minister Siddaramaiah in his note on Sunday had also said that only the Congress could do it.",
        "link": "https://www.thehindu.com/news/national/karnataka/first-time-mlas-letter-to-congress-high-command-seeking-cabinet-berths-surfaces/article70667627.ece",
        "date": "Tue, 24 Feb 2026 00:32:19 +0530",
        "fetched_at": "2026-02-24 04:00:06.139549"
    },
    {
        "title": "No end in sight to govt. doctors’ agitation as conciliatory talks fail",
        "content": "Efforts to resolve the ongoing indefinite strike carried out by the doctors in Government Medical Colleges across the State ended in a nought on Monday, even though the Kerala Government Medical College Teachers’ Association (KGMCTA) met with the Chief Minister as well as the Ministers of Health and Finance separately.\nKGMCTA later said that apart from reiterating the sad financial plight of government and pointing towards “legal hurdles” that are standing in the way of paying pay revision arrears to doctors, no assurances had been given to the doctors regarding the demands they had raised.\nThe strike boycotting all outpatient as well as inpatient care services and non-emergency surgeries which entered the eighth day on Monday, will continue.\nHowever, a final decision on the strike and how to take the doctors’ protests forward, will be taken at a meeting of the central executive committee of KGMCTA, being held later during the day.",
        "link": "https://www.thehindu.com/news/national/kerala/kgmcta-to-take-a-call-on-taking-the-strike-forward/article70668260.ece",
        "date": "Tue, 24 Feb 2026 00:49:24 +0530",
        "fetched_at": "2026-02-24 04:00:06.783247"
    },
    {
        "title": "Cabinet gives its nod for completing takeover of metro rail phase one before March 31",
        "content": "The State government has decided to completely take over the operation and maintenance of the Hyderabad Metro Rail first phase presently spanning 69 km.\nThe government has set March 31 as the deadline for completing the process in this direction. The State Cabinet which met here on Monday deliberated on the issue during its marathon session and decided to discuss the issue in the upcoming budget session of the Legislative Assembly starting March 16. “The Opposition parties can give their suggestions on the takeover as also the steps that should be taken to go ahead with the second and third phases of the metro rail,” Revenue Minister Ponguleti Srinivasa Reddy said.\nThe State had decided to take up the second and third phases in collaboration with the Central Government and the latter had appointed UP Metro Rail Corporation managing director as a member of the high level committee constituted to recommend the way forward in completion of the takeover.\nThe Cabinet has approved, what it called, a unique health and insurance coverage scheme for its more than 7.56 lakh staff, including the contract and outsourcing employees. Employees would be provided free treatment and other services at the 652 empanelled private hospitals in different parts of the State. It was decided to provide ₹1.25 crore as compensation to employees who meet with accidental deaths while a compensation of ₹10 lakh would be given to staff in harness who meet untimely death before retirement.\nTowards this end, it was decided to deduct 1.5% of the basic salary from employees and the government would contribute an equal amount as its share. “The deduction of 1.5% of basic comes to ₹528 crore and the government’s equal share will take the corpus to ₹1,056 crore,” the Minister said. The amount would be deposited in a trust to be constituted soon so that employees are provided cashless treatment.\nThe Cabinet has also decided to constitute a new directorate of secondary health that would be entrusted with the responsibility of recommending measures for improving facilities as well as installing latest equipment in State-run hospitals from the village level to district level. This was in addition to the constitution of a high power committee headed by Health Minister C. Damodar Narasimha and comprising experts like Nori Dattatreyudu and Srinath Reddy to suggest concrete measures for providing effective treatment, including for chronic diseases to the common man.\nThe Cabinet has also approved renovation of pipelines and treatment plants supplying water from Manjira and Osmansagar as they are in a dilapidated condition. With 42 acre of defence land required for expansion of the Hyderabad Karimnagar highway, it was decided to hand over 153 acre of land to the Defence Ministry in lieu of the 43 acres. The Cabinet had approved setting up of a fruit market with international standards at Koheda on the city outskirts and has approved alienation of over 200 acres towards this end. The land in the possession of the government would be transferred to the TGIIC for taking the plan forward.",
        "link": "https://www.thehindu.com/news/national/telangana/cabinet-gives-its-nod-for-completing-takeover-of-metro-rail-phase-one-before-march-31/article70668534.ece",
        "date": "Mon, 23 Feb 2026 23:48:41 +0530",
        "fetched_at": "2026-02-24 04:00:07.421864"
    },
    {
        "title": "156 MLAs and MLCs to take part in A.P. Legislature Sports",
        "content": "SAAP chairman A. Ravi Naidu, along with MLAs Sundarapu Vijay Kumar, Bojjala Sudhir Reddy, MLC Kalyan Chakravarthy Assembly Legislature Secretary General Prasanna Kumar Suryadevara and others, addressing the press at IGMC stadium in Vijayawada on Monday.\n| Photo Credit: K.V.S. GIRI\nThe Andhra Pradesh Legislature Sports-2026 will be conducted over three days, beginning on Tuesday (February 24, 2026), with the objective of fostering team spirit and camaraderie among public representatives, said Sports Authority of A.P. Chairman A. Ravi Naidu.\nAddressing the media at Indira Gandhi Municipal Corporation (IGMC) stadium in Vijayawada on Monday (February 23) Mr. Ravi Naidu said that the competitions would be held in 14 categories, including cricket, kabaddi, volleyball, tug of war, athletics, badminton, chess, and carroms.\nA total of 156 MLAs and MLCs will participate in the event, to be inaugurated by Assembly Speaker Ch. Ayyanna Patrudu on Tuesday. The competitions will be held at IGMC and Dandamudi Rajagopala Rao Indoor Stadium in the city, Mr. Ravi Naidu said.\nChief Minister N. Chandrababu Naidu, Deputy Chief Minister K. Pawan Kalyan, HRD Minister N. Lokesh are expected to participate in the inaugural event.\nIn cricket, six teams, under the captaincy of TDP State president Palla Srinivasa Rao, Ministers Nadendla Manohar,(Civil Supplies), Satya Kumar Yadav (Health), Kolusu Parthasarathy (Housing), Kollu Ravindra (Excise ), and K. Atchannaidu (Agriculture).\nEarlier today, the 87th board meeting of SAAP was held, during which key decisions were taken regarding the welfare of athletes, coaches, and the overall development of sports in the State. The A.P. Sports Academy being established in Visakhapatnam has been named Kodi Rammurthy Academy, the one in Kakinada has been named NTR Academy, the academy in Tirupati has been named after Karanam Malleswari, and the one in Guntur has been named Acharya Nagarjuna Academy.\nDuring the meeting, the SAAP also decided to submit proposals to the State government to increase the honorarium of coaches holding diploma from NIS (National Institute of Sports). Non-NIS Diploma coaches will be recognised as junior coaches and paid an honorarium of ₹21,500, the board decided.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/156-mlas-and-mlcs-to-take-part-in-ap-legislature-sports/article70668032.ece",
        "date": "Mon, 23 Feb 2026 23:16:01 +0530",
        "fetched_at": "2026-02-24 04:00:08.092298"
    },
    {
        "title": "RSS-backed trade union to launch nationwide protest against Centre over workers’ issues on February 25",
        "content": "RSS-backed Bharatiya Mazdoor Sangh (BMS) has decided to launch protests against the labour policies of the Union and State governments in every district across the country on Wednesday (February 25, 2026). The BMS has demanded that the Centre urgently convene Indian Labour Conference — involving the government, employers, and workers — to discuss workers’ issues and the implementation of the four Labour Codes.\nTalking to reporters in New Delhi on Monday (February 23, 2026), BMS leaders Pawan Kumar and Ravindra Himte said the Union government had assured the BMS that it would make amendments to the Code on Industrial Relations and the Code on Occupational Safety, Health and Working Conditions in the second lap of the Budget Session beginning on March 9. “We have conveyed our apprehensions about certain provisions in both the Codes. The government has assured that our concerns will be addressed,” Mr. Kumar said.\nMr. Kumar said the protest is against the neglect of workers’ issues by the government. “Take the case of Heavy Engineering Corporation in Ranchi. There are about 3,500 workers in the HEC and they have not received salary for the last 32 months. The Prime Minister says our indigenous Brahmos missile will be exported to various countries. But what about the workers in HEC who make components of Brahmos,” he asked.\nMr. Kumar also raised the case of mid-day meal workers, saying that the workers who make nutritious meals for students are malnourished due to the low wages they get. “Lakhs of mid-day meal workers and ASHA workers continue to receive a meagre honorarium. Even after five decades of service, Anganwadi workers are still treated merely as scheme workers, despite being compelled to work for more than 10 hours a day, with an ever-increasing workload. The Ministry of Women and Child Development has been reluctant to enhance the honorarium, while continuously assigning additional responsibilities,” the BMS leader added.\nOn cotton industry, Mr. Kumar said the country has plenty of input materials available but the government is not opening the mills of the National Textile Corporation in eight States. “Now, the government has allowed import of cotton with zero duties, but why is there a delay in opening these mills? Workers in these mills have been receiving only 50% wages since the pandemic, with salaries pending for the last 10 months,” Mr. Kumar said.\nThe BMS also demanded that the Centre withdraw the draft Electricity (Amendment) Bill. “The electricity employees throughout the country are fighting relentlessly to keep distribution companies only in the government sector and not hand them over to private players,” he said.\nThe BMS’s other demands include strict and universal implementation of labour laws across all sectors and categories of workers, increase in minimum pension under the Provident Fund pension from ₹1,000 to ₹7,500 a month, enhancement of threshold limits for coverage under Employees State Insurance and PF to ₹42,000 and ₹30,000 respectively, increase in the eligibility ceiling for bonus under the Payment of Bonus Act, 1965, in line with the present wage levels, regularisation of scheme workers and contract workers and lifting of the ban on general recruitment, and guaranteed employment with job security.\nemployment\n/\nlabour",
        "link": "https://www.thehindu.com/news/national/rss-backed-trade-union-to-launch-nationwide-protest-against-centre-over-workers-issues-on-february-25/article70667907.ece",
        "date": "Mon, 23 Feb 2026 22:43:16 +0530",
        "fetched_at": "2026-02-24 04:00:08.726979"
    },
    {
        "title": "IDFC First Bank fraud case flagged in Haryana Assembly",
        "content": "Congress leader and Leader of Opposition in the Haryana Assembly Bhupinder Singh Hooda speaks during the Budget session of the State Assembly, in Chandigarh, on February 23, 2026.\n| Photo Credit: PTI\nA day after the IDFC First Bank Limited revealed a ₹590 crore fraud linked to the Haryana government’s accounts, the Opposition Congress party on Monday (February 23, 2026) flagged the issue during the ongoing Budget session in the State Assembly, even as Chief Minister Nayab Singh Saini said that a detailed probe had been ordered in the case.\nThe alertness of State government departments had shed light on the issue, following which the government had immediately de-empanelled IDFC First Bank, the Chief Minister said. “The statements provided by the bank did not match the records maintained by the concerned departments. The case has been handed over to the Anti-Corruption Bureau, and directions have also been issued to constitute a High-Level Committee to conduct a detailed probe,” the CM told the House.\nBank staff colluded with outsiders in ₹590 crore fraud case: IDFC FIRST Bank MD\nRBI watching development around IDFC First Bank fraud, no systemic issue: Governor Malhotra\nIDFC FIRST Bank discloses ₹590 crore fraud at Chandigarh branch\nIDFC First Bank had written to the Securities and Exchange Board of India acknowledging irregularities committed by certain bank employees, Mr. Saini said, adding that the bank has also initiated action against the employees concerned. “An FIR (First Information Report) has been registered in connection with the irregularities detected in the bank’s transactions. The bank wrote a letter in this regard on February 21. However, even before the government had taken cognisance of the matter, and on February 18 de-panelled the bank, [the government] directed that the entire amount, along with interest, be transferred to a nationalised bank. The money is completely safe. Every single rupee will be recovered,” he said.\n“The investigation will determine whether the irregularity was committed by a bank employee or whether it involved any other individual,” he added.\nThe practice of departments keeping funds in banks was not new, he said. “Even during the Congress’s tenure, departmental funds were kept in banks. Banks are empanelled from time to time, and new banks continue to be added,” he said.\nEarlier, the Leader of the Opposition in the State Assembly, Congress’s Bhupinder Singh Hooda, raised the issue pertaining to the IDFC First Bank. “It is a massive scam, carried out by manipulating the accounts of 18 government departments,” Mr. Hooda said.\nHe also raised the issue of the MGNREGA (Mahatma Gandhi National Rural Employment Guarantee Act) scheme being replaced by the Central government. “During the Congress government, workers in Haryana were paid the highest wages in the country. However, as soon as the BJP (Bharatiya Janata Party) came to power, it attacked the rights of workers. After coming to power, the BJP set about weakening the MGNREGA,” Mr. Hooda said.\nHaryana",
        "link": "https://www.thehindu.com/news/national/haryana/idfc-first-bank-fraud-case-flagged-in-haryana-assembly/article70668209.ece",
        "date": "Mon, 23 Feb 2026 22:12:20 +0530",
        "fetched_at": "2026-02-24 04:00:09.413878"
    },
    {
        "title": "Pinarayi inaugurates new multi-storied building of RCC",
        "content": "Chief Minister Pinarayi Vijayan  inaugurating the new multi-storied building of the Regional Cancer Centre in Thiruvananthapuram on Monday.\n| Photo Credit: -\nThe government has intervened in the best of manner to ensure that all modern cancer care facilities have been made available in the public sector, Chief Minister Pinarayi Vijayan has said.\nHe said that several advanced medical technologies, including the first robotic surgery unit in the public sector, HIPEC treatment system, clinical laboratory tracking system, and surface-guided radiation therapy used in radiation treatment are now available at the Regional Cancer Centre.\nThe government has established sophisticated facilities, including cath labs, Gallium Scan, PET-CT Scan, KV imaging-enabled Ring Gantry Linear Accelerator, advanced brachytherapy machine for prostate cancer treatment, digital mammography machine, and paediatric autologous stem cell transplant services at RCC, Mr. Vijayan said.\nHe was speaking after inaugurating the new multi-storey building at RCC and the new Kerala Centre for Disease Control (K-CDC) facility.\nThe new building, constructed at a cost of ₹242 crore, with a built-up area of 3,30,117 sq ft, was an imperative to reduce overcrowding and provide better treatment facilities to the 2.5 lakh-odd patients seeking care at RCC annually.\nThe new building adds 200  extra patient beds as well as  two levels of parking  facilities also. The building has been constructed in compliance with green protocols and utilises solar energy as far as possible.\nRCC has also been allotted 12 acres at Pulayanarkotta for setting up a second campus\nHealth Minister Veena George, who presided over the function, said that over 2,000 beds were available for cancer care in the public sector now.\nMinister for General Education V. Sivankutty, Kadakampally Surendran, K. Ansalan, and C.K. Hareendran, all MLAs and senior Health officials were present.",
        "link": "https://www.thehindu.com/news/national/kerala/pinarayi-inaugurates-new-multi-storied-building-of-rcc/article70668128.ece",
        "date": "Mon, 23 Feb 2026 21:43:42 +0530",
        "fetched_at": "2026-02-24 04:00:10.045691"
    },
    {
        "title": "Telangana Budget session to start from March 16",
        "content": "The legislature is likely to witness the passage of legislation replacing ordinances, and these include the trifurcation of the Greater Hyderabad Municipal Corporation into three separate entities.\n| Photo Credit: File photo\nThe Budget Session of the State Legislature will start from March 16.\nThe session will start with the traditional address by Governor Jishnu Dev Varma and this will be followed by the meeting of the Business Advisory Committee of the Legislature to decide about the agenda and the duration of the session.\nDeputy Chief Minister Mallu Bhatti Vikramarka, who holds the Finance portfolio, will present the annual financial statement and budget for the year 2026-27 on March 20. The session will be adjourned sine die after the discussion on the demands for grants. The State Cabinet, which met here on Monday under the chairmanship of Chief Minister A. Revanth Reddy has finalised the dates for the all important budget session at its marathon meeting.\nWith the dates for the assembly finalised, all eyes are on the allocations that would be made to individual departments. The budget for the next financial year is likely to be focused on welfare and development, with a major chunk of funds likely to be earmarked for irrigation, panchayat raj, municipal administration and agriculture. It would be interesting to watch how the State will strike a balance between welfare and development, given the disappointment it had expressed over the allocations in the Union Budget.\nWith the Chief Minister particularly keen on launching the Musi riverfront development project and the government commencing land acquisition for the project, significant allocations are likely to be made for the project as well as for the development of the areas abutting the Musi river. It may be recalled that the government had allocated ₹1,500 crore in the current fiscal, of which it had released ₹375 crore for Musi Riverfront Development Corporation Limited towards land acquisition and other costs.\nThe legislature is likely to witness the passage of legislation replacing ordinances, and these include the trifurcation of the Greater Hyderabad Municipal Corporation into three separate entities. The two new entities have been proposed with over 70 wards each in addition to the 150 wards in the GHMC, whose limits are likely to be confined to Hyderabad city, so as to give boost to development in the peripheral areas.",
        "link": "https://www.thehindu.com/news/national/telangana/budget-session-of-legislature-to-start-from-march-16/article70668152.ece",
        "date": "Tue, 24 Feb 2026 07:37:17 +0530",
        "fetched_at": "2026-02-24 04:00:10.686540"
    },
    {
        "title": "Senior academicians call IYC protest at AI summit ‘profoundly regrettable and ill-conceived’",
        "content": "In this image posted on February 20, 2026, Indian Youth Congress workers stage a protest during the India AI Impact Summit 2026 at Bharat Mandapam, in New Delhi. X/@IYC via PTI\nTerming the “shirts-off” protest by the Indian Youth Congress (IYC) workers at the AI Impact Summit “profoundly regrettable and ill-conceived”, 160 senior academicians have said that the incident is a reflection of its “inability to distinguish between legitimate democratic dissent and the imperative of safeguarding national prestige on a global stage”.\nAmong the signatories of the joint statement are JNU Vice-Chancellor Santishree Dhulipudi Pandit, IIT Roorkee Director Kamal Kishore Pant, IIT Dharwad Director Venkappayya R Desai, and IIT Jodhpur Director Avinash Kumar Agarwal.\nStating that the India AI Impact Summit marked a defining “national and civilisational moment”, the academicians said it was India’s clear declaration to the world that the country had emerged as a serious and sovereign technological power in the era of the Fourth Industrial Revolution.\n“The recent protest by the Indian Youth Congress at the India AI Impact Summit is profoundly regrettable and ill-conceived. This was neither a partisan platform nor a venue for domestic political propaganda. It was an international forum where India was presenting its technological capabilities, strategic vision and national potential before the world,” said the statement.\nIt said that converting such a moment into an “occasion for political demonstration” reflected a serious lack of judgment and “an inability to distinguish between legitimate democratic dissent and the imperative of safeguarding national prestige on a global stage”.\nNoting that in the summit, 644 AI technologies were showcased and 41 CEOs of global technology giants participated, the academicians said the event hosted 326 exhibitors from 37 countries and drew nearly five lakh visitors, making it one of the largest technology gatherings of its kind. “Most significantly, the event resulted in investment commitments worth $250 billion, underlining tangible global trust in India’s technological future,” it said.\n“The protest associated with Rahul Gandhi conveyed an unfortunate impression at a time when global investors and technology leaders were assessing India’s credibility as a long-term partner in AI and advanced technologies. As a Member of Parliament, there exists a constitutional responsibility to distinguish between constructive democratic critique and actions that may inadvertently weaken India’s international standing,” said the statement.\nThe signatories also expressed concern that the “approach adopted by the Indian National Congress did not adequately reflect the broader national interest during such a significant global engagement”.\n“At a time when adversarial countries such as China and Pakistan publicly questioned or sought to diminish the importance of the summit, any domestic political conduct that appears to reinforce those narratives invites serious scrutiny. India’s progress in AI is the collective outcome of its scientists, engineers, entrepreneurs, institutions, universities and policy frameworks,” they said.\nThe Bharatiya Janata Party (BJP) has demanded an apology from Mr. Gandhi over the “shirts-off” protest, stating that the Congress party’s allies also criticised it.\nAt a press conference on Monday (February 23, 2026), BJP national spokesperson Sudhanshu Trivedi referred to the remarks of Samajwadi Party’s Akhilesh Yadav made in Uttar Pradesh’s Jhansi on Saturday, reportedly stating that the Congress should have refrained from doing anything that brought shame to the country in front of foreign delegates.\ntechnology (general)\n/\neducation",
        "link": "https://www.thehindu.com/news/national/senior-academicians-call-iyc-protest-at-ai-summit-profoundly-regrettable-and-ill-conceived/article70667528.ece",
        "date": "Mon, 23 Feb 2026 21:30:22 +0530",
        "fetched_at": "2026-02-24 04:00:11.327497"
    },
    {
        "title": "IIM Tiruchi bags Institutional Excellence Award for project management",
        "content": "The Indian Institute of Management-Tiruchi (IIM-T) has been conferred the prestigious Institutional Excellence Award 2025 by Project Management Associates India (PMA India), the Indian member association of the International Project Management Association (IPMA).\nAccording to an official press release, the award was presented at the IPMA Global Project Profession Forum 2026, held recently in Chennai.\nSatish S. Maheswarappa, Dean (Academics), received the award on behalf of the institute from Information Technology and Digital Services Minister Palanivel Thiaga Rajan. Senior leaders from IPMA, PMA India, and other dignitaries were present.\nThe award recognises institutions that demonstrate sustained commitment to advancing the discipline and practice of project management through academic rigour, industry engagement, and professional certification outcomes.\nThe institute has consistently integrated conceptual foundations with applied learning, equipping students with globally benchmarked project management competencies.\nIn a step towards strengthening specialised capacity in the infrastructure domain, IIM-T has inaugurated the Post Graduate Certificate Programme in Advanced Infrastructure Project Management, the release added.\nTiruchi\n/\nmanagement institutes\n/\naward and prize",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/iim-tiruchi-bags-institutional-excellence-award-for-project-management/article70667703.ece",
        "date": "Mon, 23 Feb 2026 21:14:41 +0530",
        "fetched_at": "2026-02-24 04:00:11.969594"
    },
    {
        "title": "Karnataka contributes one-fifth to the national bioeconomy: Report",
        "content": "Minister for Information Technology, Biotechnology and Rural Development, Priyank Kharge and others releasing the Karnataka BioEconomy Report 2025 in Bengaluru on Monday.\n| Photo Credit: special arrangement\nKarnataka’s bioeconomy, a $39 billion enterprise, contributes over one-fifth to the national bioeconomy and over 10% to the Gross State Domestic Product (GSDP) as of 2025, observes a newly launched report.\nThe Karnataka BioEconomy Report 2025, prepared by the Association of Biotechnology-Led Enterprises (ABLE) for the Karnataka government, was released on Monday.\nBetween 2023 and 2025, the State’s bioeconomy expanded from $31 billion to $39.2 billion, representing a cumulative rise of 26.5%. The growth has been attributed to a robust biopharmaceutical base, rapid bioindustrial diversification, and strong bioservices integration.\n“Karnataka’s innovation ecosystem — anchored in research institutions, start-ups, and global R&D centres — has transitioned from being research-heavy to production-oriented and globally competitive,” reads the report, which pins the State’s contribution to India’s bioeconomy at 20.63%.\nWhile biopharma has remained the anchor with over 40% share (about $16.44 billion), driven by biologics, biosimilars, vaccines and diagnostics, bioindustrial has emerged as the fastest-growing segment (about $11.46 billion, around 29% share), led by fermentation-based industries, biofuels, enzymes and sustainable materials.\nBioservices has also displayed steady growth, contributing about 25.8% share.\nAccording to the report, Karnataka’s bioeconomy accounted for 10.51% of the GSDP in 2025. This is more than twice the share of the biotech sector to India’s GDP (4.57%).\n“This positions biotechnology not merely a scientific discipline but as an economic pillar central to the State’s development model,” notes the report.\nKarnataka’s biotech start-up ecosystem continued to grow, with 218 new biotech start-ups being added in 2025 alone, marking the highest annual start-up additions in three years. With this, the cumulative number of biotech start-ups in the State stands at 1,451, up from 1,233 in 2024.\nThe State currently holds a 12–13% share of the national biotechnology start-up pool and more than 75% of them startups are focused on life sciences and health-tech. Bengaluru accounts for about 54% of the biotech start-ups.\nMysuru contributes around 8.7% to the bioeconomy of the State, while Belagavi and Dakshina Kannada together account for over 9%.\nOn the investment front, between January 2024 and October 2025, Karnataka attracted $1.14 billion across around 40 deals, spanning biopharma, medtech, precision fermentation, digital health, and agribio.\n“The rapid expansion of biomanufacturing shows a sector moving decisively from research to global-scale production. Continued collaboration between government, industry and academia will be critical to sustaining Karnataka’s leadership in India’s next phase of bio-led growth,” said G.S. Krishnan, honorary president, ABLE.\nPriyank Kharge, Minister for Information Technology, Biotechnology and Rural Development, noted that biotechnology is no longer confined to laboratories, but is now a central driver of economic growth, industrial innovation and societal impact.\n“Our focus is on building a full-spectrum biomanufacturing economy by supporting deep-tech start-ups, strengthening innovation infrastructure, and ensuring that growth reaches beyond Bengaluru to every region of the State,” he said.",
        "link": "https://www.thehindu.com/news/national/karnataka/karnataka-contributes-one-fifth-to-the-national-bioeconomy-report/article70667890.ece",
        "date": "Mon, 23 Feb 2026 21:20:28 +0530",
        "fetched_at": "2026-02-24 04:00:12.630475"
    },
    {
        "title": "Development is not about statistics alone, but uplifting those left behind, says CM",
        "content": "The completion of over five lakh houses under the LIFE Mission scheme and the inauguration of a model rehabilitation township at Kalpetta for families hit by the Wayanad landslides are not just two mere projects, but the fulfilment of the social interventions made to ensure the sustenance of the people and their livelihood, Chief Minister Pinarayi Vijayan has said.\nIn a statement here on Monday, he said as of February 2026, over 6 lakh families have received financial assistance as part of the LIFE Mission housing scheme. More than 5 lakh houses have been completed. Financial assistance to the tune of ₹4 lakh is provided per beneficiary (₹6 lakh for Scheduled Tribe families) who live in difficult terrains. The State government has spent a total of ₹20,831 crore, with the major share borne by the State government.\nFollowing the devastating landslides in the Mundakkai-Chooralmala region of Wayanad in 2024, the State government undertook a comprehensive rehabilitation programme. The official inauguration of the township will be held on March 1. Built on 64.47 hectares, the construction of 178 of the 410 houses planned as part of the project was completed, which will benefit over 1,662 people on its completion.\nThe project includes roads, health centres, anganwadi, market, community facilities, and other infrastructure, and the houses are designed taking into account Wayanad’s terrain and climate and are earthquake-resistant. For the State, the development is not about statistics alone but about uplifting those left behind. These initiatives are also examples of governance rooted in social justice and human dignity, said the Chief Minister.",
        "link": "https://www.thehindu.com/news/national/kerala/development-is-not-about-statistics-alone-but-uplifting-those-left-behind-says-cm/article70667621.ece",
        "date": "Mon, 23 Feb 2026 21:14:09 +0530",
        "fetched_at": "2026-02-24 04:00:13.273907"
    },
    {
        "title": "Local bodies urged to plan projects with environment in mind",
        "content": "National Green Cops (NGC) district coordinator S. Guruvayurappan has urged local self-government institutions to plan all projects with environmentally friendly development in mind.\nSpeaking at a seminar organised by Chittur-Thattamangalam Municipality, he submitted a series of recommendations that would be binding for all local bodies.\nHe suggested that each local body set aside one-third of its land to conserve biodiversity and habitats, using existing protected areas and additional barren, fallow, private or underutilised government lands.\nRoad development should include planting trees, medicinal plants, and shrubs that benefit the public without causing disruption. Proper soil testing can ensure long-lasting roads while reducing the need for stone, sand and bitumen, he said.\nProjects should aim for ‘zero-waste’ villages, providing households with cloth bags and training students in eco-friendly practices. Organic waste can be converted into compost or biogas, while inorganic waste should be reused or collected. Strict measures and fines should control roadside litter, he said.\nMr. Guruvayurappan underscored promoting organic farming, mixed cropping, home gardening and fruit or medicinal gardens with incentives and recognition to encourage chemical-free, healthy food production.\nSmall forests and green spaces should be created across homes, gardens, farms and public areas to protect local flora and fauna. Indigenous trees like karimpana and sandalwood should be conserved alongside initiatives such as sacred groves, medicinal and butterfly gardens, riverside plantations and eco-tourism.\nHe said employment programmes should support village and urban forests, agriculture and environmental protection, while households engage in wastewater treatment and rainwater harvesting. Local self-governments should also provide environmental education as a civic duty, promoting eco-friendly lifestyles, he said.",
        "link": "https://www.thehindu.com/news/national/kerala/local-bodies-urged-to-plan-projects-with-environment-in-mind/article70667981.ece",
        "date": "Mon, 23 Feb 2026 21:08:42 +0530",
        "fetched_at": "2026-02-24 04:00:13.912917"
    },
    {
        "title": "Forest Minister Khandre holds meeting, gives instructions to officers on avoiding human-elephant conflict",
        "content": "Forest Minister Eshwar Khandre.\n| Photo Credit: File Photo\nForest Minister Eshwar Khandre, on Monday, held an emergency meeting via video conference with senior officers of the department and instructed the officials to alert people in the areas bordering forests about the movement of wild elephants.\nThe Minister held the meeting in the wake of two deaths due to elephant attacks within six days in Chikkamagaluru, according to a communique from the Minister’s office.\nMr. Khandre told the officers to form WhatsApp groups of residents and planters in the area bordering forests and alert them about the movement of elephants. “Human life is precious, and the loss of two lives is painful. The officers should ensure such incidents do not repeat,” he said.\nFurther, the Minister told the officers to conduct the elephant capturing operation by clamping prohibitory orders in the area compulsorily to avoid untoward incidents. He also suggested the use of thermal drones to track the movement of the elephants.\nDuring the meeting, the officers stated that after the death of one person on February 16, the department had launched an operation to capture the elephant, and also informed the local planters not to send workers to the estates. However, they ignored the instructions. The Minister told the officers to file complaints against the planters who neglect the instructions.\nAt present, around 35 wild elephants, spread over three groups, have been roaming in parts of Chikkamagaluru district. “It is quite common to expect the wild animals to move out of the forest areas during summer. However, the officers should take all measures necessary to minimise the human-elephant conflict,\" he said.",
        "link": "https://www.thehindu.com/news/national/karnataka/forest-minister-khandre-holds-meeting-gives-instructions-to-officers-on-avoiding-human-elephant-conflict/article70667789.ece",
        "date": "Mon, 23 Feb 2026 20:59:41 +0530",
        "fetched_at": "2026-02-24 04:00:14.549123"
    },
    {
        "title": "Election Commission of India delegation reviews election preparations in Kerala",
        "content": "A delegation from the Election Commission of India holding discussions in Thiruvananthapuram on Monday.\n| Photo Credit: Special arrangement\nThe preparations and logistical and administrative requirements for the seamless conduct of the 2026 Kerala Assembly elections were reviewed by a high-level delegation from the Election Commission of India (EC) in Thiruvananthapuram on Monday.\n​The EC delegation, led by Senior Deputy Commissioners  Pawan Kumar Sharma and Maneesh Garg, along with Deputy Commissioner Sanjay Kumar and Media Director General Ashish Goyal, held discussions with the Chief Electoral Officer (Kerala), State Police Nodal Officer, District Collectors and District Police Chiefs.\n​The EC team evaluated the Special Intensive Revision (SIR) of the electoral roll and other preliminary activities undertaken by the District Election Officers and the police. Addressing the officials, the EC representatives issued specific directives to ensure a flawless and transparent electoral process. ​Highlighting Kerala’s long-standing tradition of peaceful and non-violent polling, the commission emphasised the need to maintain these high standards.\nAt Monday’s meeting, CEO (Kerala) Rathan U. Kelkar  explained the preparations in the State for the smooth conduct of the elections. H. Venkatesh, State Police Nodal Officer, briefed the EC delegation on the law-and-order measures.\nThe delegation directed enforcement agencies to strengthen the operations to curb the flow of illicit liquor, cash and narcotics. The commission mandated the real-time recording of all seizure proceedings to ensure accountability. ​\nThe delegation also met the Chief Secretary, the Home Secretary and the Secretary of the General Administration department.",
        "link": "https://www.thehindu.com/news/national/kerala/election-commission-of-india-delegation-reviews-election-preparations-in-kerala/article70667915.ece",
        "date": "Mon, 23 Feb 2026 20:59:15 +0530",
        "fetched_at": "2026-02-24 04:00:15.187150"
    },
    {
        "title": "Parliamentary Panel Seeks Clarity On Trump’s Tariff Plans; Govt Assures India’s Interests Safe",
        "content": "Recent remarks by US President Donald Trump on imposing fresh global tariffs came up for discussion at a meeting of the Department-related Parliamentary Standing Committee on External Affairs on Monday, prompting members to seek clarity on the potential impact on India’s trade and economic interests.\nThe meeting, convened to examine the Demands for Grants, saw lawmakers across party lines raising questions over Trump’s shifting public positions on tariffs and their possible implications for India.\nMembers asked officials to outline the government’s assessment and preparedness in the event of unilateral trade measures by Washington.\nAccording to sources, officials, including Foreign Secretary Vikram Misri, told the committee that there was no immediate cause for concern, stressing that India’s trade arrangements are the product of detailed negotiations guided strictly by national interest.\nOfficials underlined that any trade engagement with the United States is carefully calibrated to protect domestic industry and strategic priorities.\nSources said the Foreign Secretary also highlighted that the US continues to view India as a major democracy and a trusted strategic partner, noting that bilateral ties remain strong and stable despite periodic policy shifts in Washington.\nThe standing committee is chaired by Congress MP Shashi Tharoor and includes senior parliamentarians from both sides of the aisle.\nMembers present included BJP leaders Ravi Shankar Prasad and Aparajita Sarangi, while opposition representatives such as Asaduddin Owaisi and Akshay Yadav also participated in the discussions.\nOn broader India-US trade engagement, officials told the panel that structured dialogue mechanisms remain in place to address issues related to market access, tariffs and regulatory barriers.\nBoth countries, they said, continue to work towards strengthening trade ties through sustained negotiations aimed at balanced and mutually beneficial outcomes.\nThe concerns come in the backdrop of Trump’s recent statements following a US Supreme Court ruling that struck down tariffs imposed during his administration.\nSoon after the verdict, Trump announced plans to levy a 10 per cent tariff on all imports into the US under a different legal provision, later raising it to 15 per cent.\nThe 15 per cent levy, announced on February 21, represents the maximum tariff permitted under Section 122 of the US Trade Act of 1974, a provision that has rarely been invoked.\nOfficials noted that such tariffs are temporary in nature and can remain in force for only about five months, after which approval from the US Congress would be required.\nThe government reiterated before the committee that any current or future trade understanding with the US would be based on reciprocity and careful assessment, ensuring that India’s economic and strategic interests remain fully safeguarded.\nLatest Blogs",
        "link": "https://www.news18.com/india/parliamentary-panel-seeks-clarity-on-trumps-tariff-plans-govt-assures-indias-interests-safe-9925618.html",
        "date": "Mon, 23 Feb 2026 23:10:27 +0530",
        "fetched_at": "2026-02-24 04:00:17.596747"
    },
    {
        "title": "India's First Prime Minister Wasn't Jawaharlal Nehru, Here's What Happened In 1915",
        "content": "Long before the midnight tryst with destiny in 1947, when Jawaharlal Nehru took oath as independent India’s first Prime Minister, a bold but largely forgotten experiment in self-rule had already been attempted far from home.\nIn the middle of the First World War, on December 1, 1915, a group of Indian revolutionaries proclaimed the formation of the Provisional Government of India in Kabul, staking a claim to complete independence decades before it was realised.\nAt the height of World War I, with the British Empire deeply engaged on multiple fronts, revolutionaries sought to internationalise their struggle. In Kabul, they announced what they described as the first “Provisional Government of India\" (Hukumat-e-Mukhtara-e-Hind), an exile administration aimed at rallying global support against British rule.\nThe government was led by two prominent figures. Raja Mahendra Pratap Singh was declared President, while Maulana Barkatullah, also known as Barkatullah Bhopali, became Prime Minister. Maulana Ubaidullah Sindhi, a noted scholar associated with Deoband, was appointed Home Minister.\nRaja Mahendra Pratap had travelled widely to secure support for India’s cause and met Germany’s Kaiser Wilhelm II during the war. With German backing, he reached Afghanistan, then seen as a strategic gateway to India’s northwest frontier. Kabul offered both symbolic and geopolitical significance, a base outside direct British control, yet close enough to signal intent.\nMaulana Barkatullah, a scholar and seasoned political activist, had earlier campaigned for India’s freedom in countries including the United States and Japan. In Kabul, he worked to articulate the government’s position to foreign powers and mobilise diplomatic recognition. The administration reportedly received assurances of support from countries aligned against Britain, including Germany and the Ottoman Empire. There were even discussions about issuing independent Indian passports and postage stamps, powerful symbols of sovereignty.\nHistorians note that the Kabul government’s objective was clear: to demonstrate that Indians were prepared to govern themselves and to seek international backing for an armed uprising against the British, leveraging the global conflict. Letters were sent to rulers and heads of state across Asia and Europe, urging them to support India’s liberation.\nAlthough the experiment was short-lived, the end of World War I and shifting diplomatic alignments undercut its prospects; it marked one of the earliest organised attempts to establish an alternative Indian state structure in exile. Raja Mahendra Pratap was later nominated for the Nobel Peace Prize, and Barkatullah continued advocating for India’s independence abroad until his death.\nIn Bhopal, Barkatullah University stands as a tribute to the revolutionary scholar. In 2013, the Government of India also issued a commemorative postage stamp in his honour.\nParallel to the Kabul initiative was a covert operation that came to be known as the Silk Handkerchief Movement, or the Silk Letter Conspiracy. After the formation of the provisional government, Maulana Ubaidullah Sindhi devised a secret method of communication between Indian revolutionaries and foreign allies such as Turkey.\nMessages were written in Persian on pieces of yellow silk cloth rather than paper, making them easier to conceal and more durable. These silk letters were stitched into garments or carried discreetly across borders by trusted couriers. The plan aimed to coordinate a broader armed revolt within India with assistance from powers hostile to Britain.\nHowever, in 1916, British intelligence intercepted some of these communications. Several leaders were arrested, and the conspiracy was effectively dismantled before it could translate into a full-scale uprising.\nDecades later, as constitutional reforms began reshaping British India, another lesser-known political milestone unfolded in the provinces. Under the Government of India Act, 1935, provincial elections were held in 1937. Although the Indian National Congress secured majorities in several provinces, including Bihar, it initially declined to form governments over concerns about the sweeping powers retained by colonial governors.\nIn Bihar, the Muslim Independent Party was invited to form the ministry. Muhammad Yunus became the province’s Premier, a title often referred to at the time as Prime Minister. He assumed office in April 1937 and served for 109 days until July 19 that year.\nBorn on May 4, 1884, in Panhara village near Patna, Muhammad Yunus came from a family of legal professionals. His father, Maulvi Ali Hasan Mukhtar, was a noted lawyer, and Yunus followed in his footsteps before entering politics.\nThese parallel stories, of an exile government in Kabul during a global war, a secret silk-letter network spanning continents, and a short-lived provincial premier in Bihar, underscore the diverse and international dimensions of India’s freedom struggle.\nLatest Blogs",
        "link": "https://www.news18.com/india/indias-first-prime-minister-wasnt-jawaharlal-nehru-heres-what-happened-in-1915-ws-kl-9925452.html",
        "date": "Mon, 23 Feb 2026 20:49:48 +0530",
        "fetched_at": "2026-02-24 04:00:18.275381"
    },
    {
        "title": "30-Year-Old Banker Dies By Suicide Over Fear Of Rabies In Thane",
        "content": "In a tragic incident in Maharashtra’s Thane district, a 30-year-old bank employee reportedly died by suicide, fearing he had contracted rabies after a stray dog attack. Police identified the deceased as Aish Vishwanath Amin, who was found hanging at his residence in the Tisgaon Naka area of Kalyan East on Sunday evening.\nA suicide note discovered at the scene indicated that Amin was experiencing severe mental distress and was worried he might have rabies following a dog bite a few days earlier. According to authorities, Amin lived with his elderly parents and brother in an apartment and had been employed at a cooperative bank for over eight years.\nFamily members informed the police that Amin had only received one anti-rabies injection after the incident. They noticed significant changes in his behaviour and escalating anxiety about his health.\nAn accidental death report has been filed, and further investigation is underway.\nBoy In Thane Dies After Dog Bite\nEarlier this month, a 12-year-old boy died in Thane weeks after being bitten by a stray dog. He was bitten by a dog in the Bhiwandi area on January 10, following which his family took him to the state-run IGM Hospital in the area.\nLater, the boy was referred to Thane Civil Hospital and later brought back to the same Bhiwandi facility. His family took him home after treatment.\nAfter a few weeks, the boy’s condition worsened. He was rushed to a civic hospital in Mumbai, where he passed away on January 30.\nA doctor from IGM Hospital stated that the boy received anti-rabies and tetanus injections during his first visit. Local doctors are still unsure if the death was due to the dog bite or another cause.\nLatest Blogs",
        "link": "https://www.news18.com/india/30-year-old-banker-dies-by-suicide-over-fear-of-rabies-in-thane-ws-l-9925463.html",
        "date": "Mon, 23 Feb 2026 21:09:05 +0530",
        "fetched_at": "2026-02-24 04:00:18.979274"
    },
    {
        "title": "PM Modi To Inaugurate Noida International Airport Next Month, Says CM Yogi Adityanath",
        "content": "Prime Minister Narendra Modi is set to inaugurate the Noida International Airport at Jewar next month, Chief Minister Yogi Adityanath announced on Monday during an interaction with the Indian diaspora in Singapore. Describing the new facility as India’s largest airport and a major aviation hub for both passengers and cargo, Yogi emphasised its importance.\nAddressing the diaspora, the Chief Minister highlighted that Uttar Pradesh now boasts the highest number of airports in the country. He remarked that the forthcoming airport in Jewar represents a crucial milestone in the state’s infrastructure growth.\n“Uttar Pradesh has the highest number of airports in India. PM Modi will inaugurate Noida International Airport, Jewar, next month. This is about to be the biggest airport in India..,\" CM Yogi Adityanath said.\n#JustIn | PM Modi to inaugurate Jewar international airport in Noida next monthNews18’s @AnvitSrivastava with details @JamwalNews18 | #Jewar #Jewarairport pic.twitter.com/L2Om64TiUW\n— News18 (@CNNnews18) February 23, 2026\nUttar Pradesh CM Yogi In Singapore\nUttar Pradesh Chief Minister Yogi Adityanath is on a visit to Singapore. On Monday, he held talks with Vivian Balakrishnan, Minister for Foreign Affairs of Singapore.\nIn a post on X, Yogi said, “Had a meaningful discussion with Dr. Vivian Balakrishnan, Hon. Minister for Foreign Affairs of Singapore, today. Discussed strengthening Uttar Pradesh-Singapore cooperation under the Comprehensive Strategic Partnership, with focus on investment facilitation, infrastructure collaboration, skill development and digital economy partnerships. Reiterated our commitment to further strengthening India-Singapore relations under the leadership of Hon. PM Shri Narendra Modi Ji.\"\nYogi Adityanath is on an official visit to Singapore from February 22-24, as part of his official visit to Singapore and Japan.\nLatest Blogs",
        "link": "https://www.news18.com/india/pm-modi-to-inaugurate-noida-international-airport-next-month-says-cm-yogi-adityanath-ws-l-9925354.html",
        "date": "Mon, 23 Feb 2026 20:26:42 +0530",
        "fetched_at": "2026-02-24 04:00:19.654150"
    },
    {
        "title": "‘Leave If You Want’: Karnataka Ministers Santosh Lad Snaps At Congress MLC During KDP Meet",
        "content": "A heated exchange broke out on Monday between Karnataka minister Santosh Lad and Congress MLC F H Jakkappanavar during a Karnataka Development Programme (KDP) review meeting in Dharwad district.\nThe confrontation erupted when Jakkappanavar, an educationist and labour leader associated with the Congress’ SC Cell, accused the government of neglecting issues related to the Scheduled Caste and Scheduled Tribe communities.\nHe alleged that he was not being given adequate opportunity to speak on matters concerning the Social Welfare Department and the welfare of SC-ST communities.\n“I am only raising my voice for the SC-ST community. I am not being allowed to speak on issues that concern them,\" the Congress MLC said during the meeting, triggering a sharp response from the minister.\nSantosh Lad, who is also the district in-charge minister, countered the allegation, insisting that all members were being given sufficient opportunity to present their views.\nAs tempers flared, Lad was heard telling the MLC, “There is no need to argue. Don’t speak like this. If you want to leave the meeting, you may.\"\nThe exchange briefly disrupted the review meeting before senior officials and party leaders stepped in to defuse the situation and restore order.\nSantosh Lad, a senior Congress leader, represents the Kalghatgi-Alnavar constituency in Dharwad district and currently serves as a cabinet minister in the Siddaramaiah government.\nJakkappanavar, who has held positions linked to SC welfare bodies, has been vocal on issues concerning social justice and representation.\nLatest Blogs",
        "link": "https://www.news18.com/india/leave-if-you-want-karnataka-ministers-santosh-lad-snaps-at-congress-mlc-during-kdp-meet-9925353.html",
        "date": "Mon, 23 Feb 2026 19:38:46 +0530",
        "fetched_at": "2026-02-24 04:00:20.429819"
    },
    {
        "title": "Centre To Launch Pilot Scheme For Direct Refunds From Inactive EPFO Accounts",
        "content": "In a significant move aimed at easing access to long-pending provident fund savings, the Ministry of Labour and Employment has decided to roll out a pilot exercise to refund money lying in inactive EPF accounts directly to beneficiaries.\nAs per Employees’ Provident Fund Organisation (EPFO) rules, any account that does not record a transaction for three consecutive years is classified as inoperative.\nAccording to available data, there are 31.86 lakh inoperative accounts, collectively holding Rs 10,903 crore. Of these, around 7.11 lakh accounts fall in the Rs 0–Rs 1,000 category, amounting to Rs 30.52 crore.\nUnder the pilot phase, funds worth approximately Rs 650 crore will be credited to nearly six lakh such inactive accounts. Government sources indicate that the transfers are expected to be completed within the next month, with the money being deposited directly into the bank accounts linked to these holdings.\nThe benefit will initially cover Aadhaar-linked accounts. For inactive accounts that are not yet linked to Aadhaar, the Ministry has directed its state offices to expedite the seeding process to enable seamless transfers.\nSources said the government observed that several accounts, even those holding small sums, have remained inactive as account holders were reluctant to initiate withdrawals due to cumbersome procedures. In many instances, individuals seeking to withdraw as little as Rs 1,000 were required to make multiple visits to EPF offices and complete extensive paperwork. Additionally, such inoperative accounts do not accrue interest, further disadvantaging subscribers.\nThe pilot is aimed at ensuring that funds parked in inactive accounts reach beneficiaries without procedural hurdles, leveraging the Direct Benefit Transfer (DBT) mechanism to simplify the process.\nFollowing the pilot’s successful implementation, the government plans to institutionalise a system for timely transfers of funds from inactive EPF accounts, ensuring quicker access and improved financial inclusion for subscribers.\nLatest Blogs",
        "link": "https://www.news18.com/india/centre-to-launch-pilot-scheme-for-direct-refunds-from-inactive-epfo-accounts-ws-l-9925164.html",
        "date": "Mon, 23 Feb 2026 18:25:14 +0530",
        "fetched_at": "2026-02-24 04:00:21.225012"
    },
    {
        "title": "‘Every Penny Will Be Returned’: Haryana CM Saini On Rs 590 Crore IDFC FIRST Bank Fraud Case",
        "content": "Haryana Chief Minister Nayab Singh Saini on Monday said the state government acted swiftly after irregularities were noticed in the alleged Rs 590 crore fraud linked to certain Haryana government accounts at the Chandigarh branch of IDFC FIRST Bank.\nSaini said the government was proactive in identifying discrepancies in certain accounts.\n“When some glitches were noted, we asked for statements, and those, too, did not match. Therefore, the government decided to transfer all the money to an authorised bank, along with interest,\" the Chief Minister said. He added that the funds are completely safe and assured that the money will be recovered.\nThe Haryana CM said IDFC FIRST Bank had written to SEBI in its defence, stating that an employee was at fault. However, the state government has referred the matter to the Anti-Corruption Bureau and the Vigilance Department to examine the seriousness of the case.\n“The investigation is going on. Appropriate action will be taken against those found guilty, and even the bank if it is found at fault,\" he said, reiterating that the government would ensure accountability in the matter.\n#WATCH | Chandigarh: On Rs 590 cr fraud at IDFC First Bank, Haryana CM Nayab Singh Saini says, “We have been proactive in catching this fraud… When some glitches were noted, we asked for statements, and those, too, did not match. Therefore, the government decided to transfer… pic.twitter.com/HUD7CJzjrO— ANI (@ANI) February 23, 2026\n“The matter surfaced on social media recently, we have investigated the case till the ground level… I assure the House that all the money will come back… I can make any statement only after the investigation. Every penny will be returned,\" the CM stated.\nHis remark came in response to a question asked by the Leader of the Opposition, Bhupinder Singh Hooda, in the Haryana Assembly.\nHooda demanded to know what action the state government has taken in the matter and whether accountability has been fixed.\n“What action did the Haryana government take? We have all the details that the inquiry is being conducted… The Haryana government is capable of finding out the culprit in the case,\" he said.\n#WATCH | Chandigarh | On Rs 590 cr fraud at IDFC First Bank, Haryana Assembly LoP Bhupinder Singh Hooda says, “What action did Haryana government take? We have all the details that the inquiry is being conducted… The Haryana government is capable of finding out the culprit in… pic.twitter.com/vWRPUUMX16— ANI (@ANI) February 23, 2026\nWhat’s The Case?\nIDFC FIRST Bank has suspended four employees after uncovering suspected fraudulent transactions worth nearly Rs 590 crore in certain Haryana government-linked accounts at its Chandigarh branch. The development was disclosed in a regulatory filing by the bank.\nIn its statement, the bank said an initial internal review found that the issue was restricted to a specific set of government-linked accounts handled at the Chandigarh branch and did not affect other customers.\nIt noted that the total amount currently under reconciliation in the identified accounts is around Rs 590 crore. The final financial impact, the bank added, will depend on further verification of claims, possible recoveries — including action against beneficiary accounts in other banks — liabilities of other entities involved, and the outcome of legal proceedings.\nThe bank confirmed that four officials suspected of involvement have been suspended pending investigation.\nIt also said it would initiate strict disciplinary, civil and criminal proceedings against employees and any external individuals found responsible, in accordance with the law. Efforts to recover the funds through legal channels are under way.\nHaryana Government Takes Action\nAfter the disclosure, Haryana’s Finance Department (Institutional Finance & Credit Control) announced that it has de-empanelled IDFC FIRST Bank and AU Small Finance Bank for all government-related transactions with immediate effect.\nAccording to an official statement, no government funds will be deposited, invested or routed through these banks until further notice.\nAll departments, boards, corporations and public sector undertakings have been directed to shift their balances to authorised banks and close existing accounts with the two institutions.\nOpposition Voices Concern\nCongress leader Rao Narendra Singh reacted strongly to the incident, calling it more than a financial lapse.\nHe described it as a serious blow to public trust and questioned how such a substantial amount could allegedly be misused without major negligence or possible collusion at higher levels. He also raised concerns about whether the government’s financial monitoring systems were functioning effectively.\nLatest Blogs",
        "link": "https://www.news18.com/india/funds-are-safe-probe-underway-haryana-cm-saini-on-rs-590-crore-idfc-first-bank-fraud-case-ws-l-9925072.html",
        "date": "Mon, 23 Feb 2026 22:12:59 +0530",
        "fetched_at": "2026-02-24 04:00:21.885496"
    },
    {
        "title": "Four Of Gujarat Family Booked Over Abusing, Threatening Staff At Arunachal Resort",
        "content": "Four members of a family from Gujarat have been booked after a video surfaced online allegedly showing two of them abusing and threatening employees at a resort in Arunachal Pradesh’s Dibang Valley.\nThe incident took place at Mishmi Hills Resort in Anini, where the family had checked in on 18 February.\nA case was reportedly filed at Anini police station in connection with the matter based on the complaint by the hotel’s management.\nAccording to the complaint, guests were informed at the time of check-in that outside food and alcohol were not permitted inside the property, as per resort rules. However, on February 20, the family allegedly brought liquor from outside. When staff reminded them of the policy, the situation reportedly escalated, said a report by NDTV.\nThe FIR names Aastha Devendra Kumar Patel, Dhruv Devendra Kumar Patel, Smita Devendra Kumar Patel and Devendra Kumar Patel. It alleges that Aastha and Dhruv Patel used obscene and sexually derogatory language towards female staff members. Dhruv Patel is also accused of attempting to physically assault an employee.\nThe complaint further claims that the accused damaged a display frame containing the resort’s rules and threatened to tarnish the property’s reputation and have it shut down by using what they described as influential connections.\nPolice have invoked several sections of the Bharatiya Nyaya Sanhita, including those related to assault or use of criminal force against a woman, obscene acts and criminal intimidation. Provisions under the SC/ST (Prevention of Atrocities) Act have also been applied.\nThe controversy gained attention after the resort shared video clips of the incident on Instagram along with a detailed statement. In the post, the management said it felt “compelled\" to make the matter public and stressed that Mishmi Hills Resort has always aimed to offer warm hospitality to visitors from across India and abroad.\nThe statement added that the staff had politely explained the no outside food and drinks policy, but the guests allegedly responded with abuse, racist remarks and intimidation.\nThe resort further claimed that the guests mentioned links with prominent corporate personalities and organisations, in an attempt to pressure the staff.\nManaging Director Chimi Linggi said she stepped in after being informed about the confrontation and that the district tourism officer was present during efforts to defuse the situation.\n“We tried to speak politely, but they continued to get enraged. Our young staff, many from interior areas, were shaken by the incident,\" she said, adding that while the resort welcomes all tourists, such behaviour could not be ignored.\nDibang Valley Superintendent of Police Ringu N confirmed that officers were sent to verify the matter after the video went viral, according to a report by the outlet.\nHe said the accused had checked out on the morning of 21 February and that further investigation is ongoing.\nLatest Blogs",
        "link": "https://www.news18.com/india/four-of-gujarat-family-booked-over-abusing-threatening-staff-at-arunachal-resort-ws-l-9924943.html",
        "date": "Mon, 23 Feb 2026 16:51:35 +0530",
        "fetched_at": "2026-02-24 04:00:22.578043"
    },
    {
        "title": "Cash, Training & A Fresh Start: Inside India's Maoist Surrender Policy As Devuji Lays Down Arms",
        "content": "A Rs 5 lakh fixed deposit, a monthly stipend of Rs 10,000 for three years, vocational training, and incentives for surrendered weapons—these are among the key features of India’s Surrender-cum-Rehabilitation Scheme for Left Wing Extremists (LWEs), a policy aimed at drawing Maoist cadres away from armed insurgency and back into the mainstream.\nThe framework, valid until March 31, 2026, forms part of the Centre’s broader conflict-resolution strategy in LWE-affected states. It combines firm policing with financial and social rehabilitation, designed to ensure surrendered cadres do not return to the fold.\nThe policy came into sharp focus after top Maoist commander Devuji surrendered before police in Chhattisgarh in a move hailed by the state government as a major breakthrough against the insurgency.\nWhat the Policy Offers\nUnder the guidelines, financial assistance depends on rank:\n• Higher-ranking cadres, including state committee and central committee members, are eligible for a Rs 5 lakh grant.\n• Middle- and lower-ranking cadres may receive Rs 2.5 lakh.\n• The money is deposited as a fixed deposit in the surrenderee’s name and can be withdrawn after three years, subject to good behaviour certification by authorities. It can also serve as collateral for loans to start self-employment ventures.\n• In addition, surrendered weapons fetch separate incentives. Heavy weapons like LMGs or sniper rifles can earn Rs 35,000 per weapon, AK-series rifles Rs 25,000, and pistols or carbines Rs 10,000. Explosives, grenades, detonators, communication devices, and even ammunition rounds carry prescribed compensation rates. These incentives are also locked in fixed deposits for three years.\nTraining and Reintegration\nSurrendered cadres are initially housed in rehabilitation camps, where they receive training in trades aligned with their aptitude. During this period, they are entitled to a monthly stipend of Rs 10,000 for up to 36 months. If the individual secures government employment, the stipend is discontinued.\nThe aim, according to the policy framework, is not merely surrender but sustainable reintegration, preventing former cadres from being drawn back into the insurgency due to financial insecurity.\nStrict Screening Mechanism\nEligibility is not automatic. A Screening-cum-Rehabilitation Committee constituted by the state government scrutinises each case. The committee includes senior police officials, representatives from the Home Department, and Central Armed Police Forces.\nSurrendered cadres must confess to their involvement in extremist activities and provide operational details, including information about planners, financiers, and arms. Tactical surrenders—attempts to misuse the scheme for strategic gain—are explicitly barred.\nLegal Cases May Continue\nThe surrender does not guarantee immunity. Trials in heinous cases may proceed, though states can consider withdrawing minor cases on merit. Fast-track courts may be set up for speedy disposal.\nCentre-State Funding Model\nUnder the Security Related Expenditure (SRE) scheme, the Union government reimburses 60 per cent of the rehabilitation expenditure incurred by states, including grants and stipends, while states bear 40 per cent.\nDevuji’s Surrender In Context\nIt is within this framework that Devuji’s surrender assumes significance. As a senior Maoist commander operating in Chhattisgarh, his decision to lay down arms underscores the pressure faced by the insurgency amid sustained security operations and parallel rehabilitation outreach.\nOfficials suggest that high-profile surrenders such as Devuji’s not only weaken operational networks but also send a message to cadres deeper in the ranks that an exit route exists—backed by structured financial and institutional support.\nWith the policy remaining in force until 2026 and periodic reviews by the Ministry of Home Affairs, authorities hope more cadres will choose reintegration over insurgency, further shrinking the footprint of Left Wing Extremism in affected states.\nLatest Blogs",
        "link": "https://www.news18.com/india/cash-training-a-fresh-start-inside-indias-maoist-surrender-policy-as-devuji-lays-down-arms-ws-l-9924664.html",
        "date": "Mon, 23 Feb 2026 16:15:04 +0530",
        "fetched_at": "2026-02-24 04:00:23.294725"
    },
    {
        "title": "'Need Of The Hour': Karnataka Congress' 31 First-Time MLAs Write To Kharge Seeking Cabinet Berths",
        "content": "As many as 31 first-time Karnataka Congress MLAs have written to party president Mallikarjun Kharge, urging the leadership to accommodate new and young faces during the next cabinet reshuffle, calling it a “need of the hour\".\nThe letter, which has also been addressed to senior leaders including Rahul Gandhi, Chief Minister Siddaramaiah, Deputy Chief Minister DK Shivakumar and Congress general secretary KC Venugopal, seeks ministerial berths for first-time legislators amid talks of cabinet expansion.\nThe signatories include Mandya MLA Ravikumar Gowda Ganiga, Virajpet MLA AS Ponnanna, and Pavagada MLA HV Venkatesh, among others.\nIn the letter, the MLAs pointed out that when the 34-member Siddaramaiah-led cabinet was formed, no first-time MLA was given a ministerial position, despite the Congress coming to power with a decisive mandate.\n“It is the need of the hour that young, dynamic and proactive first-time MLAs are provided an opportunity to serve as ministers in the cabinet,\" the letter stated.\nThe legislators have requested that at least five first-time MLAs be accommodated whenever the Chief Minister, in consultation with the Congress high command and the Deputy Chief Minister, undertakes a cabinet reshuffle.\nThe MLAs further argued that giving ministerial responsibilities to newcomers is not unprecedented, noting that several state governments across the country have been led by first-time MLAs as Chief Ministers, with many others inducted as ministers.\nThe Karnataka cabinet reshuffle has been on the cards for some time, with CM Siddaramaiah and Deputy CM DK Shivakumar holding separate and parallel meetings in New Delhi with senior Congress leaders over the past four months.\nHowever, no final decision has yet been taken on either a reshuffle or an expansion of the 34-member cabinet.\nLatest Blogs",
        "link": "https://www.news18.com/india/need-of-the-hour-karnataka-congress-31-first-time-mlas-write-to-kharge-seeking-cabinet-berths-9924867.html",
        "date": "Mon, 23 Feb 2026 15:56:11 +0530",
        "fetched_at": "2026-02-24 04:00:23.990097"
    },
    {
        "title": "Xiaomi Pad 8 And Xiaomi 17 Ultra India Launch Confirmed: Price And Expected Specs",
        "content": "Xiaomi is going to end the month with a bang and that includes some of the exciting products we have been hearing about for a while. Xiaomi introduced the new 17 series flagship phones in China back in September last year, and the wait has been unusually long to see these devices announced in India and other regions.\nBut new details suggest we could finally see them out of China. Now the company has shared the launch date, and what products we could see on our shores in the next few weeks.\nXiaomi Pad 8 And Xiaomi 17 Series India Launch\nXiaomi Pad 8 and the Xiaomi 17 series are launching globally on February 28, 2026 at 18:30 PM IST and this lineup includes the premium Leica-toting Xiaomi 17 Ultra model. All these devices will be shaping the real action for the brand and we will be seeing them unveiled at the event later this week.\nXiaomi Pad 8 And Xiaomi 17 Series Launch: What To Expect\nXiaomi Pad 8 looks a different version from Pad 7 and by that we mean, the build quality, the hardware powering it as well as the accessory that work with it. The product teaser shows a track pad on the keyboard for the tablet which is a big change from the Pad 7 model unit. The Pad 8 is also getting a new stylus from the company, a thinner design also seems confirmed and even then you can expect a large battery pack.\nXiaomi 17 launched in China sports a 6.3-inch OLED display with 120Hz refresh rate. It comes with up to 16GB RAM and 1TB storage that are paired with the Snapdragon 8 Elite Gen 5 chipset. The new phone gets Android 16-based HyperOS 3 version out of the box.\nIt has a 50MP triple camera system with Leica-tuned lenses. And finally you have a 7,000mAh battery this year supported by 100W wired and 50W wireless charging speeds but the global variant could have different specs.\nXiaomi 17 price in India should be around Rs 75,000 but it could easily cross the 80K mark this time around. And going by other premium devices, the 17 Ultra price in the country could be well above Rs 1 lakh when it launches this week.\nLatest Blogs",
        "link": "https://www.news18.com/india/xiaomi-pad-8-and-xiaomi-17-ultra-india-launch-confirmed-price-and-expected-specs-9924738.html",
        "date": "Mon, 23 Feb 2026 16:01:08 +0530",
        "fetched_at": "2026-02-24 04:00:24.634020"
    },
    {
        "title": "‘Those Who Toil Receive The Profit, Not Some Rich Person’: Amit Shah To Bharat Taxi Drivers",
        "content": "Union Home and Cooperation Minister Amit Shah interacted with drivers of Bharat Taxi and assured them of support for the new initiative. He told the drivers that the company belongs to them and asked them to be patient for the next three years as the platform is on its growing stage.\nOn February 5 in Delhi, Amit Shah launched India’s first cooperative-based ride-hailing platform, “Bharat Taxi\". The platform is India’s first government-backed cooperative ride-hailing app, seen as an alternative to Ola and Uber.\nAmit Shah said, “Our objective is to make the owner prosperous. The only difference is – you are the owner. You only need to invest Rs 500. If Bharat Taxi earns Rs 25 crore, 20 per cent will go into the company’s account as your share, and the remaining 80 per cent will be distributed based on taxi operations. This means that apart from fare income, you will also earn profit. You will need patience for the first three years. The accounts will remain transparent and accessible to you. It will function on cooperative principles. Bharat Taxi will not exploit you.\"\nAddressing the drivers, Amit Shah said the aim was not to earn big profits like other companies but to strengthen the ‘sarthi’ taxi drivers. He said the drivers would be the owners of the company and added that in the coming three years the service would expand to most states. Bharat Taxi is expected to grow across more states.\nAmit Shah said, “The concept is that the one who is working hard, the one who is toiling, should get the profit, not some rich man. Why did we come up with the idea of ​​Bharat Taxi? You said that there were a lot of complaints, 30 per cent was deducted, and there was no certainty… The purpose of running those companies is to make the owners rich. Our purpose is also to make the owners rich. The only difference is that you are the owner.\"\nThe platform follows a driver-owned model backed by Amul, IFFCO and NABARD. It offers zero commission for drivers, charging only membership fees. It also promises no surge pricing and transparent fares.\nLatest Blogs",
        "link": "https://www.news18.com/india/those-who-toil-receive-the-profit-not-some-rich-man-amit-shah-to-bharat-taxi-drivers-9924290.html",
        "date": "Mon, 23 Feb 2026 12:43:49 +0530",
        "fetched_at": "2026-02-24 04:00:25.386722"
    },
    {
        "title": "Agencies Flag Shift In Tactics As IS, Al-Qaeda Push Drone Warfare Playbook Online | Exclusive",
        "content": "Global jihadist groups like Islamic State (IS) and al-Qaeda are increasingly pushing digital content to give training to their cadres and sympathisers in drone operations.\nIn the past six months, India’s central investigation and intelligence agencies have intercepted huge digital material pointing to what officials describe as a clear shift in terror strategy from conventional attack methods to technology-driven tactics.\nGovernment sources said the matter has already been raised at the top level. Sources also said the material indicates efforts to equip operatives with the skills to operate and potentially weaponise commercially available unmanned aerial systems, underscoring the evolving nature of the threat landscape.\nSecurity officials term the development deeply worrisome, particularly for densely populated urban cities.\n“Unlike traditional attacks that require physical presence and direct execution, drone-enabled operations can be carried out remotely and triggered from a safer distance, reducing the risk for terrorists while making detection and attribution significantly more challenging for agencies,\" an official aware about the development told News18.\nThe minimal on-ground footprint and the ability to operate across distances complicate surveillance, interception, and response mechanisms.\nThe concerns have sharpened in the backdrop of the Red Fort area car bomb blast in Delhi. The National Investigation Agency (NIA) has already announced the arrest of another key associate in the case. The agency stated that its investigations revealed the role of Jasir, who had allegedly provided technical support for carrying out terror attacks by modifying drones and attempting to make rockets ahead of the deadly car bomb blast that killed 10 people and injured 32 others.\nAs per the NIA press release, the accused, a resident of Qazigund in Anantnag district of Jammu & Kashmir, was an active co-conspirator who worked closely with the main accused, Umar un Nabi, in planning the attack. The agency said it continues to explore various angles to unravel the broader conspiracy behind the bombing, with multiple teams conducting searches across states to identify others involved.\nOfficials say the case highlights the growing intersection between terror networks and emerging technologies and has reinforced concerns that urban security frameworks must adapt rapidly to counter threats that can now be executed remotely, with limited physical trace and greater tactical sophistication.\nLatest Blogs",
        "link": "https://www.news18.com/india/agencies-flag-shift-in-tactics-as-is-al-qaeda-push-drone-warfare-playbook-online-exclusive-ws-kl-9924284.html",
        "date": "Mon, 23 Feb 2026 12:24:34 +0530",
        "fetched_at": "2026-02-24 04:00:26.114880"
    },
    {
        "title": "'Prahaar': Ministry Of Home Affairs Unveils India's New National Counter-Terrorism Policy",
        "content": "The Ministry of Home Affairs (MHA) has unveiled India’s new national counter-terrorism policy and strategy, titled ‘Prahaar’, outlining a comprehensive framework to address evolving terror threats through prevention, coordinated response, capacity building and adherence to the rule of law.\nIn its official release, the MHA stated that India has remained at the forefront of the global fight against terrorism for decades, even as the nature of threats continues to evolve.\n“While the nature of threats continues to change and present new challenges, India has remained consistently opposed to terrorism in all its forms and manifestations,\" the ministry said.\nThe release noted that instability in India’s immediate neighbourhood has often created ungoverned spaces and added that “few countries in the region have sometimes used terrorism as an instrument of State Policy.\"\nAt the same time, the government stressed that India does not associate terrorism with any religion or identity, stating, “India does not link terrorism to any specific religion, ethnicity, nationality or civilisation.\"\nReaffirming its stance, the ministry said India has always denounced terrorism “unambiguously and unequivocally\" and that its policy is guided by a principled approach of ‘zero tolerance’ against terrorism.\nFOUNDATION AND OBJECTIVES OF ‘PRAHAAR’\nAccording to the MHA, the counter-terrorism strategy flows from India’s long-standing commitment to stand by victims of terrorism and its belief that “there can be no justification whatsoever for violence in the world.\"\nThe strategy is predicated on key objectives, including prevention of terror attacks, swift and proportionate responses, aggregation of internal capacities through a whole-of-government approach, and ensuring human rights and rule-of-law-based processes.\nIt also focuses on attenuating conditions that enable terrorism, aligning international counter-terror efforts, and strengthening recovery and resilience through a whole-of-society approach.\nEVOLVING THREATS AND SECURITY CONCERNS\nIt added that global terrorist groups such as Al-Qaeda and ISIS have attempted to incite violence through sleeper cells.\nThe release highlighted the growing misuse of technology by terror groups, stating that handlers frequently use “the latest technologies, including the use of drones, for facilitating terror-related activities and attacks in Punjab and Jammu and Kashmir.\"\nIt further noted that terrorists increasingly rely on social media platforms and instant messaging applications for propaganda, recruitment and communication, while technologies such as encryption, the dark web and crypto wallets enable anonymous operations.\nConcerns were also raised about attempts by terrorist organisations to access Chemical, Biological, Radiological, Nuclear, Explosive and Digital (CBRNED) materials, alongside cyber-attacks carried out by criminal hackers and nation states.\nPREVENTION AND INTELLIGENCE-LED APPROACH\nThe MHA said India follows a proactive and intelligence-guided approach to counter terrorism.\nThe Multi Agency Centre (MAC) and Joint Task Force on Intelligence (JTFI) within the Intelligence Bureau serve as nodal platforms for real-time intelligence sharing and coordinated action.\nLaw enforcement agencies continue efforts to counter misuse of the internet by disrupting online propaganda, recruitment networks and logistical support systems, including overground worker (OGW) modules.\nSpecial emphasis has also been placed on disrupting terror funding networks through legal mechanisms.\nThe ministry added that border guarding forces and immigration authorities have been equipped with advanced technologies to secure threats across land, air and water, while critical sectors such as power, aviation, ports, defence and atomic energy are being protected from state and non-state actors.\nRESPONSE AND CAPACITY BUILDING\nThe release stated that local police remain the first responders during terror incidents, supported by specialised state and central forces.\nThe National Security Guard (NSG) functions as the nodal national counter-terror force, assisting states and conducting capacity-building initiatives.\nInvestigations by the National Investigation Agency (NIA) and state police agencies, coupled with high prosecution rates, are aimed at creating deterrence against future terror incidents.\nModernisation of training, acquisition of advanced technology and standardisation of procedures across agencies form a key component of capacity enhancement under the strategy.\nHUMAN RIGHTS AND RULE OF LAW\nEmphasising legal safeguards, the ministry said Indian anti-terror laws give due importance to human rights and operate within the framework of the rule of law.\nIt noted that India adheres to principles where laws are applied evenly and protect fundamental rights, while multiple levels of judicial redressal remain available to accused persons.\nDE-RADICALISATION AND WHOLE-OF-SOCIETY APPROACH\nThe policy places strong emphasis on countering radicalisation.\nThe MHA said intelligence and law enforcement agencies adopt graded responses to address violent extremism, while community leaders, NGOs and moderate preachers are engaged to spread awareness about the consequences of extremist violence.\nEfforts are also being undertaken to prevent radicalisation in prisons and to address socio-economic vulnerabilities through education, employment and welfare initiatives aimed at youth and women.\nINTERNATIONAL COOPERATION AND WAY FORWARD\nHighlighting the transnational nature of terrorism, the ministry said international partnerships remain critical through intelligence sharing, extradition arrangements and cooperation frameworks.\nIndia will continue working with global partners to designate terrorists and build consensus on counter-terror measures.\nLooking ahead, the MHA said further cooperation among agencies, periodic legal reforms and enhanced capacity building of state counter-terror units remain necessary.\nThe strategy aims to deny terrorists access to funds, weapons and safe havens while investing in technology and partnerships to counter future threats.\nThe ministry stated that through ‘Prahaar’, India seeks to strengthen coordinated national action and pursue a comprehensive approach to counter terrorism while safeguarding democratic values and societal resilience.\nLatest Blogs",
        "link": "https://www.news18.com/india/national-counter-terrorism-policy-prahaar-ministry-of-home-affairs-zero-tolerance-against-terrorism-9924124.html",
        "date": "Mon, 23 Feb 2026 11:49:31 +0530",
        "fetched_at": "2026-02-24 04:00:27.094531"
    },
    {
        "title": "Maharashtra Sadan In Delhi Receives Bomb Threat; Police Launch Search Operation",
        "content": "Maharashtra Sadan received a bomb threat in the national capital on Monday. The threat was sent through an email, prompting immediate action by the Delhi Police.\nFollowing the alert, Delhi Police launched an operation and conducted a thorough search of the entire Maharashtra Sadan premises.\nThe building has now been placed on high alert by the police.\nMaharashtra Sadan serves as the official residence for the Governor, Chief Minister, Deputy Chief Minister and ministers during their visits to Delhi.\n2 Delhi Schools Receive Bomb Threat\nTwo schools in Delhi — Army Public School and Air Force Bal Bharti School — received bomb threat emails on Monday. Police officials and teams from the Delhi Fire Service have reached the premises and are conducting checks.\n“We are verifying the source of the email. So far, nothing suspicious has been found. As a precautionary measure, a thorough search operation is underway on the school premises, which has been vacated,\" a senior police officer told news agency PTI regarding the threat to Army Public School.\nAfter receiving the email warning that an explosive device had been planted on the campus, the school administration alerted authorities.\nAn officer said the cyber cell has been roped in to trace the origin of the email and identify the sender. Teams from the Delhi Police, along with the bomb disposal squad, dog squad and fire department, are present at the spot.\nLatest Blogs",
        "link": "https://www.news18.com/cities/new-delhi-news/maharashtra-sadan-in-delhi-receives-bomb-threat-police-launch-search-operation-ws-l-9924041.html",
        "date": "Mon, 23 Feb 2026 10:37:50 +0530",
        "fetched_at": "2026-02-24 04:00:27.827139"
    },
    {
        "title": "AI Summit Protest: Fifth Accused Arrested From Gwalior, Photo With Rahul Gandhi Surfaces",
        "content": "IYC Shirtless Protest: Delhi Police on Monday arrested another accused from Madhya Pradesh’s Gwalior in connection with Indian Youth Congress’s (IYC) “shirtless protest\" inside Bharat Mandapam during the AI Impact Summit 2026.\nThe accused has been identified as Jitendra Yadav, a resident of Gwalior in Madhya Pradesh. According to sources, Yadav is allegedly linked to the Indian Youth Congress. A photo of him with Lok Sabha Leader of Opposition Rahul Gandhi has also surfaced on social media platforms.\nThis is the fifth arrest made by the police so far. He has been sent to two-day police custody as part of the ongoing investigation into the protest case.\nMeanwhile, a Delhi court on Saturday approved a five-day police custody for the four Youth Congress workers who staged a shirtless protest at Bharat Mandapam during the AI Summit.\nThe court came down heavily on the IYC, saying that their conduct was not legitimate dissent, rather a “blatant assault on public order\" that imperilled India’s diplomatic image.\nWhile allowing the Delhi Police’s plea for custodial interrogation, the magistrate said that the alleged actions of the accused “imperil not merely the event’s sanctity but also the Republic’s diplomatic image before foreign stakeholders, rendering it wholly unprotected by constitutional safeguards.\"\nWhile seeking remand, Delhi Police said that the accused had staged a protest similar to the protest in Nepal, claiming that it was a conspiracy to defame the country internationally.\nThe court said custodial interrogation was essential to unearth a larger conspiracy, funding sources, digital evidence and possible absconding associates. It noted that the accused hailed from remote regions, raising concerns about flight risk.\nIndia hosted the world’s largest artificial intelligence conclave, the AI Impact Summit-2026. The summit that began on February 16 has seen packed halls and long queues, as tech moguls, industry leaders, policymakers, founders, and technologists thronged the Bharat Mandapam.\nAround 10 activists of the Congress’s youth wing had entered the AI Summit venue in New Delhi and staged a shirtless protest, raising slogans against Prime Minister Narendra Modi over the India-US trade deal. The protesters wore or carried white T-shirts printed with images of PM Modi and US President Donald Trump along with slogans targeting the government.\nThe protest sparked a political row, with BJP leaders condemning it as “anti-national\" and accusing the Congress of harming India’s global image, while the Congress defended the demonstration as legitimate democratic dissent reflecting youth anger.\nPrime Minister Narendra Modi also hit out at Congress and accused it of using a global event for its “dirty and naked politics\".\nIn a scathing jibe at Congress, PM Modi said, “You are already naked, then why did you feel the need to take off your clothes?\"\n“What the Congress leaders did there shows how ideologically bankrupt and impoverished the oldest party of the country has become. Congress is busy defaming its own country. Some political parties within the country cannot digest India’s success. We just witnessed the world’s largest AI conference in India. But what did the Congress and its ecosystem do? The Congress turned a global event for India into a platform for its dirty and naked politics,\" the PM said while addressing a gathering in Meerut.\nLatest Blogs",
        "link": "https://www.news18.com/india/ai-summit-protest-fifth-accused-arrested-from-gwalior-photo-with-rahul-gandhi-surfaces-ws-l-9923923.html",
        "date": "Mon, 23 Feb 2026 10:50:13 +0530",
        "fetched_at": "2026-02-24 04:00:28.808600"
    },
    {
        "title": "'Must Have Discipline, Dignity': Senior Congress Leader Margaret Alva Slams Protest At AI Summit In Delhi",
        "content": "Senior Congress leader and former Union Minister Margaret Alva on Monday emphasised the importance of maintaining decorum and responsibility at global platforms, reacting to the controversy surrounding the Youth Congress protest linked to the India AI Summit.\nCommenting on the issue, Alva underlined that international events demand discipline and a sense of accountability from participants, irrespective of political differences.\n“I think at international events there has to be dignity, there has to be discipline, and there has to be a sense of responsibility,\" she said.\nBengaluru, Karnataka: On the Youth Congress protest at the India AI Summit, veteran Congress leader and former Union Minister Margaret Alva says, “I think at international events there has to be dignity, there has to be discipline, and there has to be a sense of responsibility\" pic.twitter.com/9et4obYslZ— IANS (@ians_india) February 22, 2026\nHer remarks come amid political debate following protests staged by members of the Indian Youth Congress (IYC) during the India AI Summit, an event that drew participation from national and international stakeholders.\nIndia Youth Congress National Coordinator Narsimha was detained by police during a protest at Bharat Mandapam on Friday.\nThe Youth Congress had earlier said its workers were demonstrating against what it alleged was a “compromised Prime Minister who has traded the identity of the country at the AI Summit.\"\nPolice later detained several protesters at the venue.\nDelhi Police officials said legal action was initiated after some Youth Congress cadres staged a protest described as ‘shirtless’ inside the summit premises.\nAdditional Commissioner of Police Devesh Mahla said the incident occurred around 12.30 pm and noted that the protesters had registered online to attend the summit.\nAccording to the police, the protesters were initially wearing sweaters and jackets over objectionable T-shirts.\nNear Hall Number 5, one individual reportedly removed his outer clothing and waved the T-shirt as part of the protest.\nAuthorities said those detained were being identified and that appropriate legal action was being taken.\nThe protest triggered sharp political reactions, with the Bharatiya Janata Party (BJP) criticising the demonstration by Congress cadres.\nUnion Minister Ashwini Vaishnaw also urged that the India AI Summit be kept above politics, stressing the importance of presenting India’s innovation and technological progress on a global stage.\nSpeaking to news agency ANI on the sidelines of the summit, Vaishnaw said the gathering represented an opportunity for the country’s youth and called for cooperation across political lines to support such initiatives.\nHe criticised the opposition, alleging that attempts were being made to obstruct a significant national effort.\nThe protest followed criticism by Congress leader and Leader of Opposition in the Lok Sabha, Rahul Gandhi, who attacked the government over the organisation of the summit, calling it a “disorganised PR spectacle\" and raising concerns related to data and participation.\nLatest Blogs",
        "link": "https://www.news18.com/india/senior-congress-leader-margaret-alva-condemns-youth-congress-protest-ai-summit-bharat-mandapam-calls-for-discipline-dignity-decorum-ws-l-9923894.html",
        "date": "Mon, 23 Feb 2026 09:38:27 +0530",
        "fetched_at": "2026-02-24 04:00:29.572538"
    },
    {
        "title": "Rajasthan Minister Claims Cow Milk Boosts 'Intelligence', Buffalo Milk Makes Children 'Sluggish'",
        "content": "Rajasthan Education Minister Madan Dilawar on Sunday claimed that milk from indigenous cows enhances children’s intelligence and energy, while buffalo milk makes them sluggish.\nDilawar made the remarks while addressing a gathering at a programme on ‘Go-Samvardhan and Gocharan’ (cow conservation and grazing) in the Ramganj Mandi constituency of Kota district.\n“A person who drinks the milk of a high-shouldered indigenous cow becomes intelligent, whereas those who drink buffalo milk tend to be sluggish,\" the Rajasthan Education Minister said.\n#WATCH | Kota: Rajasthan minister Madan Dilawar says, “…Choose 5-7 cows that have given birth to calves 3-4 days ago. Similarly, choose buffaloes that have given birth to calves 3-4 days ago. Stand those buffaloes and the mother cow in front of you and release their calves… pic.twitter.com/gsqs4sQoZV— ANI (@ANI) February 22, 2026\nTo justify his claims, the minister suggested selecting a few cows and buffalo that had given birth to calves a few days ago and making them stand on opposite sides.\n“Now, release their calves from a distance to go to their mothers,\" he said. He claimed the buffalo calf would struggle to find its mother, unlike a cow’s calf.\n“A buffalo calf will find its mother with great difficulty by running away, but a cow calf will go straight to its mother, which means that a child who drinks cow’s milk is intelligent, while a child who drinks buffalo’s milk is weak in the mind,\" he remarked.\nOffering another example, Dilawar stated, “Give each calf — both the cow and the buffalo — a full feed of milk before letting them return to their mothers. The buffalo calf, after a few steps, would cough and begin to doze off, while the cow calf, with its tail held high, would spring into lively motion, showcasing its playful energy and sharp intelligence.\"\nHe also referred to differences in terminology for calves and concluded, “If you want progress for your children, want to get them forward and make them intelligent and playful, offer them milk of ‘Gou Mata’.\"\nDilawar also announced the revival of a traditional cow-grazing system in 14 villages, under which one village cowherd (Guwala) will be appointed for every 70 cows. If the number exceeds 70, two cowherds will be engaged. Each will receive an honorarium of Rs 10,000 per month, with the arrangement supported by village donors (Bhamashahs), an official said.\nLatest Blogs",
        "link": "https://www.news18.com/india/rajasthan-minister-claims-cow-milk-boosts-intelligence-buffalo-milk-makes-children-sluggish-ws-l-9923889.html",
        "date": "Mon, 23 Feb 2026 09:25:19 +0530",
        "fetched_at": "2026-02-24 04:00:30.575647"
    },
    {
        "title": "Ex-Railway Minister And Once TMC Top Leader Mukul Roy Dies At 73",
        "content": "Senior politician and former Railways Minister Mukul Roy passed away on Monday. He died at 1:30 a.m. in a hospital in Kolkata. He was 73-years-old and had been suffering from various illnesses for a prolonged period.\nHe rose as a close aide to Mamata Banerjee.\nMP and senior Trinamool Congress leader Abhishek Banerjee condoled the death of Mukul Roy.\nIn a post on X, he wrote, “The demise of Mukul Roy marks the end of an era in Bengal’s political history. A veteran leader with vast experience, his contributions helped shape an important phase of the state’s public and political journey. As a founding pillar of the All India Trinamool Congress, he was instrumental in expanding and consolidating the organisation during its formative years. His dedication to public life will be recalled with admiration. I extend my sincere sympathies to his family, friends and admirers. May his soul be granted eternal peace.\"\nMukul Roy served as Union Minister of State for Shipping in 2009, Railways from 2011 to 2012, and Urban Development.\nHailing Roy’s “organizational dynamics\", Amit Shah said, “Saddened by the passing of former Union Minister Mukul Roy Ji. His long career in public service was defined by his understanding of organizational dynamics and public issues. I extend my heartfelt condolences to his family members and supporters. Om Shanti.\"\nMukul Roy was once the number two leader in the All India Trinamool Congress. He played a key role as a strategist in the party’s 2011 West Bengal Assembly election win.\nHe was expelled from the party in 2017 amid the Narada sting scandal, in which alleged payoffs were captured on video.\nHe joined the Bharatiya Janata Party in November 2017 and later became its National Vice President in 2020. He managed the party’s campaigns in West Bengal but retired from electoral politics in 2021, citing health reasons.\nHe contested the 2021 elections as a BJP candidate and returned to the Trinamool Congress after the results were announced. However, he had remained largely inactive politically after 2021.\nLatest Blogs",
        "link": "https://www.news18.com/india/ex-railway-minister-and-once-tmc-top-leader-mukul-roy-dies-at-73-9923734.html",
        "date": "Mon, 23 Feb 2026 12:59:18 +0530",
        "fetched_at": "2026-02-24 04:00:31.326026"
    },
    {
        "title": "No 20-Year Cooling-Off Period For Retiring Military Officials: Rajnath Singh After Naravane Book Row",
        "content": "Union Defence Minister Rajnath Singh on Sunday clarified that there is no proposal for a mandatory 20-year cooling-off period for retired army officers writing books. Speaking to reporters, the minister said that no such proposal came up for discussion before the Cabinet. Therefore, there will be no restriction or ban on former Army officials or retiring officials on writing books soon after their retirement.\nThis controversy sparked over a book — “Four Stars of Destiny\" — written by former Army chief General MM Naravane. This book caused a nationwide stir after the Leader of the Opposition in the Lok Sabha, Rahul Gandhi, tried to read excerpts from it in the parliament.\nThe book is on the Ladakh standoff with China.\nThe stunt witnessed massive uproar and it was alleged that the book contained sensitive information regarding national security. The book was set to be released in 2024, but its release was halted as the review by the Defence Ministry was pending.\nDefence Minister further reiterated that rules already exist that retired officers should not disclose classified or secret information. “Government permission is required to publish any sensitive information. So, the government’s position is that there is no need for a new 20-year rule; the current laws are sufficient,\" he said.\nAs per the current regulations, military officials are restricted from revealing classified information related to national security even after their retirement. Such disclosure is subject to regulations under the Official Secrets Act.\nControversy Around Naravane’s Unpublished Book\nAs per the police, the book was leaked on some social media sites and a case has been registered with the Special Cell in order to carry out a thorough investigation into this purported leak or breach.\nCongress leader Rahul Gandhi was seen flashing a purported copy of the book in the Parliament on February 3. After massive uproar, eight MPs were suspended over the issue.\n“Upon verification, it was found that a PDF copy of a type-set book with the same title and apparently prepared by M/s Penguin Random House India Pvt Ltd is available on certain websites and, also, some online marketing platforms have displayed the finished book cover as if it is available for purchase,\" Delhi police said in its official statement.\nLatest Blogs",
        "link": "https://www.news18.com/india/no-20-year-cooling-off-period-for-retiring-military-officials-rajnath-singh-after-naravane-book-row-ws-bl-9923515.html",
        "date": "Sun, 22 Feb 2026 21:50:06 +0530",
        "fetched_at": "2026-02-24 04:00:32.062847"
    },
    {
        "title": "India Shows How AI Can Work At Scale, But Inclusion Remains The Challenge: World Bank | Exclusive",
        "content": "The ‘India AI Impact Summit 2026’ brought together policymakers, industry leaders, multilateral institutions, and technologists at an unprecedented scale, signalling a shift in the global conversation around artificial intelligence.\nMoving beyond hype and model size, the summit focused squarely on how artificial intelligence (AI) can deliver real-world development outcomes, from jobs and productivity to public service delivery, while confronting risks around inequality, exclusion, and trust.\nFor the World Bank Group, the summit was a key moment to advance its vision of AI as a tool for inclusive growth. As governments across the Global South race to embed AI into welfare systems, education, healthcare, and governance, the World Bank has positioned itself at the centre of debates on responsible adoption, digital public infrastructure, cybersecurity, and global safeguards. Its emphasis on “small AI\", practical, affordable systems that work in low-resource settings, reflects a broader push to ensure AI narrows, rather than widens, development gaps.\nCNN-News18 spoke with Paul Procee, acting country director for India at the World Bank, and Mahesh Uttamchandani, regional practice director for digital and AI across East Asia and the Pacific and South Asia. The conversations ranged from the risks of AI-led exclusion and algorithmic bias to India’s role in shaping global AI norms, the governance challenges of deploying AI at the state level, and the uncomfortable truths policymakers still avoid when it comes to AI and inequality.\nExcerpts from the interview:\nThe World Bank increasingly frames AI as a development tool, but many argue it risks widening inequality in low-capacity states. How do you ensure AI projects backed by the World Bank do not end up benefiting governments and vendors more than vulnerable populations?\nMahesh Uttamchandani: At the World Bank Group, our focus is clear – AI must drive inclusion, not deepen divides. That means designing AI that works for people at the margins, not just for governments or tech vendors. We are prioritising what we call “small AI\" solutions that are affordable, practical, and effective even where connectivity and infrastructure are limited.\nIn Andhra Pradesh and Telangana, we are working with governments and partners to assess AI-powered learning tools that help students build job-ready skills. In Uttar Pradesh, AI tools are helping farmers reach wider markets, raise incomes, and create new employment opportunities. These initiatives show that when AI is grounded in local realities, it can deliver immediate gains in health, education, and agriculture, and directly strengthen communities rather than bypass them.\nIndia’s digital public infrastructure is often held up as a global model. As AI gets embedded into welfare delivery, health, and education systems, what specific risks of exclusion or error worry the World Bank most in the Indian context?\nPaul Procee: India has emerged as a global benchmark for digital public infrastructure. Platforms like Aadhaar and unified payments interface (UPI) show how technology can deliver services at scale with speed and transparency. But as AI is embedded into welfare delivery, health, and education, new risks come into focus.\nThe biggest concern is exclusion by design. Algorithmic bias, weak local-language data, or systems trained on non-representative datasets can unintentionally lock out certain communities. There are also serious cybersecurity risks. Attacks on AI-enabled systems could disrupt essential services or expose sensitive personal data, undermining public trust.\nFor the World Bank Group, the priority is to put responsible AI governance and cybersecurity at the core, not as an afterthought. That means strong data governance, transparency around how algorithms are deployed, effective grievance redress mechanisms, and clear lines of accountability.\nIndia has already taken important steps in this direction. The Digital Personal Data Protection Act establishes clear rules on consent, data handling responsibilities, and cross-border data sharing. Building on this emphasis on trust, Prime Minister Narendra Modi, at the AI Impact Summit, called for a “glass box\" approach to AI. The idea is simple but powerful – AI systems should be open, explainable, and governed by visible and verifiable safety rules, not hidden behind opaque black boxes.\nSeveral Indian states are now experimenting with AI in policing, education, and social services. Is the World Bank engaging directly with state governments on AI deployment and, if so, how does it ensure consistency with national and global safeguards?\nPaul Procee: AI governance cannot stop at state or national borders. Data flows freely across jurisdictions, and risks such as cyber threats or misinformation do not respect boundaries. That is why regulation must be rooted in local realities, but anchored in shared global principles.\nThe World Bank Group follows a layered approach. At the state level, AI deployment must comply with national laws. At the same time, it should reflect global best practices on fairness, transparency, accountability, and data privacy.\nStates need room to tailor AI tools to local needs, but within a common safeguards framework. The approach we advocate is risk-based, principles-driven, and aligned with each country’s institutional capacity and level of digital maturity.\nThis philosophy extends globally. For instance, we have supported the development of the African Union AI Continental Strategy, which strikes a balance between regional coordination and national flexibility.\nAI may be borderless, but governance cannot be one-dimensional. It has to operate simultaneously at the local, national, and global levels to ensure innovation moves forward safely, inclusively, and with shared standards of trust.\nIndia increasingly positions itself as a voice for the Global South on technology governance. Does the World Bank see India as a co-architect of global AI norms, or mainly as a test case whose lessons are later exported elsewhere?\nPaul Procee: India is both a co-architect of global AI norms and a proving ground for inclusive AI at scale. Its strength lies in its ability to pilot innovation through regulatory sandboxes and targeted programmes, and then rapidly scale what works. That transition from proof of concept to nationwide impact offers powerful lessons for other developing economies.\nMore importantly, India is helping reframe the global AI conversation. Instead of focusing only on ever larger models or greater computing power, it is pushing the debate toward development outcomes such as jobs created, productivity gains, and better public service delivery. The World Bank Group is partnering with India in this shift by supporting “small AI\": task-specific, multilingual systems that function on low bandwidth and basic smartphones.\nIndia’s leadership also matters at the regional and Global South level. Not every country can build large-scale computing infrastructure on its own, but shared facilities, common standards, and open-source partnerships can expand collective capacity. With its scale, technical talent, and policy ambition, India is shaping how AI governance and digital development evolve across the Global South.\nFinally, after listening to leaders and industry voices at the AI Impact Summit, what is the most promising signal you’ve seen for AI-led development – and what is the most uncomfortable truth about AI and inequality that policymakers still prefer to avoid?\nMahesh Uttamchandani: The most promising signal is the growing recognition that AI can create jobs and expand opportunity when it is designed for inclusion. “Small AI\", practical and affordable tools, is already showing results. We see students receiving personalised learning support, farmers accessing better advisory services, small entrepreneurs building digital credit histories, and clinics extending care to underserved communities. These applications boost productivity and open new pathways to employment for people who are often left behind.\nTo turn this potential into real jobs and opportunity, countries need to learn from one another. That is why the World Bank Group, together with six other multilateral development banks, has launched the AI Repository. It brings together real-world AI applications in development, allowing governments to adapt, replicate, and scale what is proven to work.\nThe uncomfortable truth is that inclusion also increases exposure. As the poorest and most vulnerable are brought into digital systems, risks are unavoidable, from fraud and misinformation to algorithmic bias. Policymakers still tend to treat safeguards as secondary. That is a mistake. Responsible regulation, strong consumer protection, transparency, accountability, and human oversight must be built in from the start. AI can be a powerful force for development, but managing its risks is not optional. It is a shared responsibility.\nLatest Blogs",
        "link": "https://www.news18.com/india/india-shows-how-ai-can-work-at-scale-but-inclusion-remains-the-challenge-world-bank-exclusive-ws-l-9923493.html",
        "date": "Sun, 22 Feb 2026 20:51:25 +0530",
        "fetched_at": "2026-02-24 04:00:32.747671"
    },
    {
        "title": "Karnataka Govt Considers Ban On Mobile Phones For Students Under 16 Over Addiction Fears",
        "content": "The Karnataka government is considering a significant move that could change how young students interact with technology. Chief Minister Siddaramaiah has initiated discussions on restricting mobile phone use for children below the age of 16, citing growing concerns over social media addiction and its impact on young minds.\nThe issue was raised during a meeting with vice chancellors of government universities. Seeking their views, the Chief Minister questioned whether such a restriction would be practical and beneficial.\n“Today we are discussing this, and as you are all Vice Chancellors here, I seek your opinion. Children are falling prey to drugs. Also, in line with Australia and some European countries, there is a thought to ban mobile phones among students. I want your opinion on this. We are looking at this for children below 16, not adults. Many of them are falling prey to social media addiction,\" Siddaramaiah said.\nThis comes amid increasing concern about excessive screen time among teenagers. Studies have linked prolonged phone usage to poor concentration, behavioural changes, and mental health challenges.\nAuthorities are now looking for possible ways to implement it across schools and colleges.\nIf approved, Karnataka would join countries like Australia that have introduced measures to curb digital addiction among school students. The proposed restriction would apply only to minors under 16.\nMeanwhile, neighbouring Andhra Pradesh is also reviewing social media regulations. A Group of Ministers led by Nara Lokesh has been formed to examine existing laws and consider stricter controls on children’s online access.\nA final decision in Karnataka is expected after consultations with education experts and stakeholders.\nLatest Blogs",
        "link": "https://www.news18.com/india/karnataka-govt-considers-ban-on-mobile-phones-for-students-under-16-over-addiction-fears-ws-el-9923193.html",
        "date": "Sun, 22 Feb 2026 16:39:06 +0530",
        "fetched_at": "2026-02-24 04:00:33.462392"
    },
    {
        "title": "Bangladesh Joins 88 Other Countries To Endorse New Delhi Declaration On AI Impact Summit",
        "content": "Bangladesh has joined 88 other countries and international organisations in endorsing the New Delhi Declaration on AI Impact, adopted at the conclusion of the AI Impact Summit 2026 held in the national capital on February 18–19.\nThe Declaration, backed by a total of 89 countries and international bodies, lays out a shared global vision for collaborative, trusted, resilient and inclusive artificial intelligence development.\nBangladesh’s endorsement underscores the growing regional support for India’s call for “AI for All,\" rooted in equity, access, and global cooperation.\nThe Declaration is guided by the principle of “Sarvajan Hitaya, Sarvajan Sukhaya\" (Welfare for All, Happiness for All), emphasising that AI’s benefits must be equitably shared across humanity.\nThe document highlights the need to strengthen international cooperation, promote multistakeholder engagement, respect national sovereignty and advance accessible and trustworthy AI frameworks.\nThe New Delhi Declaration is structured around seven key pillars or “Chakras\" democratizing AI resources, economic growth and social good, secure and trusted AI, AI for science, access for social empowerment, human capital development, and resilient and efficient AI systems.\nThese pillars aim to expand digital infrastructure, ensure affordable access to AI tools, promote energy-efficient systems, and prepare nations for an AI-driven economy through skilling and reskilling initiatives.\n.\nThe Summit also announced several voluntary collaborative initiatives, including the Charter for the Democratic Diffusion of AI, the Global AI Impact Commons, and the Trusted AI Commons.\nOther initiatives include an International Network of AI for Science Institutions and a Workforce Development Playbook to guide countries in AI literacy and capacity building.\n.\nThe list of endorsing countries includes nations across Asia, Europe, Africa and the Americas, along with international organisations such as the European Union and IFAD.\nBangladesh is listed among the endorsing nations, reflecting its support for the voluntary and non-binding global framework on AI governance.\nWith the New Delhi Declaration now adopted, participating countries have committed to continued cooperation to translate the Summit’s vision into concrete action for responsible and inclusive AI development.\nCountries such as US, UK, UAE, Australia, Singapore and Brazil are among the 89 signatories.\nLatest Blogs",
        "link": "https://www.news18.com/india/bangladesh-joins-88-other-countries-to-endorse-new-delhi-declaration-on-ai-impact-summit-ws-l-9923171.html",
        "date": "Sun, 22 Feb 2026 16:18:06 +0530",
        "fetched_at": "2026-02-24 04:00:34.258371"
    },
    {
        "title": "‘Projects Under BJP Don’t Face Delays': PM Modi Flags Off Namo Bharat, Hits Out At Congress",
        "content": "Prime Minister Narendra Modi on Sunday flagged off India’s first Namo Bharat RRTS in Meerut, Uttar Pradesh, and attacked the opposition, saying projects under the BJP do not face delays and that earlier governments were involved in scams.\nHe inaugurated the entire Delhi-Meerut Namo Bharat corridor and the Meerut Metro (Meerut South-Modipuram), dedicating projects worth around Rs 12,930 crores to the nation.\nSpeaking at the event, the Prime Minister said, “Viksit UP, Viksit Bharat is gaining momentum.\"\nHe said the inauguration reflects the double engine commitment of the BJP. He added that projects undertaken during their tenure do not get delayed like they used to earlier.\nHe said the BJP is focused on working for the benefit of the people and passengers. He claimed that under Congress and SP, such development was not possible and that those parties were indulged in scams.\nThe Prime Minister said the project will benefit the people of Meerut and that the new connectivity will make it easier for people to travel to Delhi.\nHe said his government has taken the metro network to up to 25 cities.\nThe Prime Minister said he spoke with students and other passengers during the visit and that they were amazed to witness the development.\nHe also said that law and order has become better.\nThe Prime Minister said the Namo Metro Rail project will benefit nari shakti, as key positions will be given to women.\nHitting out at the opposition, he said, “Let’s fight on development.\" He added that for his government, the nation’s development has always been the only priority.\nNarendra Modi said the world is looking towards India with huge respect and that developed nations are now eager to associate with the country for development.\nHe said there was a time when Congress could not build associations with developed nations, but today countries want to work with India. He added that the government’s deals will benefit small industries.\nThe Prime Minister said India conducted the world’s biggest AI Summit, with representatives from different parts of the world gathering for the event. He said the summit was organised for the development of the nation.\nHe added that the AI Summit belonged to the nation and was not a BJP event.\nThe Prime Minister alleged that Congress and its ecosystem stooped low with “gandi and nangi politics\" to destroy India’s image. He said, “The whole nation knows ‘Cong pehle se nangi hai’.\"\nHe claimed that Congress leaders hate him and abuse his mother and the NDA. He said Congress has humiliated the nation.\nHe also said the media should not defend Congress in the name of opposition.\nThe Prime Minister added that it is only Congress and its “sarfere neta\" who are destroying the nation. He said that if someone wants to become Prime Minister, they must work hard on the ground.\nHe further said, “Congress desh ke liye bojh ban gayi hai.\"\nLatest Blogs",
        "link": "https://www.news18.com/india/projects-under-bjp-dont-face-delays-pm-modi-flags-off-namo-bharat-hits-out-at-congress-9923018.html",
        "date": "Sun, 22 Feb 2026 14:30:52 +0530",
        "fetched_at": "2026-02-24 04:00:35.212380"
    },
    {
        "title": "‘Imperils India's Image’: Delhi Court Rebukes Youth Congress Over AI Summit Protest",
        "content": "A Delhi Court came down heavily on four members of the Indian Youth Congress (IYC) over their “shirtless protest\" inside Bharat Mandapam during the AI Impact Summit 2026, saying that their conduct was not legitimate dissent, rather a “blatant assault on public order\" that imperilled India’s diplomatic image.\nJudicial Magistrate Ravi made the observation when the four IYC workers were produced before his court. The court sent the four accused to five days of police custody.\nWhile allowing the Delhi Police’s plea for custodial interrogation, the magistrate said that the alleged actions of the accused “imperil not merely the event’s sanctity but also the Republic’s diplomatic image before foreign stakeholders, rendering it wholly unprotected by constitutional safeguards.\"\nAccording to the court order, as accessed exclusively by CNN-News18, the IYC members orchestrated a premeditated intrusion into the high-security precincts of Bharat Mandapam during the AI Summit 2026.\n“…the accused persons are alleged to have orchestrated a premeditated intrusion into the high-security precincts of Bharat Mandapam during the Al Summit 2026, a premier international conclave hosting global delegates and dignitaries,\" the court’s order said.\nWhile seeking custody of the arrested activists, the Police told the court that the accused donned provocative T-shirts bearing slogans such as “India US Trade Deal Compromised\", raised slogans, obstructed public servants, and allegedly assaulted police personnel, causing injuries substantiated by medico-legal reports.\nThey further said that protests were inspired by Nepal’s violent Gen Z movement that toppled the government there.\n“This is a larger conspiracy that has taken inspiration from the Gen Z protests in Nepal. The accused need to be confronted with each other as well as with digital evidence. This is a very important investigation,\" police said.\nThe court said custodial interrogation was essential to unearth a larger conspiracy, funding sources, digital evidence and possible absconding associates. It noted that the accused hailed from remote regions, raising concerns about flight risk.\nThe magistrate said the alleged offences warrant “stringent scrutiny\" as they posed a grave threat to public order and state security at an international forum.\nIndia hosted the world’s largest artificial intelligence conclave, the AI Impact Summit-2026. The summit that began on February 16 has seen packed halls and long queues, as tech moguls, industry leaders, policymakers, founders, and technologists thronged the Bharat Mandapam.\nAround 10 activists of the Congress’s youth wing had entered the AI Summit venue in New Delhi and staged a shirtless protest, raising slogans against Prime Minister Narendra Modi over the India-US trade deal. The protesters wore or carried white T-shirts printed with images of PM Modi and US President Donald Trump along with slogans targeting the government.\nSecurity personnel quickly intervened and the protesters were later arrested for disrupting the high-profile summit, which was attended by global technology leaders including Sam Altman and Sundar Pichai.\nThe protest sparked a political row, with BJP leaders condemning it as “anti-national\" and accusing the Congress of harming India’s global image, while the Congress defended the demonstration as legitimate democratic dissent reflecting youth anger.\nLatest Blogs",
        "link": "https://www.news18.com/india/imperils-indias-image-delhi-court-rebukes-youth-congress-over-ai-summit-protest-9922997.html",
        "date": "Sun, 22 Feb 2026 14:10:39 +0530",
        "fetched_at": "2026-02-24 04:00:35.955500"
    },
    {
        "title": "Karnataka Minister Hints Congress High Command ‘Have Come To Conclusion’ On Leadership Row",
        "content": "The long-standing leadership uncertainty within Karnataka’s ruling administration appears to be reaching a definitive conclusion following a pivotal meeting in the national capital.\nMinister Satish Jarkiholi, accompanied by former minister KN Rajanna, met with AICC President Mallikarjun Kharge in New Delhi to brief him on the prevailing confusion and several critical issues impacting the state unit.\nSpeaking to the press after the high-level deliberations, Jarkiholi confirmed that the party’s central leadership has finalised its stance on the internal friction that has dominated the state’s political discourse for months.\nDuring the interaction, Jarkiholi emphasised the urgency of the situation, stating that the local leadership had clearly communicated the need for a swift resolution.\n“We brought the developments in the state to his notice and requested that the confusion be resolved at the earliest,\" Jarkiholi said. He revealed that the AICC President offered specific suggestions and firm assurances that the matter would be addressed without further delay, marking a shift in the central leadership’s tone.\nHighlighting the weight of the conversation, Jarkiholi noted, “For the first time, he has said that we have come to a conclusion.\"\nThe minister further stressed that the entire party and its grassroots workers are currently awaiting clarity on the issue to ensure organisational stability.\nThe news of the High Command’s “conclusion\" was met with a positive response from Deputy Chief Minister DK Shivakumar in Bengaluru. Speaking to reporters at the Karnataka State Higher Education Council, the DCM expressed his relief regarding the progress made in New Delhi.\n“I am happy about AICC President Mallikarjun Kharge’s assurance to Satish Jarkiholi on resolving leadership issue in Karnataka,\" Shivakumar stated, suggesting a readiness to move forward under the party’s new directive.\nDespite the sense of resolution, the political atmosphere remains sensitive to ongoing internal communications. When questioned about the Chief Minister’s recent article and a series of high-profile tweets that have fuelled further speculation, Shivakumar remained tight-lipped.\n“I don’t have any information on that,\" he remarked, choosing to focus on the central leadership’s upcoming formal announcement.\nAs the state government awaits the official implementation of the High Command’s decision, the focus shifts to how this “conclusion\" will reshape the power dynamics within the Karnataka Congress\nLatest Blogs",
        "link": "https://www.news18.com/india/aicc-chief-kharge-announces-solution-to-karnataka-congress-crisis-ws-bkl-9922756.html",
        "date": "Sun, 22 Feb 2026 11:42:35 +0530",
        "fetched_at": "2026-02-24 04:00:37.223013"
    },
    {
        "title": "At AI Summit, The World Saw India's Amazing Capabilities: PM Modi On Mann Ki Baat",
        "content": "PM Narendra Modi addressed the nation in the 131st episode of Mann Ki Baat on Sunday, February 22. He said the world saw India’s amazing capabilities at the recently concluded AI Impact Summit.\nPM said the global leaders at the Summit were amazed at how India is preserving its ancient knowledge with the help of technology.\nThe Prime Minister said leaders from across the world attended the summit and two products in particular greatly impressed them. He said the first product was showcased at Amul’s booth. It explained how AI is helping in the treatment of animals and how farmers are keeping track of their dairy and livestock with 24×7 AI assistance.\nThe second product was related to Indian culture. The Prime Minister said global leaders were amazed to see how AI is being used to preserve ancient texts, knowledge and manuscripts, and adapt them for today’s generation.\nHe said the Sushrut Samhita was selected for display during the exhibition. In the first step, technology was used to improve the image quality of manuscripts and make them readable. In the second step, the images were converted into machine-readable text. In the next step, the machine-readable text was read by an AI avatar. He said it was also demonstrated how this Indian knowledge can be translated into Indian and foreign languages.\nThe Prime Minister said India also launched three Made in India AI models during the event. He described it as the biggest AI summit so far and said the enthusiasm and excitement of the youth was worth watching. He congratulated the country for the success of the summit.\nHe also said, “The one who plays, blooms,\" adding that sports unite the country. Referring to the T-20 World Cup matches, he said many people would have fixed their eyes on a particular player while watching the games.\n\" Sports also unites us. These days, you must be watching the T-20 World Cup matches. And I am very sure that while watching the match, many times your eyes must have been fixed on a particular player,\" said the Prime Minister.\nPM Modi also remembered Aalin Sherin Abraham, a 10-month-old girl from Kerala who became the state’s youngest organ donor. Speaking during Mann Ki Baat, he said the pain of losing a very young child is deep and inconsolable. He also acknowledged her parents’ decision to donate her organs.\nLatest Blogs",
        "link": "https://www.news18.com/india/pm-modi-on-mann-ki-baat-leaders-at-ai-summit-amazed-at-indias-preservation-of-ancient-knowledge-9922759.html",
        "date": "Sun, 22 Feb 2026 11:41:20 +0530",
        "fetched_at": "2026-02-24 04:00:37.951973"
    },
    {
        "title": "'We May Have Internal Rifts But...': Akhilesh Yadav Calls Congress Protest At AI Summit 'Shameful'",
        "content": "Samajwadi Party chief and Congress’ INDIA bloc ally, Akhilesh Yadav on Saturday criticised the “shirtless protest\" by the Indian Youth Congress at the AI Impact Summit, saying it should have avoided actions that could project India negatively before foreign delegates at Bharat Mandapam.\nSpeaking to reporters in Jhansi, the SP chief said that such actions bring “shame\" to the nation.\n“We may have internal rifts; the whole nation knows that the BJP lies. But, they should have refrained from doing something that brings shame to our country in front of foreign delegates and world representatives,\" Yadav said.\nYSR Congress Party chief and former Andhra Pradesh Chief Minister Y. S. Jagan Mohan Reddy also posted on X, stressing the need to present a united front to the world despite political differences.\n“Yesterday at the AI Summit, the Youth Congress made us all feel ashamed. Where is our politics heading! No one should ever demean our country. Whatever our political differences may be, we should always present a united face to the world,\" he wrote.\nThis comes after Youth Congress workers on Friday carried out a “shirtless\" protest inside the venue, waving t-shirts with protest messages targeting ‘compromised Prime Minister Narendra Modi\".\nThe protest quickly spiralled into a political flashpoint, triggering counter-demonstrations and clashes between Bharatiya Janata Party and Indian National Congress workers in Puducherry and Indore.\nCongress Reacts\nMeanwhile, the Congress leaders came forward to defend the Youth Congress’ move.\nKarnataka Minister Priyank Kharge said the manner of protest staged by the Indian Youth Congress may not have been in the “right spirit\", but the BJP should instead be embarrassed over the controversy surrounding the display of alleged Chinese products at the event.\nThe Patiala House Court on Saturday dismissed the bail pleas of four arrested Indian Youth Congress workers and remanded them to five days of police custody.\n(With inputs from ANI)\nLatest Blogs",
        "link": "https://www.news18.com/india/we-may-have-internal-rifts-but-akhilesh-yadav-calls-congress-protest-at-ai-summit-shameful-ws-l-9922635.html",
        "date": "Sun, 22 Feb 2026 09:00:03 +0530",
        "fetched_at": "2026-02-24 04:00:38.654676"
    },
    {
        "title": "One Call Home: Indian Govt Plans Global Toll-Free Passport Helpline | Exclusive",
        "content": "The Government of India is preparing to introduce an international toll-free number service that will allow Indian citizens abroad to connect directly with passport support services in India—without paying for the call. There will be no international calling charges and no complicated routing. Just a single number that works.\nFor millions of Indians living, studying, and working abroad, questions about passport renewal, reissue, or urgent grievances can come at stressful moments—a lost passport before a flight, a name correction needed for a visa, or a delay that threatens a job opportunity. In those moments, what matters most is simple access to help.\nThe Ministry of External Affairs is now working to make that access easier than ever. CNN-News18 has accessed a document that has details of the proposal.\nThe proposed international toll-free number service is designed to bridge physical distance with seamless communication. Citizens calling from outside India will dial a dedicated toll-free number from their respective countries.\nThat call will automatically land at the existing Passport Seva Programme Contact Centres located in India. The experience will feel local to the caller, even if the support team is thousands of miles away. The objective is inclusivity—ensuring that even citizens in countries without an Indian embassy or consulate can still reach help.\nFor a student in Europe who has misplaced her passport or a worker in West Asia needing urgent clarification, the process will be straightforward. Dial the toll-free number. Speak to a trained representative. Receive guidance. Raise a grievance if required. All without worrying about international call charges.\nUnder the proposed framework, the selected telecommunications service provider will provision international toll-free number access across multiple countries worldwide.\nWhere feasible, a single international number will cover as many countries as possible. In locations where regulations or telecom limitations prevent the use of the same number, alternate toll-free numbers will be arranged.\nThe calls will originate from multiple countries and terminate within India at the Passport Seva Contact Centres. The entire cost of the calls will be borne by the Ministry of External Affairs. Under no circumstances will any charge be passed on to the caller. That commitment is central to the design of the service.\nBehind the scenes, the system will be built for reliability and scale. The service provider will be required to ensure round-the-clock availability—24 hours a day, seven days a week, all year long. Passport emergencies do not follow office hours, and neither will this helpline.\nThe connectivity will be SIP-based, beginning with a minimum capacity of 40 concurrent calls, with the ability to scale up as demand grows. Redundancy mechanisms, disaster recovery systems, and failover processes will be built in to prevent service interruptions. Real-time monitoring dashboards and detailed Call Detail Records will enable oversight and performance tracking.\nCompliance will also be critical. The service must adhere to all applicable telecom regulations in India, including guidelines issued by the Telecom Regulatory Authority of India and the Department of Telecommunications, as well as regulations in the originating countries. The system must be secure, legally compliant, and operationally robust.\nTo identify the right partner, the ministry has issued a Request for Proposal inviting sealed bids from eligible telecommunications operators. The selected bidder will enter into a formal agreement with the ministry, governed by a master service agreement that outlines technical standards, service level commitments, and operational expectations.\nAt its core, this initiative is about something simple yet powerful—reassurance.\nFor Indians abroad, navigating bureaucratic systems across time zones can feel overwhelming. While embassies and consulates continue to provide vital on-ground support, many routine queries can be resolved through a responsive contact centre.\nThe international toll-free number will ensure that geography is no longer a barrier to that connection.\nThis also reflects the evolution of governance in India. The Passport Seva Programme has already digitised applications, appointments, and tracking systems. Adding a global toll-free helpline extends that digital backbone into the realm of voice support, blending technology with human interaction.\nFor the ministry, this is not merely a telecom procurement exercise. It is a step toward strengthening trust with the Indian diaspora. It signals that whether a citizen is in Delhi, Dubai, Durban, or Dublin, help is only a phone call away—and that call will not cost them anything.\nA passport may be issued in India, but its importance travels the world. With this initiative, so will access to support.\nThis move is part of India’s broader journey into digital governance. Over the past decade, the government has steadily expanded e-governance initiatives under the National e-Governance Plan. Several high-impact services were identified as mission-mode projects, and passport reform became one of the most significant among them. The goal was clear: make passport services faster, more transparent, and more citizen-friendly.\nOver the years, this structure has transformed passport delivery within India. Now the focus is expanding outward—towards Indians living overseas.\nThe Passport Seva Project was launched in June 2012 to modernise the way passports are processed and delivered. Today, passport services are managed through an extensive network that includes 37 Passport Offices, 92 Passport Seva Kendras, 452 Post Office Passport Seva Kendras, and more than 200 Indian Missions and Posts abroad.\nThe system operates in a public-private partnership model with Tata Consultancy Services, while the sovereign functions—verification, granting, and issuance of passports—remain firmly with the Ministry of External Affairs. The ownership of data and strategic control also stays with the government.\nLatest Blogs",
        "link": "https://www.news18.com/india/one-call-home-indian-govt-plans-global-toll-free-passport-helpline-exclusive-9922559.html",
        "date": "Sun, 22 Feb 2026 08:00:58 +0530",
        "fetched_at": "2026-02-24 04:00:41.374326"
    },
    {
        "title": "‘Made In India Chip Vital For Self-Reliance’: PM Modi At Greater Noida Semiconductor Facility Launch",
        "content": "Prime Minister Narendra Modi on Saturday laid the foundation stone of the HCL-Foxconn semiconductor facility in Uttar Pradesh, calling it a key milestone for the nation’s self-reliance in semiconductor chips.\n“We are proud that Uttar Pradesh is becoming a part of the semiconductor ecosystem in the country. This semiconductor unit will give new recognition to the state. Moreover, it will boost employment, as the establishment of a semiconductor facility attracts ancillary industries, which will ultimately generate more jobs,\" Modi said in a virtual address.\nTaiwan’s Foxconn and India’s HCL Group formed a joint venture, called India Chip Private Limited, to set up an Outsourced Semiconductor Assembly & Test (OSAT) facility at YEIDA (Yamuna Expressway Industrial Development Authority) in Greater Noida. The advanced facility is expected to be operational by 2028.\nIn his address, PM Modi said a weak supply chain of tiny chips during the Covid-19 pandemic halted development of several economies and stopped work at various factories. “Developed India will be built only when India is self-reliant. For this, Made in India chip is very important. Whatever India is doing in the field of technology in this decade, it will become foundation of our capability in the 21st century,\" Modi said.\nThe establishment of the HCL-Foxconn semiconductor facility in Uttar Pradesh is a step towards technological self-reliance. It will boost India’s presence in the global chip ecosystem.https://t.co/DNY4D9MDUz— Narendra Modi (@narendramodi) February 21, 2026\nThe Prime Minister also said four semiconductor units, out of the ten approved under the India Semiconductor Mission, are set to begin production in the country. “If India’s chips are made in India, we will not have to rely on others for the tech manufacturing needs. Digital India, semiconductor chips, EVs, 5G, and AI are the soul of everyday needs. If we have chips of our own, our progress in every sector will remain unimpeded,\" he said.\nHCL Group has earmarked an investment of Rs 3,700 crore over the next few years in the facility that will produce display driver chips. The investment is expected to create over 3,500 direct and indirect jobs, build local supply chains, and attract ecosystem partners across the semiconductor value chain.\nUP Chief Minister Yogi Adityanath and Union IT Minister Ashwini Vaishnaw were also present on the occasion. They were joined by Roshni Nadar Malhotra, chairperson, HCL Group, and Bob Chen, president (semiconductor business group), Hon Hai Technology Group (Foxconn).\n“In the last 11 years, the Prime Minister has established India as a powerhouse of electronics manufacturing. India is now ranked third among nations that export electronics. In a month, 3.6 crore chips will be produced from this plant. The brain of the digital screens that you see will now be made in Jewar,\" Union Electronics and IT Minister Ashwini Vaishnaw said.\nHCL Group Chairperson Roshni Nadar said the joint venture facility will cater to the requirements of both domestic and international markets. Bob Chen also addressed the event, saying, “We want to establish reliable semiconductor assembly and testing facility in India. We look forward to growing together and contributing to India’s growth in global technology landscape.\"\n(with inputs from PTI)\nLatest Blogs",
        "link": "https://www.news18.com/india/made-in-india-chip-vital-for-self-reliance-pm-modi-at-greater-noida-semiconductor-facility-launch-ws-l-9922241.html",
        "date": "Sat, 21 Feb 2026 19:02:37 +0530",
        "fetched_at": "2026-02-24 04:00:42.051669"
    },
    {
        "title": "Economic Growth, Social Good: 88 Nations Endorse AI Impact Summit Declaration In New Delhi",
        "content": "More than 80 countries signed the AI Impact Summit Declaration in New Delhi on Saturday, which called for “advancing secure, trustworthy and robust AI\", deeming it foundational to build trust and maximise societal and economic benefits.\nThe New Delhi Declaration underscored that the wide-scale adoption of AI and AI-based applications holds unprecedented potential to drive economic and social development. “Open-source AI applications and other accessible AI approaches, where appropriate, and wide-scale diffusion of AI use cases can contribute to scalability, replicability, and adaptability of AI systems across sectors,\" it read.\nThe Declaration called for further international cooperation and multistakeholder engagement across our countries along the seven chakras (pillars) of the summit, centred around the principles of development of human capital to broaden access for social empowerment, trustworthiness of AI systems, democratising AI resources and use of AI for economic growth and social good.\nAt least 88 countries, including China, Australia, France, Germany, Russia, Saudi Arabia, Singapore, the United States, and the European Union (EU) endorsed the Delhi Declaration for a reliable and secure artificial intelligence.\nDemocratising AI Resources For Social Good\nThe voluntary, non-binding document proposed several initiatives, including pooling AI research capabilities internationally, to promote AI for ensuring a prosperous future for humanity. It called for promoting access to foundational AI resources, support locally relevant innovation, and strengthen resilient AI ecosystems while respecting national laws.\n“Advancing secure, trustworthy and robust AI is foundational to building trust and maximising societal and economic benefits,\" it read, adding that it can contribute positively to scientific research and development.\n“AI holds the potential to uplift all sections of society by enabling individuals to access knowledge, cross-border AI solutions, information, services, opportunities and enhancing participation in social and economic activities. We recognise the importance of collaborations that would facilitate AI adoption for social empowerment,\" it added.\nThe document also recognised the importance of AI in human resource development, specific initiatives on education and public awareness. “Recognising the growing demands of AI on energy, infrastructure, and natural resources, we underscore the importance of developing energy-efficient AI systems,\" it said.\n“We acknowledge that the AI Impact Summit will contribute to strengthening international cooperation and a multistakeholder approach to advance shared priorities as well as voluntary and non-binding guidelines and principles, which can promote AI for ensuring a prosperous future for humanity.\"\nIndia AI Impact Summit 2026\nThe India AI Impact Summit 2026 was held from February 16 to 21 at Bharat Mandapam in New Delhi. It is the first major global AI event hosted in the Global South. The summit, organised under the IndiaAI Mission, focuses on People, Planet and Progress. It features 12 indigenous foundation models in 22 Indian languages and pavilions from France, Japan, the UK and others.\nThe event, following the UK’s first AI Summit in 2023 and France’s 2025 edition, is the fourth annual global meeting to discuss how to handle generative AI and hosted more than 20 heads of state, along with top tech leaders and innovators.\nHot topics at the Delhi gathering included the societal benefits of multilingual AI translation, the threat of job disruption and the heavy electricity consumption of data centres. The event was extended by a day due to an overwhelming response and to maximise the number of signatories.\nThe next AI summit will take place in Geneva in 2027. In the meantime, a UN panel on AI will start work towards “science-led governance\", the global body’s chief Antonio Guterres revealed on Friday.\nLatest Blogs",
        "link": "https://www.news18.com/india/india-ai-impact-summit-2026-adopts-delhi-declaration-endorsed-by-88-nations-secure-trusted-ai-ws-l-9922090.html",
        "date": "Sat, 21 Feb 2026 18:01:26 +0530",
        "fetched_at": "2026-02-24 04:00:42.797093"
    },
    {
        "title": "'Studying Developments': Centre's First Response After US Top Court Strikes Down Trump's Tariffs",
        "content": "In its first response to the US Supreme Court’s verdict to strike down the reciprocal tariffs imposed by Donald Trump, the Central government of India said it is studying all developments, from the court’s judgment to Trump’s following remarks, to analyse their implications.\n“We have noted the US Supreme Court judgement on tariffs yesterday. President Trump has also addressed a press conference in that regard. Some steps have been announced by the US Administration. We are studying all these developments for their implications,\" the Ministry of Commerce wrote in an official statement.\nThis came after the US Supreme Court dealt a major blow to the Trump administration by ruling that it did not have the legal authority to impose sweeping global tariffs under emergency powers. Earlier today, Union Minister Prahlad Joshi on Saturday said the Centre will examine the ruling and either the Commerce Ministry or the Ministry of External Affairs will officially react to it.\nIn a 6–3 decision, the court said the International Emergency Economic Powers Act (IEEPA) does not give a president the power to introduce broad, across-the-board tariffs on imports. The judgment could open the door to refund claims potentially worth tens of billions of dollars.\nUS-India Trade Deal\nWithin hours of the ruling, Trump appeared before reporters and announced a new round of tariffs, signalling that his trade agenda would move forward despite the setback. The president declared a fresh 10 per cent global tariff to be added on top of existing duties.\nTrump also said the existing trade framework with India will continue unchanged. Responding to a question about whether the trade deal or framework with India would still stand, Trump said, “Nothing changes. They will be paying tariffs. And we will not be paying tariffs. This is a reversal for what it used to be.\"\nReferring to Prime Minister Narendra Modi, Trump said, “India, Prime Minister Modi is a great man, but he was much smarter than the people he was against in terms of the United States. He was ripping us off.\"\nThis came after an interim trade deal between India and the US was announced this month, which reduced US tariffs on Indian imports from 50% to 18% in exchange for Delhi’s promise to stop buying Russian oil.\nHowever, after the Supreme Court verdict, a White House official said that Trump’s sweeping new 10% global tariff will reset rates for all major trading partners, including India. “This is, however, only temporary as the administration will be pursuing other legal authorities to implement more appropriate or pre-negotiated tariff rates,\" the official told AFP.\nA three-day meeting between Indian and American officials to finalise the legal text for an interim trade agreement will begin in the US on February 23, an official told PTI. The Indian team will be headed by chief negotiator Darpan Jain, who is a joint secretary in the Commerce Ministry.\nLatest Blogs",
        "link": "https://www.news18.com/india/were-studying-developments-centres-first-response-to-us-top-courts-decision-on-trumps-tariffs-9921886.html",
        "date": "Sat, 21 Feb 2026 16:44:49 +0530",
        "fetched_at": "2026-02-24 04:00:43.516070"
    },
    {
        "title": "Global South Can’t Just Consume AI, We Must Build It Ourselves: Brazil Tech Minister | Exclusive",
        "content": "Against this backdrop, CNN-News18 spoke with Luciana Santos, Brazil’s Minister of Science, Technology and Innovation, who explained why Brazil sees India not just as a partner, but as a co-shaper of a more inclusive AI order, one where innovation is guided by public interest, democratic governance, and the realities of the Global South, rather than dominated by a few powerful players.\nA post shared by Luciana Santos (@lucianasantos)\nEdited Excerpts:\nBrazil often speaks of AI as a tool for social inclusion, yet large parts of the Global South remain data-poor and compute-poor. How does Brazil realistically prevent AI from deepening inequality rather than reducing it?\nThe risk that artificial intelligence could deepen inequality is real, especially when much of the Global South still faces structural gaps in data availability, computing infrastructure, and skilled human capital. Brazil’s response is to treat AI not just as a technology push, but as a national development project rooted in social inclusion and digital sovereignty.\nThat approach underpins Brazil’s AI Plan 2024-2028, backed by $23 billion reais (about $4.4 billion) in public investment, with nearly 30 per cent already deployed. The focus is on tackling, at scale, the structural drivers of inequality.\nFrom building cutting-edge, renewable-powered supercomputing infrastructure to developing Portuguese-language AI models trained on Brazil’s own diverse data, the aim is to reduce external dependence and avoid imported biases.\nEqually central is large-scale training and reskilling, alongside the strategic use of AI in public services to improve delivery, especially in social sectors.\nBrazil believes that inclusion will not come automatically from innovation. It must be designed through public investment, local capacity-building, and democratic governance, so that the gains from AI are shared broadly, not concentrated in a few regions.\nIndia is positioning itself as an AI bridge between the West and the Global South. Does Brazil see India as a genuine partner in shaping alternative AI models, or is the Global South still largely reacting to rules set elsewhere?\nBrazil clearly sees India as a strategic partner. As major democracies of the Global South facing similar structural challenges, both countries share a responsibility to steer scientific and technological progress toward the public good.\nRather than simply adapting to rules set elsewhere, Brazil and India are well placed to shape their own agenda, grounded in democracy, sustainable development, and social inclusion.\nThis is already taking shape through partnerships between Brazilian and Indian AI centres, including a pilot project on secure, privacy-preserving cross-border data collaboration for medical AI. Using India’s Data Empowerment and Protection Architecture, AI models can be trained without raw data ever leaving the sovereign control of data providers.\nStronger cooperation also boosts our collective voice in global AI governance debates, pushing for frameworks that reflect the realities of the Global South, not just the priorities of major tech powers.\nThat is why summits like this one on AI’s global impact matter. They generate political momentum to democratise access to AI and accelerate its development across the Global South.\nSo, the Global South need not be reactive. Deeper strategic cooperation strengthens our ability to propose, negotiate, and build a more balanced and inclusive international AI governance.\nBrazil has taken a tougher regulatory stance on Big Tech than many emerging economies. Do you worry that stricter AI regulation could slow innovation, or do you believe unchecked innovation is the bigger risk right now?\nWe start from a simple premise: the real question is not whether to regulate or innovate, but how to regulate in a way that enables sustainable and trustworthy innovation.\nAs AI becomes more widespread, the need for strong governance has grown. Clear rules are essential to guide the development, deployment, and use of AI in a safe, ethical, and transparent manner, so its benefits truly serve society. Without them, risks such as algorithmic discrimination or violations of fundamental rights can erode public trust and, over time, undermine innovation itself.\nBrazil has therefore sought a balanced approach. Its AI Bill, approved by the Senate in December 2024 and now before the Chamber of Deputies, adopts a risk-based framework that prioritises users’ rights and participatory governance. Stricter obligations are focused on high-risk systems, while lower-risk applications are spared unnecessary burdens, preserving space for experimentation and new entrants.\nTo reinforce this framework, a complementary bill sent in December 2025 proposes the creation of a National System for the Development, Regulation, and Governance of AI, along with a Brazilian AI Council. By bringing together the National Data Protection Authority and key regulators, the model aims to deliver coordination, predictability, and regulatory clarity, all essential for investment and innovation.\nMuch of Brazil’s AI ecosystem still relies on foreign cloud infrastructure and imported chips. Can Brazil claim AI sovereignty without control over critical compute and semiconductors, and what lessons does it draw from India’s struggles on chip manufacturing?\nAcross the world, countries are increasingly debating what digital sovereignty means in their own national contexts. One widely shared view defines it as the ability to understand how digital technologies work, to develop them, and to regulate them effectively.\nFrom this perspective, sovereignty is not built through isolation, but through stronger technological autonomy achieved via openness, cooperation, and domestic capacity-building. In this context, India emerges as a strategic partner for Brazil, expanding opportunities for technology exchange, joint innovation, and solutions aligned with national priorities, especially in semiconductors, artificial intelligence, high-performance computing, the Internet of Things, blockchain, and advanced communications such as 5G and 6G.\nBrazil is also taking a strategic approach to strengthening its semiconductor ecosystem, focusing on scientific development, skills training, and deeper integration into global value chains through robust workforce programmes and incentives to expand the semiconductor supply chain.\nAt the same time, under Brazil’s AI Plan, the country is building a national public-sector data infrastructure, including sovereign cloud systems developed through partnerships between public data companies and multiple cloud providers. These arrangements are designed to ensure digital sovereignty, transparency, control, trust, and cybersecurity.\nAs BRICS expands its focus on technology cooperation, do you see scope for a BRICS-led AI framework that challenges Western-dominated governance models, or are internal differences too wide to bridge?\nBrazil is an active participant in several multilateral forums on AI governance, consistently stressing the need to promote AI for the benefit of all people, nations, living beings, and the planet. This approach is multi-stakeholder by design, bringing together governments, the private sector, academia, and civil society.\nWithin BRICS, member countries have advanced this vision through debates and conferences aimed at building consensus while respecting each country’s diversity and specific national realities.\nDuring Brazil’s BRICS presidency, the bloc discussed and adopted a declaration on AI governance and principles for the use of artificial intelligence, clearly outlining areas of shared interest. Brazil’s leadership marked an important step toward consensus-building and laid the groundwork for deeper discussions within BRICS going forward.\nFinally, from your perspective at the summit, what has been the most encouraging moment you’ve witnessed here—and what is the most uncomfortable truth about the Global South’s AI ambitions that leaders are still reluctant to admit?\nI find it encouraging to see the Global South leading a complex process such as an AI summit and agenda. This is not only possible, it is necessary. Yet we still remain heavily dependent on platforms, models, and infrastructure controlled by a handful of countries and companies.\nWithout strategic cooperation, long-term investment, and collective negotiation, there is a real risk of reproducing in AI the same technological inequalities of the past. When a few actors control algorithms and digital infrastructure, this is no longer innovation, it is domination.\nDeveloping countries cannot remain mere consumers of technology. They must build their own capabilities through technology transfer, talent development, and sovereign infrastructure.\nLatest Blogs",
        "link": "https://www.news18.com/india/global-south-cant-just-consume-ai-we-must-build-it-ourselves-brazil-tech-minister-exclusive-ws-kl-9921828.html",
        "date": "Sat, 21 Feb 2026 17:44:37 +0530",
        "fetched_at": "2026-02-24 04:00:44.183614"
    },
    {
        "title": "New Government, New Start? Dhaka Ends Visa Freeze, Moves To Stabilise Ties With India | Exclusive",
        "content": "In a significant diplomatic development, Bangladesh has fully resumed all visa and consular services at its missions in India, ending a nearly two-month suspension that had marked a low point in bilateral ties.\nThe resumption, effective February 20, applies to all categories, including tourist, medical, business, work and other visas, at Bangladesh’s missions in New Delhi, Agartala and Siliguri. All services had previously been restricted or suspended amid a diplomatic standoff.\nThe move comes just three days after Tarique Rahman was sworn in as prime minister of Bangladesh on February 17, following his party’s decisive electoral victory. Government sources described the decision as one of the new administration’s first major foreign policy steps aimed at stabilising relations with India.\nEnd Of A Two-Month Standoff\nVisa operations had been partially suspended since December 2025 during the interim administration led by Muhammad Yunus, as ties between the two neighbours grew strained. The freeze affected travel for thousands of people, including patients seeking medical treatment, students, businesspersons and families with cross-border ties.\nDiplomatic observers had described the suspension as one of the most visible signs of deteriorating relations between New Delhi and Dhaka in recent years.\nWith the full restoration of services, Bangladeshi missions in India have resumed processing all pending and fresh applications across categories.\nA Deliberate Diplomatic Signal\nTop government sources indicated that the move is being viewed as a deliberate outreach from the new BNP-led government under Rahman to reset ties with New Delhi after the uncertainty of the interim phase.\n“This is among the first tangible foreign policy decisions of the new government,\" a senior official said, adding that normalising mobility and people-to-people contact was a priority.\nThe development also follows reciprocal signals from India. A senior consular representative confirmed that New Delhi is taking steps to fully restore visa services for Bangladeshi nationals in Bangladesh as well.\nPolitical Shift and What’s Next\nRahman’s swearing-in marks a major political shift in Bangladesh, ending the interim period and ushering in a government with a strong parliamentary majority. Analysts say early diplomatic gestures such as restoring visa services are aimed at reassuring regional partners of policy continuity and stability.\nIndia, for its part, is understood to be keen on rebuilding momentum in the relationship. Officials are awaiting Rahman’s response to an invitation from Prime Minister Narendra Modi for a visit to India—a potential next step in recalibrating bilateral engagement.\nFor now, the reopening of visa services is being seen as a practical and symbolic reset, signalling that after weeks of uncertainty, the two neighbours may be moving toward a more stable phase in their relationship.\nLatest Blogs",
        "link": "https://www.news18.com/india/new-government-new-start-dhaka-ends-visa-freeze-moves-to-stabilise-ties-with-india-exclusive-ws-kl-9921726.html",
        "date": "Sat, 21 Feb 2026 15:28:38 +0530",
        "fetched_at": "2026-02-24 04:00:44.844864"
    },
    {
        "title": "Chinese Robodog Failure Highlights Galgotias’ Large AI Summit Booth: ‘Bigger Than 4 IITs’ — How Much Did It Cost?",
        "content": "When visitors walked into Hall 6 at Bharat Mandapam during the AI Impact Summit 2026 in New Delhi, one pavilion stood out for its sheer size. Galgotias University, a private institution based in Noida, had a 155-square-metre booth, quite larger than the combined space allotted to several Indian Institutes of Technology (IITs).\nThe development drew attention online, especially after the university was embroiled in the robodog controversy at the same event.\nWhat Happened With The Robodog\nGalgotias University faced backlash after a robotic dog displayed at its stall was presented as an in-house innovation developed by its Centre of Excellence. The robot was later identified as the Unitree Go2, a commercially available quadruped developed by China-based Unitree Robotics.\nThe product is sold globally and is not an original invention. The claim triggered criticism and raised concerns about due diligence at a government-backed event. Following the controversy, the Ministry of Electronics and IT (MeitY) reportedly asked the university to vacate its stall.\nThe Booth Size In Limelight\nAfter the robodog episode, attention turned to pavilion sizes at the summit. According to a floor plan obtained by The Indian Express from organisers, Galgotias University was allotted 155 square metres in Hall 6.\nIn comparison, four IITs and one research foundation together received 130 square metres. The breakup was as follows:\nIIT Bombay – 35 sqm\nIIT Madras – 35 sqm\nIIT Kharagpur – 24 sqm\nIIT Gandhinagar – 18 sqm\nAirawat Research Foundation at IIT Kanpur – 18 sqm\nCollectively, these institutions, though widely regarded as India’s best engineering and research bodies, had less exhibition space than Galgotias alone. The comparison fuelled online debate over how space was allocated at a summit positioned as a showcase of India’s AI ecosystem.\nHere’s What Social Media Said\nJoining in the debate, a user posted on X, “IITs may have thought that their degree and research is enough, but the Galgotia people understood ‘first-come-first-served’ as ‘come first, take all possession’. IIT had 130 sqm of research, so Galgotia had a swag of 155 sqm! It is called – knowledge will decrease, but the shop should be big.\"\nIITs may have thought that their degree and research is enough, but the Galgotia people understood ‘first-come-first-served’ as ‘come first, take all possession’. IIT had 130 sqm research, so Galgotia had a swag of 155 sqm! It is called – knowledge will decrease, but the shop…— Kᴀᴘɪʟ Gᴏᴜʀ (@GaurBulandshahr) February 20, 2026\nAnother simply wrote, “The space given to Galgotias for the AI summit for larger than the space given to 4 IITs combined..\"\nSomeone else said, “They paid more I’d assume? Booth size is always decided by financial contribution!\"\nThe space given to Galgotias for the AI summit for larger than the space given to 4 IITs combined. pic.twitter.com/k5ZBXHveXo— Cooper (@Akshaykpr) February 20, 2026\nHow Was Space Allocated\nThe exhibition space at Bharat Mandapam was reportedly leased on a first-come, first-served basis. Allocation was handled by the Software Technology Parks of India (STPI), an autonomous body under the Ministry of Electronics and IT (MeitY).\nAccording to an organiser cited by The Indian Express, kiosk space was allotted based on demand. Institutions that applied earlier and requested larger areas could secure more space. There was no formal vetting process tied to research output, institutional ranking or contribution to India’s AI ecosystem.\nHow Much Did Galgotias Pay\nThe rate for academic institutions was fixed at Rs 9,000 per square metre.\nWith 155 square metres allotted, Galgotias University paid approximately ₹14 lakh (excluding taxes and electricity connection charges). Institutions with smaller booths paid proportionately less, based on the space they secured.\nSince the pricing was uniform per square metre, the difference in booth size directly translated into a higher payment.\nWhy The Issue Gained Attention\nThe AI Impact Summit was positioned as a platform to showcase India’s innovation capabilities. The presence of IITs and established research bodies was seen as central to that objective, given their long-standing contributions to AI research and technological development. Viewers questioned whether exhibition space at such events should reflect institutional credibility and contribution instead of demand and booking order.\nLatest Blogs",
        "link": "https://www.news18.com/india/galgotias-universitys-ai-summit-booth-bigger-than-four-iiits-here-is-the-cost-aa-9921672.html",
        "date": "Sat, 21 Feb 2026 15:04:27 +0530",
        "fetched_at": "2026-02-24 04:00:46.713877"
    },
    {
        "title": "Delhi Court Grants 5-Day Police Custody To Four Youth Congress Workers Over AI Summit Protest",
        "content": "A Delhi court on Saturday approved a five-day police custody for the four Youth Congress workers who staged a shirtless protest at Bharat Mandapam during the AI Summit.\nWhile seeking remand, Delhi Police said that the accused had staged a protest similar to the protest in Nepal, claiming that it was a conspiracy to defame the country internationally.\nThe public prosecutor told the court that the accused shouted anti-national slogans during their protest against the India-US trade deal and wore T-shirts carrying messages against Prime Minister Narendra Modi.\nAfter being asked why the police wants 5-day custody of the accused, the investigating officer stated that there is a deep conspiracy, that other accused fled the scene, and that custody is needed for a proper investigation.\nMeanwhile, the lawyer for the accused argued that they were being singled out because of their affiliation with the opposition party and claimed that similar protests are occurring across the country. The lawyer added that political dissent shouldn’t be crushed like this.\nThe arrested men, Krishna Hari, Kundan Yadav, Ajay Kumar, and Narasimha Yadav, were brought to Patiala House Court earlier in the day.\nTheir lawyer contended that they are members of a political party and were exercising their right to protest peacefully at Bharat Mandapam, emphasizing that there is no evidence of any violence.\nHe also said they are office bearers and educated people. The charges against them could lead to up to 7 years in prison. The public prosecutor said the accused shouted anti-national slogans and wore T-shirts with messages against Prime Minister Narendra Modi.\nMeanwhile, BJP workers staged protests in multiple states against the Congress party following the Indian Youth Congress demonstration at the India AI Impact Summit.\nIn Surat and Jammu, BJP members held demonstrations targeting Congress, while in Delhi, BJP Yuva Morcha members protested and condemned the incident.\nThe protests came after Indian Youth Congress members at the Bharat Mandapam venue in Delhi removed their shirts bearing slogans such as “Compromised PM.\"\n(With inputs from agencies)\nLatest Blogs",
        "link": "https://www.news18.com/india/delhi-court-grants-5-day-police-custody-to-four-youth-congress-workers-over-ai-summit-protest-ws-kl-9921647.html",
        "date": "Sat, 21 Feb 2026 14:54:39 +0530",
        "fetched_at": "2026-02-24 04:00:47.499828"
    },
    {
        "title": "Bundelkhand ‘Epstein’ & Wife Lure 33 Boys With Games & Cash, Film Abuse, Sell To 47 Nations — Banda’s 3rd Death Penalty",
        "content": "In Uttar Pradesh’s Bundelkhand, the Special POCSO Court in Banda has delivered the harshest punishment under the law to a suspended junior engineer of the irrigation department and his wife. They have been sentenced to death after being found guilty of sexually\nexploiting 33 minor boys and selling their abuse videos on the dark web to buyers across the world.\nThe verdict has shocked many not only because of the disturbing scale of the crime but also because it marks the third death sentence awarded by the same court in just six months.\nWho Is The Judge Who Delivered Three Death Sentences In Six Months?\nThe latest verdict was pronounced by Special POCSO Judge Pradeep Kumar Mishra. With this judgment, he has now awarded the death penalty three times within half a year, Dainik Bhaskar reported.\nIn September 2025, in a village under Chilla police station, a minor girl was raped and murdered. The court completed the trial within 58 days after the charge sheet was filed and sentenced the accused to death.\nIn January, in a case from Kalinjar, another accused in a child rape case was also awarded capital punishment.\nLast year, a rape convict was sentenced to death in Marka. In the Chhota Purwa massacre case where two children were killed, the accused was also given the death penalty.\nSo far, five death sentences have been pronounced in Banda district, the report mentioned. But in older cases, the convicts’ families have filed appeals in the High Court and those matters are currently under consideration.\nWhat Is The Latest Case Of The Junior Engineer And His Wife?\nOn Friday, the POCSO court ordered that Ram Bhavan, a junior engineer posted in Chitrakoot, and his wife Durgawati be “hanged till death.\" The couple had been convicted on February 18 after a detailed trial based on digital evidence, medical reports and testimonies\nfrom dozens of witnesses.\nThe court observed that the crime fell within the “rarest of rare\" category due to its brutality, long duration, systematic planning and international ramifications.\nHow Did The Case Begin?\nThe case began in October 2020 when the Central Bureau of Investigation (CBI) received inputs from INTERPOL about child sexual abuse material linked to an Indian phone number. Acting on this information, the CBI registered an FIR on October 31, 2020.\nRam Bhavan was arrested on November 17, 2020. His wife Durgawati was also taken into custody after investigators found evidence of her involvement.\nThe couple reportedly targeted children from economically weaker families in Banda, Chitrakoot and nearby districts. They lured minors aged between 5 and 16 years by offering gifts and inducements. Once the children were brought home, they were sexually assaulted.\nThe acts were recorded using a laptop camera and mobile phones.\nThe videos and photographs were later uploaded and sold on the dark web to international buyers.\nWhat Did The Digital Investigation Reveal?\nThe CBI recovered a pen drive that contained 34 videos and 679 photographs of minors. After digital forensic analysis, it was found that the material was directly linked to the accused.\nIt was also found that the content was shared with buyers in 47 countries such as China, US, Brazil and Afghanistan.\nThe charge sheet ran into nearly 700 pages and was filed 88 days after the arrests. It included medical examination reports, victim statements, witness testimonies and digital evidence tracing the online distribution network.\n74 witnesses were examined during the trial which included child victims, doctors from AIIMS Delhi, teachers and other witnesses.\nWhat Role Did The Wife Play In The Crime?\nThe court held Durgawati equally responsible. Evidence showed that she actively participated in the exploitation and helped lure children by offering expensive gifts and bringing them into the house.\nThe prosecution also stated that she attempted to influence witnesses and facilitate compromise during the investigation.\nThe court noted that the involvement of both adults in the household deepened the psychological trauma suffered by the children and showed a calculated and sustained pattern of abuse.\nHow Were Children Trapped For Years Without Suspicion?\nRam Bhavan kept a separate mobile phone at home specifically for children. Despite having no children of his own, he used this device to attract neighbourhood minors. Some children admitted that they had visited his house to watch YouTube videos, Navbharat\nTimes reported.\nHe managed to hide his crimes for years due to his polite and simple behaviour. At the time of his arrest, then Chitrakoot SP Ankit Mittal stated that no prior complaint of such nature had ever been received.\nOriginally from Devinka Purwa in Kharaunch village, Ram Bhavan lived in rented houses in Karvi. His brothers resided in the Naraini Atarra Road area. Colleagues described him as soft-spoken and courteous which made it difficult to suspect him.\nHe never applied for government accommodation and instead lived in rented houses. In Sikri village, he rented a house from Kakkoo Singh but had to vacate it within one and a half months after neighbours complained about suspicious activities.\nAt the time of arrest, he was associated with the Arjun Sahayak Project in Mahoba and the Rasin Dam project in Chitrakoot. He was living in a rented house behind the SDM office.\nWhat Did The Court Say About The Impact On Victims?\nWhile delivering the sentence, Judge Pradeep Kumar Mishra described the acts as extremely heinous and said they struck at the foundation of societal morality and child safety.\nDuring the trial, doctors from AIIMS Delhi testified that several children suffered severe physical and psychological trauma. Some had injuries to delicate body parts and required medical treatment in Delhi. The brutality disturbed even the medical team.\nThe court observed that because of the torture, many children’s lives had turned into a living nightmare.\nRecognising the long-term trauma, the court directed the District Magistrate to ensure that each identified victim receives Rs 10 lakh as compensation for rehabilitation and medical support.\nHow Does This Case Echo The Scandal Surrounding Jeffrey Epstein?\nNavbharat Times also compared the case with American financier Jeffrey Epstein who was later exposed as a convicted sex offender running a large child sex trafficking network for years.\nHe was first arrested on July 27, 2006, in Florida in a case related to soliciting a minor for prostitution. Years later, on July 6, 2019, he was taken into custody again, this time facing federal charges of sex trafficking that involved underage girls.\nEven after his death, the controversy surrounding him has not faded. He was found dead in his Manhattan jail cell on August 10, 2019, in what authorities ruled a suicide while he was awaiting trial. The subsequent release of a vast collection of official records,\nwidely referred to as the “Epstein Files,\" has kept him at the center of international legal and political debate.\nLatest Blogs",
        "link": "https://www.news18.com/cities/uttar-pradesh-bundelkhand-je-wife-get-death-penalty-for-sexually-abusing-33-boys-aa-ws-l-9921666.html",
        "date": "Sat, 21 Feb 2026 14:54:56 +0530",
        "fetched_at": "2026-02-24 04:00:48.218225"
    },
    {
        "title": "BJP Workers Wave Black Flags At Rahul Gandhi Over Congress' Shirtless Drama At AI Summit",
        "content": "Workers, supporters and youth wing members of the Bharatiya Janata Party (BJP) staged protests across several cities, condemning the Indian Youth Congress for disrupting the India AI Impact Summit in New Delhi. Demonstrations took place in Delhi, Surat, Mulund in Maharashtra, Hyderabad and other locations, with BJP activists raising slogans and carrying placards denouncing the Congress.\n#WATCH | Patna, Bihar | BJP workers hold a protest against the Congress party over the Indian Youth Congress protest at the India AI Impact Summit yesterday pic.twitter.com/wnjzeNEb1b— ANI (@ANI) February 21, 2026\nIn Mulund, protesters showed black flags to Congress MP Rahul Gandhi as he travelled to Thane to furnish a fresh surety in a defamation case filed by a worker of the Rashtriya Swayamsevak Sangh.\nThe protests follow a incident at the AI Summit in New Delhi, where around 10 Youth Congress activists staged a shirtless protest, raising slogans against Prime Minister Narendra Modi over the India-US trade deal. The protesters wore or carried white T-shirts printed with images of PM Modi and US President Donald Trump.\nSecurity personnel quickly intervened and the activists were arrested for disrupting the high-profile summit, which was attended by global technology leaders including Sam Altman and Sundar Pichai.\nBJP chief Nitin Nabin condemned the protest, accusing certain political parties of aligning with “urban Naxalism.\"\n“We often use the term ‘urban Naxalism.’ I can say that while earlier some parties were merely influenced by it, today they have completely become a part of it,\" he said, adding, “While India is being discussed globally, such a disgraceful act has harmed the country’s progress.\"\nUnion Minister and senior BJP leader Bhupender Yadav called the incident “absolute shamelessness from Congress.\"\n“At a time Bharat is taking strides positioning itself as a global technology powerhouse, Congress is going all out to embarrass the country. This is not political opposition, this is an attempt at sabotaging India’s global image. Despicable,\" he wrote in a post on X (formerly Twitter).\nLatest Blogs",
        "link": "https://www.news18.com/india/bjp-workers-wave-black-flags-at-rahul-gandhi-over-congress-shirtless-drama-at-ai-summit-ws-l-9921602.html",
        "date": "Sat, 21 Feb 2026 14:53:40 +0530",
        "fetched_at": "2026-02-24 04:00:48.991819"
    },
    {
        "title": "Ajit Pawar's Death: Nephew Rohit Pawar Writes To PM Modi, Seeks Ouster Of Civil Aviation Minister",
        "content": "NCP-SP MLA Rohit Pawar on Saturday wrote to Prime Minister Narendra Modi seeking the ouster of Civil Aviation Minister K Rammohan Naidu and demanding an independent probe into the plane crash that killed Maharashtra Deputy Chief Minister Ajit Pawar.\nRohit Pawar, addressing a press conference here, alleged that Ajit Pawar’s death in a plane crash at Baramati last month was caused as part of a conspiracy involving the air charter company VSR.\n“Serious questions have been raised about the company VSR and its links with Rammohan Naidu’s party (TDP). These links must be investigated by an independent and competent authority, preferably in collaboration with international agencies,\" Pawar said in the letter, a copy of which was marked to Home Minister Amit Shah.\nRohit Pawar, a two-term MLA and nephew of NCP-SP leader Supriya Sule and late NCP leader Ajit Pawar, has been addressing press conferences claiming sabotage in the air crash.\n“You have always shown respect for Ajit Dada and his contribution to the country. In this context, I request that Rammohan Naidu be asked to resign from his post,\" the grandson of NCP-SP chief Sharad Pawar said in his letter.\nPawar said his findings have shown that a set of influential people across industry and politics are involved in VSR.\n“This is why we feel this investigation will not happen transparently. I request you to ensure that there is no influence or interference in examining whether the DGCA (Directorate General of Civil Aviation) was compromised in any manner in relation to VSR,\" Pawar said.\nAjit Pawar and four other persons were killed after the air charter they were travelling in crashed barely 200 metres from the edge of a tabletop runway at Baramati airport in Pune district on January 28 this year.\nLatest Blogs",
        "link": "https://www.news18.com/india/ajit-pawars-death-nephew-rohit-pawar-writes-to-pm-modi-seeks-ouster-of-civil-aviation-minister-ws-l-9921618.html",
        "date": "Sat, 21 Feb 2026 14:32:54 +0530",
        "fetched_at": "2026-02-24 04:00:49.699805"
    },
    {
        "title": "‘Their Natural Stupidity...’: KTR Says Congress Protest At AI Summit Tarnishes India’s Image",
        "content": "KT Rama Rao condemned the protest by Indian Youth Congress members at the AI Summit 2026 in New Delhi, accusing them of tarnishing India’s image by staging political demonstrations at a global event. The working president of the Bharat Rashtra Samithi (BRS) said the protest reflected poorly on the country and criticised the Congress party for choosing an international platform for dissent.\n“Natural stupidity of Congress party far exceeds Artificial Intelligence. That’s the tweet,\" Rama Rao said in a post on X (formerly Twitter).\nNatural stupidity of Congress party far exceeds Artificial IntelligenceThat’s the tweet\n— KTR (@KTRBRS) February 21, 2026\nIn another post, he said, “It is absolutely deplorable that members of the Youth Congress chose the AI Impact Summit 2026 as a venue for petty political theatrics.\"\nHe said protests at such events could damage India’s global standing.\n“Using such a global platform for protests will project our great nation India in a poor light internationally. While difference of opinion is natural in a democracy, understanding where and how to protest is very important,\" he said.\nIt is absolutely deplorable that members of the Youth Congress chose the AI Impact Summit 2026 as a venue for petty political theatricsUsing such a global platform for protests will project our great nation India in a poor light internationally\nWhile difference of opinion is… pic.twitter.com/sM3MmIb8UJ\n— KTR (@KTRBRS) February 21, 2026\nRama Rao also pointed to what he described as the irony of the timing.\n“There is a time and place for political dissent, and an international summit is certainly not one of them. And, the irony is hard to miss: Youth Congress guys staged the protest precisely when their own party’s Chief Minister, Revanth Reddy, was addressing the same AI Summit,\" he said.\nYSRCP president YS Jagan Mohan Reddy condemned the protest on X, saying, “Yesterday at the AI Summit, the Youth Congress embarrassed us all. Where is our politics headed? No one should demean our country. Regardless of political differences, we must always present a united face to the world.\"\nYesterday at the AI Summit, the Youth Congress made us all feel ashamed. Where is our politics heading! No one should ever demean our country. Whatever our political differences may be, we should always present a united face to the world.— YS Jagan Mohan Reddy (@ysjagan) February 21, 2026\nThe protest took place in New Delhi when Youth Congress activists entered the summit venue and raised slogans against Prime Minister Narendra Modi, displaying T-shirts carrying political messages related to the India-US trade deal.\nLatest Blogs",
        "link": "https://www.news18.com/india/their-natural-stupidity-ktr-says-congress-protest-at-ai-summit-tarnishes-indias-image-ws-l-9921472.html",
        "date": "Sat, 21 Feb 2026 14:45:23 +0530",
        "fetched_at": "2026-02-24 04:00:50.475596"
    },
    {
        "title": "Congress Protest At AI Summit 'A Larger Conspiracy' Inspired By Nepal’s Gen Z Movement: Delhi Police",
        "content": "Shirtless protests by members of the Indian Youth Congress at the AI Summit venue in the capital were inspired by Nepal’s violent Gen Z movement that toppled the government there, Delhi Police told a court, alleging a larger conspiracy behind the demonstration.\n“This is a larger conspiracy that has taken inspiration from the Gen Z protests in Nepal. The accused need to be confronted with each other as well as with digital evidence. This is a very important investigation,\" police said while seeking custody of the arrested activists.\nPolice told the court that investigators were also probing the funding behind the protest, including who paid for the printing of T-shirts carrying messages such as “PM is compromised\", “India-US Trade Deal\" and “Epstein Files\".\nAround 10 activists of the Congress’s youth wing had entered the AI Summit venue in New Delhi and staged a shirtless protest, raising slogans against Prime Minister Narendra Modi over the India-US trade deal. The protesters wore or carried white T-shirts printed with images of PM Modi and US President Donald Trump along with slogans targeting the government.\nSecurity personnel quickly intervened and the protesters were later arrested for disrupting the high-profile summit, which was attended by global technology leaders including Sam Altman and Sundar Pichai.\nThe protest sparked a political row, with BJP leaders condemning it as “anti-national\" and accusing the Congress of harming India’s global image, while the Congress defended the demonstration as legitimate democratic dissent reflecting youth anger.\nBJP chief Nitin Nabin condemned the protest, accusing certain political parties of aligning with “urban Naxalism\".\n“We often use the term ‘urban Naxalism.’ I can say that while earlier some parties were (merely) affected by it, today they have completely become a part of it,\" Nabin said, adding, “While India is being discussed globally, such a disgraceful act has harmed the country’s progress,\" he added.\nLatest Blogs",
        "link": "https://www.news18.com/india/congress-protest-at-ai-summit-a-larger-conspiracy-inspired-by-nepals-gen-z-movement-delhi-police-ws-l-9921407.html",
        "date": "Sat, 21 Feb 2026 13:06:15 +0530",
        "fetched_at": "2026-02-24 04:00:51.222161"
    },
    {
        "title": "'Disgraceful Conduct': Govt Slams Congress's Protest At AI Summit, Says 'Public Taught Them Lesson'",
        "content": "Union Parliamentary Affairs Minister Kiren Rijiju on Saturday condemned the actions of the Indian Youth Congress activists, who held a protest during the India AI Impact Summit 2026 at the Bharat Mandapam in Delhi on Friday, calling it a “disgraceful conduct.\"\nIn a post on X, the Union Minister stated that he was expecting an apology from Congress but was left in shock when party leaders defended the act.\n“I was expecting that Congress party would apologize for the shameful behavior of youth congress activists. I couldn’t believe my ears when Congress leaders defended the disgraceful conduct!,\" Rijiju tweeted.\nI was expecting that congress party would apologize for the shameful behavior of youth congress activists. I couldn’t believe my ears when Congress leaders defended the disgraceful conduct! Public taught them a lesson!Some Journalists (actually Congress activists) justified too https://t.co/tuu86ugRjH pic.twitter.com/Gi1IhMqNpd— Kiren Rijiju (@KirenRijiju) February 21, 2026\nThe Minister also shared a video showing people beating up the protesters at the summit venue to bring the situation under control. “Public taught them a lesson! Some Journalists (actually Congress activists) justified too,\" he further wrote on X.\nOn Friday, a group of Youth Congress members staged a shirtless protest at Bharat Mandapam, holding posters and chanting slogans against the PM Narendra Modi-led government. Subsequently, the Delhi Police arrested four Congress activists from the group. The four individuals, including Krishna Hari, Kundan Yadav, Ajay Kumar, and Narasimha Yadav, were scheduled to be produced at Patiala House Court at 11.30 am on Saturday.\n‘We’re Descendants Of Gandhi’: Indian Youth Congress Defends Protest\nEarlier in the day, the Indian Youth Congress defended its shirtless protest at the summit, saying the youth wing are “descendants of Gandhi\" while posting a shirtless image of Mahatma Gandhi.\nहम गांधी के वंशज है..Shirtless ही सही।कल भी लड़ रहे थे,आगे भी लड़ते रहेंगे 💯💪 pic.twitter.com/73ET2NnWS0\n— Indian Youth Congress (@IYC) February 21, 2026\n“We are descendants of Gandhi… Shirtless, if need be. We fought yesterday; we will continue to fight ahead,\" the tweet read.\nIn its defence, the Indian Youth Congress on Friday called the party workers “soldiers of the Constitution\" and pledged to continue raising their voices.\nPolice Probe Larger Conspiracy Angle\nPolice officials described the protest as planned. “The incident occurred around 12:30 PM. They registered online and entered through QR code scanning. They were wearing sweaters and jackets on top and a T-shirt underneath. Near Hall 5, they removed their sweaters and jackets. They protested while waving their T-shirts. We are taking appropriate legal action against them,\" CP Devesh Kumar Mahla told ANI.\nInvestigators are examining where the T-shirts were printed and probing a larger conspiracy, noting that protesters had initially planned to use black umbrellas.\nThe protest came after Congress leaders, including Rahul Gandhi and party chief Mallikarjun Kharge, criticised the AI Summit for alleged mismanagement. Kharge described it as “utter chaos,\" claiming visitors and exhibitors faced extreme distress due to lack of basic facilities, while Rahul Gandhi called it a “disorganised PR spectacle\" that allgedly compromised Indian data.\nThe protest drew criticism from summit attendees. Sumit Patni told ANI, “As a visitor, I feel this is not the right place to hold such a protest. It gives a bad image to the country.\"\nNP Gandhi echoed the sentiment, saying, “Doing such a thing at a global event is very wrong.\"\nThe incident has triggered a First Information Report (FIR) under serious sections, and the investigation into the planning and larger conspiracy is ongoing.\nLatest Blogs",
        "link": "https://www.news18.com/india/disgraceful-conduct-govt-slams-congresss-protest-at-ai-summit-says-public-taught-them-lesson-ws-l-9921250.html",
        "date": "Sat, 21 Feb 2026 11:58:43 +0530",
        "fetched_at": "2026-02-24 04:00:51.893347"
    },
    {
        "title": "Bengaluru To Goa In Just 13 Hours As Railways Proposes Coastal Vande Bharat Express",
        "content": "In a significant move, the Railway Ministry has proposed a Vande Bharat Express between Bengaluru and Goa. The train will complete the distance between Yesvantpur in Bengaluru and Madgaon in Goa via the Mangaluru railway region in just 13 hours.\nAs per a report by The Hindu, the train will leave Yesvantpur at 6:05 am and reach Madgaon at 7:15 pm in 13 hours. On the return trip, the coastal train will depart Madgaon at 5:30 am and arrive at Yesvantpur at 6:40 pm.\nAs per the official proposal, this train will skip Mangaluru Junction and Mangaluru Central stations, and will run via Padil bypass. According to South Western Railway (SWR), Mangaluru Junction is skipped to reduce the running time.\nSWR also proposed to further reduce the time by increasing the speed limit between Chikka Banawara and Hassan from 110 kmph to 130 kmph, and on the Sakleshpur-Subrahmanya Road Ghat section from 30 kmph to 40 kmph.\nGujarat Gets 6th Vande Bharat\nOn February 16, a new Vande Bharat Express, connecting Asarwa (Ahmedabad) in Gujarat and Udaipur City in Rajasthan, was inaugurated. The train was operational from February 18.\nAs per the official release, the Asarwa-Udaipur City Vande Bharat Express is equipped with modern features, including reclining, comfortable seats; sliding doors; a mobile charging point; a bio-toilet; automatic entry and exit doors; and CCTV cameras. This train will offer passengers a fast, safe, and convenient travel experience while providing world-class comfort.\nTrain number 26964 Asarwa-Udaipur City Vande Bharat Express began normal operation from Feb 18 and departed from Asarwa at 17:45 hrs and reached Udaipur City at 22:00 hrs. The train will operate daily (except Tuesday). Similarly, train number 26963, Udaipur City-Asarwa Vande Bharat Express, will depart from Udaipur City at 06:10 hrs daily (except Tuesday) and arrive at Asarwa at 10:25 hrs\nLatest Blogs",
        "link": "https://www.news18.com/india/bengaluru-to-goa-in-just-13-hours-as-railways-proposes-coastal-vande-bharat-express-ws-bl-9920849.html",
        "date": "Fri, 20 Feb 2026 23:50:23 +0530",
        "fetched_at": "2026-02-24 04:00:52.620351"
    },
    {
        "title": "PM Modi Condoles Demise Of Noted Bengali Author Shankar",
        "content": "Prime Minister Narendra Modi on Friday expressed condolence over the demise of noted Bengali litterateur Mani Shankar Mukhopadhyay, better known by his pen name ‘Shankar’, and said his unforgettable works has touched generations of readers and enriched Indian literature.\nMukhopadhyay passed away at a Kolkata hospital on Friday following prolonged age-related ailments, at the age of 92.\n“Deeply saddened by the passing of Shri Mani Shankar Mukhopadhyay Ji, fondly known as Shankar. He was a towering figure in Bengali literature whose words portrayed the lives of people with sensitivity and insight. Through his unforgettable works, he impacted generations of readers and enriched India’s literary world. My heartfelt condolences to his family, friends and countless admirers. Om Shanti,\" the prime minister said on his official X handle.\nশ্রী মণি শঙ্কর মুখোপাধ্যায়-যিনি শংকর নামে বিখ্যাত- এর প্রয়াণে গভীরভাবে শোকাহত ।বাংলা সাহিত্যের এক উজ্জ্বল নক্ষত্র হিসেবে তিনি মানুষের জীবনকে অসাধারণ সংবেদনশীলতা ও অন্তর্দৃষ্টির সঙ্গে তাঁর লেখায় তুলে ধরেছেন। তাঁর অবিস্মরণীয় সৃষ্টি, বিভিন্ন প্রজন্মের পাঠককে প্রভাবিত এবং…\n— Narendra Modi (@narendramodi) February 20, 2026\nThe Sahitya Akademi award-winning writer, best known for his iconic novels ‘Chowringhee’ and ‘Seemabaddha’, chronicled the aspirations, anxieties and moral dilemmas of urban India, transforming mundane realities of life into timeless narratives. His works were even adapted into films by Oscar-winning director Satyajit Ray.\nLatest Blogs",
        "link": "https://www.news18.com/india/pm-modi-condoles-demise-of-noted-bengali-author-shankar-ws-l-9920799.html",
        "date": "Fri, 20 Feb 2026 22:29:54 +0530",
        "fetched_at": "2026-02-24 04:00:53.361976"
    },
    {
        "title": "Junior UP Engineer, Wife Get Death Penalty For Sexually Exploiting Minors, Selling Videos Abroad",
        "content": "How did a junior engineer posted in Uttar Pradesh’s irrigation department turn into the kingpin of an international child sexual abuse racket? The answer emerged in a Banda courtroom on Friday, where a POCSO court, in one of the most disturbing child sexual abuse case, awarded the death penalty to Ram Bhavan and his wife Durgawati for sexually exploiting minors and selling their videos on the dark web to international buyers.\nThe convicts — Rambhavan, a junior engineer in the irrigation department posted in Chitrakoot, and his wife Durgavati — were ordered to be “hanged till death\" by Special POCSO Judge Pradeep Kumar Mishra.\nThe court observed that the crime fell within the “rarest of rare\" category due to its brutality, premeditation, and international ramifications.\nThe couple had been convicted on February 18 following a lengthy trial based on digital evidence, medical reports, and testimonies of multiple victims.\nHow The Case Began\nThe case dates back to October 2020, when the Central Bureau of Investigation (CBI) received inputs from INTERPOL regarding the circulation of child sexual abuse material (CSAM) linked to an Indian phone number. Acting on this intelligence, the CBI registered an FIR on October 31, 2020.\nOn November 17, 2020, Rambhavan was arrested. His wife Durgavati was also taken into custody after investigators found evidence of her involvement. According to the prosecution, the couple targeted children from economically weaker backgrounds in Banda, Chitrakoot, and surrounding districts.\nThey allegedly lured minors aged between 5 and 16 years with inducements and gifts. The court was told that the children were sexually assaulted and the acts were recorded using a laptop camera and mobile devices. These videos and photographs were then uploaded and distributed through the dark web to international networks.\nDigital Trail And Evidence\nDuring the investigation, the CBI recovered a pen drive containing 34 videos and 679 photographs of minors. Digital forensic analysis linked the content directly to the accused. Investigators also found that the material had been shared with buyers in 47 countries, including China, the United States, Brazil, and Afghanistan.\nThe charge sheet, running into nearly 700 pages, was filed 88 days after the arrests. It included medical examination reports of the victims, statements from children and witnesses, and digital evidence establishing the online distribution network.\nIn total, 74 witnesses were examined during the trial. The CBI recorded statements from individuals aged between 4 and 42 years to build a comprehensive case.\nAdvocate Kamal Singh, associated with the POCSO court proceedings, said the case was initiated after international intelligence inputs flagged suspicious online activity.\n“The investigation revealed a systematic pattern of abuse and online dissemination. The digital evidence was crucial in securing the conviction,\" he said.\nRole Of Wife And Attempt To Influence Witnesses\nWhile Rambhavan was found directly involved in the sexual assaults and recording of videos, Durgavati was also held equally responsible. The court noted that she not only participated in the exploitation but also attempted to pressure witnesses and facilitate compromise efforts during the investigation.\nThe prosecution said that the involvement of both parents-like figures in such crimes deepened the psychological trauma of the victims and demonstrated a calculated and sustained pattern of abuse.\nCourt’s Observations\nPronouncing the sentence, Judge Pradeep Kumar Mishra said the offence was extremely heinous and had a far-reaching impact on society.\n“The acts committed by the accused are of such a grave nature that they strike at the very foundation of societal morality and the safety of children. This court finds it appropriate to award the maximum punishment,\" the judge observed.\nThe court further directed the District Magistrate to ensure that each identified victim receives Rs 10 lakh as compensation for rehabilitation and medical support. Some of the affected children reportedly underwent treatment at AIIMS, New Delhi, for physical and psychological trauma.\nLatest Blogs",
        "link": "https://www.news18.com/india/junior-up-engineer-wife-gets-death-penalty-for-sexually-exploiting-minors-selling-videos-abroad-ws-l-9920557.html",
        "date": "Fri, 20 Feb 2026 19:25:23 +0530",
        "fetched_at": "2026-02-24 04:00:54.071124"
    },
    {
        "title": "News18 Evening Digest: Youth Congress Workers Protest At AI Summit, 4 Arrested & Other Stories",
        "content": "In today’s News18 evening digest, we bring to you the latest on Youth Congress Workers Protest At AI Summit, What India Said on Iran-US Tensions, Khawaja Asif Speaks on Army’s Role, Economic Woes, and other stories.\nShirts Off, Slogans On: Youth Congress Workers Protest At AI Summit, 4 Arrested\n‘We’re Keeping An Eye On Situation’: India On Iran-US Tensions\n‘You Want To Choke India’s Development’: Union Ministers Slam Rahul Gandhi Over AI Summit Protest\nIs Asim Munir Pakistan’s De-Facto Ruler? Khawaja Asif Speaks On Army’s Role, Economic Woes\nWho Is Narsimha Yadav, The Organiser Of Youth Congress Protest At AI Summit?\n‘Mohsin Naqvi Influenced BCB Chief’: Ex-General Secretary Makes Massive Claim\nSaaniya Chandhok’s Kenya Trip Pictures With Sara Tendulkar Go Viral Two Weeks Before Wedding\nLatest Blogs",
        "link": "https://www.news18.com/india/news18-evening-digest-youth-congress-workers-protest-at-ai-summit-4-arrested-other-stories-ws-l-9920450.html",
        "date": "Fri, 20 Feb 2026 18:23:44 +0530",
        "fetched_at": "2026-02-24 04:00:54.939751"
    },
    {
        "title": "Tirupati Laddu Row: Andhra Govt Sets Up Committee To Examine SIT Report | Exclusive",
        "content": "In continuation of the probe into allegations of ghee adulteration in the making of the sacred Tirupati Laddoos, which the ruling Telugu Desam Party-led NDA government has levelled against the previous YSRCP regime, the Andhra Pradesh government has now set up a one-man committee to examine the findings of the Special Investigation Team (SIT).\nRetired IAS officer Dinesh Kumar has been appointed to study the SIT’s self-contained note and recommend action, if required, against Tirumala Tirupati Devasthanams (TTD) officials and committee members.\nAccording to the government order, Kumar has been tasked with examining the SIT note and recommending initiation of suitable action, if deemed necessary, against erring committee members and senior TTD officers.\nThe committee will specifically look into administrative lapses in the relaxation and enforcement of tender conditions. It will also examine whether decisions were taken with due diligence, proper recorded justification and procedural compliance.\nThe panel has also been asked to identify the extent of administrative responsibility, if any, of officers, committee members or TTD functionaries in relation to the lapses flagged in the SIT report, and recommend appropriate administrative or disciplinary action.\nThe government has made it clear that the committee’s examination will be confined strictly to administrative and governance aspects.\nThe move comes after the state Cabinet, in its last meeting, announced that a separate panel would be set up to examine the SIT report. The latest order formally gives effect to that decision.\nThe government order refers to the FIR/ Crime No. 470/2024 was registered at Tirupati East Police Station over the alleged supply of adulterated and sub-standard ghee to TTD.\nIt also references the Supreme Court, through its October 4, 2024 order in W.P.(C) No. 622/2024 where it entrusted the investigation to an independent SIT functioning under the supervision of the Director of the Central Bureau of Investigation.\nAfter completing the investigation, the SIT filed its charge sheet before the court on January 23, 2026. Along with this, it submitted a self-contained note recommending that suitable action be initiated against committee members and senior TTD officers for lapses, omissions and failures in both relaxing and enforcing ghee tender conditions.\nIt is based on these findings that the government has now constituted the one-man committee.\nThe committee has been given the power to call for records, seek written clarifications and obtain expert assistance, subject to prior government approval. It has been directed to submit its report within 45 days from the date of the order.\nThe Tirumala Tirupati Devasthanams will provide the necessary secretariat assistance to the panel.\nThe government has also clarified that the report will be recommendatory in nature and will be examined before any further action is taken.\nLatest Blogs",
        "link": "https://www.news18.com/india/tirupati-laddu-row-andhra-govt-sets-up-committee-to-examine-sit-report-exclusive-ws-l-9920391.html",
        "date": "Fri, 20 Feb 2026 18:16:08 +0530",
        "fetched_at": "2026-02-24 04:00:55.707488"
    }
]