[
    {
        "title": "BRS MLA Kaushik Reddy alleges misuse of Govt vehicles by Karimnagar CP",
        "content": "BRS MLA Padi Kaushik Reddy showing pictures of Govt. vehicles used by private persons.\n| Photo Credit: Special Arrangement\nHYDERABAD\nBharat Rashtra Samithi (BRS) MLA from Huzurabad Padi Kaushik Reddy has accused the Karimnagar Commissioner of Police Gaush Alam of misusing his position by allowing the use of a vehicle allotted to him (TS-09-PA-4195) by private persons in Hyderabad for the last eight months.\nAddressing a press conference here on Sunday, he said the CP had also allotted two drivers from one constable posted in Karimnagar, one town police station, and one armed reserve constable as drivers for the SUV (Innova) for private use in Hyderabad. The government vehicle was being used by the father of the Karimnagar CP’s close friend and an IRS officer.\nFurther, he alleged that the CP’s brother was also driving another government vehicle (TS-09-PA-5601) and two women constables were working for the CP’s wife, who was doing an outsourced job in Karimnagar. He demanded that the DGP inquire into the misuse of government vehicles.",
        "link": "https://www.thehindu.com/news/national/telangana/brs-mla-kaushik-reddy-alleges-misuse-of-govt-vehicles-by-karimnagar-cp/article70692649.ece",
        "date": "Mon, 02 Mar 2026 09:00:04 +0530",
        "fetched_at": "2026-03-02 03:55:29.851683"
    },
    {
        "title": "Will leverage tech to crack down on market manipulators, says SEBI chief",
        "content": "SEBI Chairman Tuhin Kanta Pandey during an interview with The Hindu at SEBI Bhavan in Mumbai.\n| Photo Credit: EMMANUAL YOGINI\nThe Securities and Exchange Board of India (SEBI) will enhance surveillance and enforcement on market manipulators and cyber fraudsters through technology and use Artificial Intelligence (AI) to widen the reach of its investor awareness programmes, its Chairman Tuhin Kanta Pandey told The Hindu in an interview. He said SEBI aims to have “optimum regulation” in the capital market without “irritating” the stakeholders – exchanges, investors, brokers – such that “the market functions with integrity”.\nThe SEBI chief said that ever since he assumed charge last year, SEBI has rolled out 58 initiatives to ease business processes in the capital market, nine broad initiatives to make the market investor-centric and educate investors to make better choices. SEBI has made four changes to strengthen the framework regulating market intermediaries such as exchanges. It has introduced 13 measures to develop the capital market and six regulations to cool down speculation and stabilise the equity derivatives segment, he said.\nA lot of SEBI’s initiatives were technology-driven, said Mr. Pandey, highlighting the development of SEBI Check, a tool within the UPI interface that identifies registered intermediaries for investors before they make a payment. The tool is expected to rein in fraudulent brokers or traders who promise unreal gains to investors and dupe them.\nThe SEBI chief urged investors to be safe and be proactive while using these tools to identify cyber frauds. “If someone is approaching, people should say that ‘you are a fraud as your account does not show SEBI Check. I will lodge an FIR against you’,” he said, adding that people need to visit their broker’s office or bank branches at least once before making an investment.\nHe said SEBI is planning to run campaigns to popularise these tools as part of investor education initiatives. The market regulator has collaborated with Bengaluru-based AI company SARVAM to widen the reach of such efforts.\n“We have also done a pilot AI campaign with SARVAM where they have reached out to about 3,85,000 people through calls, and these calls were made through an AI process in multiple languages to explain about the SEBI Check tool,” he said.\nMr. Pandey inherited a correcting stock market in which retail investors may not be able to make returns they saw during the post-Covid rally. With the markets falling amid sustained selling by foreign investors and geopolitical uncertainly, he said the SEBI’s role was to make sure that there were no major instabilities and some market participants “do not act too smart”.\nThe SEBI chief said returns were contingent on multiple factors, and gains should not be judged based on one period alone. “People have always compounded their wealth over a period of time (through) disciplined and long investing,” he said, adding that the Indian markets were stable and the economy was growing.\nSpeaking on the widespread speculation in options trading (a derivative instrument which is used to protect investors from crashing stocks leading to losses), he said that this was limited to short duration options. With some stakeholders proposing many ideas, including restricting “unsuitable” players from the market to ensure stability, Mr. Pandey said there were no signs of instability in the markets. “Market stability is inherent. Now we don’t see any sign of market instability. So, there cannot be scaremongering. There is no need of panic,” he said.\nMr. Pandey warned investors against financial influencers who were “conning” investors by promising returns on options. He said people must be careful of such “swindlers” who operate through WhatsApp groups, adding that SEBI is monitoring such activities.\nLast year, SEBI took action against many market manipulators and mis-sellers. Avadhut Sathe, for example, who ran an “unregistered investment advisory” in the name of an academy, and Jane Street, an American hedge fund which allegedly manipulated a significant portion of the options market, were the prominent ones. They were served interim orders and investigations on both the cases are underway. Both have approached the Securities Appellate Tribunals and one of their rationales for this was that the market regulator was charging them of “manipulative intent” when they were just carrying on regular trading/teaching operations.\nWhile Mr. Pandey refused to comment on individual cases that were sub-judice, he expressed confidence that in recent days, SEBI had 80% to 90% success rate in the tribunal cases and much higher rate in the Supreme Court, and that principles of natural justice should apply.\nHe also responded to criticisms that SEBI was the legislative, executive and the judiciary, that surfaced when enforcement action was taken. He said this was a standard regulatory model all over and any other model would make it impossible to keep up with a fast-paced market.\nMr. Pandey said SEBI was studying the possibilities of rejuvenating the agri-commodities market. “Two working groups were created in agriculture to look at all kinds of problems, which were faced by the commodity side of agriculture. And they have given reports to me (last week), and it will go to committee process,” he said, adding that the proposal to change provisions that have been “static long time” and “making the market inefficient” will be put out for public consultation.\nSEBI is also set to focus on deepening the corporate bonds market, he said.\nMr. Pandey said SEBI will study the impact of regulations and make policy writing is more scientific. A committee under the Chief Economic Adviser V. Anantha Nageswaran will meet soon to discuss this, he said.\nfinancial markets",
        "link": "https://www.thehindu.com/business/markets/will-leverage-tech-to-crack-down-on-market-manipulators-says-sebi-chief/article70691965.ece",
        "date": "Sun, 01 Mar 2026 23:03:19 +0530",
        "fetched_at": "2026-03-02 03:55:30.469562"
    },
    {
        "title": "Chief Minister to inaugurate Critical Care Block in Jawadhu Hills",
        "content": "Along with health officials, Collector V.R. Subbulaxmi inspected the new health facility.\n| Photo Credit: Special Arrangement\nChief Minister M.K. Stalin will virtually inaugurate the first ₹20 crore District Critical Care Block (CCB) facility at the foothills of Jawadhu Hills in Anaicut village on the outskirts of Vellore Corporation limits this month .\nAlong with health officials, Collector V.R. Subbulaxmi inspected the new health facility.  The new facility has been built within Government Taluk Hospital near Amirthi Zoological Park as it can be easily accessible for tribals in the hills. “Snake bites remain a key health challenge in the hills. Currently, treatment is available only at Vellore Medical College Hospital, around 20 km away from the hills,” R. Pandithurai, a tribal said.\nHealth officials said that the new single-storey facility, which will cover around 5,000 sq.ft, has 50 beds with separate wards for maternity, newborn care, and in-patients. It also has an Intensive Care Unit (ICU), which has 10 beds, X-ray and scanning facilities.\nThree surgical theatres with ultrasound units are also part of the facility. Apart from accident victims, the new facility will treat patients for burn injuries, snake bites, cardiac related problems, and paediatrics.\nApart from a spacious out-patient ward that can accommodate around 100 persons, the new facility also has an antenatal care unit. On an average, the new facility will cover at least 2.5 lakh persons, mostly tribals in the hills and rural areas.\nResidents said that at present, Anaicut region at the foothills of Jawadhu do not have private clinics. They have to depend on government health care centres, which do not have adequate facilities. The region also lacks a government facility that provides specialist care for neurology, cardiology, orthopedics, dermatology, and ophthalmology.\nHealth officials said that the new facility will bridge the gap in providing specialist care  in the region. Similar facilities are also coming up in 17 spots that have a sizable tribal population in the State.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/chief-minister-to-inaugurate-critical-care-block-in-jawadhu-hills/article70692046.ece",
        "date": "Mon, 02 Mar 2026 09:01:21 +0530",
        "fetched_at": "2026-03-02 03:55:31.083329"
    },
    {
        "title": "Government conspiring to destroy education system in Telangana: Praveen Kumar",
        "content": "BRS leader R.S. Praveen Kumar showing pics of education infrastructure developed by the previous government under the leadership of K. Chandrasekhar Rao in Hyderabad on Sunday.\n| Photo Credit: By Arrangement\nHYDERABAD\nFormer IPS officer and BRS general secretary R. S. Praveen Kumar alleged that the State government is conspiring to destroy the education system in Telangana. He criticised the recent report of the State Education Commission led by A. Murali on education policy.\nAddressing a press conference, he said the report blamed teachers for the flaws in the education system. He added that its findings had hurt the self-esteem of 1.7 lakh teachers in the State and pointed out that it is the Pay Revision Commission that decides the pay structure of teachers, not the Education Commission.\nAccusing Mr. Murali of preparing the report against the teaching community, the BRS leader questioned how he could conclude that the education system had been destroyed during the 10-year rule of K. Chandrashekhar Rao without reviewing the existing system.\nThe BRS leader alleged that Chief Minister Revanth Reddy had got the Education Commission report prepared with the intention of avoiding an increase in teachers’ salaries, while the previous government had significantly enhanced the pay of teachers and other employees. He also objected to the Commission’s recommendation to conduct tests for teacher promotions, saying no such system exists for other departments.\nHe further criticised the recommendation to scrap Telangana EAPCET, saying it would benefit students studying in corporate colleges and disadvantage those from rural areas, as corporate college students are more likely to secure higher Intermediate marks and gain admission into engineering colleges. He also opposed the recommendation to phase out the existing residential education system.",
        "link": "https://www.thehindu.com/news/national/telangana/government-conspiring-to-destroy-education-system-in-telangana-praveen-kumar/article70692578.ece",
        "date": "Mon, 02 Mar 2026 00:21:17 +0530",
        "fetched_at": "2026-03-02 03:55:31.685266"
    },
    {
        "title": "BJP begins campaign for Bengal Assembly elections with Parivartan Yatras",
        "content": "Union Minister JP Nadda being felicitated during a public meeting after BJP's 'Parivartan Yatra', in Nadia, West Bengal on March 1, 2026.\n| Photo Credit: PTI\nThe Bharatiya Janata Party (BJP) leadership on Sunday (March 1, 2026) began its campaign for West Bengal Assembly elections with four Parivartan Yatras (March for change) starting from four corners of the State.\nBJP national president Nitin Nabin along with State BJP president Samik Bhattacharya flagged off a Parivartan Yatra from Cooch Behar in north Bengal. Party leaders alleged that north Bengal remained neglected despite repeated promises by the Trinamool Congress government and that the administrative functioning in Uttar Kanya, the secretariat for north Bengal, remained ineffective. The BJP leadership promised equal regional development, infrastructure expansion and administrative accountability for people of north Bengal. Mr. Nabin said that the Parivartan Yatras launched across the State would cover a distance of about 5,000 km with a promise of ‘new Bengal’ for the people of the State.\nFormer BJP president and Union Minister J.P. Nadda along with BJP MP and Union Minister of State Sukanta Majumdar flagged off another Parivartan Yatra from Krishnanagar in Nadia. Speaking at the launch of the yatra, Mr. Nadda said industries in different sectors from coal to steel to heavy industries to jute mills had declined in the State during the Trinamool Congress regime. The Union Minister said that it was the responsibility of the people to remove a government under whose watch the rape and murder was committed at R.G. Kar Medical College and Hospital.\nUnion Minister Dharmendra Pradhan and Leader of the Opposition Suvendu Adhikari flagged off another Parivartan Sankalpa Yatra from Garbeta in Paschim Medinipur. Mr. Pradhan targeted the Trinamool Congress government on several counts and said that the people of West Bengal had made up their minds to change the anti-poor, anti-women and corrupt government that supported infiltration across the border.\nUnion Minister of Women and Child Development Annapurna Devi and Former Union Minister Smriti Irani addressed a gathering at Kulti in Asansol and flagged off another Parivartan Yatra that will cover the south western parts of the State. The Union Minister recalled incidents of crime against women, including the rape and murder of doctor at R.G. Kar Medical College and Hospital, and said that State had become a safe haven for criminals.\nOn March 2, five more Parivartan Yatras will be flagged off in the State. The BJP leadership on February 27 launched a theme song and route march of the Parivartan Yatras in the State.\nAll nine yatras will conclude with a public rally of Prime Minister Narendra Modi at Kolkata’s Brigade Parade Grounds. Union Home Minister Amit Shah is likely to join the Parivartan Yatra on Monday (March 2) and likely to address a public meeting at Raidighi in South 24 Parganas.\nWith elections to the West Bengal Legislative Assembly likely to be announced in the next few days, the BJP leaders have flagged off the Parivartan Yatras with the slogan “Paltano Dorkar Chai BJP Sorkar (Need change and want BJP government)”.\nWest Bengal\n/\nKolkata",
        "link": "https://www.thehindu.com/news/national/west-bengal/bjp-begins-campaign-for-bengal-assembly-elections-with-parivartan-yatras/article70692222.ece",
        "date": "Sun, 01 Mar 2026 23:01:26 +0530",
        "fetched_at": "2026-03-02 03:55:32.293545"
    },
    {
        "title": "Amit Shah asks Punjab govt. to act against ‘religious conversions’",
        "content": "Union Home Minister Amit Shah and Maharashtra Chief Minister Devendra Fadnavis at the 'Hind-di-Chadar' Shri Guru Tegh Bahadur Sahib Ji 350th Shahidi Samagam, in Navi Mumbai on March 1, 2026.\n| Photo Credit: ANI\nUnion Home Minister Amit Shah on Sunday (March 1, 2026) said religious conversions were taking place in Punjab, and appealed to the people and the State government led by Chief Minister Bhagwant Mann, to stop this practice which was driven by “greed”.\nMr. Shah invoked the sacrifice of Guru Tegh Bahadur while addressing the ‘Hind-Di-Chadar’ commemoration event to mark the 350th martyrdom anniversary of Guru Tegh Bahadur in Kharghar, Navi Mumbai.\n“Today, it has been said here that religious conversion is taking place in Punjab. Guru Tegh Bahadur sacrificed himself to save others’ religions. They faced atrocities, but we today prefer to convert because of some greed. Then, we cannot be called followers of our great leaders. The Punjab government and Punjab society should stop religious conversions,” Mr. Shah said.\nHad Guru Tegh Bahadur not sacrificed himself to save the Hindu religion, “there would not have been a single Hindu left in the world”, Mr. Shah said.\nSome people had earlier objected to this statement, he said, adding that “everybody should accept this truth”.\nPaying homage, the senior Bharatiya Janata Party (BJP) leader said the Guru faced grave injustice and atrocities and fought against enemies far more powerful than him. “His sacrifice inspired and gave courage to Hindus to continue their fight,” he added.\nGuru Nanak had emphasised chanting God’s name, prayer, and sharing meals, underlining togetherness, which later provided moral strength in resisting Mughal invaders, Mr. Shah said.\nHe also referred to Mughal ruler Aurangzeb, claiming that when atrocities were inflicted in Jammu and Kashmir, Kashmiri Pandits sought protection from the Guru, and continue to hold him in high regard.\n“Guru Tegh Bahadur had said that if Aurangzeb can convert me, then all the people will get converted. Aurangzeb accepted it as a challenge,” Mr. Shah said.\n“He inflicted atrocities and killed Guru Tegh Bahadur’s companions, but the Guru never budged. Finally, Guru Tegh Bahadur sacrificed himself, but he did not give up. His sacrifice inspired people to fight against Aurangzeb,” the Minister said.\nThe followers of ‘Sanatan Dharma’ across the world were grateful to the Sikh guru, he said. “Traditions established by 10 Sikh Gurus are worth emulation by the world,” Mr. Shah said.",
        "link": "https://www.thehindu.com/news/national/punjab/amit-shah-asks-punjab-govt-to-act-against-religious-conversions/article70692384.ece",
        "date": "Sun, 01 Mar 2026 22:28:54 +0530",
        "fetched_at": "2026-03-02 03:55:32.914465"
    },
    {
        "title": "MHA cautions States against possible violence in the wake of U.S.-Israel military strikes against Iran",
        "content": "Kashmiri Shia Muslims stage a protest outside the United Nations office in Sonwar following the Iran's Supreme Leader Ayatollah Khamenei's killing in a US-Israel strike, in Srinagar on March 1, 2026\n| Photo Credit: ANI\nThe Union Ministry of Home Affairs (MHA) has cautioned States against “possible violence” and “sporadic protests” in India in the wake of a joint military operations by the United States and Israel against Iran, a senior government official told The Hindu.\nThousands of people took to the streets across the country to protest the killing of Iranian Supreme Leader Ayatollah Ali Khamenei in military strikes by the U.S.-Israel alliance on February 28.\nIran-Israel conflict updates on March 1, 2026\nDemonstrations were held in Uttar Pradesh, Jammu and Kashmir, Ladakh, Karnataka, and Delhi, among others, by Shia groups.\nIn a communication sent to Chief Secretaries and Director(s) General of Police on February 28, the MHA asked States to keep a watch on protests and demonstrations by “affiliates of both pro- and anti-Iranian regime” at the embassies and consulate offices of Iran, the U.S., and Israel, the official said.\nIt also asked States to identify “pro-Iran radical preachers giving inflammatory sermons and provoking violent actions.”\nThe States have been asked to monitor the social media activities of “pro-Iran extremists and the global terrorist groups (GTG) handles”, and enhance the watch on “pro-Iran student organisations and socio-political organisations.”\nAccording to the MHA, the likely targets of the Shiite militia groups, as well as the global terror groups such as the Islamic State and Al Qaeda, may include the U.S. and Israeli embassies and consulates in India and their staff, delegations, business persons, resorts, business establishments, tourist sites frequented by westerners, synagogues, Chhabad Houses, kosher shops, and Jewish community centres, among others. It added that “similarly, there could be targeting of Embassy/Consulates/cultural centres of Iran”.\nThe MHA asked States to sensitise security personnel regarding the threat perception, and need to augment security arrangements, particularly in and around the embassies and consulates, and also tourist locations frequented by Israeli, American, and Iranian visitors. It suggested CCTV coverage and checking of locations for the presence of Improvised Explosives Devices (IEDs) and explosive substances.\n“It is also requested to take adequate measures, including security arrangements at the sites mentioned above and other vulnerable locations to prevent any untoward incident and to maintain law and order, peace, and public tranquility. A watch may also be kept on social media to curb the spread of misinformation and requisite action may be taken in this regard,” the MHA said.\nIsrael\n/\nIran",
        "link": "https://www.thehindu.com/news/national/mha-cautions-states-against-possible-violence-in-the-wake-of-us-israel-military-strikes-against-iran/article70692234.ece",
        "date": "Mon, 02 Mar 2026 06:38:40 +0530",
        "fetched_at": "2026-03-02 03:55:33.519855"
    },
    {
        "title": "DMK Ministers competing among themselves to indulge in scams: PM Modi",
        "content": "Prime Minister Narendra Modi addressing a public meeting in Madurai on Sunday.\n| Photo Credit: G. Moorthy\nBJP leader and Prime Minister Narendra Modi on Sunday alleged that Ministers in Tamil Nadu were in stiff competition among themselves to indulge in scams.\nSharing the dais with the BJP’s allies, including AIADMK leader Edappadi K. Palaniswami at a NDA public meeting in Madurai, Mr. Modi charged, “Usually, Ministers compete among themselves for good governance. But, DMK Ministers were competing in scams... and were snatching the money from the poor, youth and farmers. Such a corrupt government has no moral right to continue.”\nContending that the NDA would give a clean and efficient government, he sought the ouster of the “corrupt and anti-people” DMK government.\nPrime Minister Narendra Modi joins NDA leaders to cheer party workers at a public meeting organised by NDA in Madurai on Sunday.\n| Photo Credit:\nG. Moorthy\n“The DMK Mayor (in Madurai) had to resign due to corruption. The DMK was busy in making money for itself while pushing the problems to the people,” Mr. Modi said. While six lakh homes were completed under the Prime Minister’s Housing Scheme, three lakh houses could not be completed in Tamil Nadu because of the failure of the DMK in conducting the survey. “DMK’s petty politics has delayed the opportunity for the poor to live with dignity,” he alleged.\nAccording to him, the DMK government exemplified corruption as opposed to the Kamaraj rule that was an example for honesty. Calling the DMK’s governance inefficient, he said Madurai city was at the bottom of the chart among similar cities in the country with regard to cleanliness.\nHe levelled charges of corruption in various departments right from transfers to government jobs and contracts for sand mining and in Tasmac liquor bottle sale, which he said, ranged from ₹365 crore to ₹40,0000 crore.\n“After 25 long years, the DMK got a full majority to rule the state in 2021. However, the Dravidian party failed to deliver good governance. It looted the State and brought mafia-style politics to Madurai,” he alleged.\nTaking a jibe at the Congress, Mr Modi said angered by Tamil Nadu rejecting the party for six decades, it “took revenge” by handing over Katchatheevu to Sri Lanka and by bringing in an ordinance to ban Jallikattu. He charged that the DMK had remained silent at the time. Mr. Modi took credit for having lifted the ban on Jallikattu.\nReferring to the Pamban Bridge, he said the old rail bridge structure had worn out, forcing trains to move slowly across the sea bridge. It should have been replaced earlier, but the DMK and the Congress, which were in power for 10 years from 2004 (UPA regimes), failed to act, he alleged.\nAfter the NDA came to power, the work was expedited and trains were now moving faster on the bridge, he said. “The DMK and the Congress did nothing for Tamil Nadu but talked big,” he alleged.\nAccusing the DMK government of failing to curb crimes against women, Mr. Modi said families were being destroyed by a growing drug mafia. “The NDA government that will be elected will ensure safety, dignity and empowerment of women,” he added.\nRecalling that the Centre had recently signed a trade agreement with the European Union, the Prime Minister said it would create golden opportunities for the youth, farmers and entrepreneurs of Tamil Nadu.\nHe said the textile industry, electronics and manufacturing sectors, and seafood exporters would gain access to global markets. Factories would expand, and farmers and workers would get new job opportunities. Tamil Nadu products would have greater scope to compete globally.\n“For all these to happen, Tamil Nadu needs a government focused on people’s welfare. The NDA will provide a stable and people-oriented government,” the Prime Minister added.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/tn-ministers-competing-among-themselves-to-indulge-in-scams-modi/article70692264.ece",
        "date": "Mon, 02 Mar 2026 09:06:51 +0530",
        "fetched_at": "2026-03-02 03:55:34.128672"
    },
    {
        "title": "Kerala Chief Minister’s moment with young landslide survivor takes political turn",
        "content": "Kerala Chief Minister Pinarayi Vijayan with a child during the inauguration of the first phase of the Wayanad model township for landslide survivors on Elston Estate in Kalpetta on Sunday.\n| Photo Credit: -\nA heartwarming moment between Kerala Chief Minister Pinarayi Vijayan and a three-year-old girl during the inauguration of the township for landslide survivors in Wayanad became a focal point for political debate on Sunday.\nCommunist Party of India (Marxist) [CPI(M)] leaders leveraged the interaction to target Prime Minister Narendra Modi, comparing his previous interaction with the child.\nThe child was identified as Nysa, who gained national attention after Mr. Modi’s interaction with her during his visit to a hospital in the hill district soon after the Mundakkai-Chooralmala landslides.\nOne of the youngest survivors of the tragedy, Nysa had lost her father, siblings and home to the disaster that had ravaged Wayanad on July 30, 2024.\nThe video of the  exchanges between the child and the Mr. Modi had gone viral on social media platforms and widely carried by the national media.\nNysa and her mother also got a home when the Mr. Vijayan handed over keys of houses to 178 survivors at the newly constructed township.\nSoon after television channels aired visuals of Mr. Vijayan’s interaction, MP John Brittas and General Education Minister V. Sivankutty hailed the gesture on their social media handles.\nMr. Brittas, in his Facebook post, shared the videos of both the Prime Minister and the Chief Minister with the child and said one person had left after his “show,” and the other has implemented what he promised.\nThe MP alleged that the Prime Minister, who took the child in his arms and pampered her during his visit, refused to give anything to her or her family later. The Chief Minister held the girl in his lap and pampered her after fulfilling his promises, he pointed out.\nIn his Facebook post, Mr. Sivankutty also took a dig at Mr. Modi, saying, “What was seen in the reel then and what is being seen in real today.” “The Left government says only what it can do and it does what it says,” the senior leader posted.\nSenior CPI(M) leader K.K. Shailaja also shared the photo of Mr. Vijayan with Nysa and described the township inauguration as a “new chapter” in the history of survival.\nThe township inauguration also witnessed Congress’ Kalpetta legislator T. Siddique being heckled and booed by a crowd during his speech.\nThere was also booing when his name was mentioned during the welcome address. Reacting to the incident, Mr. Siddique said it was staged by the CPI(M) workers, who protested against him.\nNoting that everyone worked along with the government for the rehabilitation of the landslide survivors, he said he would continue to work for them in the future as well.\nDuring his speech, Revenue Minister K. Rajan apparently took a dig at Mr. Siddique and the Congress, saying that the Left government is not the one that merely lays a single stone and leaves, but it places stone upon stone and build further.",
        "link": "https://www.thehindu.com/news/national/kerala/kerala-chief-ministers-moment-with-young-landslide-survivor-takes-political-turn/article70692209.ece",
        "date": "Sun, 01 Mar 2026 22:46:00 +0530",
        "fetched_at": "2026-03-02 03:55:34.728382"
    },
    {
        "title": "Work on beach circuit project linking Kuzhipilly, Cherai and Munambam begins",
        "content": "Infrastructure works have begun at Cherai beach as part of the Vypeen beach circuit project.\n| Photo Credit: File photo for representational purpose only\nKerala Tourism has entrusted the Ernakulam District Tourism Promotion Council (DTPC) with the task of executing a ₹2.97 crore beach circuit on Vypeen island, linking Kuzhipilly, Cherai, and Munambam beaches.\nThe long-awaited circuit was initially proposed in 2017 as part of a broader plan to promote beach tourism in Ernakulam district. The three beaches are being developed as part of a ₹4.50 crore project aimed at augmenting infrastructure at a total of nine beaches along a 25-km corridor, from Puthu Vypeen at one end to Munambam on the Ernakulam–Thrissur border, tourism sources said.\nThey attributed the delay to issues related to obtaining Coastal Regulation Zone (CRZ) clearances and other technical reasons. Once completed, the project is expected to significantly enhance the experience for tourists visiting beaches in Ernakulam district, especially as sea incursion has reduced the appeal of Fort Kochi beach.\nAs part of developing the beach circuit, the Kerala Electrical and Allied Engineering Company (KEL), which will execute the project, will renovate the existing infrastructure. In addition, toilets, rain shelters, snack kiosks and a children’s play area will be constructed. Work at Cherai beach began a week ago, it is learnt.\nTourists, including those from other States, continue to throng Cherai beach despite sea erosion caused by factors such as climate change, said Lijo Jose, secretary of Ernakulam DTPC. “Being a recently developed beach, Kuzhipilly stands out due to the many casuarina trees along the beachfront and a floating bridge. It has thus become a popular spot for photo shoots. Members of the local community and the panchayat have been wholeheartedly extending their cooperation to ensure the upkeep of the beach,” he said.\nMunambam, as the name suggests, is an estuary. Apart from watersports activities, the walkway, Chinese fishing nets and the harbour here attract a large number of visitors. Once infrastructure is augmented, the beach circuit is expected to revitalise these destinations and bring a new vibrancy. Walkways will also be illuminated as part of the project. The works covering the three beaches are expected to be completed by February 2027. To ensure the safety of visitors, lifeguards have already been deployed at Munambam and Cherai, along with lifesaving equipment, Mr. Jose added.",
        "link": "https://www.thehindu.com/news/national/kerala/297-crore-beach-circuit-project-to-link-kuzhipilly-cherai-and-munambam/article70692153.ece",
        "date": "Mon, 02 Mar 2026 06:44:25 +0530",
        "fetched_at": "2026-03-02 03:55:35.332298"
    },
    {
        "title": "NLCIL signs MoA with IISC Bengaluru for project on innovation in mining",
        "content": "NLC India Ltd. (NLCIL) has entered into a memorandum of agreement (MoA) with Indian Institute of Science, Bengaluru for project on innovation in mining.\nThe MoA was signed by Neeraj Kumar, Chief General Manager and Unit Head, Centre for Advanced Research and Development (CARD) on behalf of NLCIL and Pikee Priya, Assistant Professor from the Materials Engineering Department, IISC, Bengaluru.\nAccording to a press note, in line with its vision to foster impkactful R&D, NLCIL, through CARD has initiated structured coolborations with premier academic institutions, resulting in the signign of MoAs with IISC, IITs, NITs and State Universities.\nThe MoA with IISC, Bengaluru marks a significant milestone by addressing a critical mining requirement through indigenous material development.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/nlcil-signs-moa-with-iisc-bengaluru-for-project-on-innovation-in-mining/article70691532.ece",
        "date": "Sun, 01 Mar 2026 21:07:46 +0530",
        "fetched_at": "2026-03-02 03:55:35.936150"
    },
    {
        "title": "Andhra Pradesh achieves record GST collection in February 2026",
        "content": "The Government of Andhra Pradesh has recorded its highest-ever February Net GST collection, reaching ₹3,061 crore in 2026. This marks a 5.45% growth compared to February 2025, signalling a robust economic trajectory despite significant tax cuts introduced under the GST 2.0.\nCommissioner of State Taxes Babu A, in a release on Sunday, said the revenue growth wis particularly notable as it followed the September 2025 implementation of rate reductions on consumer essentials, pharmaceuticals, and cement, alongside the total withdrawal of GST on life and medical insurance.\nMr. Babu attributed this resilience to increased consumption driven by lower rates and a sophisticated, AI-powered compliance net.\nWith a cumulative growth of 5.86% for the 2025-26 fiscal year, Andhra Pradesh was currently outperforming several neighboring States, including Karnataka (5.70%), Telangana (4.57%), and Tamil Nadu (3.10%).\nA key driver for this success had been the aggressive use of AI-powered data analytics to identify ineligible Input Tax Credits (ITC). This led to an IGST settlement of ₹1,810 crore, a 7.24% increase over the previous year. Furthermore, Professional Tax collections saw a massive surge of 31.97%, reflecting an expanding taxpayer base.\nAP also pioneered a performance-based transfer policy, deploying high-performing officers to high-stakes revenue zones. Officials state that this “meritocracy-first” approach, combined with strict enforcement against defaulters, successfully reversed early-year slowdowns, positioning Andhra Pradesh as a national leader in fiscal mobilisation, he added.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/andhra-pradesh-achieves-record-gst-collection-in-february-2026/article70691836.ece",
        "date": "Sun, 01 Mar 2026 20:57:39 +0530",
        "fetched_at": "2026-03-02 03:55:36.565260"
    },
    {
        "title": "92 people have called Karnataka government seeking help",
        "content": "As many as three legislators are among the Kannadigas believed to be stuck in West Asia with cancellation of flights to Bengaluru and Mangaluru even as the State government is coordinating with the Ministry of External Affairs to bring those stranded back safely.\nThe State Emergency Operations Centre, which has been receiving calls seeking help, has a list of 92 people that is constantly getting updated.\nWhile 37 flights to and from Kempegowda International Airport in Bengaluru were cancelled owing to escalation of tension in West Asia on Sunday, 11 flights to and from Mangalauru International Airport remained cancelled. The airspace in 11 West Asian countries have been closed till Monday.\nOn Sunday, Karnataka also witnessed protests in multiple places against the U.S.-Israel attack on Iran that killed supreme leader Ayatollah Ali Khamenei.\nThe protests were held at Johnson Market in Bengaluru and Alipur in Chickballapur district, near here. Chief Minister Siddaramaiah and Deputy Chief Minister D.K. Shivakumar have condemned the attack on Iran.\nThe State government has appointed the Resident Commissioner of Karnataka in Delhi to coordinate with the Ministry of External Affairs to ensure the safe return of Kannadigas stranded in West Asia and requiring help.",
        "link": "https://www.thehindu.com/news/national/karnataka/about-200-persons-have-called-karnataka-government-seeking-help/article70692070.ece",
        "date": "Sun, 01 Mar 2026 23:04:12 +0530",
        "fetched_at": "2026-03-02 03:55:37.177722"
    },
    {
        "title": "KTR assures Musi project victims of raising issue in Assembly",
        "content": "BRS working president K.T. Rama Rao interacting with victims of the Musi Riverfront project in Hyderabad on Sunday.\n| Photo Credit: By Arrangement\nHYDERABAD\nThe Bharat Rashtra Samithi (BRS) would raise the issue of people identified to be displaced as part of the Musi Riverfront project, planned by the Congress Government and would exert pressure on the government against demolishing the homes, working president of the party K.T. Rama Rao said during a visit to some areas on Sunday.\nHe, along with party leaders, took out a protest march along with the residents and interacted with them in Hydershah Kot and K.K. Nagar areas, including the Madhu Park Ridge apartments.\nSpeaking to the residents at Rajiv Gruhakalpa, Mr. Rama Rao said there was a need to build pressure on the government not to demolish even one home and it was possible with a united fight by the families likely to be displaced, their neighbours and others. He alleged that Chief Minister A. Revanth Reddy was running a “bulldozer raj”.\nHe accused the government of resorting to real estate business by displacing people along the Musi in the name of the riverfront project and selling the reclaimed land to the realtors. He asked them to wage a battle against the government to protect their homes for the next two years and the next government of BRS would ensure that their homes were not touched.\nHe accused the Congress national leadership of keeping silent on the ‘Bulldozer Raj’ in Telangana in lieu of the funding being made by Mr. Revanth Reddy. The BRS leader said the Congress Government had unveiled a major scam in the name of Musi riverfront project to help kin and followers get the contracts of real estate business in the reclaimed areas.\nHe pointed out that it was the previous Congress Government that had given permissions to Madhu Park Ridge. He also questioned why the government was keeping silent on the palatial homes, villas and farmhouses of the Congress leaders in the buffer zones of water bodies.",
        "link": "https://www.thehindu.com/news/national/telangana/ktr-assures-musi-project-victims-of-raising-issue-in-assembly/article70692150.ece",
        "date": "Sun, 01 Mar 2026 20:52:52 +0530",
        "fetched_at": "2026-03-02 03:55:37.781825"
    },
    {
        "title": "Left parties condemn military action by U.S. and Israel on Iran",
        "content": "Ten Left parties condemned the joint military action by the United States and Israel on Iran, calling it a grave violation of international law and Iranian sovereignty.\nIn a joint press statement, the parties denounced the attack on Iranian territory, including strikes near the residence of Supreme Leader Ayatollah Khamenei and on civilian targets such as schools.\nThe statement was issued by V. Srinivas Rao of the CPI(M), G. Eshwaiah of the CPI, P. Prasad of the Communist Party of India (Marxist–Leninist) New Democracy, B. Bangarraju of the Communist Party of India (Marxist–Leninist) Liberation, Katam Nagabhushanam of the Yuvajana Shramika Rythu Communist Party (United), Jasti Kishore Babu of the Communist Party of India (Marxist–Leninist), B.S. Amarnath of the Socialist Unity Centre of India (Communist), P.V. Sundararama Raju of the All India Forward Bloc, and Janaki Ramulu of the Revolutionary Socialist Party, along with Y. Ramakrishna representing CPI (ML) New Democracy.\nThey criticised Prime Minister Narendra Modi’s recent visit to Israel, alleging that India’s stance represents a complete 360-degree reversal from the previous Indian governments’ traditional support for Palestinian rights.\nThe joint attack on Iran occurred in days after the Prime Minister’s visit, suggesting a link between India’s foreign policy orientation and the ongoing conflict, they alleged.\nThe Left leaders demanded that the Government of India formally condemn the strikes on Iran. They called on peace-loving citizens to oppose what they consider a shift in Indian policy, and urged global solidarity with the Iranian people against “imperialist aggression.”\nThey described the bombing as an act of imperialist aggression, highlighting the killing of innocent children and civilians as evidence of extreme disregard for human life. They stated that the attacks violate the United Nations Charter and multiple global agreements, urging democratic forces and citizens to reject such actions.\nThe leaders condemned Israel’s continuing military operations in Gaza, asserting that despite announcements of a ceasefire, attacks had persisted against Palestinian civilians.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/left-parties-condemn-military-action-by-us-and-israel-on-iran/article70691382.ece",
        "date": "Sun, 01 Mar 2026 20:51:50 +0530",
        "fetched_at": "2026-03-02 03:55:38.388249"
    },
    {
        "title": "CM moving around with a crowbar in hand, says Ramchander Rao; BJP chief accuses govt. of violating court orders in Khammam demolition drive",
        "content": "Telangana BJP president N. Ramchander Rao interacting with people ‘displaced’ due to demolitions at Velugumatla in Khammam on Sunday.\n| Photo Credit: SPECIAL ARRANGEMENT\nTelangana BJP president N. Ramchander Rao accused the Congress government of demolishing houses belonging to poor families across the State by “bypassing legal procedures for the sake of real estate interests”.\nDuring his one-day tour of Khammam district on Sunday, Mr. Rao visited Velugumatla and interacted with displaced families, whose houses had been demolished. He alleged that Chief Minister A. Revanth Reddy was “moving around with a crowbar in hand” and supervising the demolition of homes despite court orders directing the authorities to maintain status quo.\nCalling the demolitions ‘inhuman’, he said that nearly 1,800 people from 600 labourer households had been rendered homeless. The houses, constructed with their hard-earned savings near the Collectorate office, were razed in violation of High Court stay orders, which he described as “atrocious and shameful”.\nMr. Rao also alleged that the government harboured malafide intentions, as real estate prices in the area had surged following the establishment of the collectorate office and the proposal of a highway project. He claimed that the poor were being pushed out because the land had become valuable.\nHe further said that despite multiple status quo orders and explicit court instructions against evictions, revenue officials had issued eviction notices—a “heinous act”, according to him. The former MLC rejected the Government’s claim that the houses were built on the basis of fake documents or illegal allotments, reportedly unearthed during an inquiry by the Bhoodan Board and Revenue Department.\nThe BJP chief demanded that the government correct its ‘mistake’ by constructing houses for the displaced families at the same site under the Indiramma Housing scheme. He asserted that the party would stand by the oustees against what he termed the “Crowbar Government” until justice was served.\nIn a separate development, BJP Deputy Floor leader Payal Shankar announced that the party has decided to take up a mass contact programme with farmers, starting from Adilabad to highlight the demand for taking up the farm insurance programme from March 7 to 15. The objective is to gather 10 lakh signatures and put it before the government during the next Assembly session.\nHe criticised the Government for failing to implement the Centre’s crop insurance scheme despite promising to do so during the elections. The scheme, he said, had earlier been neglected by the BRS Government as well, he said while addressing a press conference at the State BJP office.\nAlthough the Congress Government had announced ₹3,000 crore for the scheme in its first year, not a single rupee had been released, leaving farmers facing harsh climatic conditions and poor yields without relief. Save for cotton farmers, who are being supported by the Cotton Corporation of India (CCI), others have been under a lot of distress due to pressure from bankers and lack of support from the government.",
        "link": "https://www.thehindu.com/news/national/telangana/cm-moving-around-with-a-crowbar-in-hand-says-ramchander-rao-bjp-chief-accuses-govt-of-violating-court-orders-in-khammam-demolition-drive/article70691768.ece",
        "date": "Sun, 01 Mar 2026 20:48:33 +0530",
        "fetched_at": "2026-03-02 03:55:38.991724"
    },
    {
        "title": "Government failed to ensure MSP for farmers, alleges YSRCP",
        "content": "YSRCP leader M.V.S. Nagi Reddy.\n| Photo Credit: File Photo\nThe YSRCP has accused the NDA government of neglecting farmers’ issues and making false declarations in the Assembly.\nSpeaking to the media at the party central office at Tadepalli on Sunday, YSRCP general secretary (Agriculture and Farmers’ Welfare) M.V.S. Nagi Reddy alleged that the government failed to ensure remunerative prices for farmers, particularly chickpea (Bengal gram) cultivators.\nMr. Nagi Reddy said the government was insensitive to the distress of chickpea farmers, as prices had sharply declined due to reduced import duties. While the Minimum Support Price (MSP) for chickpea was announced at ₹5,800 per quintal, farmers would still incur losses without an additional ₹1,000 bonus. The State government failed to exert pressure on the Centre to reinstate higher import tariffs, he said.\nAccording to him, chickpea cultivation had been undertaken in about 3.72 lakh hectares this Rabi season, with production expected to exceed seven lakh tonnes. However, procurement had not yet commenced, and farmers were reportedly selling at significantly lower prices in markets such as Kurnool and Adoni, where rates had fallen to around ₹5,089 and ₹4,939 per quintal, respectively.\nRaising concerns about maize farmers, he said maize cultivation covered over 4.37 lakh hectares this season, largely in Rayalaseema. Despite an MSP of ₹2,400 per quintal last Kharif season, farmers reportedly sold maize at around ₹1,400.\nThe YSRCP leader criticised delays in completing the e-crop registration process, stating that procurement linked to central allocations of 94,500 tonnes at ₹8,775 per quintal had not begun. He alleged that the government’s inaction was forcing farmers to sell produce below MSP.\nThe YSRCP leader accused the Agriculture Minister of making misleading statements in the Assembly regarding free electricity supply and agricultural procurement. He asserted that free power to horticulture crops and nurseries was introduced during the previous regime and that agricultural power supply was streamlined to daytime.\n“Instead of making grand announcements in the Assembly, the government must act on the ground,” Mr. Nagi Reddy said, urging immediate steps to secure additional procurement approvals from the Centre and protect farmers from financial distress.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/government-failed-to-ensure-msp-for-farmers-alleges-ysrcp/article70691410.ece",
        "date": "Sun, 01 Mar 2026 20:39:54 +0530",
        "fetched_at": "2026-03-02 03:55:39.590691"
    },
    {
        "title": "Vice-President inaugurates centenary celebrations",
        "content": "Vice-President C.P. Radhakrishnan being felicitated during the inauguration of the centenary celebrations of St. Stephen’s Higher Secondary School, Pathanapuram, in Kollam on Sunday.\n| Photo Credit: ANI\nEducation must go beyond textbooks and cultivate critical thinking, empathy, resilience, and integrity, Vice President C.P. Radhakrishnan has said here on Sunday. Inaugurating the centenary celebrations of St. Stephen’s Higher Secondary School in Pathanapuram, he added that the completion of 100 years is a remarkable milestone achieved by very few institutions. The Vice-President urged students to say no to drugs and described substance abuse as one of the biggest curses afflicting society. “The campaign against drug use must become a mass movement cutting across religions, languages, and political parties,” he said.\nThe Vice-President observed that the India of 2047 will be shaped by the ideas and initiatives of today’s students. He called upon them to seek not just personal success but also to create a positive impact on society. Describing the centenary as a time of renewal, he expressed hope that as the school enters its second century, it will embrace modern educational advancements while remaining rooted in its moral and cultural foundations. Highlighting Kerala’s strong emphasis on education and social development, the Vice-President noted that institutions like St. Stephen’s Higher Secondary School have significantly contributed to the State’s educational reputation.\nThe Vice-President also paid floral tributes at the holy tomb of the Four Metropolitans located at Mount Tabor Dayara in Pathanapuram. The centenary celebrations were attended by Governor Rajendra Vishwanath Arlekar; Union Minister of State for Petroleum and Natural Gas & Tourism Suresh Gopi; Transport Minister K.B. Ganesh Kumar; Finance Minister K.N. Balagopal; Kodikunnil Suresh, MP; Catholicos of the East, Baselios Marthoma Mathews III Metropolitan and others.",
        "link": "https://www.thehindu.com/news/national/kerala/vice-president-inaugurates-centenary-celebrations/article70691845.ece",
        "date": "Sun, 01 Mar 2026 22:18:32 +0530",
        "fetched_at": "2026-03-02 03:55:40.197493"
    },
    {
        "title": "V-P launches remote-controlled drone-based tranquillizer system in Thrissur",
        "content": "In a significant step toward safer wildlife management, Vice-President (V-P) C. P. Radhakrishnan on Sunday launched a remote-controlled drone-based tranquillizer system designed to sedate rogue elephants and dangerous wild animals from a safe distance.\nThe innovative system, conceptualised by veterinary expert Dr P. B. Giridas, was unveiled at a function held at Devamatha School in Thrissur. The project, named Gajasthram, is financially supported by the Lakshmi Charitable Trust chaired by Thrissur MP and Union Minister Suresh Gopi.\nThe drone is equipped with a capture gun, tranquillizer syringe and medication, all operated remotely. Capable of functioning from a distance of up to 500 metres, the system ensures enhanced safety for wildlife experts, assisting personnel and the public during high-risk operations.\nIntegrated with a mobile-linked GPS system and camera, the device enables precision targeting and real-time monitoring. Officials said the technology would be particularly effective in dense forest regions and geographically challenging terrains where controlling wild animals is difficult.\nDr. Giridas, a member of the Central Elephant Care and Management  Committee and an experienced elephant-darting expert, has been actively involved in tranquillization operations for nearly three decades.\nMr. Gopi expressed confidence that the system would be highly beneficial for Forest department experts and government elephant squad personnel engaged in wildlife control operations.",
        "link": "https://www.thehindu.com/news/national/kerala/v-p-launches-remote-controlled-drone-based-tranquillizer-system-in-thrissur/article70691975.ece",
        "date": "Sun, 01 Mar 2026 20:31:14 +0530",
        "fetched_at": "2026-03-02 03:55:40.817379"
    },
    {
        "title": "Universal Health Scheme a sham, alleges APCC president Y. S. Sharmila",
        "content": "The decision to link Aarogyasri with private insurance must be withdrawn immediately, demands APCC president Y.S. Sharmila.\n| Photo Credit: File Photo\nAPCC president Y.S. Sharmila on Sunday alleged that the State government’s claim on the Universal Health Scheme to provide free insurance to about 5 crore people was a sham.\n“The claim of ₹2.5 lakh health insurance is a blatant fraud. This is a conspiracy to kill Aarogyasri,” she posted on X. She accused the TDP-led coalition government of preparing the ground for privatising the health scheme.\nMs. Sharmila argued that private insurance would bring burden and not benefit, and accused Chief Minister N. Chandrababu Naidu of derailing the Aarogyasri scheme, which, she said, was the lifeline of the poor.\n“When the government is unwilling to allocate ₹4,000 crore annually towards Aarogyasri payments, where will it find thousands of crores to pay in advance to the insurance companies, what does ₹2.5 lakh insurance coverage mean, and why should expenses beyond that be paid by the NTR Vaidya Seva Trust?” she questioned.\nThe APCC chief pointed out that States that implemented private insurance were shifting back to the government trust model, and demanded that the State government spell out its intent behind introducing private insurance. She said Mr. Naidu should explain what benefit would come from replacing Aarogyasri with private insurance.\n“Aarogyasri, a brainchild of former Chief Minister Y.S. Rajasekhara Reddy, is the life-saving scheme for the poor. The decision to link Aarogyasri with private insurance must be withdrawn immediately,” she demanded. She said the government should run the scheme under the trust model and also demanded immediate release of the pending dues of ₹3,000 crore to hospitals.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/universal-health-scheme-a-sham-alleges-apcc-president-y-s-sharmila/article70691891.ece",
        "date": "Sun, 01 Mar 2026 20:30:12 +0530",
        "fetched_at": "2026-03-02 03:55:42.142068"
    },
    {
        "title": "Ernakulam district panchayat to launch job portal for women",
        "content": "The Ernakulam district panchayat will shortly launch a job portal where people can select women workers ranging from domestic help and drivers to professionals with technical expertise.\nThe project, Anganamitra, is designed to financially empower women by providing employment opportunities. Around 5,000 women will be enrolled in the list in the first phase.\n“The project aims to ensure financial independence for women. The idea is to bring the job seekers as well as job providers to a platform. The women will be registered on the portal, and an app will be developed to facilitate this. Any woman above the age of 18 and willing to work can enrol,” said K.G. Radhakrishnan, president of the local body.\nThe job portal will connect women job seekers with individuals and companies offering employment opportunities. The portal will feature the job profiles of the women, along with the ratings they receive for their work. The panchayat will provide ID cards and uniforms for the women.\nKudumbashree will run the project. Tenders will be floated for developing the app, he said.",
        "link": "https://www.thehindu.com/news/national/kerala/ernakulam-district-panchayat-to-launch-job-portal-for-women/article70691636.ece",
        "date": "Sun, 01 Mar 2026 20:28:30 +0530",
        "fetched_at": "2026-03-02 03:55:42.738587"
    },
    {
        "title": "Phase I of Wayanad township inaugurated, keys handed over to 178 families",
        "content": "Chief Minister Pinarayi Vijayan handing over the keys to a flat to five year old Naisa, one of the survivors of the Mundakkai-Chooralmala landslides disaster in Wayanad district in August 2024.\n| Photo Credit: Special Arrangement\nHailing the reconstruction efforts in landslides-hit Wayanad as the latest instance of the ‘Kerala model,’ where people beyond all religious differences come together to support each other in distress, Chief Minister Pinarayi Vijayan on Sunday inaugurated the first phase of the Kalpetta township, built for the survivors of the Mundakkai-Chooralmala landslides in July 2024. Keys to houses were handed over to 178 families.\nFive-year-old Naisa, who lost her father and two siblings in the landslides, was one of the beneficiaries who received the keys from the Chief Minister. A video of her interaction with Mr. Vijayan on stage went viral on social media, with the CPI(M) online handles drawing a picture of contrast between the State government’s fulfilling of its promise and the Union government’s stand in denying relief to the victims. Young Naisa was seen with Prime Minister Narendra Modi in another viral video during his visit to Wayanad after the landslides.\n“We cannot compensate for many losses. But through compassion, we can help people slowly recover from that loss. That is the characteristic of humanity. That is what we saw in the Mundakkai-Chooralmala survival. The world once again saw the Kerala model of love, compassion, and reciprocity. There were many obstacles, from propaganda to denial of Central assistance, from attempts to mislead the survivors and calls not to contribute to the relief fund. Some media outlets also tried to destroy the rehabilitation project by fabricating lies. But it became a reality due to the unity and support of the people,” said Mr. Vijayan.\nSpeaking on the efforts taken by the government for the victims, he said that ₹6,000 has been provided as monthly rent for all disaster survivors. An amount of ₹17.2 crore was spent for livelihood support, while ₹2 crore was spent to provide assistance to 21 children who lost their parents in the disaster. In addition, 858 families are also being provided with food coupons of ₹1,000 per month. The Chief Minister’s Distress Relief Fund received an assistance of ₹773.98 crore for the project.\nHe said that the State government had decided to fully assume the loan arrears of 555 disaster victims in various banks, amounting to ₹18.75 crore, with the Union government abdicating its responsibility. The township is testament to the work ethic of the Uralungal Labour Contract Society which deployed thousands of workers to complete the work with precise planning and extreme efficiency.\nAlong with the houses, the township includes public facilities such as a community hall, disaster shelter, football ground, disaster memorial, shops, material collection facility, water reservoir, sewage treatment plants, underground electricity distribution network, drainage system, a water tank with a capacity of 9.5 lakh litres, and a solar power plant in each house with a capacity of 2 Kilowatt. The township, which is planned in five zones, is built in 35 clusters of 8-10 houses. Each cluster has a spacious green space courtyard. A separate title deed will be issued for the individual owners.\nHe said that the construction of houses for the remaining beneficiaries is nearing completion and the keys are expected to be handed over before the next monsoon. Revival plan for entrepreneurs and business establishments that lost their lives in the disaster is also being implemented.\nRevenue Minister K. Rajan, who presided over the function, said that the township is an example of the Left Democratic Front (LDF) government’s approach which goes beyond just making declarations and laying foundation stones.",
        "link": "https://www.thehindu.com/news/national/kerala/phase-i-of-wayanad-township-inaugurated-keys-handed-over-to-178-families/article70691966.ece",
        "date": "Sun, 01 Mar 2026 20:27:39 +0530",
        "fetched_at": "2026-03-02 03:55:43.345844"
    },
    {
        "title": "Pattissery dam project inaugurated in Idukki",
        "content": "Water Resources Minister Roshy Augustine at the Pattissery dam in Kanthalloor after its inauguration on Sunday.\n| Photo Credit: SPECIAL ARRANGEMENT\nThe Pattissery dam is set to spark an agricultural revolution in the Kanthalloor region, Water Resources Minister Roshi Augustine has said. While inaugurating the completion of the major irrigation project at Kanthalloor in Idukki district on Sunday, Mr. Augustine stated that the dam would secure both drinking water and irrigation for local farming during the summer months. He also revealed that administrative sanction for a new project, the “Lower Chattam Munnar” dam, will be granted soon.\nAccording to officials, the Pattissery dam is part of the Chenkalar project located in the Kanthalloor panchayat. The Water Resources Department completed the construction for ₹60.34 crore. The dam has a total storage capacity of one million cubic metres and is expected to provide irrigation to 240 hectares across the Kanthalloor and Keezhanthur areas. Officials noted that while the project faced numerous hurdles during development, construction is now finally complete.\nBeyond agriculture, the project is expected to boost tourism in the Anchunad hills.\nThe newly-inaugurated Pattissery dam in Kanthalloor in Idukki.\n| Photo Credit:\nSPECIAL ARRANGEMENT\nConstruction began in 2014 but was met with immediate resistance from Tamil Nadu due to the dam’s proximity to the border. Work eventually resumed after these legal and diplomatic hurdles were resolved. Officials highlighted that the Pattissery dam is one of the most significant irrigation projects constructed on the Kerala-Tamil Nadu border since the State’s formation. Water from the Mannavan Shola will be stored in the new reservoir.\nThe project’s initial estimate was ₹24 crore. However, work was halted twice by the contractor, who demanded a revised budget. The estimate was subsequently updated twice before construction could reach completion.\nKanthalloor village is renowned for its tourism and cool-season vegetable farming. The new dam is expected to provide a significant boost to the local agricultural economy. Meanwhile, sources indicated that the project was officially inaugurated before the reservoir had been filled.\nThe ceremony was attended by Water Resources Department Chief Engineer Suja Graison, Irrigation Chief Engineer Benoy Tomy George, and Mechanical Chief Engineer Bejoy K., among others.",
        "link": "https://www.thehindu.com/news/national/kerala/pattissery-dam-project-inaugurated-in-idukki/article70691805.ece",
        "date": "Sun, 01 Mar 2026 22:23:08 +0530",
        "fetched_at": "2026-03-02 03:55:43.944403"
    },
    {
        "title": "Escalation in West Asia can disrupt global oil markets and affect India’s economy, says CPI leader Narayana",
        "content": "India must safeguard its energy security and economic interests, says CPI National Executive member K. Narayana.\n| Photo Credit: File Photo\nCommunist Party of India (CPI) National Executive member  K. Narayana on Sunday criticised the foreign policy of the United States under President Donald Trump, alleging that it reflected “authoritarian and destabilising tendencies.”\nMr. Narayana called upon the international community to collectively oppose unilateral actions targeting sovereign nations.\nAddressing the media in Vijayawada on Sunday, Mr. Narayana said countries such as Iraq, Venezuela and Iran had faced severe consequences for pursuing policies independent of U.S. interests. Referring to the removal of former Iraqi President Saddam Hussein, he argued that allegations over weapons of mass destruction had led to prolonged instability in the region.\nHe expressed concern over rising tensions involving Iran and the growing strategic alignment between the US and Israel. He cautioned that any escalation in West Asia could disrupt global oil markets and adversely affect India’s economy.\nUrging Prime Minister Narendra Modi to pursue an independent foreign policy, he said India must safeguard its energy security and economic interests. He warned that strained relations with Iran could impact crude oil imports, potentially leading to higher fuel prices and increased cost of living domestically.\nThe CPI leader also raised concerns about trade measures imposed by the U.S., stating that higher tariffs on Indian goods could hinder India’s growth ambitions. He emphasised that geopolitical instability in the Gulf region might affect millions of Indian workers and reduce foreign exchange inflows.\nCalling for balanced diplomacy, rooted in peace and mutual respect, Mr. Narayana said the CPI supports efforts to maintain global stability and opposes policies that intensify international tensions.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/escalation-in-west-asia-can-disrupt-global-oil-markets-and-affect-indias-economy-says-cpi-leader-narayana/article70691314.ece",
        "date": "Sun, 01 Mar 2026 20:09:58 +0530",
        "fetched_at": "2026-03-02 03:55:44.570392"
    },
    {
        "title": "Work to lay concrete for two new Kaiga units launched",
        "content": "A view of the Kaiga atomic power station in Karwar where concreting work for two new units began on Sunday.\n| Photo Credit: SPECIAL ARRANGEMENT\nAtomic Energy Commission Chairman Ajit Kumar Mohanty launched concreting work for the construction of the fifth and sixth nuclear power units at Kaiga in Uttara Kannada on Sunday.\nHe said that 10 units of indigenous technology PHW (Pressurised Heavy Water) reactor type are being built at various nuclear power plants in the country.\nOut of these, two units of 700 MW capacity of PHW type are being built at Kaiga. With this technology, the PHW used once in the reactor will be re-used several times. These two units are being built at a cost of around ₹21,000 crore.\nDr. Mohanty launched the work by pressing a button. Later, he performed a puja to mark the commencement of the work. This is considered a significant milestone in the construction of nuclear power generation units.\nA time limit of 59 months has been given to complete the unit construction work. Megha Infra Ltd. is the main contractor.\nThe Kaiga Nuclear Power Plant has four units of 220 MW capacity. The construction work of the fifth and sixth units was started in 2025 itself. Rods have been attached to the foundation to build the reactor. Concreting has now started. After the commissioning of these two units, the power generation capacity of the Kaiga Nuclear Power Plant will be 2280 MW.\nNPCL Chairman Bhuvan Chandra Pathak said that nuclear power plants are producing over 85 million units per day in the country and there are significant revenue earnings.\n“The Kaiga Nuclear Power Plant has achieved significant milestones. We have begun the work of concreting units five and six after obtaining permission from the Atomic Energy Regulatory Board. This is a significant milestone,” he said.\nKaiga plant Director B. Vinod Kumar, Director of the fifth and sixth units Suresh Kulkarni and others were present, according to a release.",
        "link": "https://www.thehindu.com/news/national/karnataka/work-to-lay-concrete-for-two-new-kaiga-units-launched/article70691758.ece",
        "date": "Sun, 01 Mar 2026 20:08:20 +0530",
        "fetched_at": "2026-03-02 03:55:45.175617"
    },
    {
        "title": "PM Modi Inaugurates India's First Domestic Chip Facility In Gujarat's Sanand",
        "content": "Prime Minister Narendra Modi on Saturday inaugurated Micron Technology’s Assembly, Testing, Marking and Packaging (ATMP) facility in Sanand, Gujarat, marking the launch of India’s first domestically produced semiconductor chips. The project positions Gujarat as an emerging centre in the global semiconductor supply chain.\nAddressing the gathering, PM Modi said the facility sends a strong message globally about India’s technological capability. He said the project shows that “India is capable, India is competitive, India is committed,\" and reflects the country’s growing role in the global electronics ecosystem.\nThe Prime Minister described the Sanand project as more than just an industrial investment. According to him, it demonstrates how policy support, manufacturing readiness and global confidence are coming together to strengthen India’s semiconductor mission.\nPM Modi also highlighted the importance of India’s partnership with the United States in advanced technologies. “Today’s program at this facility is evidence of strong collaboration and partnership between India and America,\" he said, noting that cooperation in areas such as artificial intelligence and semiconductor manufacturing will shape the future global technology order.\nA proud day for India!Micron Technology’s Semiconductor ATMP facility was inaugurated in Sanand earlier today.\nHere are some glimpses from the occasion…@MicronTech @MicronCEO pic.twitter.com/y4vrYEMhdy\n— Narendra Modi (@narendramodi) February 28, 2026\nReflecting on India’s technological journey, PM Modi said that discussions around chips and data were limited in the country a decade ago, when the focus was largely on IT services.\n“Today India, known for software, is successfully making its mark in hardware as well,\" he said, pointing to a shift towards manufacturing and innovation.\nHe compared the importance of semiconductors in the modern era to the role of machines during the Industrial Revolution. “If oil was the regulator of the last century, the microchip will be the regulator of this century,\" he said, emphasising the strategic importance of semiconductor production.\nPM Modi also spoke about the transformation of Sanand, which evolved from hosting a single automobile plant to becoming one of India’s major auto hubs.\nHe suggested that Micron’s investment could similarly create a strong semiconductor ecosystem by attracting suppliers, technology partners and new businesses.\nRecalling the region’s industrial journey, the Prime Minister mentioned late industrialist Ratan Tata and said he once sent a message saying, “see what a Gujarati can do with an investment of one rupee,\" highlighting Gujarat’s spirit of entrepreneurship.\nThe Micron ATMP facility has been built with an investment of Rs 22,516 crore. It will assemble and package chips used in SSDs and RAM modules, linking India directly to global electronics supply chains. The project is expected to generate around 5,000 jobs.\nPM Modi said the semiconductor sector will create new opportunities for young people and strengthen India’s technological independence.\n“This opportunity is opening new gates for India’s youth,\" he said, adding that as more semiconductor projects begin production, their broader economic impact will become visible.\nUS Ambassador Sergio Gore also attended the event, marking his first visit to Gujarat after assuming office. His presence highlighted the growing cooperation between India and the United States in critical technology sectors.\nLatest Blogs",
        "link": "https://www.news18.com/india/pm-modi-inaugurates-indias-first-domestic-chip-facility-in-gujarats-sanand-ws-l-9935880.html",
        "date": "Sat, 28 Feb 2026 22:28:05 +0530",
        "fetched_at": "2026-03-02 03:55:49.939258"
    },
    {
        "title": "'Delhi Will Breathe Better': CM Rekha Gupta Sets October AQI Deadline At Rising Bharat Summit",
        "content": "Delhi Chief Minister Rekha Gupta, at the News18 Rising Bharat Summit on Saturday, placed pollution at the heart of her government’s one-year report card, promising that the Capital would breathe “better air\" in the coming months.\nResponding to questions on whether 365 days were enough to claim achievements, Gupta struck a measured tone. “One year is not a long period to list countless achievements,\" she said, adding that what gave her satisfaction was that her government had “worked among the people, faced problems head-on and tried to deliver better solutions\".\nThe Opposition, she acknowledged, continues to argue that pollution levels remain unchanged and that traffic congestion still cripples large parts of the city. Gupta countered sharply: “If an 11-year-old government asks a one-year-old government to answer for every problem, is that fair?\"\nShe described pollution, traffic and waterlogging as “legacy problems\" inherited from the previous regime, insisting her administration had adopted a “scientific roadmap\" rather than ad-hoc responses. According to her, the real undoing has been of “corruption and leakages,\" with governance digitised and accountability tightened across departments.\nOn whether Delhi can ever truly become pollution-free, Gupta was unequivocal. “Definitely,\" she said. “Every year Delhi will see better air.\"\nShe detailed a multi-pronged strategy:\n•\tImplementation of ‘No PUC, No Fuel’ to curb vehicular emissions\n•\tInduction of 4,000 electric buses — the largest such fleet in the capital\n•\tA forthcoming EV policy with subsidies and incentives\n•\tExpansion of last-mile connectivity\n•\tAutomated vehicle fitness testing stations (two inaugurated, five planned)\n•\tNotification of 4,200 hectares of ridge area as forest\n•\tA target to plant 3.5 million indigenous trees over four years\nPollution, she argued, cannot be tackled as a seasonal crisis. “We are looking at it holistically—dust, smoke, emissions, green cover—everything together.\"\nThe conversation turned sceptical when asked whether her vision sounded more like a hill station than present-day Delhi, notorious for its traffic snarls.\nGupta insisted that improvement depends on public participation as much as policy. “If the government and the people move in one direction, things will improve. Cities like Indore have shown it can be done. No city becomes clean in one day.\"\nPressed on timelines, she avoided setting a fixed deadline. “This is not time-bound. It is an ongoing process.\"\nBut on one specific marker—the Air Quality Index this October—she was willing to commit. “Yes, Delhi will see better air,\" she said. “We will work collectively towards it.\"\nOn financial assistance to women, a politically sensitive promise, Gupta maintained that strengthening women economically remains her government’s intent. She said an eligibility list is being prepared and the scheme will be implemented through an online portal to ensure transparency and avoid leakages.\nYet it was clear that, at the summit, pollution defined the narrative of her first year in office.\nWith winter historically bringing a blanket of smog over the Capital, Gupta’s assurance of “better AQI this October\" now stands as a measurable benchmark.\nLatest Blogs",
        "link": "https://www.news18.com/cities/new-delhi-news/delhi-will-breathe-better-cm-rekha-gupta-sets-october-aqi-deadline-at-rising-bharat-summit-ws-l-9935850.html",
        "date": "Sat, 28 Feb 2026 21:21:06 +0530",
        "fetched_at": "2026-03-02 03:55:50.547249"
    },
    {
        "title": "Muslims Are Most Unsafe In Muslim Countries: Taslima Nasreen At Rising Bharat Summit 2026",
        "content": "At a time of heightened geopolitical tensions and renewed debates over secularism, exiled Bangladeshi author Taslima Nasreen delivered a forceful and controversial defence of regime change in certain Islamic nations, while also pushing back against claims that Muslims are unsafe in India.\nSpeaking at Network18’s Rising Bharat Summit 2026 on Saturday, Nasreen was asked whether powerful nations have the right to engineer regime change in countries they “do not like\", citing examples from Iran to Bangladesh.\nThe controversial author, who has been living in New Delhi in exile, argued that each country’s situation is different but maintained that Iran’s clerical establishment “must be changed\", calling for a secular government that separates religion from the state.\nHer statement came hours after US and Israel launched strikes on Iran, triggering global concerns of escalation into a broader conflict in the Middle East.\nReferring to Iranian protests against compulsory hijab and the deaths of women who resisted it, Nasreen said a system based on equality and justice was essential for women’s freedom.\n“I think that in Iran, the mullah regime should be changed… so many women were murdered because they did not want to wear the compulsory hijab. So this mullah regime must be changed and a secularist government should be there in Iran,\" she said.\n“In Iran, you will find that many Muslim women do not want to wear hijab, but some Muslim women want to wear hijab,\" she added.\nTurning to homeland Bangladesh, Nasreen criticised what she described as the growing influence of Islamist forces and defended the need for secular political alternatives. She reiterated her long-held position that religion-based politics undermines democracy and minority rights.\n“Nowhere is radical Islam okay,\" Nasreen said as the conversation broadened to the status of radical Islamist movements globally.\nShe condemned the Taliban’s rule in Afghanistan for banning girls’ education and restricting women from work, arguing that any state governed by religious law inevitably erodes human rights.\nOn India, Nasreen pushed back against narratives that Muslims face systemic insecurity. An atheist from a Muslim background who has lived in India for decades, she said she has not personally encountered Muslims expressing a desire to leave the country out of fear.\n“Muslims in India, they never think of leaving India for any Muslim country. So it means that they are living in safety in India. Muslims are safe in Europe, America, India, and any non-Muslim countries. Muslims are most unsafe in Muslim countries,\" she said.\nIn contrast, she claimed that religious minorities in Bangladesh, particularly Hindus, often live in anxiety and migrate when possible. She argued that Muslims tend to seek refuge in secular democracies — Europe, America and India — rather than in Muslim-majority states, because the latter lack freedom of expression and gender equality.\nLatest Blogs",
        "link": "https://www.news18.com/india/muslims-are-most-unsafe-in-muslim-countries-taslima-nasreen-at-rising-bharat-summit-2026-ws-l-9935706.html",
        "date": "Sat, 28 Feb 2026 19:25:11 +0530",
        "fetched_at": "2026-03-02 03:55:51.320679"
    },
    {
        "title": "Schemes To Representation, Panellists Decode Where Muslims Stand Amid Rising Bharat",
        "content": "From minority representation to government schemes, a wide range of issues were discussed at the Rising Bharat summit on Saturday.\nAmong the panelists at The Minority Report: Margins To Centre discussion were Shehzad Poonawalla, national spokesperson, Bharatiya Janata Party (BJP); Mumtaz Patel, Congress leader; Sumaiya Rana, Samajwadi Party (SP) spokesperson and Tanvir Zahack from Milli Chronicles.\nElaborating on the status of minorities under the BJP rule, Poonawalla said, “There were riots in various parts of the country during the Congress rule…School dropout rates reduced, toilets were made, water supply was ensured…all of this was done by the BJP government. When we named a road after APJ Abdul Kalam, the Aurangzeb club objected…We removed the triple talaq…We are the strongest government on national security, we gave Muslim representation there…Compared to Muslims in Bengal, where BJP never came to power, are Muslims in Gujarat, where we are in power for 30 years, prosperous or not?…Our party never makes MPs or ministers based on religion, but on merit…Of the 28 global laurels for PM Narendra Modi, 8 are from Muslim countries…\"\nUnhappy over the state of Muslims, Mumtaz Patel, Congress leader, said, “The way Congress used to support Muslims earlier, it is not able to do it …Like Dilip Kumar, even my grandfather went by the name Kantibhai Patel…How many BJP Lok Sabha MPs are from the minority community?…While taking off the shirts could have been prevented, the Congress has every right to protest.\"\nSumaiya Rana said, “We are being questioned for hijab. Bihar CM Nitish Kumar pulled off a woman’s hijab…The Congress shirtless protest at AI Impact Summit felt bad…When action is taken against me, why not against Anurag Thakur or Kapil Mishra?\"\nTanvir Zahack offered a different perspective. “Muslims are second largest majority in India, not a minority…When it comes to religious freedom, Muslims of Kashmir are feeling positive after the abrogation of Article 370. The narrative is because some can’t digest Rising Bharat…There is no Islamophobia. There might be Muslim phobia because of their attitude,\" he said.\nLatest Blogs",
        "link": "https://www.news18.com/india/schemes-to-representation-panellists-decode-where-muslims-stand-amid-rising-bharat-ws-kl-9935652.html",
        "date": "Sat, 28 Feb 2026 18:34:15 +0530",
        "fetched_at": "2026-03-02 03:55:51.919713"
    },
    {
        "title": "'Need Nerves Of Steel To Let Military Lead': Historian Praises Political Leadership For Op Sindoor",
        "content": "At the Rising Bharat Summit, Swiss-based military historian and author Adrien Fontanellaz highlighted the critical role of political courage and institutional trust in high-stakes military operations, citing India’s Operation Sindoor as a case in point.\n“On the political level, you really need nerves of steel to let your military be in charge of the escalation ladder and to do what they need to do because the stakes are so high,\" Fontanellaz said. “You need trust in your own institutions—this was quite striking and rare.\"\nOperation Sindoor, carried out after the Pahalgam terror attack, involved carefully calibrated strikes and military maneuvers aimed at countering insurgent networks while minimising escalation.\nAsked about India dominating the battlefield but losing the information war, the historian reflected on the complexities of modern conflict, where strategic outcomes are no longer measured solely by battlefield success. He noted that despite India having dominated the operational aspects of the conflict with Pakistan, the country lost the information war.\n“I am in two minds,\" he explained. “Of course, it is bad to lose the info war. Nowadays, communication is a line of operation itself, so it is true that the Pakistanis were better at that game.\"\nYet, Fontanellaz added a nuanced perspective on the strategic importance of such “wars of perception\". “But at the same time, is winning this info war so important at the strategic level? Because Pakistan won the info war, they did not lose face. And when you have an adversary who has not lost face, they will not reform, and in future, they will be less of a threat.\"\nFontanellaz emphasised that high-stakes operations like Op Sindoor require more than just tactical skill: they demand political trust in military institutions, courage to delegate authority, and careful management of escalation risks.\nABOUT RISING BHARAT\nRising Bharat 2026 is a global forum that reflects the confidence and capability driving India’s rise. Built around the theme Strength Within, the summit brings together leaders, policymakers, and industry voices to shape a future powered by India’s own resolve and ambition. This is where national purpose meets global ambition, transforming resilience into a roadmap for excellence on the world stage. Be part of the movement shaping a stronger, self-reliant Bharat.\nLatest Blogs",
        "link": "https://www.news18.com/india/need-nerves-of-steel-to-let-military-lead-historian-praises-political-leadership-for-op-sindoor-ws-l-9935555.html",
        "date": "Sat, 28 Feb 2026 17:07:55 +0530",
        "fetched_at": "2026-03-02 03:55:52.523439"
    },
    {
        "title": "A Life In 75 Milestones: Network18 Presents To PM Narendra Modi A Special Edition Book At Rising Bharat 2026",
        "content": "At the Rising Bharat 2026 event, Network18 presented Prime Minister Narendra Modi with a special edition book chronicling his life and leadership. Conceived to mark his 75th birthday, the 176-page volume captures 75 milestones that define his journey from a young student in Vadnagar and an RSS pracharak to Chief Minister of Gujarat, Prime Minister of India and a global statesman.\nTitled Modi at 75, the visually rich book was handed over to the Prime Minister by Rahul Joshi, Network18 Group Editor-in-Chief, and the core team behind the project: Brajesh Kumar Singh, Group Editor for Integration and Convergence; Rashmi Singh, Editor for Infographics; Soumyadip Choudhury, Product Head for News18 and Local18; Nadeem Alam, Executive Creative Director; Triparna Mitra, Principal Creative Director; Utpal Kumar, Deputy Executive Editor; Alankar, Principal Creative Director; and, Santanu Kumar Santan, Creative Director. The Prime Minister also met the team on the occasion.\nThe book stands apart from a conventional publication. It is both a visual archive and a carefully structured narrative. Organised into five sections, it traces his formative years, his rise in public life, his tenure as Gujarat’s Chief Minister, his ongoing leadership as Prime Minister, and his role in shaping India’s global engagement.\nThe volume draws on rarely seen archival material, including photographs, letters, memorabilia and even an entry from the Prime Minister’s diary. Several of these have not been published before. The effort behind the book was extensive. A team of six researchers worked for over five months, planning, verifying details, combing through archives and sourcing rare images to ensure that no significant milestone was overlooked.\nThis was followed by more than two months of intensive design development, illustration work and editorial review, with multiple rounds of discussions and vetting to maintain accuracy and context.\nThe project brought together some of the network’s most experienced editors and designers. It also used artificial intelligence to create illustrative renderings of moments from the Prime Minister’s life for which photographic records do not exist. One such AI-generated depiction, portraying a phase of his life as an ascetic, drew a hearty laugh from the Prime Minister when he saw it.\nAdding depth to the narrative are reflections from distinguished voices across the world. Former Australian Prime Minister Tony Abbott has written the preface, sharing his impressions of Narendra Modi’s leadership. Israeli Prime Minister Benjamin Netanyahu addresses his friend “Narendra\" in a personal letter. The Prime Minister of Trinidad and Tobago, Kamla Persad-Bissessar, offers her perspective, while leading figures from India’s corporate sector reflect on his vision for growth and development. Together, these contributions highlight the breadth of his global relationships and the impact of his leadership across sectors.\nThe book’s chapters reflect the arc of his public life. ‘Humble Beginnings’ traces his early years. ‘Rising Through the Ranks’ follows his grassroots work in the Sangh and the BJP. ‘A State Builder’ examines his years in Gujarat and the governance model that drew national attention. ‘Believing in Bharat’ looks at his efforts to steer a new India. ‘Navigating the Globe’ focuses on his diplomatic outreach and global partnerships.\nMore than a commemorative volume, Modi at 75 aims to serve as a reference work that sets out a clear timeline of events and achievements, addressing gaps and misconceptions that sometimes arise in fragmented news narratives. It is designed as a collector’s edition for readers interested in understanding the rise of a leader who journeyed from a small town in Gujarat to the highest elected office in the world’s largest democracy.\nAt Rising Bharat 2026, the presentation of the book and the Prime Minister’s interaction with the team celebrated not only his 75 years but also marked a moment of recognition of the collaborative effort that went into documenting them.\nYou can read the special edition Modi at 75 here: https://www.news18.com/modiat75/\nLatest Blogs",
        "link": "https://www.news18.com/india/a-life-in-75-milestones-network18-presents-to-pm-narendra-modi-a-special-edition-book-at-rising-bharat-2026-9935403.html",
        "date": "Sat, 28 Feb 2026 16:26:11 +0530",
        "fetched_at": "2026-03-02 03:55:53.165299"
    },
    {
        "title": "At Rising Bharat, Expert Warns Iran Holds Multiple Cards In Latest War As Israel, US Launch Strikes",
        "content": "As open hostilities broke out between Iran and the US-Israel axis on Saturday, a stark warning emerged from News18’s Rising Bharat Summit—Tehran holds multiple levers of retaliation, and events may no longer be in Washington or Tel Aviv’s control.\nSpeaking at the summit, Swiss-based military historian Adrien Fontanellaz said the unfolding conflict underscores a deeper global shift, one where assumptions of dominance and predictability have eroded.\nFontanellaz placed the current confrontation in the context of a broader geopolitical transition. “In the early 2000s, we thought we were living in a completed world, governed by international law,\" he said. “But for over a decade now, everything has been unravelling.\"\nAccording to him, the move from a unipolar order dominated by the United States to a multipolar system—with powers such as India rising—has generated friction and instability. “We are now back in a conflicted world until a new paradigm emerges,\" he noted, describing the present moment as “highly risky.\"\nThe outbreak of direct hostilities between Iran and Israel, with US involvement, appears to reflect precisely that volatility.\nFontanellaz drew comparisons between US President Donald Trump and Russian President Vladimir Putin, arguing that both leaders demonstrated a belief in swift, decisive operations that avoid prolonged entanglement. He cited Russia’s short 2008 war with Georgia and the subsequent annexation of Crimea as examples of quick strategic wins that may have shaped Moscow’s later miscalculation in Ukraine. What was expected to be another rapid success instead turned into a grinding, protracted conflict involving Russia, Ukraine and Western Europe.\nFontanellaz suggested that Washington may be facing a similar strategic gamble in confronting Iran. “So far, military operations have been clean, under control, and scoring PR points,\" he observed. “But the danger this time in going against Iran is that we have no control over what the Iranians will do.\"\nThe historian stressed that Tehran possesses “several serious options\" in the event of escalation. Among them, he said, were targeting American naval assets in the Persian Gulf, deploying an arsenal of at least 1,000 long-range ballistic missiles, launching thousands of shorter-range missiles capable of striking bases in Saudi Arabia, activating regional allies and Tehran-backed militias. He also described Iran’s long-range missile capability—alongside its nuclear potential—as a form of strategic insurance. “My assumption is they will not renounce them so easily,\" he said, implying that Iran’s deterrent posture is deeply embedded in its national security doctrine, and any attempt to degrade it risks triggering broader retaliation.\nWhat makes the present moment particularly dangerous, Fontanellaz warned, is the unpredictability of Iran’s response. “What is frightening,\" he said, “is that the Israelis and the Americans don’t have control over Iran’s possibility to escalate.\"\nWith war now underway, that uncertainty looms large. Unlike previous limited strikes or shadow conflicts, Saturday’s developments risk drawing in regional actors, disrupting energy corridors, and widening into a sustained confrontation.\nLatest Blogs",
        "link": "https://www.news18.com/world/at-rising-bharat-expert-warns-iran-holds-multiple-cards-in-latest-war-as-israel-us-launch-strikes-ws-l-9935010.html",
        "date": "Sat, 28 Feb 2026 14:41:16 +0530",
        "fetched_at": "2026-03-02 03:55:53.767180"
    },
    {
        "title": "PM Modi Launches Nationwide Human Papillomavirus Vaccine Drive In Ajmer To Prevent Cervical Cancer",
        "content": "Prime Minister Narendra Modi on Saturday launched the nationwide Human Papillomavirus (HPV) vaccination campaign aimed at preventing cervical cancer among girls aged 14 years, describing the initiative as a major step towards safeguarding the health and well-being of the country’s daughters.\nThe Prime Minister inaugurated the programme during his visit to Rajasthan’s Ajmer, reiterating the government’s commitment to strengthening women’s healthcare through preventive measures.\n#WATCH | Ajmer, Rajasthan: Prime Minister Narendra Modi launches the nationwide Human Papillomavirus (HPV) Vaccination Programme for girls aged 14 yearsThe programme will target approximately 1.15 crore girls aged 14 years every year across all States and Union Territories. The… pic.twitter.com/bepCZ6Cj5h\n— ANI (@ANI) February 28, 2026\nAhead of the launch, PM Modi said the government was focused on ensuring better health outcomes for girls across the country.\nIn a post on X cited, the Prime Minister mentioned, “We are leaving no stone unturned to ensure that the daughters of the country are healthy and prosperous.\"\nHe added that the nationwide HPV vaccination campaign was being launched to prevent cervical cancer.\nNATIONWIDE PREVENTIVE HEALTH INITIATIVE\nAs per an official release, the campaign marks a decisive move in India’s public health journey and aligns with the government’s vision of “Swastha Nari\", which emphasises prevention, protection and equity in women’s healthcare.\nThe programme will target approximately 1.15 crore girls aged 14 years every year across all States and Union Territories.\nThe vaccine will be provided free of cost at designated government health facilities, the official statement mentioned.\nThe Press Information Bureau (PIB) said the initiative represents a significant milestone in advancing preventive healthcare and strengthening women’s well-being nationwide.\nThe campaign specifically aims to prevent cervical cancer, which remains one of the leading causes of cancer-related morbidity among women.\nIMPLEMENTATION THROUGH PUBLIC HEALTH NETWORK\nAccording to details shared in the release, vaccination sessions will be conducted at Ayushman Arogya Mandirs (Primary Health Centres), Community Health Centres, Sub-District and District Hospitals, as well as Government Medical Colleges and Hospitals.\nEach vaccination session will be supervised by trained medical officers supported by healthcare teams. Functional Cold Chain Points have been established at all sites to ensure safe vaccine storage and delivery.\nThe facilities will also be linked to 24×7 government health centres to provide immediate medical support and manage any rare Adverse Events Following Immunisation (AEFI), the release stated.\nThe vaccination programme will remain voluntary, and informed consent from parents or guardians will be obtained before administration.\nAccording to the release, the Prime Minister’s visit to Ajmer also included the launch, inauguration and foundation laying of multiple development projects worth over Rs 16,680 crore across sectors such as urban development, drinking water supply, roads, irrigation, energy and industrial infrastructure.\nIt further said that the HPV vaccination drive forms a key component of the government’s broader push towards preventive healthcare, aiming to ensure long-term health security for girls and women across the country.\nThe Prime Minister will also address a public gathering during the visit and distribute appointment letters to newly recruited youth in various government departments and organisations in Rajasthan.\nLatest Blogs",
        "link": "https://www.news18.com/india/pm-narendra-modi-launches-nationwide-human-papillomavirus-hpv-vaccination-rajasthan-ajmer-cervical-cancer-prevention-ws-l-9934831.html",
        "date": "Sat, 28 Feb 2026 12:39:12 +0530",
        "fetched_at": "2026-03-02 03:55:54.753367"
    },
    {
        "title": "Rising Bharat Summit 2026 Highlights: Our Biggest Strength Has Been Talent, Says MeitY’s Abhishek Singh",
        "content": "News18 Rising Bharat Summit 2026 Day 2 Highlights: Day 2 of the News18 Rising Bharat Summit 2026 began on Saturday, bringing together an exceptional lineup of influential voices from across government, business, technology, economics, sustainability, entertainment and sports.\nAmong the prominent attendees are cricketers Mithali Raj, MD Shami and Yuzvendra Chahal, Delhi Chief Minister Rekha Gupta, General Sir Nick Carter, former Chief of the Defence Staff of the UK, Defence Secretary Rajesh Kumar Singh, and Sarvam AI co-founder Pratyush Kumar.\nCentered on the theme “Strength Within,” the summit serves as a dynamic global forum highlighting the confidence and capability driving India’s rise. It aims to unite policymakers, industry leaders and changemakers to chart a future powered by India’s own ambition and resilience. Positioned at the intersection of national purpose and global aspiration, Rising Bharat 2026 seeks to transform inner resolve into a roadmap for excellence on the world stage, inviting participants to be part of a movement shaping a stronger, self-reliant Bharat. Follow for live updates.\nSpeaking at the Rising Bharat Summit 2026, Defence Secretary Rajesh Kumar Singh said India will continue to safeguard its strategic interests in Iran’s Chabahar port while ensuring access to key regions.\n“We will have to negotiate our way so that our interest in Chabahar are sustained and it brings us benefits in terms of access to Central Asia and Afghanistan,” he said.\nSingh also highlighted India’s strategic autonomy in global engagement. Referring to the recently concluded International Fleet Review, he said India has been able to bring different nations together despite geopolitical differences.\n“In the recently concluded international fleet review, our strategic autonomy is distinct in that we were able to get Americans, Iranians on the table,” he said.\nHe added that India’s ability to work with multiple countries while maintaining its own strategic priorities has been evident over the years.\n“India’s ability to strike, align and engage with different countries has shone over the years,” Singh noted.\nSpeaking at the Rising Bharat Summit 2026, ideaForge CEO Ankit Mehta said India’s defence procurement process has become significantly faster in recent years.\nHe noted that since 2020, fast-track procurement has been introduced in the defence sector, helping speed up the acquisition of equipment and technology.\nMehta added that the new Defence Acquisition Procedure (DAP) is further strengthening the procurement system.\nHe also highlighted that the time taken to adopt new technologies has reduced sharply. According to him, the process that earlier took months or even years is now completed within weeks.\nAt the Rising Bharat Summit 2026, Abhishek Singh from the Ministry of Electronics and Information Technology (MeitY) highlighted the need for stronger digital infrastructure as the use of artificial intelligence expands in India.\nHe said that if nearly 10 to 20 crore people in the country begin using AI-based services for different needs, the current backend systems will have to be significantly upgraded.\n“Given the size of our country, if 10–20 crore people start using these services for various purposes, we will need to upend the backend infrastructure. 100,000 to 200,000 GPUs will be the minimum we will need to meet the demand of India,” he said.\nSpeaking at the Rising Bharat Summit 2026, Jean Touboul, CEO of Pernod Ricard, said the company is focusing on encouraging consumers to choose better-quality products rather than increasing consumption.\n“Value is more important than volume. As I said, premiumization, which has been a strategy that we have applied worldwide and in India for many years means, we really want to push consumer to drink, better,” he said.\nSpeaking at the Rising Bharat Summit 2026, Swiss-based military historian Adrien Fontanellaz said Iran has several possible options if it decides to retaliate against Israel and the United States.\nHe indicated that Tehran has different strategic and military avenues it could pursue in response to rising tensions in the region.\nSwiss-based military historian and author Adrien Fontanellaz spoke on the evolving global power dynamics, saying, “We are switching into a different world with several equal powers, perhaps four or five real global powers, India will be one of them obviously and during this transition, we are seeing frictions. We are seeing a reshuffling of cards, which is generating conflict.”\nFontanellaz highlighted that as new powers emerge and global influence shifts, the world is witnessing increased tensions and conflicts driven by this geopolitical realignment.\nShiprocket co-founder Gautam Kapoor highlighted India’s entrepreneurial spirit, particularly among its youth. He said, “India is the land of entrepreneurs. A large part of the young part of Bharat is actually becoming an entrepreneur rather than looking for a job. I think e-commerce is one of those places where people find a lot of connect and they are able to create brands and products by investing less money. So, what the Indian ecosystem of manufacturing has done is that the capability of any brand to go back and go to a manufacturer to create a fashion brand… if they have a good idea and then it will go to a smaller batch of manufacturers…, so you can really start now, and that is what is fueling this flurry of new brands coming with interesting products.”\nKapoor emphasised that accessible manufacturing and e-commerce platforms are enabling young Indians to launch innovative brands and products with minimal investment.\nDTDC Express CEO Abhishek Chakraborty highlighted the growing emphasis on local production in India. He said, “The one story that has stood out very clearly is that the Indian brands, the Indian sellers, the Indian manufacturers have actually taken that as a big clue to take it upon themselves and honestly start focusing on actual domestic production, actual domestic manufacturing.”\nPernod Ricard India CEO Jean Touboul praised India’s workforce for its high level of education and talent. He said, “My experience working with Indian is that the workforce is extremely well educated. So you have people who are really able to do that. We as a group source talent from India, send them abroad and sometimes they come back to contribute again to Indian business. We see India as a manufacturer of talent that’s really helpful for the entire group.” Touboul highlighted how Indian professionals play a crucial role not only domestically but also in supporting the company’s global operations.\nResponding to a question on brand differentiation in India’s competitive market, Pernod Ricard India CEO Jean Touboul emphasised the importance of local relevance. He said, “India is not a market where you apply only a global recipe. You have to be locally relevant. That’s what we try to do with our brands. Which are, for most of them, produced here, in India, for Indians and we are trying to be very accurate in the experience we provide to the consumers.” Touboul highlighted that adapting global strategies to suit Indian tastes and producing locally are key to delivering meaningful consumer experiences.\nMohammad Shami expressed his support for regional language commentary in sports, saying, “I prefer local languages for commentary in sports. India has so many languages and people living in villages don’t always understand English.”\nFormer cricketer Mithali Raj reflected on the unpredictable nature of sports and life, saying, “Sports is a risk. There is no guarantee in sports that, despite you scoring a hundred today, tomorrow you might get out on the first ball, so there is no guarantee in that, but what you can do best is that you can back them, back our team…In life, there are a lot of fluctuations. Sometimes you are peaking and sometimes you are in the valley.” She emphasized resilience and unwavering support, noting that both sport and life are filled with highs and lows, and what truly matters is standing by the team through every phase.\nAt the Summit, cricketer Yuzvendra Chahal spoke about the spirit of teamwork in cricket, emphasising that individual selection matters less than collective success. He said, “I don’t think it’s hard to miss any matches. It’s a team game. If you are on the bench with the team, even if I don’t play, winning the match is a joint win.” Chahal underlined the importance of unity and shared responsibility, noting that every victory belongs to the entire squad, whether on the field or off it.\nDuring Day 2 of the Summit, cricketer Mohammed Shami reminisced about his experiences in the 2023 World Cup, calling it a career highlight. He said, “Those were the best days of my life,” reflecting on the memorable moments and teamwork that made the tournament an unforgettable chapter in his journey as an athlete.\n#CricketFever | Reflecting on the 2023 World Cup campaign, @MdShami11 speaks about his standout spells and the mindset he carries into major tournaments#RisingBharatSummit2026 #WorldCup2023 | @ShivaniGupta_5 pic.twitter.com/U0vlNrcJBV\n— News18 (@CNNnews18) February 28, 2026\nAditya B Chatterjee, MD of Equifax India, revealed that India suffered losses of approximately Rs 34,000 crore to scams last year. His statement underscores the growing concern around financial fraud and highlights the need for stronger risk management and monitoring mechanisms within the country’s lending and banking sectors.\nAditya B Chatterjee, MD of Equifax India, shared insights on lending behavior, stating, “All the lenders have become very cautious. They have become very cautious on the ticket size.  We are seeing that there is a direct effect of the ticket size and delinquency. Again, zero to 15,000 is a very high delinquency, but if we go to a loan above one lakh or two lakh, it becomes very secure.\nHemant Gala, CEO of PhonePe Lending, highlighted the next phase in the fintech sector, emphasising the importance of formalization. He said, “Formalisation phase coming, which leads to data understanding of structured data formats to be able to figure out what is the credit spending, how to lend and how to give money to people.”\nSEBI’s Kamlesh Chandra Varshney said, “Now that verified tick is available only on those apps which have been verified. So that is a very important step which has been taken.  We are very thankful to Google, who has helped us in doing this. We are still negotiating with Apple.”\nSEBI Whole-Time Member Kamlesh Chandra Varshney spoke about the distinctive nature of India’s financial ecosystem, stating, “The way our stock market works is unique in the world.” He highlighted the regulatory framework, investor behavior and market mechanisms that set India apart. “We can proudly say there are some initiatives that we have taken to protect market and investors’ interests, which no other country has done. We are doing things on our own. T+1 settlement was done in India first, the US followed after us,” he added.\nSEBI Whole-Time Member Kamlesh Chandra Varshney spoke about the distinctive nature of India’s financial ecosystem, stating, “The way our stock market works is unique in the world.” He highlighted the regulatory framework, investor behavior and market mechanisms that set India apart. “We can proudly say there are some initiatives that we have taken to protect market and investors’ interests, which no other country has done. We are doing things on our own. T+1 settlement was done in India first, the US followed after us,” he added.\nThe panel session titled “Currency of Lending: Trust, Tech, Transactions” kicked off, bringing together industry experts to discuss the evolving landscape of lending in India.\nThe summit saw the presence of several prominent leaders from the financial and technology sectors. Among the distinguished attendees are SEBI Whole-Time Member Kamlesh Chandra Varshney, PhonePe Lending CEO Hemant Gala, Idfy CEO and Co-Founder Ashok Hariharan, and Equifax India MD Aditya B. Chatterjee. Their participation highlighted the summit’s focus on innovation, finance, and governance, offering attendees valuable insights from industry experts shaping India’s economic and technological landscape.\nDay 2 of the Rising Bharat Summit 2026 kicked off with a lively performance by UK-based bhajan clubbing artist Radhika Das as he took the stage. The ‘Hare Krishna’ chants set an energetic tone for the day, captivating the audience and adding a vibrant cultural touch to the summit’s proceedings.\nDay 2 of the News18 Rising Bharat Summit 2026 is set to begin shortly.\nDay 2 of the News18 Rising Bharat Summit 2026 features an impressive roster of key attendees from diverse fields. Sports icons such as cricketers Mithali Raj, MD Shami, and Yuzvendra Chahal will be present, alongside political leaders like Delhi Chief Minister Rekha Gupta. The summit also welcomes distinguished defence and security figures, including General Sir Nick Carter, former Chief of the Defence Staff of the UK, and India’s Defence Secretary Rajesh Kumar Singh. From the technology and entrepreneurship space, Sarvam AI co-founder Pratyush Kumar will participate, representing India’s growing innovation ecosystem. This convergence of leaders from government, defense, sports, and industry underscores the summit’s focus on collaboration and shared vision in shaping India’s future.\nLatest Blogs",
        "link": "https://www.news18.com/india/rising-bharat-summit-2026-day-2-live-updates-network18-flagship-event-pm-modi-ayushman-bharat-ai-summit-congress-new-delhi-india-latest-news-liveblog-9934573.html",
        "date": "Sat, 28 Feb 2026 22:47:59 +0530",
        "fetched_at": "2026-03-02 03:55:55.650311"
    },
    {
        "title": "Fino Payments Bank MD Rishi Gupta Arrested; CFO Ketan Merchant Named Interim Head",
        "content": "Rishi Gupta, Managing Director and Chief Executive Officer of Fino Payments Bank, has been arrested under the provisions of the Central Goods and Services Tax (CGST) Act and the State Goods and Services Tax (SGST) Act, the bank informed stock exchanges on Friday.\nIn its regulatory filing, the bank said the arrest took place earlier in the day. It clarified that the investigation is related to certain business partners of the bank.\nFollowing Gupta’s arrest, Chief Financial Officer Ketan Merchant has been appointed as the Head of the Organisation, the filing stated.\nThe development was disclosed through an official communication to the exchanges. Further details regarding the nature of the investigation were not immediately available.\nLatest Blogs",
        "link": "https://www.news18.com/india/fino-payments-bank-md-rishi-gupta-arrested-cfo-ketan-merchant-named-interim-head-ws-l-9934412.html",
        "date": "Fri, 27 Feb 2026 23:32:10 +0530",
        "fetched_at": "2026-03-02 03:55:56.364113"
    },
    {
        "title": "Surat Mass Suicide: Main Accused Arrested After Note Reveals Credit Card Fraud, Mental Torture",
        "content": "Days after three members of a family died by suicide, reportedly by consuming a poisonous substance, police have arrested the main accused, identified as Vaibhav Rungta, in Delhi for allegedly forcing the family to take the drastic step.\nBalmukund Khetan, a native of Bihar, his wife Priyanka and their elder daughter died at their residence in Surat’s Vesu area on Tuesday after allegedly consuming a poisonous substance. The couple’s younger daughter, who is seven years old, survived and is currently receiving treatment, according to police.\nThe investigation uncovered a trail of financial abuse. A three-page suicide note was recovered from the scene, which accused Vaibhav Rungta of massive credit card fraud and relentless mental torture, according to a report by NDTV. The note revealed that Rungta allegedly misused Khetan’s credit cards.\nWhen Balmukund, a stock trader who worked from home, demanded his money back, he was met with verbal abuse and death threats. The family chose to take the extreme step due to constant mental and financial pressures.\nYoungest Daughter ‘Spoon-Fed’ Poison\nThe youngest daughter, identified as Prithvi, told cops that she had been “spoon-fed\" something by her parents, which led investigators to believe that the children were poisoned first before the couple consumed the substance themselves, according to the NDTV report.\nThe family consumed aluminium phosphide, a highly toxic substance. On the day of the incident, Priyanka informed her father that they had consumed prison. Although an ambulance rushed the family to the hospital, most of them could not be saved. Balmukund was declared dead at the scene, while Priyanka and their elder daughter, Bhavya, succumbed to their injuries during treatment.\nPolice are now investigating whether other moneylenders or accomplices were involved in the harassment, and the victim’s bank accounts and credit card transactions are being audited for evidence.\nAfter the mass suicide, Vesu police team caught Rungta in Delhi following technical surveillance. A local Delhi court refused transit remand to Rungta, ordering the accused to appear in person before the Surat court instead.\nSuicide Prevention. News 18. If you or someone you know needs help, call any of these helplines: Aasra (Mumbai) 022-27546669, Sneha (Chennai) 044-24640050, Sumaitri (Delhi) 011-23389090, Cooj (Goa) 0832- 2252525, Jeevan (Jamshedpur) 065-76453841, Pratheeksha (Kochi) 048-42448830, Maithri (Kochi) 0484-2540530, Roshni (Hyderabad) 040-66202000, Lifeline 033-64643267 (Kolkata)\nLatest Blogs",
        "link": "https://www.news18.com/india/surat-mass-suicide-main-accused-arrested-after-note-reveals-credit-card-fraud-mental-torture-ws-l-9934393.html",
        "date": "Fri, 27 Feb 2026 22:56:53 +0530",
        "fetched_at": "2026-03-02 03:55:56.973026"
    },
    {
        "title": "Rising Bharat Summit | PM Modi Hails Rise Of 'New India', Assails Congress For 'Defaming Nation'",
        "content": "At the News18 Rising Bharat Summit on Friday, Prime Minister Narendra Modi delivered a powerful address that balanced a scathing critique of the political opposition with a soaring vision of a self-confident, “Aatmanirbhar\" India. The Prime Minister asserted that when the “hidden strength\" of a nation awakens, it achieves accomplishments that amaze the world. However, he lamented that despite decades of independence, certain political factions remain shackled to a “colonial mindset\", acting as a “toolkit\" of opposition that belittles national achievements on the global stage.\nA significant portion of the Prime Minister’s speech was dedicated to the recent AI Summit, which he described as a moment of immense national pride where India moved from being a consumer to a creator of technology. He sharply criticised the Congress party for attempting to turn this global celebration into a political spectacle. PM Modi remarked that the “country’s oldest party\" revealed its “ideological bankruptcy\" by attempting to defame the nation in front of foreign guests. He suggested that when frustration from repeated failure takes over, it manifests as arrogance that harms the country’s image. He further noted that the Congress often uses the name of Mahatma Gandhi as a shield to hide its mistakes while reserving all credit for a single family when things go well.\nThe Prime Minister highlighted the dramatic shift in India’s digital landscape, particularly through the “JAM Trinity\" (Jan Dhan, Aadhaar, and Mobile). He noted that while ATMs arrived in India far later than in developed nations, the country has leapfrogged to become a global leader in digital payments. This infrastructure has revolutionised welfare, allowing the government to transfer Rs 24 lakh crore directly to beneficiaries, effectively plugging the leakages that were once accepted as an unavoidable truth. He pointed out that an India where 30 million families lived in darkness before 2014 is now a global leader in solar power and boasts the world’s third-largest metro rail network.\nThe Prime Minister drew a sharp contrast between the “slow and delayed\" India of the past and the “Fast and Fearless\" India of 2026. He cited the transformation of the Indian Railways through Vande Bharat and Namo Bharat as evidence of this new pace. On the economic front, he noted that India has managed to control inflation—which was once in double digits—and has successfully negotiated trade deals with developed nations from a position of “Aatmanirbhar\" strength. He declared that India has officially become the “world’s growth engine\", driven by a generation of Gen Z voters who are ready to teach a lesson to those immersed in “family loyalty\" rather than national duty.\nThe Prime Minister also took aim at regional governments for stalling central welfare schemes. He highlighted that the Ayushman Bharat health scheme, providing free treatment up to Rs 5 lakh, remains unimplemented in West Bengal. Similarly, he noted that while 9.5 lakh houses were allotted to the poor in Tamil Nadu under PM Awas Yojana, construction for 3 lakh homes has stalled because the DMK government is “not taking interest\". He added that such delays are a result of insincere intentions, contrasting them with his government’s mission to ensure that no citizen is left behind in the journey towards a developed Bharat.\nLatest Blogs",
        "link": "https://www.news18.com/india/rising-bharat-summit-pm-modi-hails-rise-of-new-india-assails-congress-for-defaming-nation-9934364.html",
        "date": "Fri, 27 Feb 2026 22:19:54 +0530",
        "fetched_at": "2026-03-02 03:55:57.690090"
    },
    {
        "title": "PM Modi Underscores India’s Tech Leap, AI Summit Success At News18 Rising Bharat 2026",
        "content": "Addressing the News18 Rising Bharat Summit on Friday, Prime Minister Narendra Modi articulated a transformative vision of India’s journey from a hesitant importer of technology to a dominant global exporter and trendsetter. Speaking at Bharat Mandapam in New Delhi, the Prime Minister noted that the world is now “amazed\" by India’s digital infrastructure, which has bridged the gap between governance and the common citizen through the formidable “JAM Trinity\"—Jan Dhan, Aadhaar, and Mobile. This bedrock of Digital Public Infrastructure (DPI) has enabled the government to transfer a staggering Rs 24 lakh crore directly to beneficiaries via Direct Benefit Transfer (DBT), effectively eliminating the “bitter truth\" of leakages that once plagued India’s welfare systems.\nThe Prime Minister highlighted that India’s leadership in digital payments is no longer just a regional success story but a global case study. He remarked that while ATMs arrived in India much later than in the developed world, the country has leapfrogged traditional banking hurdles to facilitate 20 billion digital transactions every month. This democratic spirit of technology ensures that 50 out of every 100 real-time digital transactions in the world now occur in India alone. This shift from a “consumer mindset\" to a “creator mindset\" was further exemplified by the recent India AI Impact Summit, where India was not merely a participant but a leader, shaping international standards for ethical and inclusive artificial intelligence.\nPrime Minister Modi emphasised that India is now setting new benchmarks in emerging technologies. He noted that a few years ago, initiatives hosted in India were often dismissed as regional matters; today, every major step taken in Bharat is analysed internationally. This rising global stature is a reflection of the “strength within\"—a realisation of national potential that has turned India into a hub for semiconductors, quantum computing, and scalable AI solutions. By moving from “Machine Learning\" to “Learning Machines\", India is ensuring that its MANAV vision for AI (Moral, Accountable, National, Accessible, and Valid) becomes a global blueprint for the common good.\nThe Prime Minister maintained that by stating that India is now a “Fast and Fearless\" nation, contributing nearly 20% to global growth. The transition from importing 2G and 3G technology to exporting indigenous 5G solutions and homegrown AI models signifies a sovereign digital future. For the global community, especially the Global South, the “India Stack\" has become a beacon of hope, proving that technology can be a means of equality rather than a source of divide. As India acts, the world watches, recognising that the nation is no longer just a part of the global dialogue—it is the one leading it.\nLatest Blogs",
        "link": "https://www.news18.com/india/pm-modi-underscores-indias-tech-leap-ai-summit-success-at-news18-rising-bharat-2026-9934324.html",
        "date": "Fri, 27 Feb 2026 21:24:59 +0530",
        "fetched_at": "2026-03-02 03:55:58.396355"
    },
    {
        "title": "'They Tried To Destroy India's Image': PM Modi Lashes Out At Congress Over AI Summit Protest",
        "content": "Prime Minister Narendra Modi on Friday launched a scathing attack on Congress, referring to it as “India’s oldest party\" that tried to destroy India’s image at the AI Impact Summit, which concluded on February 21.\nCalling the shirtless protest at the AI summit by the Youth Congress a “dirty\" tactic, Prime Minister Modi said they deployed it a time when India is shaping the discourse in the age of artificial intelligence.\n“The AI summit was a moment of pride for the entire country, but the country’s oldest party tried to turn the national celebration into a spectacle. In front of foreign guests, the Congress not only exposed itself but also revealed its ideological bankruptcy,\" Modi said, during the News18 Rising Bharat Summit.\nModi took a swipe at the Congress’s “habit\" of protesting, saying when frustration and disappointment from failure fill the mind and arrogance takes over, thinking that defames the country comes to the surface. But he said no matter what, his government will keep doing its work.\n“Congress jitna shirt pharte rahe, hum apna kaam karte rahenge (no matter how many shirtless protests Congress carries out, we will keep doing our work),\" he said.\nRecalling Congress leader Rahul Gandhi’s reference to Mahatma Gandhi over the shirtless protest, he said the grand old party always brings Bapu’s name forward to “hide its mistakes\".\n“There is anger in the country over this act of Congress. That is why, to justify their wrongdoing, they brought Mahatma Gandhi forward. The Congress party does the same thing whenever it wants to hide its mistakes — it brings Bapu to the forefront — and when it wants to claim credit, it gives all the recognition to one family (Nehru-Gandhi family),\" he said.\nListing the Congress’s opposition to Article 370, triple talaq, Swachh Bharat, Covid vaccine, surgical strikes, and the Ashoka stambh, the Prime Minister said the Congress has now been reduced to merely a “toolkit\" of the opposition in the name of ideology.\n“Congress opposed Ashoka stambh in Parliament, they opposed the new Parliament building, opposed the surgical strikes, air strikes, ‘Operation Sindoor. They opposed the CAA, women reservation Bill, UPI, opposed abolition of triple talaq. This mindset of blind opposition has grown so much that it does not miss any opportunity to belittle the country on any stage or platform,\" he said.\nGiving the example of the AI summit, however, Modi said nowadays any event hosted by India starts a global conversation but this was not the case before.\nHe said till a few years ago, events happening in India barely received serious attention in global media. Programmes and initiatives hosted in India were often seen as regional matters, not global ones, he added.\n“But look at the situation today. When India acts, the world watches. When India hosts an event, it becomes part of the global conversation. Every major step taken here is analysed internationally. Take the example of the AI summit. Under the leadership of Narendra Modi, India is not just participating in global technology discussions — it is helping shape them. The world is closely observing India’s initiatives in artificial intelligence, digital governance, and emerging technologies,\" he said.\nHe added that this transformation reflects India’s rising global stature and, today, India is not just part of the dialogue — it is helping lead it.\nLatest Blogs",
        "link": "https://www.news18.com/india/indias-oldest-party-tried-to-destroy-indias-image-at-ai-summit-pm-modi-at-rising-bharat-9934264.html",
        "date": "Fri, 27 Feb 2026 21:41:52 +0530",
        "fetched_at": "2026-03-02 03:55:59.012940"
    },
    {
        "title": "'Some Surprised About India's Trade Deals With Developed World': PM Modi At Rising Bharat Summit",
        "content": "Prime Minister Narendra Modi on Friday said India’s growing global stature and economic confidence have led developed nations across the world to actively seek trade agreements with the country, describing it as a reflection of an “Aatmanirbhar and Aatmavishwaasi Bharat (self-dependent and self-confident)\".\nDelivering the keynote address at News18’s Rising Bharat Summit, PM Modi said over the last 11 years, India has rediscovered its strength and shed what he described as a long-standing colonial mindset. “In the last 11 years, energy has flowed into the consciousness of the country. India has understood its strength and wants to recognise its capabilities,\" the prime minister said.\n#RisingBharatSummit2026 | People are shocked at the trade deals India is doing. How come developed nations are excited regarding making deals with India: PM Narendra Modi (@narendramodi) Watch live: https://t.co/3knrPqR1Sv pic.twitter.com/KGVITcGVQI\n— News18 (@CNNnews18) February 27, 2026\nDrawing a contrast with the past, PM Modi remarked that for decades, India’s potential was “ignored\" and the country remained dependent on foreign models. “There was a time when we used to copy foreign technology. Even after Independence, India could not come out of the mentality of slavery. We are suffering the consequences of that till date,\" he said.\nThe prime minister, highlighting India’s expanding trade footprint, said the world’s leading economies are now eager to partner with India. “India is now so capable that developed countries of the world are themselves coming forward to make trade deals with India,\" he said. “Some people are not able to believe how India managed to do trade deals with developed countries.\"\nAccording to the prime minister, the answer lies in what he termed an “Aatmavishwaasi Bharat\"—a self-confident India that negotiates from a position of strength.\nHe added that India’s macroeconomic stability has strengthened its credibility. “We have made our banking system strong. We have controlled inflation which was once in double digits. We have made India the world’s growth engine,\" he said, asserting that global investors and governments view India as a reliable economic partner.\nPM Modi also pointed to India’s transformation in technology and digital governance as a factor behind rising global interest. “There was a time when India was just a consumer of technology. Today, India is not only using technology at scale but also becoming a leader in it,\" he said, highlighting the global attention around India’s Digital Public Infrastructure.\nReferring to the JAM trinity—Jan Dhan, Aadhaar and Mobile—the prime minister said the integration of these platforms has enabled transparent governance and direct benefit transfers worth Rs 24 lakh crore to beneficiaries, reducing leakages that were once considered inevitable.\n“In a country where even ATMs arrived much later compared to developed nations, how did India achieve global leadership in digital payments?\" he asked, adding that the world is “amazed\" by India’s digital infrastructure.\nLatest Blogs",
        "link": "https://www.news18.com/india/some-surprised-about-indias-trade-deals-with-developed-world-pm-modi-at-rising-bharat-summit-ws-l-9934214.html",
        "date": "Fri, 27 Feb 2026 20:57:15 +0530",
        "fetched_at": "2026-03-02 03:55:59.639323"
    },
    {
        "title": "'Everyone Would Want Good Relations With India': Ex-Singapore FM At Rising Bharat Summit 2026",
        "content": "Former Singapore Foreign Minister George Yeo spoke about India’s role in current geopolitics at the News18 Rising Bharat Summit, where he underscored that everyone wants to build ties with New Delhi due to its rising political clout and economic growth.\nSpeaking to Firstpost’s Managing Editor Palki Sharma, Yeo said relations between India and China were key to regional peace in Asia, adding that India was in a good position globally as it was not a threat to any of the major powers in the world.\n“India is in a good position. India is not a threat to any of the major powers. Everyone wants good relations with India, including China. India has the privilege to sit at every table and enjoy the best,\" he said, when asked about current global uncertainties.\nYeo also appeared confident that all of India’s neighbours, including China, would want good relations with New Delhi in 10-20 years as it would be a “very good source of their own well-being\" and advantageous for them in the long run.\nYeo On India-China Relations\nThe former Singaporean FM said all of China’s neighbours wanted good investment, but they did not want to get too close to Beijing as they didn’t want it to dominate their lives. “China makes use of its economic position for statecraft. In 10-15 years, India will be in the same position in the continent.\"\nAn advocate of peaceful relations between India and China, Yeo said their relationship is key to regional peace, adding that while it is unlikely they will be too close, they do not have to be enemies.\nHe outlined key issues in India-China ties: politics and border security. However, he emphasised that China now understands that India is acting on its own behalf and its alliance with America is not aimed at countering Beijing.\nSelf-Sustaining Development In India\nYeo also asserted that India was on the trajectory for self-sustaining development, which he said was beneficial for Asia, Singapore and the world.\n“India went through a critical test in the last few months, when America piled on pressure. But India did not buckle. Its standing in the world has gone up. t made some tough decisions – to have an FTA with Europe, to undertake further internal reforms, and to move towards a situation where Indian talent is retained within India,\" he remarked.\nIndia’s IT Development & AI\nAlthough Yeo said India has become a major IT power in the world, he cautioned that artificial intelligence was a huge challenge for every nation. “The US and China are moving very fast. I think it’s good that India gave AI its full attention,\" he stated.\n“You (India) had a successful convention here a few weeks ago. You have identified the problems and opportunities, but moving with this technology requires the mobilisation of all people. It’s not just what a few computer scientists could do.\"\nHe also highlighted the use of technology for good and evil. “We have to be very mindful of the harm AI could do,\" he added. “Some societies can respond to new technologies better than others. They can exploit it, they can manage the problems.\"\nLatest Blogs",
        "link": "https://www.news18.com/india/everyone-would-want-good-relations-with-india-ex-singapore-fm-at-rising-bharat-summit-2026-ws-l-9934206.html",
        "date": "Fri, 27 Feb 2026 20:13:50 +0530",
        "fetched_at": "2026-03-02 03:56:00.372811"
    },
    {
        "title": "'Longest Ever Kill In Military History': IAF Showcases S-400’s Operational Might In New Video",
        "content": "The Indian Air Force (IAF) has released a video showcasing the operational capability of its S-400 long-range air defence missile system, claiming what it described as the “longest ever kill recorded in military history.\"\nThe footage shows a radar detecting a distant aerial target, followed by the launch of a missile that successfully intercepts and destroys it at extreme range.\nAn on-screen message reads, “Enemy may be out of sight but never out of reach,\" underscoring the system’s long-distance engagement capability. The IAF said the intercept represents the longest-range kill achieved so far.\n#WATCH | For the first time, the Indian Air Force shares a video showcasing the Sudarshan S-400 long-range air defence missile system in operation, along with a caption of scoring the longest ever kill recorded in military history.The Indian Air Force had secured the kill… pic.twitter.com/lDxQx2vynu\n— ANI (@ANI) February 26, 2026\nThe video also makes reference to Operation Sindoor, conducted in May 2025, during which the S-400 system reportedly played a critical role.\nAccording to IAF officials, the air defence platform was used to strike a target located nearly 300 km inside Pakistan during the operation.\nThe footage has been released ahead of Exercise Vayu Shakti-2026, a major air power demonstration scheduled to be held at Pokhran, where the IAF is expected to display its operational readiness and advanced combat capabilities.\nThe S-400 Triumf, developed by Russia’s Almaz-Antey and inducted into Indian service as the “Sudarshan Chakra,\" is one of the world’s most advanced long-range surface-to-air missile systems.\nOperated by the IAF, it is designed to detect, track and neutralise a wide range of aerial threats, including fighter jets, drones, cruise missiles and select ballistic missiles.\nIndia signed a $5.4-billion deal with Russia in 2018 to procure five S-400 regiments, with deliveries beginning in 2021.\nThe system employs multiple missile variants, including the long-range 40N6 missile with a reported reach of up to 400 km, supported by medium- and short-range interceptors for layered defence.\nEquipped with powerful surveillance radars capable of detecting targets at distances of up to 600 km under favourable conditions, the S-400 can track and engage multiple threats simultaneously.\nMounted on mobile platforms, each regiment comprises launchers, radar units, command posts and support vehicles, allowing rapid redeployment.\nIntegrated with other Indian air defence systems such as Akash and medium-range surface-to-air missiles, the S-400 forms a key pillar of India’s layered air defence grid.\nVayu Shakti-2026 is also set to feature a wide array of IAF assets, including Tejas, Rafale, Jaguar, Mirage-2000, Sukhoi-30MKI, MiG-29 and Hawk jets, along with transport aircraft and helicopters, highlighting the breadth of India’s air power capabilities.\nLatest Blogs",
        "link": "https://www.news18.com/india/iaf-releases-s-400-strike-video-says-longest-ever-kill-in-military-history-watch-9934196.html",
        "date": "Fri, 27 Feb 2026 22:51:56 +0530",
        "fetched_at": "2026-03-02 03:56:00.975790"
    },
    {
        "title": "'Judiciary Is Supreme': Anna Hazare Reacts As Court Grants Relief To Kejriwal In Excise Policy Case",
        "content": "Social activist Anna Hazare on Friday said the court’s decision to discharge former Delhi chief minister Arvind Kejriwal in the excise policy case must be respected, asserting that the strength of India’s judiciary is what keeps the country functioning smoothly.\nSpeaking to reporters at his native village Ralegan Siddhi, Hazare welcomed the verdict and said the “judiciary remains the supreme institution in the country.\"\n“Our nation runs because of the judicial system. In a country with many parties, castes, religions and ideologies, stability is maintained due to a strong judiciary,\" he said.\nHazare said that without an independent and effective judicial system, criminal elements would gain the upper hand, leading to chaos and unrest. He added that all citizens must accept court rulings in a democracy, irrespective of political differences.\nResponding to his past criticism of Kejriwal during the probe, Hazare said his remarks were made before any judicial finding. “At that time, allegations were being discussed. Now the court has clearly stated that he had no role in any wrongdoing. We must accept the verdict,\" he said.\nA Delhi court on Friday discharged Kejriwal, his former deputy Manish Sisodia, and 21 others in the politically sensitive liquor policy case, observing that there was no “overarching conspiracy or criminal intent\" behind the policy.\nThe court also pulled up the Central Bureau of Investigation for lapses in its probe.\nKejriwal, who was arrested in March 2024 by the Enforcement Directorate and later by the CBI, spent 155 days in jail before being released on bail.\nHazare also described Kejriwal and Sisodia as his former “karyakartas\" (volunteers), recalling their association during the 2011 India Against Corruption movement that demanded a strong Jan Lokpal law.\nThe movement later led to the formation of the Aam Aadmi Party, though Hazare distanced himself when it took a political turn.\nWhen asked what advice he would give Kejriwal following the court relief, Hazare said, “Work for society and the nation. Do not think about yourself or your party.\"\nLatest Blogs",
        "link": "https://www.news18.com/india/judiciary-is-supreme-anna-hazare-reacts-as-court-grants-relief-to-kejriwal-in-excise-policy-case-9934122.html",
        "date": "Fri, 27 Feb 2026 19:10:38 +0530",
        "fetched_at": "2026-03-02 03:56:01.580992"
    },
    {
        "title": "Rising Bharat Summit | From Back-Offices To Nerve Centres: How GCCs Are Anchoring India’s Global Ambitions",
        "content": "The narrative of India as a mere “back-office\" for global corporations has been firmly dismantled at the News18 Rising Bharat Summit 2026. During a high-impact session titled “GCCs Ahoy! All roads lead to India\", industry leaders gathered at Bharat Mandapam in New Delhi on February 27 to map out the meteoric rise of Global Capability Centres (GCCs). The discussion underscored a fundamental shift: India is no longer just providing labour; it is now the strategic “nerve centre\" where high-end R&D, autonomous vehicle technology, and AI-first products are conceived and owned.\nKaran Virwani, Chairperson, MD, and CEO of WeWork India, provided a striking metric for this growth, noting that GCCs now drive 40% of the Indian commercial real estate market. However, the physical expansion is merely a shadow of the intellectual growth occurring within those walls. Virwani highlighted that as digital transformation and AI adoption accelerate, the actual research and development—traditionally kept at global headquarters—is now happening in India. From innovation hubs to front-office functions, the sophisticated nature of the work being migrated is transforming the local talent landscape into a global front-runner.\nKiran Cherukuri, EVP and Global GCC Practice Head at HCLTech, revealed that the mandate for these centres has evolved from execution-based tasks to full product ownership. This transformation is being supercharged by artificial intelligence, with 65% of GCCs having already experimented with or fully rolled out AI pilots. This “AI-first\" approach is allowing Indian centres to transition from being recipients of instructions to becoming the primary architects of global enterprise platforms.\nThe rapid scaling of the sector has brought the challenge of talent retention to the forefront. Aravind Maiya, Co-Founder and CEO of EmbarkGCC, emphasised that as competition intensifies, “leadership depth\" becomes the critical differentiator. To maintain a standalone business in India, firms must offer more than just a job; they must provide a distinct culture and a clear global career path. Maiya predicted a significant rise in global roles being operated directly from India for multinational firms, further solidifying the country’s influence in international boardrooms.\nRohan Lobo, Partner and GCC Industry Leader at Deloitte South Asia, shared an optimistic outlook for the coming years, stating that approximately 5,000 firms are currently looking to establish GCCs in India. The scope of work is also expanding into futuristic sectors, with companies increasingly setting up autonomous vehicle operations within the country. While metro cities remain the primary hubs, Virwani noted that the next phase of growth will likely see a push into Tier-II markets, as firms seek to tap into a wider talent pool and manage rising operational costs in traditional urban centres.\nLatest Blogs",
        "link": "https://www.news18.com/india/rising-bharat-summit-from-back-offices-to-nerve-centres-how-gccs-are-anchoring-indias-global-ambitions-9933858.html",
        "date": "Fri, 27 Feb 2026 17:27:10 +0530",
        "fetched_at": "2026-03-02 03:56:02.232358"
    },
    {
        "title": "When Piyush Goyal Met Howard Lutnick, Sergio Gor: Minister Reveals Inside Details At Rising Bharat",
        "content": "At the Rising Bharat summit on Friday, Piyush Goyal, Union Minister for Commerce and Industry, revealed what transpired in the surprise meet with US Secretary of Commerce Howard Lutnick and US ambassador to India Sergio Gor.\nAfter the meeting, in a post on X, Goyal had written: “Hosted US Secretary of Commerce @HowardLutnick & @USAmbIndia Sergio Gor. Engaged in very fruitful discussions to expand our trade and economic partnership.\"\nCNN-News18’s Rahul Shivshankar asked Goyal about the picture, which he said had sparked a conversation, Goyal, in a lighter vein, said, “You are reminding me of Mona Lisa’s painting when you say sparked a conversation…You don’t like my smile…What do you not like in the picture?\"\nWhen questioned further, he said, “I have an ODOP product which I gifted him. A cow and calf made in an Indian handicrafts shop.\"\nTrade winds are shifting, alliances recalibrating, and India is charting its own course.At #RisingBharatSummit2026, Union Commerce Minister Piyush Goyal speaks candidly on trade, tariffs, and the tactics shaping a new global order.\nWatch the full conversation for deeper… pic.twitter.com/1lqbQ2GkCJ\n— News18 (@CNNnews18) February 27, 2026\nWhen asked if he told Lutnick the importance of dairy as a red line for the US trade deal, Goyal said, “Dairy is exempt, I have said many times. Just because one Rahul does not understand, does not mean all Rahuls won’t understand. Some people are beyond understanding. I am not a person who will say like Shah Rukh Khan, “naam toh suna hi hoga\".\"\nIndia and the United States announced reaching a framework for an Interim Trade Agreement on February 2. The announcement followed a telephonic conversation between Prime Minister Narendra Modi and U.S. President Donald Trump. A formal joint statement detailing the framework was subsequently released by both governments on February 6–7. The U.S. agreed to slash reciprocal tariffs on Indian goods from 50% to 18%. This included removing a 25% penalty tariff previously imposed due to India’s purchase of Russian oil. The Indian government clarified that it has protected sensitive sectors like dairy and several key agricultural products from duty concessions.\nOn February 20, 2026, the U.S. Supreme Court issued a landmark 6–3 ruling in Learning Resources, Inc. v. Trump, striking down the president’s sweeping “reciprocal tariffs\" as unlawful. The Court ruled that the International Emergency Economic Powers Act (IEEPA) does not grant the president the power to unilaterally impose tariffs. Chief Justice John Roberts wrote that the power to “regulate\" importation does not equate to the power to “tax,\" which remains an exclusive authority of Congress.\nThe picture with the key US officials on February 26 sparked a conversation around the deal.\nHosted US Secretary of Commerce @HowardLutnick & @USAmbIndia Sergio Gor.Engaged in very fruitful discussions to expand our trade and economic partnership. 🇮🇳🇺🇸 pic.twitter.com/UjfExNj6wi\n— Piyush Goyal (@PiyushGoyal) February 26, 2026\nElaborating on the deal, Goyal said, “If you remember the lower court had ruled in May or June that IEEPA is not the mechanism which would sustain, but they were in appeal and it was a process that was simultaneously going. For us, the US is a very important trading partner. It is an important strategic relationship that encompasses our Quads, which covers our technological partnership. We are members of Pax Silica, which is our effort to create resilient supply chains. It is a very multifaceted relationship. There are so many opportunities. After all, we had a very successful AI summit at the same venue. If we are looking $200-billion investment in data centres and other AI associated ventures, if we are looking for opportunities for our men and women, we will need investments, technology, we will need GPUs, we will need equipment from the ICT world…these are partnerships… We have a lot of strategic interest in the pharmaceutical world…There are huge opportunities in our gems and jewellery and diamonds sectors…Our textiles will flourish.\"\n“… The US is an evolving situation. We are in dialogue with the administration in the US. We will have to wait and watch and ensure interests of India are protected. I want to assure that India stays committed to engaging for the best possible opportunities which were negotiated with the US for a deal that gives us competitive advantage,\" said Goyal.\n“Should the circumstances change, the deal will be rebalanced…The deal has many elements. There are so many positives. Trade deal or international trade is about comparative and competitive advantage. Trade deal is not about what the tariff is. It is about the advantage you get over competition. At 50% tariff, we were at huge disadvantage and the fact that we were able to bring it down to much lower than the rest of competition, was huge for India’s agriculture, handicrafts, diamonds, pharmaceuticals…India is on the move and our exports this year will be higher,\" he said.\nLatest Blogs",
        "link": "https://www.news18.com/india/piyush-goyals-meet-with-howard-lutnick-sergio-gor-when-cow-calf-rahul-entered-us-trade-deal-story-ws-l-9933708.html",
        "date": "Fri, 27 Feb 2026 17:11:50 +0530",
        "fetched_at": "2026-03-02 03:56:02.880795"
    },
    {
        "title": "‘Wife Admitted Affair’: Hubby Fights Rs 15K ‘Very High’  Maintenance With Loans, Child Costs",
        "content": "A recent court proceeding has caught people’s attention, capturing a man explaining to the honourable judge why he would not be able to pay a certain monthly maintenance to his former wife. He mentioned that he has his kids to look after and gets a limited salary. Once again, this incident has sparked debate on divorce, alimony, and gender-neutral laws in the country.\nIn the clip posted on X (formerly Twitter), the man told the court that he has been facing financial strain while raising his two children alone. He stated that both are minors and are currently in his custody. “There are two children, my Lord, and both are in my custody,\" he said. During the proceedings, he informed the judge that he had married in 2015 but that his wife left him in 2021.\nThe Man Alleged That His Wife Cheated On Him\nAfter she left him, he filed a police complaint. Following this, his former wife allegedly admitted to having an affair with someone else and stated she would no longer continue to live with him. “She only left my company, and then I registered a police complaint on which she has stated that okay, she has an affair with someone else,\" he said.\nThe Man Said He Only Gets Rs 60,000 Monthly\nAs he was about to continue his statement, the judge interrupted and asked whether his ex-wife had demanded Rs 5,000 for rent and Rs 10,000 for living expenses. He nodded yes. This led the judge to ask, “How is it very high?\" The man then talked about his financial constraints, saying that he earns a monthly salary of Rs 60,000 and that Rs 20,000 is deducted each month to repay a housing loan he took in 2020. This leaves him with Rs 40,000 to cover all other expenses, which also include his children’s expenses.\nThe post was shared on the platform with the caption, “Wife is earning. Involved in ADULTERY. Still, the husband must pay maintenance?? Is maintenance now a reward for betrayal?\"\nWife is earning. Involved in ADULTERY.Still the husband must pay maintenance??Is maintenance now a reward for betrayal?For legal help and guidance, visit:👇https://t.co/zUuvYY9xay#Adultery #MensRights #MaintenanceReform #JusticeForMen #GenderNeutralLaws pic.twitter.com/JVT4JX1bG9\n— ShoneeKapoor (@ShoneeKapoor) February 27, 2026\nInternet Calls The Incident “Legal Terrorism\"\nSome people also reacted to the post, saying, “Woww My Lords !!! Nowhere in the world is a woman rewarded for cheating on husband. NVR ever marry a working woman… Better life with a housewife.\"\nAnother quipped, “Allowing maintenance for immoral, unethical act lead to promote more immorality in society and results in more false cases and crimes. Observation should portray ethical norms; otherwise entire society will get drowned. Wake up.\"\n“Adultery is rewarded in this nation,\" a different person mentioned.\n“This is legal terrorism,\" said an individual.\nIt is worth noting that the exact location where the case unfolded was not mentioned in the post.\nLatest Blogs",
        "link": "https://www.news18.com/viral/wife-admitted-affair-hubby-fights-rs-15k-very-high-maintenance-with-loans-child-costs-aa-ws-l-9933785.html",
        "date": "Fri, 27 Feb 2026 16:56:01 +0530",
        "fetched_at": "2026-03-02 03:56:03.555456"
    },
    {
        "title": "'What Matters To Me Is...': 8-Year-Old Ranvir Sachdeva Shares $30 Trillion Economy Dream",
        "content": "News18 Rising Bharat Summit 2026: Ranvir Sachdeva, the eight-year-old child prodigy who stole the spotlight at the India AI Impact Summit 2026, said that he hopes for the future anchored in “sovereign innovation, ethical AI, and inclusive impact.\"\nWhile speaking at the News18 Rising Bharat Summit 2026, he said, “I’m someone who’s about to witness eight decades of an independent India sometime soon. But you know what matters to me more? Will India be a 30 trillion dollar economy when I will be 30?\"\nPositioning his speech between “Rising Bharat in 2026\" and “Viksit Bharat in 2047,\" Sachdeva structured his narrative around two thoughts, opening with a couplet from Prime Minister Narendra Modi, “Kuch aisa nahi jo kar na sako, Kuch aisa nahi jo paa na sako.\"\nReferring to the India AI Mission’s roadmap, he underlined the importance of building a responsible AI ecosystem that is “accountable, sovereign, ethical, accessible and legitimate,\" bringing together technology giants, startups, scientists and students alike.\nWhile quoting Steve Jobs’s “You can never connect the dots looking forward; you can only connect them looking backwards,\" Sachdeva said that he has distilled two guiding principles from this – commitment over focus, and perseverance over fixed goals.\nHe also shared highlights of his journey, from presenting a three-minute IoT sensor project for public safety at age four, to authoring a book on artificial intelligence at six, and delivering a keynote at the AI for Good Global Summit at seven.\nDrawing an analogy from cricket practice, he said he “bleeds blue\" for the sport and believes in “playing on the front foot — whether in technology or cricket.\" His message to the audience was simple: “experience the sunrise, explore potential, and go the distance.\"\nConcluding with gratitude to the audience, he expressed hope that the “dots\" being created today would connect meaningfully by 2047, laying the foundation for a human-centric AI-driven Bharat.\n“Bharat ka anmol samay hai. Yehi samay hai, sahi samay hai,\" he said, urging collective action toward a stronger, future-ready India.\nSachdeva, the eight-year-old technologist and global author, made headlines after he attended the AI Impact Summit as the youngest keynote speaker.\nWhile speaking to news agency ANI after the summit, he explained that his address focused on how different nations are approaching artificial intelligence and how India is carving its own path in AI development.\nHe spoke confidently about innovation, indigenous AI models and the importance of technological self-reliance. His participation at the high-profile summit drew praise on social media, with many lauding his confidence and grasp of complex subjects at such a young age.\nEarlier, he was invited to the United Nations’ AI for Good Global Summit in Geneva, Switzerland, in 2025. There, he had confidently addressed over 10,000 attendees from more than 180 countries, 53 UN partner organisations, and global AI leaders. He spoke for 20 minutes on “Agents of Change: A 7-Year-Old’s Lens on Generation AI for Good\".\nLatest Blogs",
        "link": "https://www.news18.com/india/what-matters-to-me-is-8-year-old-ranvir-sachdeva-shares-30-trillion-economy-dream-ws-l-9932818.html",
        "date": "Fri, 27 Feb 2026 13:46:39 +0530",
        "fetched_at": "2026-03-02 03:56:04.319512"
    },
    {
        "title": "'Trust Factor In Deploying AI Is Crucial': Ashwini Vaishnaw At Rising Bharat Summit 2026",
        "content": "“Trust factor in deploying AI is important,\" Union Minister Ashwini Vaishnaw said while addressing concerns over artificial intelligence and its impact on jobs at the News18 Rising Bharat Summit 2026. Emphasising India’s strengths in the technology sector, Vaishnaw argued that AI adoption would expand opportunities rather than diminish them — provided trust, talent and innovation move in tandem.\nAddressing fears of job losses, the minister said India’s IT industry has historically adapted to technological disruption. “The biggest strength of our IT sector is to be able to go to an enterprise, understand how it works and, based on that, provide a solution. It was demonstrated during the Y2K problem,\" he noted, recalling how Indian IT firms earned global credibility during the millennium bug crisis.\nHe underlined that trust will be central to AI integration in sensitive sectors such as banking and finance. “A bank would not want to hand over its coding to a software it doesn’t trust. That is where the role of IT companies will grow,\" he said. According to Vaishnaw, Indian technology firms are uniquely positioned to act as trusted partners in deploying AI systems securely and responsibly.\nAt the same time, he acknowledged the inevitability of disruption. “We need to scale up innovation in the AI sector. At the same time, we must be prepared for disruption due to the AI boost,\" he said, calling for proactive planning to manage workforce transitions. He stressed the importance of building a strong talent pipeline, adding that state governments must ensure colleges are reoriented to equip students with AI-focused skills and solution-driven training.\nSpeaking about the India AI Impact Summit, Vaishnaw described it as a global success. “The summit was well received and recognised globally. The format was more on the lines of World Economic Focus (WEF) Davos. It was designed in a way that the younger generation, who I call Gen Bharat, gets an opportunity to create their future in the way they want,\" he said, highlighting the focus on youth participation and solution-driven dialogue.\nOn funding, the minister was clear that India must increase investments. “We will have to scale up our investment on AI models,\" he said, signalling a push towards indigenous AI capabilities.\nHe also touched upon the evolving digital content ecosystem. “Content creators must get their fair share for creating content. Media houses should be rewarded accordingly for high-quality content,\" Vaishnaw said, underscoring the need for fair compensation in the AI-driven information economy.\nLatest Blogs",
        "link": "https://www.news18.com/india/trust-factor-in-deploying-ai-is-crucial-ashwini-vaishnaw-at-rising-bharat-summit-2026-ws-l-9933071.html",
        "date": "Fri, 27 Feb 2026 13:34:36 +0530",
        "fetched_at": "2026-03-02 03:56:05.050150"
    },
    {
        "title": "Piyush Goyal At Rising Bharat Summit: Does Rahul Gandhi Even Know What Maize Is?",
        "content": "Piyush Goyal, Union Minister for Commerce and Industry, during a conversation with CNN-News18’s Rahul Shivshankar at Rising Bharat, slammed Opposition leader Rahul Gandhi’s comments on the trade deal with the US.\nOn meeting with United States Secretary of Commerce Howard Lutnick, he said, “We will need more technology for development…There was a cow and calf…\"\nWhen asked if he explained the significance of dairy, Goyal said, “Just because one Rahul doesn’t understand, doesn’t mean other Rahul won’t…I won’t say like Shah Rukh Khan, Rahul, naam toh suna hoga…Dairy, MSMEs, rice, wheat, maize have been protected…Does he even understand maize? I have announced that there are no exemptions on soyabean, poultry… GM foods won’t come to India…Rahul ji misleads people on the basis of false pretext. I feel sad that he is misleading our innocent farmers. May be, he is compromised. The Gandhi family has been compromised for years…I have recently spoken about it. Rahul Gandhi is playing in the hands of international powers…He is misleading India…The deal protects India and its youth…It looks to make India Viksit. Rahul Gandhi ji has not understood it or may be it is beyond his understanding.\"\n#RisingBharatSummit2026 | @PiyushGoyal slams LoP Rahul Gandhi for dragging innocent farmers into his dirty political strategies: ‘Gandhi Family has always played with the feelings of our framers’#RisingBharatSummit2026 #BreakingNews #PiyushGoyal #RahulGandhi | @RShivshankar pic.twitter.com/h8HuVYi5Jp— News18 (@CNNnews18) February 27, 2026\nQuestioning the Youth Congress protest at the AI Summit, Goyal said, “It was a shameful act at a time when 20 foreign leaders were here…To belittle our development, opportunities was the worst anti-national act which needs to be condemned in the strongest words…Their anti-India stand has been exposed…They can’t digest India’s progress and try to run it down. It must have been planned at the very high level of Congress… There has only been one family at the top for 100 years. I will not be surprised if the protest had the blessing of the leadership…\"\nReiterating his statement on the US trade deal, Goyal said, “For us, the US is an important trading partner, strategic and technological partnership…for Quads, Pax Silica… The US is an evolving situation. We are in dialogue with the administration in the US. We will have to wait and watch and ensure interests of India are protected. I want to assure that India stays committed to engaging for the best possible opportunities which were negotiated with the US for a deal that gives us competitive advantage.\"\nPositioned at a pivotal moment in India’s growth journey, the News18 Rising Bharat Summit 2026 brings together top national leadership and international delegates at Bharat Mandapam on February 27–28.\nAnchored in the theme, “Strength Within,\" the summit stands as one of the country’s largest platforms where governance, economic ambition, and strategic thinking converge, reflecting India’s expanding influence in global conversations.\nAgainst this backdrop, Hon’ble Prime Minister Narendra Modi will deliver the keynote address, giving direction to the summit’s central theme. His address will outline India’s long-term developmental roadmap, economic momentum, and strategic priorities in a rapidly shifting global order, while setting the tone for deliberations over the two-day gathering.\nOver the years, the Rising Bharat platform has evolved into a credible venue for substantive policy dialogue, and the 2026 edition signals sharper engagement around the ideas shaping India’s next phase of progress. The theme salutes the collective strength within every citizen-the power that drives innovation, sustains democracy, India as a leading light on the world stage.\nLatest Blogs",
        "link": "https://www.news18.com/india/piyush-goyal-at-rising-bharat-summit-does-rahul-gandhi-even-understand-maize-ws-l-9932951.html",
        "date": "Fri, 27 Feb 2026 13:28:03 +0530",
        "fetched_at": "2026-03-02 03:56:05.651963"
    },
    {
        "title": "Delhi Liquor Policy Case LIVE Updates: CBI Moves HC Against Kejriwal's Discharge; Rekha Gupta Says 'Evidence Tampered'",
        "content": "Delhi Excise Policy Case News Live: Delhi’s Rouse Avenue Court on Friday discharged former Chief Minister Arvind Kejriwal, former Deputy Chief Minister Manish Sisodia and all other accused in the Central Bureau of Investigation (CBI) case linked to the alleged Delhi Excise Policy scam.\nKejriwal hailed the decision as “historic”, accusing Prime Minister Narendra Modi and Union Home Minister Amit Shah of hatching a “conspiracy” to defame him and the Aam Aadmi Party (AAP). He said the court’s order confirmed that there was not an iota of evidence against him.\nMeanwhile, the CBI has approached the High Court, challenging the Rouse Avenue Court’s order discharging former Delhi Chief Minister Arvind Kejriwal, former Deputy Chief Minister Manish Sisodia and all other accused in the alleged Excise Policy Scam case.\nThe court had earlier observed that the agency failed to present material sufficient to proceed against them. The order was passed by Special Judge Jitender Singh, who refused to frame charges in the corruption case, discharging all 23 accused persons.\n‘IMPLICATED WITHOUT MATERIAL’\nThe court noted that no prima facie case was made out against the accused and observed significant shortcomings in the prosecution’s case.\nWhile pronouncing the judgment, Arvind Kejriwal had been implicated without any cogent material linking him to the alleged offence.\nThe court held that it did not find any criminal conspiracy in the case and that the CBI’s allegations “lacked substance”.\nFollow for live updates\nDelhi Chief Minister Rekha Gupta, reacting to legal relief to Arvind Kejriwal, said everyone knew the evidence in the liquor policy case had been tampered with. “This is the lower court’s decision…We all know how evidence (in liquor policy case) was tampered with,” she told reporters.\n“If you (Arvind Kejriwal) were right, then why did you withdraw the liquor policy as soon as the investigation started?…The courts had also expressed their worry on this case and traces of money laundering was found. Even today you are doing ‘nautanki’ (drama),” she added.\nShiv Sena (UBT) leader Aaditya Thackeray commended Arvind Kejriwal and Manish Sisodia after they were discharged in the Delhi excise policy case and accused the Centre of defaming opposition leaders before elections. “We are very proud of Arvind Kejriwal and the case he has fought along with Manish Sisodia… The hope is that the BJP will apologise to Arvind Kejriwal, and the independence of the institution now remains,” he said.\nArvind Kejriwal slammed the Congress for its reaction to his discharge in the excise policy case, “Kejriwal went to jail. Did Robert Vadra go to jail? Sanjay Singh went to jail. Did Rahul Gandhi go to jail? Manish Sisodia went to jail. Did Sonia Gandhi ji went to jail? What is Congress saying? Does it have no shame?”\nThe Central Bureau of Investigation (CBI) has moved the Delhi High Court, challenging the Rouse Avenue Court’s order discharging former Delhi Chief Minister Arvind Kejriwal and others in the liquor excise policy case, CBI sources told CNN-News18.\nReacting to Arvind Kejriwal’s discharge, BJP MP Manoj Tiwari said, “This is a decision of a lower court. The CBI is going to the higher court. All the evidence against the corrupt is solid, and we are confident that the criminals involved in the scams will lose.”\nBJP national spokesperson RP Singh said there are other corruption cases against AAP leader Arvind Kejriwal, which will go for trial. “As per the CAC report, there was scam in building roads, schools and hospitals, all these cases will be under trial,” he said.\nArvind Kejriwal challenged the BJP and PM Modi, saying if elections are held again in Delhi and the BJP wins over 10 seats, he will leave politics. “The people of Delhi are tired of your failures,” he said.\nArvind Kejriwal also said his mother was very sick and had to be admitted to a hospital while he was imprisoned in the excise policy case. He also said Manish Sisodia’s wife suffered from multiple sclerosis.\nIn a strong message to PM Modi, Kejriwal said, “You filed so many cases against us, you sent ED and CBI after us, you even sent us to jail, even then you could do nothing to Kejriwal. Now PM Modi has only one option, to kill Kejriwal. You have tried everything, now you would have to kill me.”\nArvind Kejriwal in his press conference also said he was repeatedly questioned why he disappeared from the public view after his bail, saying he preferred to keep quiet till his name was cleared of all charges.\n“I am an honest man, it affects me when someone calls me dishonest. It affects me when I am sent to jail and my family faces taunts. I had decided that I will keep quiet until I am proven innocent in front of the nation.”\nArvind Kejriwal said he had always led an honest life and never earned a single penny through dubious means, while accusing the BJP of defaming him. He said the court’s decision proved that he was “kattar imaandar”.\nAAP leader Arvind Kejriwal demanded an apology from Prime Minister Narendra Modi and Union Home Minister Amit Shah, alleging that they hatched the “most disgusting conspiracy in independent India” to finish the Aam Aadmi Party.\nIn response to the acquittal of AAP leader Arvind Kejriwal, BJP MP Manan Kumar Mishra said, ”In crying and doing drama, Arvind Kejriwal is very good at it. What is the answer to this?”\nAAP leader Arvind Kejriwal said the Delhi court, in its 600-page order, said there is not the slightest evidence to even have a case on the liquor excise policy issue. He said the verdict of the court was “historic”, which exposed a conspiracy against him and the Aam Aadmi Party.\nArvind Kejriwal held a press conference on Friday, where he thanked the lawyers for his discharge in the Delhi excise policy case. He also attacked the BJP and central agencies, accusing them of ‘conspiring’ to finish the Aam Aadmi Party (AAP) through a false case.\nRJD leader Tejashwi Yadav claimed that central agencies were filing cases against opposition leaders and accused the BJP of defaming people. “The court has also said that a case should be filed against the CBI’s IO (investigating officer) as well. Agencies keep filing cases against opposition parties in the wrong manner. The BJP uses this to defame people. We too have faith in the judiciary that in the coming times, we will also get justice,” he told reporters.\nCongress spokesperson Shama Mohamed questioned how the evidence against Arvind Kejriwal in the Delhi liquor policy case had disappeared. “Let’s understand certain things. No one has said that one is innocent. They’re saying there is no evidence… There was evidence before; suddenly, the evidence has disappeared,” she said.\nAam Aadmi Party (AAP) leader Atishi on Friday said that Arvind Kejriwal’s honesty is before entire nation.\n“Arvind Kejriwal’s ‘kattar imaandaari’ is before the entire nation today… On one side, it is the BJP’s conspiracy, hunger for power and misuse of central agencies; on the other side is Arvind Kejriwal’s and AAP’s honesty,” she said.\n#WATCH | Delhi | On Arvind Kejriwal’s acquittal in excise policy case, AAP leader Atishi says, “Arvind Kejriwal’s ‘kattar imaandaari’ is before the entire nation today…On one side, it is the BJP’s conspiracy, hunger for power and misuse of central agencies; on the other side is… pic.twitter.com/HPEPLd6DGk\n— ANI (@ANI) February 27, 2026\nReacting to the acquittal of Arvind Kejriwal, Manish Sisodia, and other accused in the liquor policy case, the wife of AAP leader Sanjay Singh called it a big day, adding that “everyone is very happy.”\n“This is a big day for AAP and our family. We have received more than what we expected. Everyone is very happy. Our senior leaders have been acquitted and there is immense joy in the AAP. I thank the judiciary,” she said.\n#WATCH | Delhi: On the acquittal of Arvind Kejriwal, Manish Sisodia and other accused in Liquor Policy case, wife of AAP leader Sanjay Singh says, “This is a big day for AAP and our family. We have received more than what we expected. Everyone is very happy. Our senior leaders… pic.twitter.com/gGdrd54FAu\n— ANI (@ANI) February 27, 2026\nFollowing the Delhi court, discharging Arvind Kejriwal and Manish Sisodia in the alleged excise policy scam, AAP leader Sanjay Singh alleged conspiracy into the case, asserting the court has put a stamp on Kejriwal’s honesty.\n#WATCH | Ayodhya, UP | On Arvind Kejriwal’s acquittal in excise policy case, AAP MP Sanjay Singh says,” As per a conspiracy, you (BJP) defamed the AAP govt, Arvind Kejriwal, Manish Sisodia…Today’s judgment makes it clear that the CBI never had any evidence against Arvind… pic.twitter.com/wfj47BqAhd\n— ANI (@ANI) February 27, 2026\nAAP leader Satyendar Jain reacted to the Delhi court’s order, clearing Arvind Kejriwal and Manish Sisodia of charges in the alleged liquor scam case, saying the “truth has come out today”.\n#WATCH | Chandigarh | On Arvind Kejriwal’s acquittal in excise policy case, AAP leader Satyendra Jain says, “The truth has come out today. We will now show them…It has become clear to everyone that Arvind Kejriwal is honest.” pic.twitter.com/xnlT9zRkcj\n— ANI (@ANI) February 27, 2026\nCelebrations at AAP’S Punjab office after Delhi court order, acquitting Arvind Kejriwal and Manish Sisodia in the alleged excise policy scam.\n#WATCH | Chandigarh: Celebrations at AAP Punjab office after the acquittal of the party’s national convener Arvind Kejriwal and party leader Manish Sisodia in Delhi Liquor Policy case. pic.twitter.com/JN7WGqrfAz\n— ANI (@ANI) February 27, 2026\nAfter AAP leaders Arvind Kejriwal and Manish Sisodia were cleared of charges in the alleged excise policy scam, Congress leader Pawan Khera targeted the BJP, saying the decision was “not surprising”.\n#WATCH | Delhi | On Arvind Kejriwal’s acquittal in excise policy case, Congress leader Pawan Khera says, “Not surprising at all; most predictable…This is what the BJP does before every election. If it suits them to weaken the congress, they will strengthen Congress’ rivals.… pic.twitter.com/PEWDPdXx06\n— ANI (@ANI) February 27, 2026\nHours after being cleared of charges in the alleged excise policy case, AAP leader and former Deputy Chief Minister embraced party leader Atishi, expressing joy over the decision.\n#WATCH | AAP leader Manish Sisodia shares a hug with Delhi LoP Atishi and shares laddoos with party leaders as he reaches his residence after acquittal in Delhi Liquor Policy case. pic.twitter.com/8kzxfYH2RN\n— ANI (@ANI) February 27, 2026\nAfter a Delhi court discharged former Chief Minister Arvind Kejriwal in the alleged excise policy scam, the Aam Aadmi Party (AAP) hailed the decision, calling its supremo a “revolution”.\nआम आदमी पार्टी और अरविंद केजरीवाल जी एक इंक़लाब हैं और BJP की तानाशाही के हर ज़ुल्म का जवाब हैं????#KattarImaandarKejriwal pic.twitter.com/8RF4mYxLMC\n— AAP (@AamAadmiParty) February 27, 2026\nFormer Delhi Chief Minister and AAP chief broke down after being discharged in the alleged excise policy scam case.\n“I always used to say that the truth is with us. A sitting Chief Minister was dragged out of his home and thrown into jail. Mud was flung at us,” Kejriwal said while speaking to reporters.\nFormer Delhi Chief Minister Arvind Kejriwal will hold a press conference at 4 P.M., after he and former Deputy CM Manish Sisodia were cleared of all charges in the alleged excise policy scam case.\nAfter a Delhi court cleared former Chief Minister Arvind Kejriwal and Deputy CM Manish Sisodia of charges related to the alleged excise policy scam, the latter took to ‘X’, and wrote, “Satyamev Jayate. Today, once again, I feel proud of Baba Saheb Ambedkar Ji’s visionary thinking and the Constitution he crafted. Despite all the attempts by Modi Ji’s entire party and all their agencies to prove us dishonest, today it has been proven that Arvind Kejriwal – Manish Sisodia are staunchly honest.”\nसत्यमेव जयते।\nआज एक बार फिर बाबा साहेब अम्बेडकर जी की दूरदर्शी सोच और उनके बनाए संविधान पर फ़ख़्र महसूस हो रहा है।\nमोदी जी की पूरी पार्टी और सारी एजेंसियों की हमें बेईमान साबित करने की तमाम कोशिशों के बावजूद आज साबित हो गया कि अरविंद केजरीवाल – मनीष सिसोदिया कट्टर ईमानदार…\n— Manish Sisodia (@msisodia) February 27, 2026\nAam Aadmi Party (AAP) leader Sanjay Singh targeted the BJP and demanded its apology after a Delhi court cleared Arvind Kejriwal, Manish Sisodia and other accused of all charges in the liquor policy case.\nकोर्ट ने हमारे नेताओं को बरी कर दिया।ये साबित हो गया की देश की सत्ता पर एक खतरनाक षड्यंत्रकारी राज कर रहा है।जिसने साजिश रच कर देश के सबसे लोकप्रिय ईमानदार मुख्यमंत्री @ArvindKejriwal सबसे योग्य ईमानदार शिक्षा मंत्री @msisodia सबसे बेहतरीन ईमानदार पार्टी @AamAadmiParty को बदनाम…\n— Sanjay Singh AAP (@SanjayAzadSln) February 27, 2026\nDelhi former Chief Minister Arvind Kejriwal reacted to the court order, discharging him and other accused in the alleged excise policy scam case.\nआख़िर में अधर्म और अन्याय हारता है और सच ही जीतता है।\nसत्यमेव जयते pic.twitter.com/GZghEdhJf3\n— Arvind Kejriwal (@ArvindKejriwal) February 27, 2026\nFormer Delhi Chief Minister Arvind Kejriwal was greeted with a warm welcome as he arrived at his residence following the court’s order, clearing him of the charges linked to the alleged liquor policy scam case.\n#WATCH | Family of former Delhi CM Arvind Kejriwal welcomes him as he, along with former Deputy CM Manish Sisodia, arrives at his residence.\nThe Rouse Avenue court discharged both AAP leaders in the Delhi Excise policy case.\n(Video Source: AAP) pic.twitter.com/nblU348jvz\n— ANI (@ANI) February 27, 2026\nAam Aadmi Party (AAP) leader Atishi hailed Delhi court’s order, clearing former Chief Minister Arvind Kejriwal, former Deputy Chief Minister Manish Sisodia and all other accused in the Central Bureau of Investigation (CBI) case linked to the alleged Delhi Excise Policy scam.\nसत्यमेव जयते!\nचाहे कितने भी झूठे आरोप लगाये, चाहे कितना अत्याचार किया, लेकिन आख़िरकर सच की जीत हुई।\nआज पूरे देश के सामने है – भाजपा का षड्यंत्र और अरविंद केजरीवाल की कट्टर ईमानदारी\n— Atishi (@AtishiAAP) February 27, 2026\nAfter Delhi’s Rouse Avenue Court cleared former Chief Minister Arvind Kejriwal, former Deputy CM Manish Sisodia, and other accused of all charges in the corruption case related to the alleged liquor policy scam, the AAP chief’s wife, Sunita Kejriwal expressed joy over the decision.\n“We faced a lot of problems.. God was with us. Grateful to those who stood with us during difficult times”, she said.\nFormer Delhi Chief Minister Arvind Kejriwal broke down before media after the Rouse Avenue Court order discharging him, former Deputy Chief Minister Manish Sisodia and all other accused in the Central Bureau of Investigation (CBI) case linked to the alleged Delhi Excise Policy scam.\n“I am not corrupt. The court has said that Kejriwal and Manish Sisodia are honest”, Kejriwal said, ANI reported.\nThe Central Bureau of Investigation (CBI) will approach the High Court, challenging the Rouse Avenue Court’s order discharging former Delhi Chief Minister Arvind Kejriwal, former Deputy Chief Minister Manish Sisodia and all other accused in the alleged Excise Policy Scam case.\nLatest Blogs",
        "link": "https://www.news18.com/india/delhi-liquor-policy-case-live-cbi-to-approach-hc-against-order-discharging-kejriwal-sisodia-in-excise-policy-scam-liveblog-ws-l-9932767.html",
        "date": "Fri, 27 Feb 2026 18:33:34 +0530",
        "fetched_at": "2026-03-02 03:56:06.938070"
    },
    {
        "title": "CBI Moves Delhi High Court Against Relief To Kejriwal, Sisodia In Excise Policy Case",
        "content": "The Central Bureau of Investigation (CBI) has approached the Delhi High Court, challenging the Rouse Avenue Court order clearing former Delhi Chief Minister Arvind Kejriwal and former Deputy Chief Minister Manish Sisodia in the Delhi Excise Policy case, according to CBI sources.\nThe move comes soon after the special court granted relief to the two senior Aam Aadmi Party leaders, holding that the allegations against them did not stand up to judicial scrutiny.\nWhile pronouncing the order, the court observed that the alleged central conspiratorial role attributed to them by the investigating agency could not be substantiated.\nThe court noted that the accusations placed before it “failed judicial scrutiny.\"\nIn its observations, the court found no criminal intent on the part of Manish Sisodia and stated that the prosecution’s conspiracy theory “cannot survive against one constitutional authority.\"\nThe court concluded that the material presented was insufficient to proceed against the two leaders at this stage.\nCBI’S CASE AND ALLEGATIONS\nThe CBI had registered the case in connection with alleged irregularities in the now-scrapped Delhi excise policy.\nThe agency filed its first chargesheet in 2022 and later submitted multiple supplementary chargesheets as part of the investigation.\nAccording to the agency, a “south lobby\" allegedly paid Rs 100 crore to influence the excise policy in its favour.\nIn total, 23 accused were charge-sheeted in the matter, including Arvind Kejriwal, Manish Sisodia, K Kavitha, Kuldeep Singh, Narender Singh, Vijay Nair, Abhishek Boinpally, Arun Ramchandra Pillai, Mootha Goutam, Sameer Mahendru, Amandeep Singh Dhall, Arjun Pandey, Butchibabu Gornatla, Rakesh Joshi, Damodar Prasad Sharma, Prince Kumar, Chanpreet Singh Rayat, Arvind Kumar Singh, Durgesh Pathak, Amit Arora, Vinod Chauhan, Ashish Mathur and P Sarath Chadra Reddy.\nDuring arguments before the trial court, the CBI maintained that the alleged offence of criminal conspiracy must be examined in its entirety and argued that the sufficiency of evidence should be assessed during trial rather than at the discharge stage.\nRepresented by Additional Solicitor General DP Singh and advocate Manu Mishra, the agency contended that adequate material existed to frame charges against all accused persons.\nDEFENCE ARGUMENTS BEFORE COURT\nSenior advocate N Hariharan, appearing for Kejriwal, argued that there was no incriminating material linking his client to the alleged conspiracy.\nThe defence submitted that the fourth supplementary chargesheet naming Kejriwal merely reiterated earlier allegations and that he was performing his official duties as Chief Minister.\nHariharan further pointed out that Kejriwal was not named in the original chargesheet or in the first three supplementary chargesheets and was included only in the fourth.\nThe defence also questioned the basis of further investigation and the evidentiary value of certain statements, including that of approver Raghav Magunta.\nLatest Blogs",
        "link": "https://www.news18.com/india/cbi-to-challenge-court-order-clearing-arvind-kejriwal-manish-sisodia-delhi-excise-policy-liquor-policy-case-9932765.html",
        "date": "Fri, 27 Feb 2026 17:42:48 +0530",
        "fetched_at": "2026-03-02 03:56:07.568965"
    },
    {
        "title": "'Unmitigated Disaster': Jyotiraditya Scindia Takes Swipe At Congress For AI Summit Protest",
        "content": "Union Minister Jyotiraditya Scindia on Thursday strongly criticised the Indian Youth Congress (IYC) for staging a shirtless protest during the AI Impact Summit in New Delhi, terming the disruption “an unmitigated disaster\" at a global platform meant to showcase India’s technological leadership. Speaking at the News18 Rising Bharat Summit 2026, Scindia said the summit represented India’s national interest and was not a party event.\nMembers of the Indian Youth Congress gathered outside the high-security venue and staged a dramatic shirtless protest, raising slogans and attempting to march toward the site where global leaders and delegates had assembled. With over two dozen heads of state and international representatives in attendance, security was heightened. Delhi Police detained and later arrested several protesters for breaching barricades and attempting to disrupt the proceedings.\nReacting to the incident, Scindia said, “It was an unmitigated disaster. The AI Impact Summit was not a BJP programme. It was Bharat’s programme. You had 26 heads of state visiting India because everyone realises India is the next growth potential in the world.\" He argued that protests of this nature at an international forum damaged the country’s image at a time when India is emerging as a major technology and innovation hub.\nIn a sharp political swipe, he added, “If you want to exhibit the vacuousness of desh bhakti, then good luck to you. India has rejected you multiple times. It is the people in that arena there that took these people down,\" asserting that electoral mandates had already delivered their verdict.\nOn Congress leader Rahul Gandhi, Scindia was brief, saying, “I have nothing to say to Rahul Gandhi.\" However, responding to Gandhi’s criticism of the India-US trade deal, he said, “If you are so anti your own country in your own mind, then I don’t think this country has any place for you.\"\nScindia positioned the controversy as a clash between India’s global ambitions and what he described as disruptive political theatrics.\nThe News18 Rising Bharat Summit 2026 is a two-day national platform hosted in New Delhi that brings together political leaders, policymakers, industry captains, innovators, thinkers and cultural voices to spotlight India’s expanding role on the global stage and chart the country’s future trajectory across technology, policy, trade, culture and social development.\nLatest Blogs",
        "link": "https://www.news18.com/india/unmitigated-disaster-jyotiraditya-scindia-takes-swipe-at-congress-for-ai-summit-protest-ws-l-9932677.html",
        "date": "Fri, 27 Feb 2026 11:11:59 +0530",
        "fetched_at": "2026-03-02 03:56:08.320754"
    },
    {
        "title": "'Truth Has Won': Arvind Kejriwal Breaks Down After Delhi Court Clears Him In Liquor Policy Case",
        "content": "Arvind Kejriwal turned emotional and broke down before cameras on Friday after a Delhi court discharged him and former Deputy Chief Minister Manish Sisodia in the Central Bureau of Investigation (CBI) case linked to the now-scrapped Delhi Excise Policy, calling the verdict a victory of truth and justice.\nSpeaking to reporters after the order, an emotional Kejriwal said the verdict reaffirmed his long-held claim of innocence.\n“I am not corrupt. The court has said that Kejriwal and Manish Sisodia are honest,\" the former Chief Minister said.\n“BJP was making allegations against us, but the court acquitted everyone, truth has prevailed,\" Kejriwal said, breaking down during the interaction.\n“We always said that the truth emerges victorious. We have full faith in the Indian legal system. (Union Home Minister) Amit Shah and (Prime Minister) Modi ji together hatched the biggest political conspiracy to finish the Aam Aadmi Party, and five big leaders of the party were put in jail.\"\n“The sitting Chief Minister was dragged out of his house and put in jail. Kejriwal is not corrupt. I have only earned honesty in my life,\" he added.\nhttps://images.news18.com/ibnlive/uploads/2026/02/tweeload_din1v3jh-2026-02-68eab43061680bb06648899428108cab.mp4\nFormer Deputy Chief Minister Manish Sisodia also reacted to the verdict, saying the outcome strengthened faith in constitutional institutions.\n“We are proud of our Constitution,\" Sisodia said, crediting the judicial process for ensuring justice after a prolonged legal battle.\nMeanwhile, Arvind Kejriwal’s wife, Sunita Kejriwal, took to X and wrote, “In this world, no matter how powerful one becomes, one cannot rise above Shiva Shakti. Truth always prevails.\"\nSeparately, speaking to reporters, she said, “We faced a lot of problems, but God was with us. We are grateful to those who stood with us during such difficult times.\"\nThe order was passed by Special Judge Jitender Singh of the Rouse Avenue Court, who discharged all 23 accused in the matter and declined to frame charges in the corruption case.\nThe court held that the prosecution had failed to establish a prima facie case and flagged serious deficiencies in the investigation.\nThe court also rapped the CBI for implicating the accused without sufficient material and noted that the voluminous chargesheet contained several lacunae unsupported by witness statements or evidence.\nCOURT FLAGS INVESTIGATIVE LACUNAE\nThe court’s order underscored the importance of a fair investigation for ensuring a fair trial.\nThe judge criticised the investigative process, pointing to gaps in evidence and inconsistencies in the prosecution’s case.\nWith the refusal to frame charges, all accused persons in the matter stand discharged.\nDuring hearings, the CBI had argued that the alleged conspiracy should be viewed in its entirety and that the sufficiency of evidence ought to be tested during trial.\nThe defence, however, maintained that there was no incriminating material linking Kejriwal to the alleged wrongdoing and questioned why his name appeared only in a later supplementary chargesheet.\nTHE DELHI EXCISE POLICY CASE\nThe case stems from allegations surrounding the formulation and implementation of Delhi’s excise policy, which was probed by the CBI.\nThe agency had alleged that a “south lobby\" paid around Rs 100 crore to influence the policy in its favour.\nThe court had reserved its order on February 12 after hearing detailed arguments from both the prosecution and the accused, including Kejriwal and Sisodia, before pronouncing its decision on February 27.\nLatest Blogs",
        "link": "https://www.news18.com/india/arvind-kejriwal-breaks-down-on-camera-delhi-liquor-policy-excise-policy-case-delhi-court-discharges-kejriwal-sisodia-9932678.html",
        "date": "Fri, 27 Feb 2026 12:06:57 +0530",
        "fetched_at": "2026-03-02 03:56:08.969860"
    },
    {
        "title": "Arvind Kejriwal, Manish Sisodia Cleared By Delhi Court In Liquor Policy Case",
        "content": "Delhi’s Rouse Avenue Court on Friday discharged former Chief Minister Arvind Kejriwal, former Deputy Chief Minister Manish Sisodia and all other accused in the Central Bureau of Investigation (CBI) case linked to the alleged Delhi Excise Policy scam, observing that the agency failed to present material sufficient to proceed against them.\nThe order was passed by Special Judge Jitender Singh, who refused to frame charges in the corruption case and discharged all 23 accused persons.\nCOURT FINDS NO EVIDENCE AGAINST ACCUSED\nThe court held that no prima facie case was made out against the accused and noted significant shortcomings in the prosecution’s case.\nThe judge observed that Arvind Kejriwal had been implicated without any cogent material connecting him to the alleged offence.\nThe court emphasised that a fair investigation is fundamental to ensuring a fair trial and found that the evidence placed on record did not substantiate the allegations levelled by the CBI.\nThe judge also said the voluminous chargesheet filed by the agency contained several lacunae and was not supported by witness statements or corroborative material.\nAs reported by Live Law, the judge held that the CBI failed to make out even a prima facie case against Sisodia, leading to his discharge from the matter along with the other accused.\nThe order came after the Rouse Avenue Court had reserved its decision on February 12, following detailed arguments from both the CBI and the accused.\nThe case relates to alleged irregularities in the now-scrapped Delhi Excise Policy.\nThe CBI had alleged that a “south lobby\" paid around Rs 100 crore to influence the policy in its favour.\nThe agency filed its first chargesheet in 2022 and later submitted multiple supplementary chargesheets naming 23 accused, including Kejriwal and Sisodia.\nDuring arguments, the CBI maintained that the offence of criminal conspiracy should be viewed in its entirety and argued that the adequacy of evidence should be tested during trial proceedings.\nThe defence, however, contended that there was no incriminating material linking the accused to the alleged conspiracy.\nLatest Blogs",
        "link": "https://www.news18.com/india/delhi-liquor-policy-case-arvind-kejriwal-manish-sisodia-discharged-of-accusations-excise-policy-corruption-case-9932533.html",
        "date": "Fri, 27 Feb 2026 11:54:30 +0530",
        "fetched_at": "2026-03-02 03:56:09.626977"
    },
    {
        "title": "Rising Bharat Summit 2026 Highlights: PM Modi Slams TMC, Says Ayushman Bharat Scheme Not Implemented In Bengal",
        "content": "News18 Rising Bharat Summit 2026 Day 1 Highlights: Prime Minister Narendra Modi addressed the News18 Rising Bharat Summit 2026, which brought together top national leadership and international delegates at Bharat Mandapam on February 27, Friday, reflecting the confidence and capabilities driving India’s rise.\nDuring the speech, PM Modi hailed the nation’s internal strength and said that the country has realised its potential in the last 11 years.\nBuilt around the theme — “Strength Within” — the two-day summit brings together leaders, policymakers, and industry voices to shape a future powered by India’s own resolve and ambition. This is where national purpose meets global ambition, transforming resilience into a roadmap for excellence on the world stage.\nAmong the other dignitaries were: Union Ministers Piyush Goyal, Ashwini Vaishnaw,  and Jyotiraditya Scindia, among others.\nAddressing the gathering, Prime Minister Narendra Modi said, “Ayushman Bharat scheme has not been implemented in Bengal till today.”\nHe added, “If the intention had been sincere, this scheme providing free treatment up to ₹5 lakh for the poor would not have been stopped in Bengal.”\nReferring to housing initiatives, he said, “Under the PM Awas Yojana, permanent houses are being built for the poor across the country.”\nCiting Tamil Nadu, PM Modi said, “In Tamil Nadu, 9.5 lakh permanent houses have been allotted to poor families, but construction of 3 lakh houses has stalled because the DMK government is not taking interest in building homes for the poor.”\nHe concluded, “Because the intention is not sincere.”\nAddressing the role of the opposition in a democracy, Prime Minister Narendra Modi said, “In democracy, the role of the opposition is not just about blind opposition but about presenting an alternative vision. That is why the enlightened public of the country is teaching a lesson to Congress.”\nAddressing the gathering, Prime Minister Narendra Modi said, “A nation’s progress is determined not by today’s comforts, but by preparation for tomorrow. The hard work done with foresight is the foundation of a self-reliant, strong, and prosperous India by 2047. And no matter how much the Congress may protest, we will continue working relentlessly.”\nContinuing his criticism, PM Modi said, “There is anger in the country over this act of Congress. That is why, to justify their wrongdoing, they brought Mahatma Gandhi forward. The Congress party does the same thing whenever it wants to hide its mistakes — it brings Bapu to the forefront — and when it wants to claim credit, it gives all the recognition to one family.”\nHe also said, “In the name of ideology, Congress has now been reduced to merely a ‘toolkit’ of opposition. This mindset of blind opposition has grown so much that it does not miss any opportunity to belittle the country on any stage or platform.”\nPrime Minister Narendra Modi launched a sharp attack on Congress over its protest during the AI Summit, calling it an attempt to undermine a moment of national pride. He said, “The AI Summit was a moment of pride for the entire country, but the country’s oldest party tried to turn the national celebration into a spectacle. In front of foreign guests, Congress not only exposed itself but also revealed its ideological bankruptcy.”\nHe further added, “When frustration and disappointment from failure fill the mind and arrogance takes over, such thinking that defames the country comes to the surface.”\nAddressing the Rising Bharat Summit 2026, Prime Minister Narendra Modi criticised Congress over its shirtless protest during the AI Summit. He said, “incidents like this occur due to a mindset of arrogance, which is portrayed by Congress,” linking the episode to what he described as a larger pattern of behaviour.\nSpeaking at the Rising Bharat event, Prime Minister Narendra Modi said, “there was a time when india was just a consumer of a technology, but today india is manufacturing it.” He further added, “There was a time when India was importer of new technologies, now we are exporter of new technology.”\nHighlighting India’s infrastructure growth, PM Modi said, “world is amazed with our digital infrastructure.” He also noted, “India has world third largest metro network,” pointing to rapid urban and connectivity expansion.\nPrime Minister Narendra Modi said, “When the hidden strength within a nation awakens, it achieves new accomplishments.” He underlined the importance of national confidence and collective resolve in driving progress.\nAddressing the Rising Bharat event, Prime Minister Narendra Modi said, “India is now so capable that developed countries of the world are themselves coming forward to make trade deals with India.” He emphasised growing global confidence in India’s economic strength and expanding international partnerships.\nHighlighting India’s growing global economic engagement, PM Modi said, “countries are coming forward to do trade deal with india,” underscoring rising international interest in partnering with India.\nPrime Minister Narendra Modi asserted that “We have made india world’s growth engine.” He also said, “we have controled the inflation which was in double digit,” pointing to efforts aimed at stabilising the economy.\nSpeaking at the Rising Bharat event, Prime Minister Narendra Modi said, “In the last 11 years, energy has flowed into the consciousness of the country.” He added that “we have made our banking system strong,” highlighting structural reforms undertaken during this period.\nSpeaking about India’s growing global standing, Prime Minister Narendra Modi said, “some people are not able to believe how india managed to do trade deals with developed countries.” He explained, “why are developed countries so eager to do trade deal with india…answer is aatma vishwasi bharat,” attributing the interest to a confident and self-assured India.\nPrime Minister Narendra Modi said, “Even after independence, India could not come out of the mentality of slavery. We are suffering the consequences of this till date.” He further added, “unfortunately after independence india could not come out of colonial mindset, because of which we are suffering even today,” highlighting the long-term effects of that mindset.\nAddressing the Rising Bharat event, Prime Minister Narendra Modi said, “we want to recognise our capabilities and strength.” He noted that in the past, “we use to copy foreign countries technology,” stressing the need for greater self-reliance and confidence in India’s own potential.\n“We want to recognise our capabilities and strength,” PM Modi said. “We use to copy foreign countries technology,” he added.\nPM Modi said that the Summit focuses on the “internal strength of the nation,” adding that India has realised its strength in the last 11 years.\nPrime Minister Narendra Modi will address the Rising Bharat Summit 2026 shortly.\nAt a time when India’s global identity is being shaped not just by economic policy but by cinema, sport and culture, conversations around storytelling have also evolved. At the News18 Rising Bharat Summit 2026, themed Strength Within, actor Yami Gautam addressed whether her choice of politically charged films ever cost her professional opportunities.\nIf Congress wants to save itself, it must look for a better face, Bollywood actor and Mandi MP Kangana Ranaut said at the Rising Bharat Summit on Friday, calling out Leader of Opposition Rahul Gandhi’s behaviour in political life.\nResponding to the question — “Kabhi aapke saath aisa nahi hua ki certain film makers said main aapko cast karta but you did that film toh uske baad I don’t want to cast you?” — Yami offered a candid reflection.\n“Our relation go long back in time. We follow development in India very closely. India is now on the trajectory of self sustaining development,” said Singapore politician George Yeo on India-Singapore relations.\nSpeaking at the News18 Summit, “BJP MP Kangana Ranaut on Friday said,”We learn from Rahul Gandhi what not to do and how not to become. Somewhere Rahul Gandhi has lost his mind. Behaving like this, taking off clothes in that manner.”\n“After Independence, Mahatma Gandhi had said that Congress should be dissolved, but Nehru ji did not listen to him. I feel that now Rahul Gandhi is fulfilling that dream — he is showing how to completely destroy Congress. His behaviour in Parliament is like that of a tapori (street ruffian),” she said.\nVeteran actor Anil Kapoor reflects on his remarkable 45-year journey in the film industry, sharing insights into his enduring appeal, disciplined fitness routine, and the mindset that keeps him energized and relevant even today.\n#RisingBharat2026 | ‘It’s been a journey of discovering and learning’\nAnil Kapoor (@AnilKapoor) shares his timeless appeal, fitness secrets, and what keeps him energized after 45 years in the industry. #AnilKapoor #News18 | @KishoreAjwani pic.twitter.com/smqhmOPr9Y\n— News18 (@CNNnews18) February 27, 2026\nResponding to a question, Yami Gautam said, “I am fortunate, in the last 5–6 years the kind of work I have received connected me with the audience in a way, I really value that sentiment. Somewhere, that inspires me to do better work. We are not in competition with each other. We need to stand together as an Indian film industry and present ourselves to the world that we are ready. Keeping that in mind, I do as much work as I can, nothing beyond that.”\nActor and politician Khushbu Sundar praised the film Dhurandhar, calling it one of the finest cinematic experiences in recent times.\n“For me, Dhurandhar was one of the best films ever made in recent times. It was a long one, 3 and a half hours, so I was told the movie is too long. But then I have my two young girls; they said, “Mummy, go and watch this in theater.” And I didn’t realise how 3.5 hours passed.\nSpeaking about people calling films an agenda, Swanand Kirkire said, “I don’t understand why you are watching a movie assuming there is an agenda. A film is a medium of entertainment — why aren’t you looking for an agenda in other things?\nIf that is the case, then when a poor girl falls in love with a rich boy, is that also an agenda? If an inter-caste marriage is shown on screen, is that too an agenda?\n“Govt has said 30-35 per cent of the vehicles will be electrified by 2030. India’s driven solar manufacturing in India to the size and scale that is unbelievable. It is now driving in a very big way critical mineral processing and the battery manufacturing PLI in India,” said Former NITI Ayog CEO Amitabh Kant.\nAmitabh Kant, former CEO, NITI Ayog believed urbanisation must become the key driver of India’s growth story.\n“There are 46 per cent people in agriculture, which is too high, it will drag down the productivity. You need to take away people from agriculture into manufacture and from manufacturing to exports. Manufacturing led urbanization is the key,” he said .\n“Today we have 315 universities across India where students are using the world’s most advanced EDA tool. And compare globally, outside India there are not even 20 universities where students will get end to end capability of designing a chip, manufacturing it, and using it in a module,” said Ashwini Vaishnaw.\nUnion Minister Ashwini Vaishnaw on Friday spoke about AI diffusion in India and said, “If you look at all the economies, we have probably highest AI diffusion rate both in the consumer sector and in the enterprise sector. It is actually giving us big strength. The IT sector is working rapidly towards providing AI services, and in consumer sector lots and lots of creators are coming up. So ofcourse it is happening.”\nSpeaking at the News18 Rising Bharat Summit, BJP’s Shudhanshu Tiwari said, “Today, India is leading the AI summit and has become the world’s number 1 country in digital transactions, and if we look at it, in iPhone manufacturing, it stands at number 2 after China.”\nAt the News18 Rising Bharat Summit 2026, Winselow Tucker, President & GM, Eli Lilly India, will address the urgent need to reframe obesity from stigma to science. The session will explore evolving medical understanding, breakthrough therapies, and the importance of building awareness-led, patient-centric healthcare solutions in India.\nObesity is not a choice, it’s a challenge demanding a serious rethink.\nAt News18 Rising Bharat Summit 2026, Winselow Tucker, President & GM, Eli Lilly India, will address the urgent need to reframe obesity from stigma to science. The session will explore evolving medical… pic.twitter.com/JBPd3vbKnD\n— CNBC-AWAAZ (@CNBC_Awaaz) February 27, 2026\nSIM binding has become a crucial safeguard in India’s digital ecosystem to tackle rising financial fraud and national security threats, said Jyotiraditya Scindia, Communications Minister.\n“SIM binding has become a critical, mandatory security requirement in India to curb massive financial fraud and address severe national security concerns,” he said.\nThe minister underlined that the move is aimed at strengthening digital security frameworks as online transactions and mobile-based services continue to expand rapidly across the country.\n#RisingBharatSummit2026 | ‘SIM binding has become a critical, mandatory security requirement in India to curb massive financial fraud and address severe national security concerns, ‘ says Jyotiraditya Scindia, Communications Minister#CNBCTV18Digital #RisingBharatSummit2026… pic.twitter.com/iONWQj89lW\n— CNBC-TV18 (@CNBCTV18News) February 27, 2026\nReflecting on how family businesses have evolved into global forces, Prashant Ruja, Group Chief Executive of Essar Group, pointed to the current positive business environment and changing global dynamics.\n“The environment which we are in now is positive and our strength is what is in demand, for many years the commodity business whether it was metals mining or infrastructure, things we think we do well. We were little bit left behind. ]Everybody felt that energy transition, something that we easily adopted, that will take over and leave behind a lot of these other sectors. That’s completely changed and globally there is huge demand for energy whether it’s oil or gas, AND along with renewable power and other things. We found ourselves at a place where we can really contribute strength in building assets and bringing it up to the scale and making it operational.”\nHe stressed that the renewed global demand across oil, gas, renewable power and core infrastructure has created fresh opportunities for businesses with proven strengths in asset building and operational scale.\nUnion Minister Ashwini Vaishnaw said at the Rising Bharat Summit that two more semiconductor plants will soon be announced following the Micron Technology project in India.\nIndia’s economy is undergoing significant changes, driven by reforms and renewed global engagement, according to Rajiv Memani, Chairman and CEO of EY India.\nSpeaking about the country’s performance in the last few months amid rising global competitiveness and back-to-back trade deals, Memani identified three major shifts over the past 12 months.\n“If you look up to last 12 months and if you were to pick up 3 big changes, I’d say first one is this period which reforms are happening.”\nHe stressed that reforms are critical for scaling up and improving the ease of doing business across sectors.\n“And for scaling up, it is critical doing business. lots of sectors, if you reflect back three years, were not there. those sectors are there. And govt is putting a lot of pressure in all sectors whether it is on data centres, electronics, nuclear, medical devices. You can go on and on.”\nMemani also pointed to India’s increasing global engagement through trade agreements as another major development.\n“Second is the way India is now reengaging globally through FTA, bilateral agreements, I think that’s fantastic.”\n“Instead of just using AI, we should work on developing them”\nThe 8-year-old coder @ranvirsachdeva shares his vision for rising Bharat with @KuheenaSharma #RisingBharatSummit2026 #TechNews #Coding pic.twitter.com/pOVaZlY1gy\n— News18 (@CNNnews18) February 27, 2026\nLatest Blogs",
        "link": "https://www.news18.com/india/rising-bharat-summit-2026-live-updates-day-1-network18-flagship-event-pm-modi-keynote-speech-highlights-new-delhi-india-latest-news-liveblog-9932447.html",
        "date": "Fri, 27 Feb 2026 23:29:40 +0530",
        "fetched_at": "2026-03-02 03:56:10.593221"
    },
    {
        "title": "Congress's Bihar Election Funds May Have Been Used To Back AI Summit Protest, Probe Suggests",
        "content": "Congress’s election funds may have been used to finance a protest by members of the Indian Youth Congress (IYC) at the AI Summit at Bharat Mandapam, investigators are probing.\nThe funds were allegedly collected for the Bihar elections, officers privy to the investigation told News18.\nA Special Investigation Team (SIT) set up to probe the “organised\" protest has scanned multiple bank accounts linked to those arrested in the case.\nAccounts associated with the Indian Youth Congress have also been examined.\n“Some amount was received in bank accounts linked to Shri Krishna Hari, the national secretary of the IYC. Questioning has indicated that the money may have been unused funds from the Bihar elections. We are examining bank accounts and the possible money trail further to establish this,\" one of the investigators said, requesting anonymity.\nPolice have found that nearly Rs 35,000 was allegedly used to arrange logistics such as printing T-shirts and placards for the protest.\nInvestigators said umbrellas were also printed but could not be used for unspecified reasons.\nSo far, at least 11 persons associated with the Indian Youth Congress have been arrested. Three of them were brought to Delhi in the early hours of Friday from Himachal Pradesh on transit remand.\nAmong those arrested, IYC president Uday Bhanu Chib and National Secretary Shri Krishna Hari are suspected to be the masterminds behind the protest.\nOfficers familiar with the probe said Hari’s bank account is linked to the IYC’s account and has received funds on multiple occasions.\n“We are examining how and when the money was spent and for what purposes,\" another officer said, also requesting anonymity.\nThe February 20 protest was staged at Bharat Mandapam on the final day of the AI Summit, in the lobby area of Hall Number Five.\nFour persons, National Secretary Krishna Hari, who hails from Bihar; Bihar state secretary Kundan Yadav; Eastern Uttar Pradesh vice president Ajai Kumar; and Narsimha Yadav from Telangana, were initially arrested at the spot, while a search was launched for others involved.\nOn Tuesday, the investigation into the protest was handed over to the Delhi Police Crime Branch.\nThe same day, Special Commissioner of Police (Crime Branch) Devesh Srivastava addressed the media and said the protesters attempted to breach the security cordon in front of visitors at the AI Summit, during which some police personnel were injured.\nHe added that the involvement of several individuals had been confirmed at the preliminary stage of the probe.\n“CCTV footage was examined, and some individuals who had provided assistance were identified. Office bearers of the Indian Youth Congress are also involved in the case,\" the officer said.\nFollowing the February 20 incident, Delhi Police registered a case under various sections of the Bharatiya Nyaya Sanhita (BNS), including Sections 61(2) (criminal conspiracy), 121(1) (voluntarily causing hurt or grievous hurt to deter a public servant from duty), 132 (assault or criminal force to deter a public servant from discharge of duty), 195(1) (assaulting or obstructing a public servant while suppressing a riot), 221 (obstructing a public servant in discharge of public functions), 223(A) (disobedience to an order duly promulgated by a public servant), 190 (unlawful assembly), 196 (promoting enmity between groups), 197 (acts prejudicial to national integration), and 3(5) (common intention).\nLatest Blogs",
        "link": "https://www.news18.com/india/ai-summit-protest-bharat-mandapam-congress-funded-indian-youth-congress-protest-investigations-delhi-police-arrest-ws-l-9932419.html",
        "date": "Fri, 27 Feb 2026 08:54:22 +0530",
        "fetched_at": "2026-03-02 03:56:11.196274"
    },
    {
        "title": "Fewer Trackside Signals, Kavach: How Indian Railways Is Clearing The Tracks For 160 Kmph Travel",
        "content": "The “superfast\" mission looks a step closer for Indian Railways, which has undertaken a modernisation initiative to facilitate high-speed travel up to 160 kmph.\nThis will be reflected in how the railways manages its traffic: a move towards fewer trackside signals and a significant increase in the distance between them, as well as thorough Kavach implementation.\nAccording to a report published by the Times of India, to ensure the safety of these faster journeys, the Railway Board has approved a proposal to double the distance between signals from the current 1 km to 2 km.\nThe report said this adjustment is a vital safety enhancement, as when the trains reach speeds of 160 kmph, the physics of braking dramatically change. This will require a longer stretch of track to decelerate and make a safe stop.\nIt said by spacing signals 2 km apart, the railways will provide locomotive pilots with a longer braking window and earlier warnings. Experts said this will significantly reduce the need for the abrupt, sudden braking that can compromise both safety and passenger comfort.\nThe Times of India reported that before this is implemented across the vast national network, it will undergo rigorous testing. A pilot project managed by Southern Railway has been given the “green light\" to prepare a detailed proposal for the Railway Board.\nIt said if this pilot proves successful in maintaining safety while facilitating higher speeds, the system is expected to be rolled out nationwide with other zones like the North Central Railway already identified for future expansion. This initiative has been solidified following high-level consultations between the additional member (traction) and zonal principal chief electrical engineers, culminating in a pivotal meeting on January 27, where the 2-km spacing was officially suggested.\nThe shift away from traditional trackside (or “wayside\") signals represents a major technological leap.\nHistorically, the railways has relied on physical signals — essentially sophisticated “traffic lights\" on poles — that a locomotive pilot must visually spot. This system, however, will prove to be a hurdle as the network aims for higher speeds.\nAt speeds exceeding 130 kmph, the “sighting distance\" — the time between a driver seeing a signal and reaching it — becomes dangerously short. This problem is worsened by external factors such as heavy rain, sharp curves, or the thick fog common in North India, which often forces drivers to slow down because they cannot see the signal clearly.\nTo overcome these constraints, the railways is transitioning to “cab signalling\". Under this system, the signal aspect (red, yellow, or green) is directly displayed on a screen inside the locomotive cockpit.\nThis allows the train to maintain its top speed regardless of external visibility or weather conditions, effectively moving the “intelligence\" of the railway from the ground into the train.\nThe primary driver of speed upgrade is the implementation of Kavach, India’s indigenous automatic train protection (ATP) system, alongside ETCS Level 2 (European Train Control System).\nKavach acts as an electronic “shield\", creating a digital communication bubble around every train to prevent collisions. The system operates through a sophisticated “digital handshake\" between several components.\nThis allows the railways to move from “fixed blocks\" — where only one train can occupy a set section of track — to optimised or “moving\" blocks. By knowing the exact position and braking distance of every train via radio communication, the gap between trains can be safely reduced, allowing more trains to run at higher speeds without waiting for a physical “all clear\" from a distant pole.\nKavach also introduces continuous speed supervision. Unlike physical signals, which are “static\" and only tell a driver to “stop\" or “go\", it provides a continuous speed curve.\nThe system calculates the train’s weight, the track’s gradient, and the distance to the next restriction to determine the exact moment braking is required. If a conflict is detected, Kavach initiates a three-stage safety protocol.\nAdditionally, it includes a network-wide SOS feature. If an accident occurs, a pilot can press an SOS button, sending a radio signal that automatically slows or stops every other train within a several-kilometre radius, preventing secondary collisions on adjacent tracks.\nBeyond speed and safety, reducing trackside signals offers significant cost and maintenance benefits.\nPhysical signal posts are expensive to install and prone to failure, theft, or damage. Each signal requires extensive wiring, power, and individual maintenance.\nBy contrast, it is far more cost-effective to maintain a network of radio towers for Kavach and ETCS than thousands of individual signal lamps and hundreds of kilometres of copper signalling cables. This reduction in a “signal failure\" is expected to significantly improve the punctuality of the network.\nAs of February, the rollout of Kavach 4.0 has significantly accelerated. The project is focused on two critical high-speed corridors under ‘Mission Raftar’.\nAccording to the ministry of railways, the vendor base has expanded to over five companies in 2026, shifting the pace from experimental to mass production. With over 1,300 route kilometres already commissioned and more than 4,150 locomotives fitted with Kavach, the full activation of this system remains the final “permission slip\" needed to officially raise the speed limit to 160 kmph across these vital corridors.\nLatest Blogs",
        "link": "https://www.news18.com/explainers/indian-railways-160-kmph-speed-fewer-trackside-signals-kavach-travel-ws-l-9932354.html",
        "date": "Fri, 27 Feb 2026 08:00:53 +0530",
        "fetched_at": "2026-03-02 03:56:11.811678"
    },
    {
        "title": "News18 Rising Bharat Summit 2026 Showcases India’s Sporting And Cultural Surge",
        "content": "India’s emergence is no longer limited to economic graphs and policy. Today, it is seen on the podiums, red carpets, and virtual stages of the world. From unprecedented sporting achievements to globally acclaimed cinematic and musical accomplishments, Bharat is asserting its strength with confidence and clarity.\nCapturing this defining moment, the News18 Rising Bharat Summit 2026, themed Strength Within, will bring together some of the most influential voices from sports and entertainment on 27-28 February at Bharat Mandapam, New Delhi.\nIndian sport is in one of its most dynamic phases. From the Women’s Cricket Team lifting the World Cup and the U-19 men reclaiming global dominance, to boxers securing nine gold medals at BOXAM, shooters commanding ISSF podium finishes, wrestlers sustaining Asian supremacy, and chess champions conquering international tournaments, the surge is both sustained and significant.\nThis is reflected in the fact that badminton icons Saina Nehwal, bronze medallist and previous World No. 1, and PV Sindhu, two-time Olympic medallist, will join Mohammed Shami, Mithali Raj, and Yuzvendra Chahal to talk about the importance of resilience, discipline, and the winning mindset required to not only compete globally but also win.\nParallel to its sporting ascent, Indian entertainment is commanding unprecedented international recognition. Homebound received a standing ovation at Cannes and reached the top 15 at the Oscars. All We Imagine As Light secured the Cannes Grand Prix. Boong won at the BAFTAs. Musical collaborations such as Dhurandhar – Part 1 are expanding India’s creative footprint beyond borders.\nAs India’s creative voice grows louder, the summit will feature cinema and storytelling voices, including Kangana Ranaut, Anil Kapoor, and Yami Gautam. Joining them are author Advaita Kala and critic Baradwaj Rangan, who will examine how narrative, identity, and influence are shaping India’s cultural discourse.\nGiving it a modern touch, hip-hop and rap artists Reble (Daiaphi Lamare), who rose to fame through the popular track “Run Down the City – Monica\" in Dhurandhar – Part 1, Yung DSA (Yash Deshmukh), and South Korean singer Aoora will bring to the fore the changing music scenario that is connecting with the youth of India.\nBalancing performance with perspective, kirtan singer Radhika Das and balance artist Gautam Vaishnav will bring to the table conversations on mindfulness and self-discipline, while DJ Lil Aarohi, Nikhil Chinapa, and DJ Skipster will focus on the role of music in shaping identity and culture.\nFrom sports to cinema to music, it is clear that the underlying factor is excellence achieved through inner conviction. As India moves from aspiration to achievement, the News18 Rising Bharat Summit 2026 will bring together performance and purpose, with talent and national pride.\n27-28 February 2026 | Bharat Mandapam, New Delhi\nRegister now: https://www.news18features.com/risingbharatsummit/\nLatest Blogs",
        "link": "https://www.news18.com/india/news18-rising-bharat-summit-2026-showcases-indias-sporting-and-cultural-surge-9932321.html",
        "date": "Thu, 26 Feb 2026 23:47:47 +0530",
        "fetched_at": "2026-03-02 03:56:12.549576"
    },
    {
        "title": "Assam Cabinet Moves Gauhati HC, Seeks Fast-Track Court In Zubeen Garg Case",
        "content": "The Assam Cabinet has decided to formally approach the Gauhati High Court seeking the constitution of a fast-track court to hear the high-profile death case of popular Assamese singer Zubeen Garg. The move follows mounting public pressure and demands from the singer’s family for a speedy trial.\nAnnouncing the decision after a Cabinet meeting on February 26, Chief Minister Himanta Biswa Sarma said the state government would request the Chief Justice of the Gauhati High Court to facilitate day-to-day hearings to ensure swift justice.\n“The Assam Cabinet has decided to recommend or formally request the Gauhati High Court to constitute a fast-track court for the trial in the death case of popular Assamese singer Zubeen Garg. This move aims to expedite proceedings and ensure timely, day-to-day hearings for swift justice,\" Sarma said.\nThe case has drawn widespread attention across Assam, with opposition parties, civil society organisations, and prominent individuals repeatedly demanding faster judicial progress. A regional political party had also announced plans to launch an agitation over delays in the case.\nHowever, some political voices have raised concerns over whether shifting the matter to a fast-track court could have implications for bail conditions or ongoing legal proceedings.\nIn a related development, the Gauhati High Court has ordered the reopening of a packaged drinking water unit linked to Siddharth Sarma, one of the prime accused in the case. Sarma, who served as Garg’s manager, faces allegations of mismanagement and alleged misappropriation of the singer’s funds.\nThe water plant Mahavir Aqua (also referred to as Mahabir Aqua) — located in an industrial area near Guwahati, had been sealed by the Special Investigation Team (SIT) during the probe. Investigators suspect that funds allegedly siphoned from Garg were invested in the business, citing it as part of the possible motive in the case.\nA Public Interest Litigation (PIL) seeking the reopening of the plant was filed by Sarma’s associate, Chetan Dhirasia. The matter was heard on February 25, 2026.\nIn its order, the court observed that public welfare-oriented business operations should not remain indefinitely shut due to ongoing criminal proceedings against an individual. The bench stressed the need to balance the interests of justice with broader community and economic considerations.\nMeanwhile, Siddharth Sarma, event manager Shyamkanu Mahanta, co-signer Amritprabha Mahanta, accompanist Sekhar Goswami, and other accused individuals remain in judicial custody.\nObservers noted that during recent court appearances, the accused appeared composed, with no visible display of remorse.\nThe case continues to generate significant public and political interest as calls grow louder for a time-bound trial and accountability.\nLatest Blogs",
        "link": "https://www.news18.com/india/assam-cabinet-moves-gauhati-hc-seeks-fast-track-court-in-zubeen-garg-case-ws-l-9932295.html",
        "date": "Thu, 26 Feb 2026 23:20:59 +0530",
        "fetched_at": "2026-03-02 03:56:13.331176"
    },
    {
        "title": "Rising Bharat Summit 2026: PM Modi, Union Ministers And Global Voices To Shape India’s Growth Agenda",
        "content": "Positioned at a pivotal moment in India’s growth journey, the News18 Rising Bharat Summit 2026 will bring together top national leadership and international delegates at Bharat Mandapam on February 27–28. Anchored in the theme, “Strength Within,\" the summit stands as one of the country’s largest platforms where governance, economic ambition, and strategic thinking converge, reflecting India’s expanding influence in global conversations.\nAgainst this backdrop, Hon’ble Prime Minister Shri Narendra Modi will deliver the keynote address, giving direction to the summit’s central theme. His address will outline India’s long-term developmental roadmap, economic momentum, and strategic priorities in a rapidly shifting global order, while setting the tone for deliberations over the two-day gathering. Over the years, the Rising Bharat platform has evolved into a credible venue for substantive policy dialogue, and the 2026 edition signals sharper engagement around the ideas shaping India’s next phase of progress.\nAmong the Union Cabinet ministers joining the dialogue is Piyush Goyal, Minister for Commerce and Industry, who is expected to steer conversations on trade expansion, manufacturing growth, and export competitiveness, alongside India’s deeper integration into global supply chains.\nTechnology and infrastructure discussions will be led by Ashwini Vaishnaw, Minister for Railways, Information & Broadcasting, and Electronics & IT, highlighting digital transformation and next-generation connectivity as pillars of growth. Jyotiraditya M. Scindia, Minister for Communications and Development of North Eastern Region, will focus on telecom expansion and inclusive regional development.\nAt the state level, Rekha Gupta, Chief Minister of Delhi, will bring a governance lens to discussions on urban development and administrative innovation. Strategic and defence dimensions will be addressed by Rajesh Kumar Singh, aligning with the summit’s emphasis on security preparedness and strategic autonomy.\nBeyond national leadership, the summit will host foreign delegates, diplomats, policy experts, and industry leaders, reinforcing its standing as a forum where domestic priorities align with global realities. With participation spanning government, industry, diplomacy, and defence, the News18 Rising Bharat Summit 2026 stands as a substantive platform for policy engagement and strategic clarity. To be part of the conversations shaping India’s next chapter, register now at https://www.news18features.com/risingbharatsummit/.\nLatest Blogs",
        "link": "https://www.news18.com/india/rising-bharat-summit-2026-pm-modi-union-ministers-and-global-voices-to-shape-indias-growth-agenda-9932259.html",
        "date": "Thu, 26 Feb 2026 23:07:02 +0530",
        "fetched_at": "2026-03-02 03:56:13.977531"
    },
    {
        "title": "Textbook Row: NCERT Identifying People Responsible For Inclusion Of Chapter On 'Judiciary Corruption'",
        "content": "The NCERT is ascertaining the process of making textbooks, which led to the error in judgement about inclusion of a chapter on “judicial corruption\" after Supreme Court observed that there appeared to be a “well-orchestrated conspiracy\" to defame the judiciary.\n“The NCERT is ascertaining the process of making textbooks which has led to this error of judgement and also identify the persons responsible for the same. This would also ensure that this kind of inappropriateness is completely avoided in future. This shall be done with utmost strictness,\" reported PTI citing sources.\nThis comes after a sharp remarks from the apex court, which termed it a “well-orchestrated conspiracy\" to defame the judiciary. The court imposed a “complete blanket ban\" on the Class 8 NCERT book and directed that all copies, both physical and digital, be seized.\nThe controversial chapter in Social Science textbook mentioned corruption, a large backlog of cases and an insufficient number of judges as challenged faced by judicial system.\nUnion Education Minister Dharmendra Pradhan on Thursday also expressed deep concern over the inclusion of the chapter. He assured that accountability would be fixed and action taken against those involved in drafting the content.\nAfter the court made it clear that it would not allow “anyone on earth\" to tarnish the integrity of the judiciary, NCERT removed the textbook from its official website.\nAccording to the sources, the government was extremely upset over the references included in the curriculum.\nEarlier on Wednesday, NCERT issued an apology for what it called “inappropriate content\". It also stated that the textbook would be rewritten in consultation with the appropriate authorities.\n“The error is purely unintentional and NCERT regrets the inclusion of inappropriate material in the said chapter. NCERT reiterates that the objective of the new textbooks is to strengthen constitutional literacy, institutional respect, and informed understanding of democratic participation amongst students,\" it said.\nLatest Blogs",
        "link": "https://www.news18.com/india/textbook-row-ncert-identifying-people-responsible-for-inclusion-of-chapter-on-judiciary-corruption-ws-l-9932199.html",
        "date": "Thu, 26 Feb 2026 22:46:12 +0530",
        "fetched_at": "2026-03-02 03:56:14.657590"
    },
    {
        "title": "PM Modi Sets Reform Agenda: Ministers Asked To Present ‘Report Card’ Of Third-Term Performance",
        "content": "Prime Minister Narendra Modi has outlined an ambitious reform roadmap for the coming years, asking all Cabinet ministers to come prepared with a detailed report card of reforms undertaken in their respective ministries during the government’s third term.\nSources say the Cabinet Secretariat has circulated a specific form, laying out the format in which each ministry must present its reform initiatives and achievements.\nThe ministries will need to highlight what exactly the reform is, when it was implemented, and what the results are after that.\nApart from the regular Cabinet agenda, a special segment has been set aside for ministries to share key achievements and positive developments. Ministers will individually brief the Cabinet on the reforms carried out under what is being described as a “Reforms Express\".\nAccording to sources, the Prime Minister has conveyed that regardless of whether a minister continues in the present Cabinet or not, every ministry must immediately focus on its reform priorities.\nIn the long term, this reform drive is envisioned as part of a broader roadmap leading up to 2047.\nAmong the most significant reforms carried out during Prime Minister Narendra Modi’s tenure has been the rollout of GST 2.0, implemented during the last festive season, which was projected as a major step toward rationalising the indirect tax regime.\nMore recently, Railways Minister Ashwini Vaishnaw announced that his ministry would undertake 52 reforms in 52 weeks—an ambitious, time-bound reform agenda aimed at accelerating modernisation and efficiency in the railway sector.\nIn the sports sector, one of the key milestones has been the passage of the Sports Development Bill, designed to place athletes at the centre of governance and institutional reform.\nThe Prime Minister has repeatedly emphasised that India is on board the “Reform Express,\" describing reforms as the driving force behind the journey toward a Viksit Bharat—a developed India by 2047.\nDuring the Cabinet discussions, each minister will present a detailed account of reform measures undertaken within their ministry.\nLatest Blogs",
        "link": "https://www.news18.com/india/pm-modi-sets-reform-agenda-ministers-asked-to-present-report-card-of-third-term-performance-9932196.html",
        "date": "Thu, 26 Feb 2026 22:27:28 +0530",
        "fetched_at": "2026-03-02 03:56:15.262238"
    },
    {
        "title": "Global Military Outreach: Indian Army Set For Large Multinational Exercise In May-June",
        "content": "In continuation with international engagements conducted in the past, the Indian Army is now preparing to conduct a large-scale multinational exercise. The groundwork has begun, and outreach to partner nations will start soon.\nOfficials familiar with the planning indicate that the exercise is likely to be held in May or June this year. The aim is to enhance interoperability and operational synergy in an evolving security environment. In the year 2025-26, the Indian Army has conducted 27 bilateral exercises with foreign partners. While such engagements are part of its annual training calendar, the upcoming multinational drill is expected to be significantly larger in scale and participation, possibly extending beyond traditional partners. Sources suggest that groupings such as ASEAN and BIMSTEC countries could see substantial participation, though invitations may not be limited to these blocs.\nThe exercise is likely to be held in the eastern parts of India. The broader objective is to position India as a key land warfare partner in the Indo-Pacific and the extended neighbourhood.\nLast year, India hosted the United Nations Troop Contributing Countries Chiefs’ Conclave in New Delhi, bringing together senior military leaders from 32 troop-contributing nations.\nThe conclave focused on mandate clarity, operational challenges, and reforms in UN peacekeeping. In 2023, the Indian Army organised IPACC, IPAMS and SELF-2023 with the US Army as the co-host.\nThe event witnessed participation from 30 countries. 18 countries were represented by Chiefs of their respective armies, and 12 countries were represented by Heads of Delegations.\nWith another multinational Army exercise on the horizon, the military is set to further deepen defence diplomacy through boots-on-ground engagement.\nSeveral bilateral exercises of the Indian Army are also lined up in the upcoming months. Exercise La Mitiyé with Seychelles is scheduled for March, followed by drills with Egypt and Saudi Arabia in April. In May, India and Uzbekistan are also set to hold a joint exercise.\nLatest Blogs",
        "link": "https://www.news18.com/india/indian-army-plans-major-multinational-exercise-in-may-june-to-boost-global-military-cooperation-ws-l-9932088.html",
        "date": "Thu, 26 Feb 2026 22:02:04 +0530",
        "fetched_at": "2026-03-02 03:56:15.882738"
    },
    {
        "title": "News18 Evening Digest: PM Modi On NCERT Row, WEF CEO Resigns Over Epstein & Other Stories",
        "content": "In today’s News18 evening digest, we bring you the latest on Prime Minister Narendra Modi’s trip to Israel, his comments on the ongoing NCERT row, and other top stories.\nPM Modi Expresses Displeasure Over NCERT Judiciary Chapter, Demands Accountability: Govt Sources\n‘Humanity Must Never Become A Victim Of Conflict’: PM Modi Says India Supports Gaza Peace Efforts\nBorge Brende Quits As World Economic Forum CEO After Epstein Links Emerge\nNew Air Ticket Refund Rules: No Extra Charge For Cancellation Of Booking Within 48 Hours\nIndia Vs Zimbabwe Live Cricket Score, T20 World Cup 2026: Samson, Axar Set To Return\nIndia are up against Zimbabwe in their second Super 8s match of the ICC Men’s T20 World Cup 2026 today. The match between India and Zimbabwe is taking place at MA Chidambaram Stadium in Chennai. Both India and Zimbabwe suffered humiliating defeats in their first Super 8s match of the ongoing tournament, and so today’s match is a must-win for both of them. India are expected to make multiple changes to their playing XI for the game against Zimbabwe. CHECK LIVE UPDATES HERE\nRashmika Mandanna, Vijay Deverakonda Wedding LIVE Updates: Actors Now Married, First Photos To Be Out Soon\nLatest Blogs",
        "link": "https://www.news18.com/india/news18-evening-digest-pm-modi-on-ncert-row-wef-ceo-resigns-over-epstein-other-stories-ws-l-9931796.html",
        "date": "Thu, 26 Feb 2026 18:26:24 +0530",
        "fetched_at": "2026-03-02 03:56:16.524746"
    },
    {
        "title": "PM Modi Expresses Displeasure Over NCERT Judiciary Chapter, Demands Accountability: Govt Sources",
        "content": "Prime Minister Narendra Modi expressed displeasure over the ongoing NCERT row, government sources told CNN-News18, after the Supreme Court strongly criticised a chapter referring to “corruption in judiciary\" in a Social Science textbook for Class 8 students.\nAccording to top government sources, PM Modi expressed his displeasure over the NCERT controversy and demanded to know the person who was overseeing the matter. He also questioned how Class 8 students could discuss judicial corruption and called for accountability in the matter.\nPrime Minister Modi’s reaction came after the NCERT tendered an unconditional apology over the controversy and said it would retract the Social Science textbook for Class 8 containing the chapter on judicial corruption, after strong criticism from Chief Justice of India Surya Kant.\nThe NCERT said it will be rewriting the curriculum of the textbook in question, Exploring Society: India and Beyond, Vol II, which was officially released on February 24. Within hours of its release, the book was taken off the council’s website and all physical circulation was stopped after the SC expressed its ire over the content, which it deemed defamatory and an affront to the integrity of the legal system.\nThe matter was brought to the court’s attention for urgent consideration by senior advocates Kapil Sibal and Abhishek Singhvi. CJI Surya Kant issued a stern warning stating that “nobody on earth will be allowed to defame the judiciary and taint its integrity\".\nThe Supreme Court observed that the publication of the book is a serious misconduct and directed that all copies of the book containing the chapter be immediately “seized\". It also issued a contempt notice to the NCERT chairman, Professor Dinesh Prasad Saklani, and the Secretary of School Education.\n“We would like to have a deeper probe. As head of the judiciary, it is my duty to ensure accountability; heads must roll,\" CJI Kant told Solicitor General Tushar Mehta, who appeared for the NCERT. Mehta tendered an unconditional and unqualified apology on behalf of the Ministry of Education.\nLatest Blogs",
        "link": "https://www.news18.com/india/pm-modi-expresses-displeasure-over-ncert-judiciary-chapter-demands-accountability-govt-sources-9931675.html",
        "date": "Thu, 26 Feb 2026 18:32:32 +0530",
        "fetched_at": "2026-03-02 03:56:17.129761"
    },
    {
        "title": "New Air Ticket Refund Rules: No Extra Charge For Cancellation Of Booking Within 48 Hours",
        "content": "The Directorate General of Civil Aviation (DGCA) on Thursday revised passenger-friendly norms for airline ticket cancellations, changes, and refunds, aiming to make the process simpler and faster.\nUnder the amended rules, passengers can cancel or change air tickets without paying an additional charge within 48 hours of booking, subject to certain conditions. In addition, the DGCA clarified rules for correcting name errors on tickets.\nFor tickets booked directly through an airline’s website, passengers can request a correction in the name of the same passenger within 24 hours of booking without any extra charge.\n“In case of purchase of ticket through travel agent/portal, onus of refund shall lie with the airlines as agents are their appointed representatives. The airlines shall ensure that the refund process is completed within 14 working days,\" the DGCA said.\nThe revised norms also include provisions for ticket cancellations due to medical emergencies, ensuring airlines handle such requests promptly and transparently.\nThe amendments to the Civil Aviation Requirements (CAR) on ‘Refund of Airline Tickets to Passengers of Public Transport Undertakings’ come amid rising complaints from passengers about delayed refunds.\nThe issue gained attention during flight disruptions by IndiGo in December 2025, when the civil aviation ministry had directed the airline to complete refunds within a specified timeline.\n(With inputs from PTI)\nLatest Blogs",
        "link": "https://www.news18.com/india/no-extra-charge-for-air-ticket-name-errors-flagged-within-24-hours-dgca-ws-l-9931453.html",
        "date": "Thu, 26 Feb 2026 17:16:48 +0530",
        "fetched_at": "2026-03-02 03:56:17.735117"
    },
    {
        "title": "Karnataka Ministers Meet Governor Thawar Chand Gehlot Over Internal Reservation Bill",
        "content": "A delegation of Karnataka Ministers on Wednesday met Governor Thawar Chand Gehlot, seeking early assent to the Internal Reservation Bill, as the state government prepares to move ahead with recruitment to vacant posts.\nThe meeting comes amid growing pressure from job aspirants and internal discussions within the government on expediting appointments. At a separate meeting chaired by the Chief Minister with Dalit Ministers, it was decided that the recruitment process should begin without waiting for a final court verdict on the internal reservation matter.\nMinisters are learnt to have opined that pending litigation should not indefinitely delay filling vacancies. They resolved that legal proceedings would continue alongside administrative action.\nFollowing the Chief Minister’s consultation, the Ministers called on the Governor at Raj Bhavan and urged him to consider the Internal Reservation Bill at the earliest. They said delays in granting assent were affecting the recruitment drive.\nThe delegation comprised Home Minister Dr G Parameshwara, Ministers HC Mahadevappa, KH Muniyappa, and Satish Jarkiholi, along with the Chief Minister’s legal adviser, Ponnanna.\nLatest Blogs",
        "link": "https://www.news18.com/india/karnataka-ministers-meet-governor-thawar-chand-gehlot-over-internal-reservation-bill-ws-l-9930051.html",
        "date": "Thu, 26 Feb 2026 15:52:59 +0530",
        "fetched_at": "2026-03-02 03:56:18.357236"
    },
    {
        "title": "New Book Delves Into Ancient Hindu Glory, Seeks To Rekindle The 'Flame Of Resistance'",
        "content": "At a time when debates around India’s civilisational past are often framed through the lens of decline and disruption, a new book seeks to shift the narrative towards rediscovering lost grandeur and drawing lessons for the future. The Decline of the Hindu Civilisation by Shashi Ranjan Kumar reconstructs the intellectual brilliance, scientific achievements and spiritual depth of ancient India, arguing that the civilisation’s enduring “flame of resistance\" ensured its continued relevance despite repeated upheavals. Rather than dwelling solely on decay, the book positions the past as a source of renewal — suggesting that the road ahead lies in understanding and reclaiming civilisational confidence.\nA senior civil servant and an electrical engineering graduate from Indian Institute of Technology Delhi, Kumar writes that his journey began when he read VS Naipaul’s India: A Wounded Civilisation. The book, he says, unsettled his early understanding of Hindu civilisation. But as he turned to primary sources and comparative historical study, Kumar came to see the “wound\" not as fatal, but as a reminder of resilience — a civilisational continuity that refused to be extinguished. Through deep research and comparisons with other great cultures, he examines whether internal rigidities, political fissures or external invasions best explain periods of decline, even as he foregrounds the enduring strength that survived them.\nStructured in four parts and sixteen chapters, the book re-evaluates Indian history from what Kumar describes as an indigenous perspective, challenging colonial and Marxist frameworks. The first part, comprising eight chapters, offers a comparative study of ancient Indian, Greco-Roman and Chinese civilisations. It draws parallels between institutions such as Nalanda and Alexandria, and devotes detailed chapters to astronomy, mathematics and medicine. Kumar revisits the “sciences of the Hindus,\" comparing Indian cosmological models with Greek thought, and highlighting contributions such as Aryabhata’s astronomical insights, the formalisation of zero, and the early foundations of calculus developed by the Kerala school.\nThe book also addresses civilisational self-perception. Kumar argues that “Bharat\" — or the Idea of India — is not a 19th-century construct but finds clear articulation in ancient texts such as the Puranas, which describe a culturally unified geography. He challenges the claim that “Hinduism\" was merely a British-era invention, contending instead that it represents a long-standing civilisational continuum. According to him, India’s historical trajectory is marked by wounds that “refuse to heal,\" accompanied by what he calls a stubborn denial of past humiliations. Yet this very continuity, he suggests, is proof of resilience rather than rupture.\nA substantial section of the book analyses five key battles — from the Battle of Hydaspes to the Battle of Assaye — to understand recurring military setbacks. Kumar attributes these to tactical inflexibility, lack of political unity and delayed adaptation to changing technologies of warfare. He also contests Sheldon Pollock’s thesis on the “death of Sanskrit,\" arguing that Sanskrit intellectual culture remained vibrant in regions such as the Sena and Gahadavala kingdoms until the onset of foreign invasions.\nDrawing comparisons with the Roman, Greco-Roman and Chinese civilisations, Kumar notes that while several great empires collapsed or were entirely replaced, Hindu civilisation retained a living core. That persistent “flame of resistance,\" he argues, prevented total extinguishment and preserved cultural memory through centuries of turmoil.\nThe book ultimately returns to its central proposition: that the past is not merely a chronicle of defeats but a reservoir of inspiration. By revisiting ancient achievements and honestly examining historical setbacks, Kumar suggests that India can shape a future worthy of its civilisational inheritance — one that generations to come will regard with pride.\nLatest Blogs",
        "link": "https://www.news18.com/india/new-book-delves-into-ancient-hindu-glory-seeks-to-rekindle-the-flame-of-resistance-ws-l-9931068.html",
        "date": "Thu, 26 Feb 2026 15:01:43 +0530",
        "fetched_at": "2026-03-02 03:56:19.031009"
    },
    {
        "title": "Row Erupts Over Use Of Urdu In Karnataka Govt Event Invite, BJP Alleges Appeasement",
        "content": "A controversy has erupted after the Karnataka government issued an invitation in Urdu, prompting the BJP to allege appeasement politics by the Congress.\nThe invitation was related to a key Health Department programme to launch preventive treatment and free ambulance services for haemophilia patients. In addition to Kannada and English, the Department of Health and Family Welfare also released the invitation in Urdu.\nThe BJP termed the decision appeasement politics and asked why the invitation needed to be published in Urdu. The party alleged that the government had created a new precedent in the name of minority appeasement.\nCiting the Karnataka Official Language Act, the BJP pointed out that Urdu does not have official status in the state. It accused the government of issuing invitations in a language that is not recognised as an official administrative language in Karnataka.\nLatest Blogs",
        "link": "https://www.news18.com/india/row-erupts-over-use-of-urdu-in-karnataka-govt-event-invite-bjp-alleges-appeasement-9930912.html",
        "date": "Thu, 26 Feb 2026 13:32:21 +0530",
        "fetched_at": "2026-03-02 03:56:19.674423"
    },
    {
        "title": "Centre To Launch Nationwide HPV Shots For Girls Aged 14 On February 28",
        "content": "Prime Minister Narendra Modi is set to launch the nationwide Human Papillomavirus Vaccination campaign for 14-year-old girls on February 28 from Ajmer, Rajasthan, marking the formal start of India’s large-scale push to prevent cervical cancer through immunisation.\nIn an official letter dated February 25, sent to states and union territories, the Union Health Ministry said the launch has been planned “tentatively at 11.30 am on 28th February 2026\" and that “The Prime Minister has kindly consented to launch the campaign from Ajmer, Rajasthan.\"\nThe letter underscores the public health rationale, stating, “Cervical cancer is a significant public health concern in our country as well as globally. It is caused by Human Papilloma Virus (HPV) and it is the only cancer which can be prevented by a vaccine.\"\nThe campaign will initially target girls aged 14 years — those who have celebrated their 14th birthday but have not yet turned 15 — and will run as a three-month intensive drive before being integrated into routine immunisation services.\nTo minimise stress-related reactions among adolescents, the document advises ensuring girls are not vaccinated on an empty stomach, observing them for 30 minutes post-vaccination and avoiding overcrowding.\nWHAT DOES THE LETTER SAY?\nThe operational guidelines annexed to the letter direct states to begin implementation immediately after the Prime Minister’s launch. “Initiate the HPV vaccination on 28th February 2026 after the launch event as per the following detailed guidelines,\" the letter said.\nDefining eligibility, it said, “Target Population: Girls aged 14 years (those who have celebrated their 14th birthday but have not yet celebrated their 15th birthday).\" It further clarifies that “Girls who will turn 15 years within 90 days of the launch will also be eligible for vaccination during the intensive three-month HPV vaccination activity.\"\nOn consent, the reiterated that “The HPV vaccination is voluntary and obtaining consent from the parent/guardian is mandatory before vaccination of girls.\"\nAll vaccinations will be administered at public health facilities including Ayushman Arogya Mandir-Primary Health Centers, Community Health Centers, Sub District/District Hospitals & Government Medical Colleges & Hospitals),\" the letter notes, adding that these facilities will have “a Cold Chain Point (CCP) and dedicated medical officer for AEFI management.\"\nAddressing safety, the annexure of the letter said, “HPV vaccine is generally safe but beneficiaries may experience mild side effects following vaccination. Most side effects last no more than a couple of days and are part of the immune system’s natural response to the vaccine.\"\n“All HPV vaccination session sites will be equipped with AEFI Kits for anaphylaxis management,\" it adds, and will be linked to the nearest 24×7 health facility. A helpline is to be operational in all states and UTs.\nDigital tracking has been mandated for registration, recording and reporting the vaccination.\n“The digital U-WIN platform will be used for registration, recording and reporting and all vaccine stocks and logistics to be managed & monitored through e-VIN,\" the guidelines state.\nWHAT IS THE PLAN?\nThe rollout will run for three months as a focused campaign. “HPV vaccination Duration: 3 months (90 days). After the completion of the three-month HPV vaccination, HPV vaccine will be available on the routine immunization session days,\" it specifies.\nStates have been asked to complete microplanning and ensure facility readiness. “For the rollout of the HPV vaccination, microplanning and health facility readiness are to be undertaken as per the standard formats already shared with States/UTs as part of training material,\" the guidelines state.\nWith the Prime Minister set launch the initiative on February 28, the government will begin implementation across States and UTs the same day, starting with a tightly defined age cohort and a digitally monitored campaign aimed at building momentum for cervical cancer prevention nationwide.\nLatest Blogs",
        "link": "https://www.news18.com/india/centre-to-launch-nationwide-hpv-shots-for-girls-aged-14-on-february-28-ws-l-9930882.html",
        "date": "Thu, 26 Feb 2026 13:30:03 +0530",
        "fetched_at": "2026-03-02 03:56:20.437781"
    },
    {
        "title": "Karnataka Self-Styled Godman Booked Under POCSO For Inappropriate Behaviour With Minor",
        "content": "A case under the Protection of Children from Sexual Offences (POCSO) has been filed against Mallikarjun Mutya, a self-proclaimed seer in Karnataka’s Yadgir district, after a video allegedly showing him behaving inappropriately with a minor girl went viral on social media platforms.\nThe incident reportedly took place on February 19 at Mahal Roja village, where the Yamanurappa Mutya Mutt is located. The minor girl, who is originally from Solapur in Maharashtra, had visited the mutt with her family.\nIt was alleged that Mallikarjun Mutya kissed the minor girl in the presence of her relatives. The video of the incident later surfaced online, triggering widespread public outrage.\nTaking suo motu cognisance of the matter, the Karnataka State Commission for Protection of Child Rights directed authorities to initiate action. Following instructions from Commission Chairman Shashidhar Kosambe, a case was registered at Gogi Police Station.\nThe complaint was filed by the Child Development Project Officer of Shahapur taluk. Police have booked the case under relevant sections of the Protection of Children from Sexual Offences (POCSO) Act and the Bharatiya Nyaya Sanhita.\nReportedly, Mallikarjun Mutya has left the mutt late at night and travelled to Telangana. A notice has been issued asking him to appear for questioning. Officials said that if he fails to comply, a special team may be formed to secure his arrest.\nFurther investigation into the matter is underway.\nMallikarjun Mutya, who is believed to be around 26–27 years old, has gained popularity in recent years through social media platforms, on Instagram, YouTube, and Facebook.\nHe is widely known as “Appaji\" among his followers. According to local reports, he is revered by many devotees in North Karnataka and surrounding districts, who regard him as a “walking god\" or a local deity.\nHe has become widely known over the past four years due to his active presence on social media and has drawn attention for his sometimes controversial “miracles.\"\nHe is known to have a large following not only in Karnataka but also in Andhra Pradesh, Telangana and Maharashtra.\nLatest Blogs",
        "link": "https://www.news18.com/india/karnataka-self-styled-godman-booked-under-pocso-for-inappropriate-behaviour-with-minor-ws-l-9930616.html",
        "date": "Thu, 26 Feb 2026 11:40:41 +0530",
        "fetched_at": "2026-03-02 03:56:21.084659"
    },
    {
        "title": "'Heads Must Roll': SC Bans Controversial NCERT Book, Issues Contempt Notice To Chairman",
        "content": "The Supreme Court on Thursday demanded accountability as it strongly criticised the NCERT over a chapter referring to “judicial corruption\" in a  Social Science textbook for Class 8 students. Taking action, the Chief Justice of India banned the NCERT textbook chapter and prohibited the publication, re-printing, and digital sharing of the copies.\nIn its order, the CJI directed that all copies of the book containing the chapter be immediately “seized\", and stated that those sharing the copies in any form will face legal action. In addition to this, the CJI has also issued a contempt notice to the NCERT chairman, Professor Dinesh Prasad Saklani, and the Secretary of School Education.\nPrima facie, the top court observed that the publication of the book is a serious misconduct, which can come within the purview of criminal contempt of court, if proved to be a deliberate act to scandalise the judiciary.\n“We would like to have a deeper probe. As head of the judiciary, it is my duty to ensure accountability; heads must roll,\" Chief Justice Surya Kant said as he grilled Solicitor General Tushar Mehta, appearing for the NCERT.\n“I will not close these proceedings until there is some accountability. We want to know who the people behind this are,\" the Chief Justice added.\n“They fired a gunshot and the judiciary is bleeding today,\" the Chief Justice raged, stating, “This looks like a deep-rooted conspiracy. A very calculated move.\"\nTaking exception to the NCERT’s Wednesday communication, the SC said there was not a single word of apology in it, and instead, they have tried to justify it.\nAt the outset, Solicitor General Tushar Mehta tendered an unconditional and unqualified apology on behalf of the Ministry of Education.\nThe NCERT corruption in the judiciary chapter controversy escalated on Wednesday after the CJI sharply criticised the content as a grave matter and raised concerns over the biased narrative. CJI Kant also stated that the Supreme Court would not permit any attempt to defame or undermine the integrity of the judiciary.\nLatest Blogs",
        "link": "https://www.news18.com/india/biased-narrative-sc-issues-show-cause-notice-to-ncert-chairman-over-corruption-in-judiciary-reference-9930647.html",
        "date": "Thu, 26 Feb 2026 16:12:27 +0530",
        "fetched_at": "2026-03-02 03:56:21.713320"
    },
    {
        "title": "'Disappointing': Iran's Foreign Minister On Budgetary Cuts For The Strategic Chabahar Port",
        "content": "Iran’s Foreign Minister Abbas Araghchi expressed his disappointment over India’s decision to not allocate any funds this year for the Chabahar port project, stating that the project could have played a key role in enhancing connectivity to Central Asia and Europe.\nTalking about the budgetary cuts to the jointly developed project, Araghchi in an interview with India Today said, “Well, I think it’s a disappointment for both Iran and India.\"\n“Chabahar, as Prime Minister Modi once said, is a golden gate that connects the Indian Ocean area to Central Asia, the Caucasus, and then to Europe — and vice versa. It is a very strategic port. If fully developed, it can play a very important role in connecting India through Iran to Central Asia, to the Caucasus, and then to Europe,\" the Iranian minister was quoted by India Today.\nThe Iranian minister added that the port can probably act as the best transit route. “I hope that one day we can witness the full development of this port,\" he said.\nWith huge strategic importance, the Chabahar Port project is being developed by India at Chabahar in southeastern Iran. The port will open immense opportunities towards creating direct trade and transit route to Afghanistan and Central Asia while bypassing Pakistan.\nThe port will help India increase its regional connectivity, boost trade access to landlocked Central Asian markets, counter China’s influence in Pakistan’s Gwadar Port, and strengthen India’s geopolitical presence in the region.\nHowever, amid renewed tensions between the US and Iran, this year’s Union Budget marks the first time since India signed a deal to develop the port in 2024 that no allocation has been made for the project.\nNotably, India in previous budgets had earmarked Rs 100 crore annually for the major connectivity project in Iran’s southern Sistan-Balochistan province, where it continues to remain a key development partner.\nLatest Blogs",
        "link": "https://www.news18.com/india/disappointing-irans-foreign-minister-on-budgetary-cuts-for-the-strategic-chabahar-port-9930366.html",
        "date": "Thu, 26 Feb 2026 10:01:49 +0530",
        "fetched_at": "2026-03-02 03:56:22.528362"
    },
    {
        "title": "Holi 2026: Is It A Public Holiday? State-Wise Schools, Banks Holiday List",
        "content": "Holi 2026 School, Bank Holiday: Different astrological interpretations have caused a sense of confusion regarding Holi celebrations for the year 2026. Uncertainty persists in citizens’ minds over the exact dates for the festivities of Holika Dahan and Dhulandi. At the crux of confusion are the variations in the almanack readings, lunar calculations, the impact of Adhik Maas and the occurrence of a lunar eclipse on March 3.\nAccording to the traditional panchang interpretations, Holika Dahan is set to take place late at night on March 2, with the colourful celebrations for Dhulandi observed two days later on March 4. However, since official holiday announcements across various states have been different from each other, uncertainty remains.\nIn certain North-Western and Central states, the festivities and puja rituals for the Holika Dahan will be hosted on March 2. The occasion will fall on the next day in the other parts of the region, with the Dhulandi celebrated the following morning.\nIn Uttar Pradesh, there is a different kind of confusion about the festivities and overall Holi celebrations this time. The state government had announced that students can enjoy a prolonged observance of the festival in the first week of March.\nMarch 1, 2026, falls on a Sunday and is a regular weekly holiday for school students, according to the annual academic calendar released by the State Education Department. In certain schools, March 2 will see a close due to Holika Dahan and March 4 has been announced a holiday for the celebrations of Dhulandi.\nSince Holika Dahan is generally observed one day before the Holi festivities, there is confusion whether the UP government will also have March 3rd as a public holiday.\nLatest Blogs",
        "link": "https://www.news18.com/india/holi-2026-is-it-a-public-holiday-state-wise-schools-banks-holiday-list-aa-9928485.html",
        "date": "Sun, 1 Mar 2026 17:22:15 +0530",
        "fetched_at": "2026-03-02 03:56:23.223861"
    },
    {
        "title": "British Government Borrowed Rs 35,000 Over A Century Ago; Now Indian Family Wants It Back",
        "content": "A family in Madhya Pradesh’s Sehore has claimed that the then British government failed to repay a loan of Rs 35,000 taken during the First World War in 1917 and is now exploring legal options to recover  what they describe as a historic sovereign debt with interest\nThe family of late businessman Seth Jumma Lal Ruthia claimed that he lent Rs 35,000 to the British administration in 1917 during the First World War, as per a report by News18 Hindi. At the time, the amount was considered substantial and was reportedly provided to support wartime administration in the princely state of Bhopal.\nNow, more than a century later, Seth Jummalal’s grandson, Vivek Ruthia, said he is preparing to send a legal notice to the British government to recover the loan which was never repaid. He said that the documentary evidence of the transaction was recently discovered among old family records following his father’s death.\nThe document, dated June 4, 1917, stated that Seth Jumma Lal, of the firm Seth Rama Kishan Jaskaran Ruthia, “subscribed Rs 35,000 to the Indian War Loan and thereby showed his loyalty to the Government and Empire.\" It beares the signature of W S Davis, who was then the political agent in Bhopal.\nWar loans during that period were debt instruments issued by the British government to raise funds for military expenses during World War I, typically offering 5.5% interest.\nSeth Jummalal Ruthia died in 1937, nearly 20 years after the loan was extended. The matter, the family claimed, remained unsettled and gradually slipped into obscurity until now.\nRuthia said that he is consulting lawyers to explore whether a claim can be made against the current UK government.\n“It’s not just about money, it’s about justice and history,\" he said, adding that when adjusted for compound interest, inflation or gold prices, the original Rs 35,000 could now be worth several crores of rupees.\nThe Ruthia family was once among the most prominent and affluent in Sehore and the Bhopal princely state, with significant landholdings and business interests. Seth Jumma Lal Ruthia was a prominent trader in cloth and grain in Sehore during British rule. At the time of World War I, when the colonial administration was facing financial strain, local officials reportedly approached him for assistance.\nThey family continues to own property in Sehore, Indore and Bhopal.\nLegal experts note that claims involving pre-Independence transactions between colonial authorities and private individuals are rare and legally complex. While no legal notice has yet been sent, the family said that it is determined to pursue the matter.\nLatest Blogs",
        "link": "https://www.news18.com/india/british-government-borrowed-rs-35000-over-a-century-ago-now-indian-family-wants-it-back-ws-l-9930207.html",
        "date": "Thu, 26 Feb 2026 08:53:20 +0530",
        "fetched_at": "2026-03-02 03:56:23.913207"
    },
    {
        "title": "‘Will Pee In Your Mouth’: Mathura Cop Assaults Tea Seller Over Delay | Video",
        "content": "In a shocking incident, a Government Railway Police (GRP) sub-inspector allegedly assaulted and hurled obscene abuses at a tea vendor at Mathura Railway Station over a delay in preparing tea.\nThe incident took place on Wednesday morning at Platform No. 8 at a stall named “Krishna Foods.\" According to reports, the vendor, identified as Suraj was cleaning the stall when GRP sub-inspector Vivek Kumar approached him around 8 am and asked him to prepare tea.\nWhen the vendor said it would take a few minutes as he was still finishing his work, the officer allegedly lost his temper and went away. Around 8:15 am, he returned to the stall and, upon being told again to wait briefly, reportedly began abusing the vendor and slapped him multiple times.\nThe CCTV footage, which has since gone viral on social media, allegedly showed the officer using abusive language and threatening the vendor, saying, “I’ll pee in your mouth.\"\nAt Mathura Junction, GRP constable allegedly abused a tea vendor with filthy slurs and assaulted him over a slight delay in making tea. @Uppolice @upgrphq @RailMinIndiaPS (Abusive language) pic.twitter.com/hrQAybC5FI\n— Sanjay Jha (@JhaSanjay07) February 25, 2026\nThe video triggered widespread condemnation online, with many questioning the misuse of authority.\nSenior officials took cognisance of the viral video and suspended the sub-inspector. Confirming the action, Circle Officer Rajesh Dixit said the officer has been placed under suspension pending further inquiry.\nGRP station in-charge Jitendra Kumar said that no formal complaint had been received from the vendor till evening.\nLatest Blogs",
        "link": "https://www.news18.com/india/will-pee-in-your-mouth-mathura-cop-assaults-tea-seller-over-delay-video-ws-l-9930144.html",
        "date": "Thu, 26 Feb 2026 07:46:24 +0530",
        "fetched_at": "2026-03-02 03:56:24.717513"
    }
]