[
    {
        "title": "IIT-Madras Research Park, Unicorn Ventures launch ₹600-crore deep tech fund",
        "content": "Indian Institute of Technology Madras Research Park (IITMRP), in collaboration with Unicorn India Ventures, on Friday announced the launch of a ₹600-crore fund to support deep tech startups across India. Called IIT Madras Unicorn Frontier Fund I, it will have ₹400 crore ‘greenshoe option’, a clause that allows underwriters sell 15 per cent more shares than planned if the demand was high. In the initial phase, it plans to invest in over 25 startups that range from robotics, space tech, defence tech, and semiconductors. Announcing this at the inauguration of Entrepreneurship Summit 2026, V. Kamakoti, Director, IIT Madras, said the fund would be operational in about three or four months after all the necessary approvals were obtained. The School of Innovation and Entrepreneurship, he said, would start offering programmes and courses soon and develop course materials so as to provide a fillip to the entrepreneurial ecosystem. Startups not only incubated within IITMRP but from across the country will be able to seek funding, Dr. Kamakoti added. The fund aims to target the ‘valley of death’ curve, the phase in the life of a startup between start of operations and generation of revenue, and convert it to ‘valley of hope’. IIT-Madras was also developing an e-plane capable of vertical take-off and landing within a 5,000-square-foot-space making it an ideal candidate for initiatives like air ambulance. The project was expected to reach the commercial stage in about a year’s time, he added. Natarajan Malupillai, Group CEO, IITMRP, said the fund would have a 10+2 years tenure and was the first step towards creating a steady stream of startups reaching IPO level. Ashwin Mahalingam, Dean, Alumni and Corporate Relations, IIT-Madras, said that the venture would attempt to draw upon the expertise of the institute’s 70,000-odd alumni. Bhaskar Majumdar, founder and managing partner, Unicorn India Ventures, said nearly two-thirds of the 50-odd companies that his company has invested in were from tier two or tier three cities. Talking about the challenges he had to overcome, Swapnil Jain, co-founder, Ather Energy, said the startup environment was looking more promising now than it was a decade ago when he started his company. He said of late, there was an observable shift in interest of investors from e-commerce to deep tech. Richa Agrawal, Faculty Advisor, Entrepreneurship Cell, IIT-Madras, Sathyanarayana N. Gummadi, Dean-Students, IIT-Madras, Atharva Kokate, Student Core, E-Summit, and Harin Raam A., Student Manager, E-Summit, spoke. Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/iit-madras-research-park-unicorn-ventures-launch-600-crore-deep-tech-fund/article70600949.ece",
        "date": "Sat, 07 Feb 2026 02:25:42 +0530",
        "fetched_at": "2026-02-07 02:29:21.346980"
    },
    {
        "title": "‘Focus on inclusive growth’: Omar tables ₹1.27-lakh-cr. budget",
        "content": "J&K Chief Minister Omar Abdullah addressing a press conference at the Convention Centre in Jammu on Friday. @CM_JnK X/ANI Photo) Highlighting the financial distress the Union Territory (UT) was facing, Jammu and Kashmir Chief Minister Omar Abdullah on Friday presented a ₹1.27-lakh-crore budget with a “special focus on the marginalised sections of the society and fresh measures to create jobs”, in a region with one of the highest unemployment rates in the country. “The budget carries a wide range of people-centric initiatives aimed at delivering immediate relief, strengthening social protection, promoting inclusive growth and ensuring equitable development across all regions of J&K,” said Mr. Abdullah, who presented the second budget of his government as the Finance Minister. Thirty-two welfare measures were rolled out for the marginalised sections, including women, orphans and persons with disabilities. Mr. Abdullah announced six free LPG cylinders for families registered under the Antyodaya Anna Yojana (AAY); free bus service for women and passengers with disabilities in smart city buses and other government transport systems; Direct Benefit Transfer-based financial reimbursement of fees for AAY students from Classes 9 to 12 as well as college students; and sponsorship support to 6,000 orphans under non-institutional care. Opposition parties expressed their unhappiness over the budget though. “The budget is hopeless and a vague document. It offers no healing or hope. The youth, who comprise 60%–65% of our population, have been ignored,” Peoples Democratic Party MLA Waheed-ur-Rehmaan Parra said. BJP MLA and Leader of Opposition Sunil Sharma termed it “a budget for National Conference MLAs”. “There is nothing for the common people in it,” he added. “The Budget carries a set of focused measures that will directly touch the lives of citizens, particularly the most vulnerable sections,” Mr. Abdullah said. Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/jammu-and-kashmir/focus-on-inclusive-growth-omar-tables-127-lakh-cr-budget/article70600948.ece",
        "date": "Sat, 07 Feb 2026 03:58:30 +0530",
        "fetched_at": "2026-02-07 02:29:22.546149"
    },
    {
        "title": "Election Commission directives ignored, disabled people made to wait in queue for SIR hearings in Bengal",
        "content": "“With the exercise now increasingly resembling a citizenship verification drive, it is apprehended that many disabled people will not only face disenfranchisement, but also be forced to prove their citizenship,” National Platform for the Rights of the Disabled said. File Thirty-nine-year-old Arpita Banerjee, a resident of Baranagar in West Bengal’s North 24 Parganas district, has been battling multiple health problems since childhood, exacerbated by neurological disorders. Born in November 1987, Ms. Banerjee had been on the earlier 2025 voter list and was included in the post-Special Intensive Revision (SIR) draft electoral rolls published in December last year. Soon after, however, she received a notice to attend a hearing over a “logical discrepancy” arising from a mismatch in the spelling of the surname “Banerjee” in her and her father’s records. Her 76-year-old father, a small-time businessman, accompanied her to the hearing, where they had to wait for a good three hours before officials clicked her photograph and accepted her disability certificate as documentary evidence, as mandated under SIR rules. The experience, however, has left her traumatised. Similar difficulties have been reported by other voters with disabilities. Lokman Sheikh, a person with visual disability from Raghunathganj Assembly Constituency under Murshidabad district, had to wait in the queue during his hearing, with no separate facility for people like him, despite being called over a “logical discrepancy” in his name. The parent of a non-verbal autistic boy from Kolkata, who did not wish to be identified, said they had to wait for nearly five hours in a queue with their son for the SIR hearing, triggering severe anxiety in the child. According to the Election Commission of India data, West Bengal had 5,07,089 registered voters with disabilities in the 2024 electoral rolls used for the Lok Sabha elections. The ECI provides a home voting facility for voters with disabilities. During the SIR of electoral rolls in West Bengal, the ECI issued directives on January 7, exempting certain categories of voters, including persons with disabilities, from physical hearings. The directive stated that disabled electors who submit specific requests to the Electoral Registration Officers (EROs) or Assistant EROs, either directly or through family members, may not be called for hearings. If notices had already been issued, officials were instructed to contact such voters by phone and conduct verification at their homes. However, activists say the situation on the ground is starkly different, largely due to the short notice period.  “Most voters are being asked to appear within two days or even the very next day. As people are already anxious and under great stress, they are not taking any chances and are rushing for hearings despite great hardships,” said Shampa Sengupta, a Kolkata-based disability rights activist. People gather during a hearing of the Special Intensive Revision (SIR) of the electoral rolls, in Balurghat, West Bengal. File A senior ECI official from West Bengal told The Hindu that it was the responsibility of Booth Level Officers (BLOs) to process and facilitate exemption requests, as they are local residents familiar with families in the area. V. Muralidharan, general secretary of the National Platform for the Rights of the Disabled (NPRD), said, “While the ECI has robustly implemented home voting for elderly and disabled voters during elections, the same groups face unnecessary harassment during voter roll revisions”. “Many disabled persons have complained of being humiliated and treated in an undignified manner. With the exercise now increasingly resembling a citizenship verification drive, it is apprehended that many disabled people will not only face disenfranchisement, but also be forced to prove their citizenship,” he said. Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/west-bengal/disabled-people-made-to-wait-in-queue-for-sir-hearings-in-bengal/article70600739.ece",
        "date": "Sat, 07 Feb 2026 02:05:13 +0530",
        "fetched_at": "2026-02-07 02:29:31.518012"
    },
    {
        "title": "Prescription For Crises: Govt May Ask Pharma Firms To Fund Free Medicines For Emergencies",
        "content": "India is examining a proposal to mandate pharmaceutical companies to set aside a share of their profits for free medicines during health emergencies, News18 learned. The proposal seeks an amendment to the Drugs Rules, 1945, to include a mandatory provision requiring pharmaceutical companies to spend “at least one per cent of their net profit for providing free medicines in medicine bank\" to be used by the central government during “health emergencies, disaster or any other circumstances considered necessary\". The proposal is still under deliberation and has been placed before the country’s top statutory decision-making body on technical matters related to drugs and cosmetics, the Drugs Technical Advisory Board. The move, according to the agenda document accessed by News18, is being examined to assess whether emergency access to free medicines can be strengthened through regulatory changes without conflicting with company law. The proposal was deliberated at DTAB’s 90th meeting held on January 25, 2024, after which the board recommended that the Ministry of Health and Family Welfare may seek the opinion of the Ministry of Corporate Affairs on the matter. Subsequently, comments were received from the corporate affairs ministry, which flagged legal constraints. The agenda document notes that “the broad framework for CSR is laid down under Section 135 of the Companies Act, 2013\", along with Schedule VII of the Act and the Companies (CSR Policy) Rules, 2014. It further clarifies that “the Government does not issue specific direction or intervention in the manner or geographical area in which companies choose to spend their CSR funds\", highlighting limits on directing CSR expenditure through sector-specific rules. The corporate affairs ministry has indicated that any attempt to mandate CSR-linked spending through drug regulations would need to be legally aligned with company law. The document states that “CSR is governed by Companies Act, 2013,\" and therefore suggests that “the authority for CSR activity may be quoted from Schedule VII, Companies Act, 2013 and Companies (CSR Policy) Rules, 2014 and proposed amendment in Drugs Rules, 1945 need to be in sync\". More significantly, it cautions that “any amendment in the CSR framework would require an amendment to the Companies Act\", suggesting that changes through the Drugs Rules alone may not be sufficient. The matter has now been placed back before DTAB, with the agenda concluding that “DTAB may kindly deliberate and give its recommendations in the matter\". The matter continues to be reviewed, with regulators weighing public health needs against existing corporate law provisions.",
        "link": "https://www.news18.com/india/prescription-for-crises-govt-may-ask-pharma-firms-to-fund-free-medicines-for-emergencies-9885630.html",
        "date": "Sat, 7 Feb 2026 07:00:34 +0530",
        "fetched_at": "2026-02-07 02:29:55.611689"
    },
    {
        "title": "State government allocates ₹51.92 crore for proposed bronze museum at Egmore",
        "content": "The Tamil Nadu government has given administrative sanction and allocated ₹51.922,70,000 crore for the proposed bronze museum at Egmore, said K. Manivasan, Additional Chief Secretary, Department of Tourism and Hindu Religious and Charitable Endowments (HR&CE) Department. The announcement regarding the creation of the museum was made by Finance Minister Thangam Thennarasu during the presentation of the Budget in 2025. The Egmore Museum houses more than 2,000 bronze statues, meticulously crafted from aimpon (an alloy of five metals) by master artisans of the past. “To showcase these sculptural masterpieces, which are renowned for their serene expressions, elegant postures, as well as intricate mudras, a gallery with a traditional architectural design will be constructed within the museum complex, at an estimated cost of ₹40 crore, ensuring an immersive experience that will captivate international visitors,” Mr. Thennarasu said. In his order granting administrative sanction and allocation of funds, Mr. Manivasan also recalled the earlier announcement that a total of ₹1 crore would be allotted for thematic galleries on bronzes. Mr. Manivasan said the Commissioner of Museums had obtained a detailed project report from Sanrachana Architectural Studio for the construction of a traditional building through the Public Works Department at a cost of ₹41.91 crore, and a gallery with modern technology and interiors through the Museums Department at a cost of ₹14.30 crore. After examining the report submitted by the Commissioner of Museums, the government sanctioned a total amount of ₹51.92 crore. This includes ₹40.02 crore for the construction of the museum complex within the Egmore Museum campus and ₹11.90 crore for the thematic galleries on bronzes. The government order also directed the Commissioner of Museums to obtain the opinion of a suitably qualified officer regarding the demolition of the old building within the museum complex. Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/state-government-allocates-5192-crore-for-proposed-bronze-museum-at-egmore/article70601058.ece",
        "date": "Sat, 07 Feb 2026 00:39:05 +0530",
        "fetched_at": "2026-02-06 19:29:13.511944"
    },
    {
        "title": "Nellore District Science Centre curator bags award for promoting education in rural areas",
        "content": "Published - February 07, 2026 12:02 am IST - VIJAYAWADA Samagra Shiksha State Project Director B. Srinivasa Rao on Friday (February 06, 2026) said that the Nellore District Science Centre curator N. Subramanyam has bagged the “Shikshagraha Leadership Award”, presented to him in recognition of his relentless efforts to promote science education in rural areas for nearly three decades. Announcing that that award is instituted by Infosys co-founder S.D. Shibulal, Mr. Rao said that it was presented during the national educators conference “InvokED 5.0: Mission to Movement” held in Bengaluru on Friday and it comprised a national citation and a financial grant of ₹10 lakh. “The encouragement and support from Mr. Srinivasa Rao played a vital role in this achievement,” said Mr. Subrahmanyam expressing his gratitude. Mr. Rao said out of 6,500 teachers across India, only three were selected based on leadership qualities, social impact, and contributions to rural education and Mr. Subrahmanyam was one among these outstanding educators. The award was presented by S.D. Shibulal, founder, ShikshaLokam and co-founder of Infosys and his wife Kumari Shibulal, founder and Chairperson of the Shibulal Family Philanthropic Initiatives. Mr. Subrahmanyam, who is currently serving as the Curator of the District Science Centre, Chemudugunta, Nellore,has restored the Mobile Science Lab (Space on Wheels), indoor and outdoor exhibits, integrated QR codes with video explanations, implemented Astro Tourism, Cosmos Digital Learning, STEM-based experiential education and continues to lead programmes such as Budding Scientists, INSPIRE Awards and the Rural Children Research Centre. Recognising his innovative initiatives, the Samagra Shiksha has consistently encouraged and provided him financial support, including monthly transport charges for operating the Mobile Science Lab. Published - February 07, 2026 12:02 am IST Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/nellore-district-science-centre-curator-bags-award-for-promoting-education-in-rural-areas/article70601367.ece",
        "date": "Sat, 07 Feb 2026 00:02:16 +0530",
        "fetched_at": "2026-02-06 18:43:08.136271"
    },
    {
        "title": "Chief Minister Stalin announces Kalaignar Ninaivu Kalaithurai Vithagar award for film veterans M.N. Rajam and S.P. Muthuraman",
        "content": "News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Published - February 06, 2026 11:38 pm IST - CHENNAI Tamil Nadu Chief Minister M.K. Stalin on Friday announced that the Kalaignar Ninaivu Kalaithurai Vithagar Award for 2024 and 2025 will be conferred on veteran actor M.N. Rajam and veteran filmmaker S.P. Muthuraman, respectively. Rajam is one of the senior-most artistes in Tamil cinema, who began her acting career in stage plays at a young age and made her film debut as a child artiste in 1949. She rose to become a leading heroine in the 1950s and 1960s and earned wide appreciation for her performances in several successful films, including Rathakkanneer, Pennin Perumai, Pudhaiyal, Thangapathumai, Nadodi Mannan, Pasamalar, Thaali Baakiyam and Mangaiyar Thilakam. She has acted in more than 200 Tamil films, later taking on supporting roles such as mother and mother-in-law, and secured a lasting place in the hearts of the audience. Her mother roles in films, such as Arangetram and Oorukku Uzhaippavan, are particularly remembered. She is also the first woman member registered with the South Indian Artistes’ Association and has received several awards for her long service to the field of arts, an official release said. Muthuraman began his career as an assistant director with the film Kalathur Kannamma in 1960 and went on to become one of the most successful commercial directors in Tamil cinema from the 1970s through the 1990s. He has directed more than 70 Tamil films. Some of his notable films, include Aarilirunthu Arubathu Varai, Bhuvana Oru Kelvikuri (1977), Oru Oodhappoo Kan Simittugirathu (1978), Murattu Kaalai, Engeyo Ketta Kural (1982), and Sakalakala Vallavan (1985). He has received several awards for his contributions to Tamil cinema and is also well known for his simplicity, integrity, and humility. Both awardees will receive a cash prize of ₹10 lakh each along with a memento from the Chief Minister, the release added. Published - February 06, 2026 11:38 pm IST Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/chief-minister-stalin-announces-kalaignar-ninaivu-kalaithurai-vithagar-award-for-film-veterans-mn-rajam-and-sp-muthuraman/article70601513.ece",
        "date": "Fri, 06 Feb 2026 23:38:54 +0530",
        "fetched_at": "2026-02-06 18:34:48.436317"
    },
    {
        "title": "Book launch directed against CPI(M): Ragesh",
        "content": "News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Published - February 06, 2026 11:31 pm IST - KANNUR Communist Party of India (Marxist) [CPI(M)] district secretary K.K. Ragesh on Friday (February 6) alleged that the release of book authored by V. Kunhikrishnan, who was expelled from the CPI(M) Kannur district committee and its primary membership for alleging embezzlement of martyr’s fund by the party, was used as a platform by anti-CPI(M) forces. Addressing a press conference, Mr. Ragesh said several participants attended the book launch under the “Left label”, but maintained that the programme was essentially directed against the CPI(M). He criticised the speech delivered by Joseph C. Mathew at the event, saying that it resembled that of a “former CPI(M) leader,” and said the party did not require advice from him. “Anyone with basic common sense can understand the intention behind organising such a programme,” he said. Mr. Ragesh further alleged that the book released by Mr. Kunhikrishnan amounted to personal attack on MLA T.I. Madhusoodanan. He maintained that no funds had been diverted and that the party had suffered no financial loss. All figures mentioned in the book were incorrect, he alleged. Published - February 06, 2026 11:31 pm IST Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/kerala/book-launch-directed-against-cpim-ragesh/article70600193.ece",
        "date": "Fri, 06 Feb 2026 23:31:44 +0530",
        "fetched_at": "2026-02-06 18:34:49.574499"
    },
    {
        "title": "Prime Minister Narendra Modi must answer questions related to national security in Parliament, says Congress MP",
        "content": "News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Updated  - February 06, 2026 11:05 pm IST - CHENNAI Congress Member of Parliament Sudha Ramakrishnan on Friday dismissed allegations that women opposition members had intended to protest against Prime Minister Narendra Modi in an “unprecedented manner” in the Lok Sabha. She charged Mr. Modi of using these allegations as a pretext to avoid answering questions related to India’s national security. Ms. Sudha told The Hindu  that the Leader of Opposition, Rahul Gandhi, raised questions over General Naravane’s account of how Government of India responded during the Chinese incursion into Indian territory in 2020, which was published in a magazine, and about Jeffrey Epstein files linking Mr. Modi. “Why can’t we debate it? The magazine has only published what was there in General Naravane’s unpublished book. And Epstein is a child sex offender. Why can’t Mr. Modi clarify these issues in the Parliament? What does Epstein mean by Mr. Modi dancing in Israel (as claimed in Epstein’s emails)? Shouldn’t issues relating to national security be answered in the parliament?” she asked. According to her, Mr. Gandhi was prevented from raising these issues. She alleged that the Speaker (Om Birla) at the time allowed a BJP MP to slander Indira Gandhi based on some magazine. “So, we gheraoed him,” she said. Published - February 06, 2026 11:00 pm IST Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/pm-must-answer-questions-related-to-national-security-in-parliament-congress-mp/article70600787.ece",
        "date": "Fri, 06 Feb 2026 23:05:35 +0530",
        "fetched_at": "2026-02-06 18:34:50.713168"
    },
    {
        "title": "Kerala MP moves private Bill to conduct Census every ten years",
        "content": "News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Published - February 06, 2026 10:51 pm IST - NEW DELHI IUML MP Haris Beeran speaks in Rajya Sabha during the Budget Session in New Delhi on February 6, 2026. Photo: Sansad TV via ANI. Kerala MP Haris Beeran has moved a Private Member’s Bill in the Rajya Sabha to amend the Census Act, 1948 to insert a provision to conduct at least one Census in the whole of India every ten years. Mr. Beeran, who belongs to the Indian Union Muslim League (IUML), moved the Census Amendment Bill, 2024, arguing that the conduct of a Census for the entire country at a regular interval is a must, as a majority of the country’s population would otherwise be unable to access several schemes, benefits and services. “Neither the Constitution nor the Census Act, 1948 as it stands today, mandates a census to be conducted at regular intervals. However, the census on the national level has so far been conducted every ten years,” the Bill said. The last Population Census in India was conducted in 2011. The next edition, expected in 2021, was initially delayed due to the COVID-19 pandemic. The first phase of the next Census exercise will now start on April 1 and conclude in February 2027, a delay of six years from the regular schedule. The Amendment Bill said that a “periodical census is a legal imperative for the reason that constitutionally-mandated policies of social justice, which include reservations in electoral constituencies, education and public employments, cannot be pursued effectively without correct population data, particularly caste-wise data.” It added that detailed caste-wise data is necessary to avoid and correct wrongful inclusions of undeserving castes and exclusions of deserving castes, and to guard against a few dominant castes in a reserved category crowding out others. “It is also needed for sub-categorising castes within a reserved category and to determine the income/wealth criterion for the creamy layer. It is also a moral imperative for the reason that the absence of detailed caste-wise data has helped a coterie of elites, among upper castes and dominant Other Backward Classes (OBCs), to corner a disproportionate share of the nation’s assets, incomes, and positions of power,” the Bill said. The first Census of Independent India was conducted in 1951 and the Union government continued the practice of conducting a national Census every ten years after that, without any delays, until 2011. The Bill noted that te Census to be conducted in 2021 was postponed due to the pandemic and the country still awaits a nationwide data collection. Published - February 06, 2026 10:51 pm IST Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/kerala-mp-moves-private-bill-to-conduct-census-every-ten-years/article70601298.ece",
        "date": "Fri, 06 Feb 2026 22:51:40 +0530",
        "fetched_at": "2026-02-06 18:34:51.863440"
    },
    {
        "title": "Delhi Biker Dies After Crashing Into Jal Board Pit, Water Minister Announces Ex-Gratia Of Rs 10 Lakh",
        "content": "A motorcyclist was found dead inside a massive pit at a road construction site in West Delhi’s Janakpuri area on Friday morning, triggering allegations of negligence from his family. The deceased was identified as Kamal, a resident of Kailashpuri. The Delhi government later ordered a probe into the case, Urban Development Minister Ashish Sood confirmed. Water Minister Parvesh Verma has announced an ex gratia of Rs 10 lakh for the family of the deceased. The Delhi Jal Board has also set up a committee to probe the death of the motorcyclist who allegedly fell into a construction pit dug by the water agency. According to the relatives of the man, he was returning home late on Thursday from his office in the Rohini area and had remained in touch with family members during the commute. When he failed to reach home, they began searching for him, visiting several police stations through the night, including those in Janakpuri, Sagarpur, Vikas Puri and Rohini. Family members said they received a call from the police around 7.30 am informing them about an accident. When they reached the site, they found Kamal’s body inside the pit along with his motorcycle. #WATCH | Janakpuri, Delhi | A biker dies allegedly due to falling into a pit. Further details awaited. pic.twitter.com/7kja0wll1M— ANI (@ANI) February 6, 2026 They alleged negligence by the Delhi Jal Board, which was carrying out construction work at the location, and also raised the possibility of foul play, claiming someone might have killed Kamal and dumped his body in the manhole. Police said all angles were being examined. Responding to the incident, Delhi Jal Board has expressed “deep sorrow\" over the tragic accident that occurred at the pipeline rehabilitation project site in Janakpuri and conveyed its condolences to the bereaved family. A serious view has been taken of the tragic accident at the Janakpuri Line Rehabilitation Project site.Delhi Jal Board has constituted a high-level Inquiry Committee to ensure a transparent investigation into the incident. The Committee has been directed to:• Inspect the… — Parvesh Sahib Singh (@p_sahibsingh) February 6, 2026 The Board said a committee has been constituted to investigate the incident, and assured that strict action will be taken if negligence is found at any level. It added that regular inspections of safety measures are being carried out at all workplaces. The board has urged citizens to report any unsafe worksite on the toll-free helpline number 1916. According to news agency PTI, authorities received a call around 7 am about the incident in Janakpuri, following which personnel rushed to the spot. A senior officer told the agency that preliminary investigations indicated the pit was part of a Delhi Jal Board worksite and that it had been “properly barricaded.\" “We are investigating the matter to ascertain the exact sequence of events,\" the officer was quoted as saying. DELHI MAN FALLS TO DEATH IN PIT: THE POLICE’S VERSION According to the Delhi Police, the man worked at the HDFC Bank, and his daily shift usually ended at nearly 11 pm. On Thursday, as his shift ended, he called his family and informed them that he was at Janakpuri District Centre and was on his way home. As the police were informed about the family, at nearly 12.30 am, that Kamal had not reached home, a search for him began. Subsequently, the police traced his mobile phone’s location, which was nearly 200 mts away from the accident spot. The Delhi Police conducted a search operation in the area for nearly two hours during the night, with head constables searching the surroundings for any clues. Kamal’s body was found in the morning when someone reported that a man and a bike were lying in a pit. Police reached the spot, and a team from the fire brigade was called. The body was fished out at nearly 8.30 am. Saurabh Bharadwaj, Delhi unit chief of the Aam Aadmi Party, shared the pictures of the accident on his official X handle. In his post, Bharadwaj wrote, “Shocking !!! An innocent biker fell into a deep pothole on the road, got stuck, lay there all night, and died.\" “The BJP government in Delhi has learned nothing from the Noida incident. They just keep lying every day,\" he alleged. The incident comes weeks after a similar case in Noida, where 27-year-old software engineer Yuvraj Mehta died after his car fell into a waterlogged pit near a construction site. The incident had happened in Sector 150 area during the intervening night of January 16 and 17. In the recent case, authorities in Delhi said forensic teams and local officers were reconstructing the sequence of events in Kamal’s case, examining whether safety barricades were intact, checking nearby CCTV footage and recording statements from witnesses and family members. Officials stressed that no conclusion would be drawn until the probe is completed.",
        "link": "https://www.news18.com/india/dehli-man-falls-into-pit-with-motorcycle-delhi-motorcyclist-dead-janakpuri-manhole-visuals-delhi-police-delhi-jal-board-ws-l-9883515.html",
        "date": "Fri, 6 Feb 2026 23:06:48 +0530",
        "fetched_at": "2026-02-06 18:35:39.148439"
    },
    {
        "title": "Ex-Anna University V-C urges Governor, CM to bury the hatchet over V-C appointments",
        "content": "Looking at World Affairs from the Indian perspective. News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Published - February 06, 2026 10:22 pm IST - Chennai Former Anna University Vice Chancellor, E. Balagurusamy, on Friday urged Governor R.N. Ravi and Chief Minister M.K. Stalin to arrive at a ‘temporary, pragmatic compromise’ for appointment of Vice Chancellors to the Tamil Nadu’s public universities. In an open letter, Prof. Balagurusamy proposed the consensual use of existing university Acts and established conventions for appointment of Vice Chancellors either on an interim or a regular basis as a possible way forward. This would, however, be subject to the final outcome of judicial review. The absence of VCs in several universities has led to “administrative paralysis, delayed academic decisions, stalled faculty recruitment and promotions, uncertainty in financial governance, and a growing erosion of academic morale”, he added. A consensus between the Governor and the State government would “restore academic and administrative stability, protect the interests of students and faculty, demonstrate statesmanship and constitutional maturity, and reaffirm that higher education remains above political and constitutional conflict”, he averred. Published - February 06, 2026 10:22 pm IST Terms & conditions | Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/ex-anna-university-v-c-urges-governor-cm-to-bury-the-hatchet-over-v-c-appointments/article70601093.ece",
        "date": "Fri, 06 Feb 2026 22:22:18 +0530",
        "fetched_at": "2026-02-06 17:00:32.042080"
    },
    {
        "title": "Adilabad police arrest seven-member gang for duping 26 people of Rs 1.03 crore on pretext of finding gold treasure",
        "content": "Looking at World Affairs from the Indian perspective. News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Published - February 06, 2026 09:57 pm IST - ADILABAD The Adilabad police busted a seven-member gang of tricksters for duping 26 gullible persons to the tune of Rs 1.03 crore on the pretext of finding gold treasures. All the seven members of the gang, including its kingpin, have been arrested, Superintendent of Police Akhil Mahajan said. The gang led by Darshanala Rajkumar, 23, a fake ‘baba’, of Pippalkoti village, allegedly cheated several gullible persons in the name of gold treasure finds in Bheempur, Neradigonda, Boath and various other mandals in the district over the past few months. The modus operandi of the gang was to collect money from gullible victims with false promises of warding off their troubles and finding hidden gold treasures. The gang was involved in as many as 12 cases reported under various police station limits in the district. The police have recovered a car, a bike, seven mobile phones and earthen pots meant to stock fake gold coins used in the crime. Published - February 06, 2026 09:57 pm IST Terms & conditions | Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/telangana/adilabad-police-arrest-seven-member-gang-for-duping-26-people-of-rs-103-crore-on-pretext-of-finding-gold-treasure/article70600679.ece",
        "date": "Fri, 06 Feb 2026 21:57:54 +0530",
        "fetched_at": "2026-02-06 17:00:32.653893"
    },
    {
        "title": "Service organisations welcome five-day week proposal for govt. staff",
        "content": "Looking at World Affairs from the Indian perspective. News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Published - February 06, 2026 09:41 pm IST - THIRUVANANTHAPURAM Service organisations in general welcomed the move to introduce a five-day week in government offices at a meeting called by Chief Secretary A. Jayathilak here on Friday. The weekly loss of seven working hours resulting from a five-day week can be made up by rearranging the daily working hours, the organisations suggested. At the same time, the number of holidays currently available to the employees should not be reduced under the proposed system, they said. Mr. Jayathilak had convened the online meeting to collect the feedback of the organisations. General Administration secretary K. Biju also was present. At the meeting, however, the government had not presented a detailed plan, which invited criticism from the organisations. Organisations representing government doctors and medical college teaching staff urged the government to hold separate meetings to discuss specific issues affecting them under the proposal. The representatives of around 80 organisations, including the NGO Union, NGO Association, Joint Council, Secretariat Action Council, Kerala Secretariat Association, NGO Sangh and the Kerala Secretariat Employees Association, attended Friday’s meeting. The government proposal for a five-day week is reportedly aimed at slashing operational expenses and government expenditure in general. The Kerala Secretariat Association said in a statement that the government was yet to make public its own proposal with respect to the five-day work week. The government should do so at the earliest, the association said. The association also urged the government to consider the possibility of introducing flexible working hours for the employees. Published - February 06, 2026 09:41 pm IST Terms & conditions | Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/kerala/service-organisations-welcome-five-day-week-proposal-for-govt-staff/article70601210.ece",
        "date": "Fri, 06 Feb 2026 21:41:10 +0530",
        "fetched_at": "2026-02-06 17:00:33.267436"
    },
    {
        "title": "Student team from Puducherry wins Wipro earthian award",
        "content": "Looking at World Affairs from the Indian perspective. News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Updated - February 06, 2026 09:31 pm IST - PUDUCHERRY A team of students from the Shree Bharath Vidyaashram CBSE Senior Secondary School, Puducherry was among the recipients of the Wipro earthian Awards 2025. | Photo Credit: Special Arrangement A team of students from Shree Bharath Vidyaashram CBSE Senior Secondary School, Puducherry is among the recipients of the Wipro earthian Awards 2025. A press note from Wipro Limited, which recently hosted the 15th edition of the Wipro earthian Awards 2025 at Azim Premji University, Bengaluru, said Anurag Behar, Chief Executive Officer, Azim Premji Foundation, and Narayan P. S., Global Head of Sustainability and Societal Initiatives, Wipro Limited, and Managing Trustee, Wipro Foundation, presented certificates and cash prizes to the winning teams. The annual programme seeks to promote integrated sustainability education and recognises schools and colleges across India that demonstrate meaningful and enduring engagement with sustainable practices and principles. The team from the Puducherry school, comprising S. Prithisha, G. Varshini, S. Tanika, K. Dulasi, A. Taynshika, and guided by their teacher R. Arun Kumar, was among the 25 winning teams chosen by an independent jury that evaluated over 2,000 submissions for the 2025 Wipro earthian programme. The projects showcased fresh insight into biodiversity, waste, and water, combining hands-on activities with reflective written work. The team from Puducherry led a large‑scale plastic cleanup and awareness drive in the Murungapakkam mangrove forest, where 79 students collected, segregated, and documented plastic waste in just 79 minutes. Through interactions with local residents and municipal officials, they learned about poor segregation, household dumping, and inadequate waste infrastructure affecting the mangrove ecosystem. Aiming for the Bipin Rawat World Record 2025, the initiative combined science, civic action, and media outreach, resulting in a student‑driven environmental movement and a sustainable action plan for long-term mangrove conservation, the press note said. Published - February 06, 2026 09:27 pm IST Terms & conditions | Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/student-team-from-city-wins-wipro-earthian-award/article70601293.ece",
        "date": "Fri, 06 Feb 2026 21:31:58 +0530",
        "fetched_at": "2026-02-06 17:00:33.871834"
    },
    {
        "title": "CyberPeace Summit 2026 to address cybercrime, AI risks, misinformation",
        "content": "Looking at World Affairs from the Indian perspective. News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Published - February 06, 2026 09:20 pm IST - NEW DELHI The convergence of AI and cybersecurity has given rise to hybrid professional roles. | Photo Credit: Getty Images/iStockPhoto The Global CyberPeace Summit 2026, to be organised from February 8 to 10, will focus on pressing digital challenges ranging from cybercrime, AI risks, misinformation, and critical infrastructure protection to digital governance. “Through policy dialogues, capacity-building sessions, and collaborative initiatives, the summit aims to deliver actionable outcomes for a safer, more resilient digital world,” read a statement by non-profit CyberPeace. The organisers said the summit would bring together governments, parliamentarians, law enforcement agencies, defence and diplomatic leadership, technology platforms, industry, academia, civil society, and everyday internet users to collectively address the challenges shaping the global digital ecosystem. On Thursday, the curtain-raiser was addressed by Major Vineet Kumar, founder and global president of CyberPeace; its global chief executive officer and chief mentor S.N. Pradhan (former Indian Police Service officer); and its chief technical officer M.A.K.P. Singh. On February 8-9, at the United Services Institution of India, the focus will be on “Trust & Safety capacity building through hackathons and buildathons”. On February 10, the summit is expected to record over 1,000 participants. Published - February 06, 2026 09:20 pm IST Terms & conditions | Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/cyberpeace-summit-2026-to-address-cybercrime-ai-risks-misinformation/article70601009.ece",
        "date": "Fri, 06 Feb 2026 21:20:05 +0530",
        "fetched_at": "2026-02-06 17:00:34.490278"
    },
    {
        "title": "Karnataka High Court stays FIR against private drone development firm; seeks explanation from police inspector",
        "content": "Looking at World Affairs from the Indian perspective. News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Published - February 06, 2026 09:07 pm IST - Bengaluru The High Court of Karnataka on Friday directed a police inspector to explain his conduct of not giving a copy of the First Information Report (FIR) and making officials of a private firm, engaged in research, development and testing of drone and unmanned aerial vehicles, to sit in the police station for over six hours and demanding the company’s financial and other details. The court also stayed the investigation based on the FIR registered suo motu by the Doddaballapur Rural police on January 29 against unknown persons initially and notices issued to the officials of the company on January 30. The FIR was registered under Sections 125 (an act endangering life or personal safety of others) and 329(3) (criminal trespass) of the Bharatiya Nyaya Sanhita. Justice M. Nagaprasanna passed the interim order on the petition filed by Bengaluru-based Newspace Research and Technologies, which supplies drones to Indian armed forces and has its testing centre on a leased land spread over 48 acres in Doddaballapur. It has been stated in the petition that a lightweight research drone belonging to the company suffered a battery malfunction during routine test and glided beyond the boundary of its premises and landed smoothly in a neighbouring property on June 29. However, the company did not take up search activity as it was dark. Later, a police constable, based on an alert received through police control room, came to the spot and took the drone to the police station and then the FIR was registered against unknown persons on the same day. However, on January 30 the notice was served on the company officials. The officials pointed out to the police inspector that the company is a licensed drone research and testing agency under the control of Director General of Civil Aviation, its testing are legally permitted activity under Drones Rules, 2021 and other laws, besides explaining the circumstance under which it glided away from its boundary and landed on neighbouring property. However, police inspector Sadiq Pasha refused to give a copy of the FIR and wanted the managing director of the company to come to the police station and provide details of number of employees working, turnover, revenue, etc., and made the officials sit in the station for about six hours. Finally, the copy of FIR was provided after company’s legal adviser said that they would be compelled to complaint to the Lokayukta. Published - February 06, 2026 09:07 pm IST Terms & conditions | Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/karnataka/karnataka-high-court-stays-fir-against-private-drone-development-firm-seeks-explanation-from-police-inspector/article70601080.ece",
        "date": "Fri, 06 Feb 2026 21:07:23 +0530",
        "fetched_at": "2026-02-06 17:00:35.147061"
    },
    {
        "title": "Will consider high-speed rail if State interested, says Union Minister",
        "content": "Looking at World Affairs from the Indian perspective. News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Updated - February 06, 2026 09:35 pm IST - THIRUVANANTHAPURAM As the political slugfest around rail development continues, Union Railway Minister Ashwini Vaishnaw on Friday said in the Rajya Sabha that the SilverLine semi-high-speed rail project proposed by Kerala was not feasible as it had a major environmental impact. The Minister, who criticised the State for its non-cooperation in rail development works, said the Centre was ready to consider the high-speed rail project if the State was interested. In the case of the Sabari rail project, the Union Minister said the Kerala Chief Minister and the State government had been approached several times regarding the Angamaly–Sabarimala railway line. After persistent persuasion, the Chief Minister initiated the land acquisition process, possibly because of the upcoming elections, he said. He expressed hope that the acquisition would continue beyond the elections. In the meantime, technocrat E. Sreedharan said in a statement that the State government’s move to go ahead with the Regional Rail Transit System (RRTS) was either out of ignorance or with the sole intention to derail the proposed high-speed rail in Kerala. The concept of RRTS was brought in by the Government of India for the first time as part of the New Metro Rail Policy, 2017. Regional rail catered to passenger services within a larger urban agglomerate or metropolitan area, connecting the outskirts to the centre of the city. The services have a greater number of halts at smaller distances. RRTS are common in large metropolitan cities and help in decongesting the city centre by providing safe and speedy access to the city centre. In short, it is nothing but a mass rapid transit system. In addition, RRTS is not an accepted railway system, and it cannot be planned and executed under the ‘Railway Act’. It is a transit mode under the mass rapid transit system to be designed and constructed under the “Metro Act”. Therefore, it does not come under Indian Railways but under the Ministry of Housing and Urban Affairs. Against this background, how can the Kerala government plan a long railway line from Thiruvananthapuram to Kasaragod terming it as RRTS, he asked. Last week, taking a dig at Mr. Sreedharan, Chief Minister Pinarayi Vijayan said at a public function that he, along with K.V.Thomas, special representative of Kerala in New Delhi, had met the Union Railway Minister seeking a high-speed-rail project for the State as advised by Mr. Sreedharan. However, the State had not received any reply from the Centre regarding the project to date. It was against the backdrop of the continued neglect by the Centre that the State decided to move ahead with the RRTS project. Published - February 06, 2026 09:02 pm IST Terms & conditions | Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/kerala/will-consider-high-speed-rail-if-state-interested-says-union-minister/article70600705.ece",
        "date": "Fri, 06 Feb 2026 21:35:53 +0530",
        "fetched_at": "2026-02-06 17:00:35.826727"
    },
    {
        "title": "Srikalahasti Brahmotsavam in tune with Agama principles, says Minister",
        "content": "Looking at World Affairs from the Indian perspective. News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Published - February 06, 2026 09:02 pm IST - TIRUPATI Srikalahasti MLA Bojjala Venkata Sudheer Reddy formally greeting Minister for Endowments Anam Ramanarayana Reddy at Srikalahasti temple in Tirupati on Friday. Collector S. Venkateswar is also seen. | Photo Credit: BY ARRANGEMENT The annual Srikalahastheeswara Swamy Brahmotsavam will be conducted in a grand manner and in tune with the Agamic principles, said Minister for Endowments Anam Ramanarayana Reddy on Friday (February 06, 2026). Participating in a review meeting at the temple in Srikalahasti town ahead of the grand festival that runs concurrent with ‘Mahasivaratri’, the Minister said that the primary goal of the event administrators would be to follow the Agamic principles and adhere to the norms, in letter and spirit, as stipulated in the doctrines of Sanatana Dharma. “The State government has decided to conduct the event in a spectacular manner in Srikalahasti, which is one of the major Saivite temples in Andhra Pradesh. The grandeur will not, however, come in the way of religiously observing the doctrine of worship,” the Minister said. Keeping in view the heavy rush expected to converge at the temple during the festival, Mr. Reddy said that two special darshan queues would be allowed with an entry ticket of ₹200 and ₹500, while the free queue line will also be available for the common pilgrims. Principal Secretary (Endowments) Hari Jawaharlal said that more volunteers would be roped in this time to help manage the queue lines and serve the visiting pilgrims, while Collector S. Venkateswar assured that the scale of celebration would certainly get bigger than last year. Srikalahasti MLA Bojjala Venkata Sudheer Reddy offered to distribute pocket calendars and ‘mini Pasupu Kunkuma Prasadam’ to every devotee visiting the shrine during the event. Endowments Commissioner Ramachandra Mohan announced that steps would be taken to popularise the event in the other States. Superintendent of Police L. Subbarayudu said that the entire temple area would be brought into the CCTV network and surveillance enhanced through command control, in order to prevent any untoward incident. Temple trust board chairman Kotte Saiprasad and Executive Officer T. Bapi Reddy took part. Published - February 06, 2026 09:02 pm IST Terms & conditions | Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/srikalahasti-brahmotsavam-in-tune-with-agama-principles-says-minister/article70600881.ece",
        "date": "Fri, 06 Feb 2026 21:02:09 +0530",
        "fetched_at": "2026-02-06 17:00:36.431092"
    },
    {
        "title": "Representatives of textile industry and traders’ bodies meet Chief Minister M.K. Stalin",
        "content": "Looking at World Affairs from the Indian perspective. News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Published - February 06, 2026 08:55 pm IST - CHENNAI Chief Minister M.K. Stalin with the representatives of textile industry bodies and traders at the Secretariat on Friday. | Photo Credit: Special arrangement Representatives of various textile industry bodies and the Tamil Nadu Vanigar Sangangalin Peramaippu called on Tamil Nadu Chief Minister M.K. Stalin at the Secretariat in Chennai on Friday. An official release said representatives from the Confederation of Indian Textile Industry, Cotton Textiles Export Promotion Council, Synthetic and Technical Textiles Export Promotion Council, Powerloom Development and Export Promotion Council, Southern India Mills’ Association; South India Textile Research Association; CII Tamil Nadu Textile Panel; Tiruppur Exporters’ Association; Karur Textile Manufacturer Exporters’ Association and others called on Mr. Stalin. They thanked him for the various announcements made at the recently held textile conference at the CODISSIA Trade Fair Complex in Coimbatore. These announcements included a 20% capital investment subsidy for textile companies to purchase advanced weaving and knitting machinery, with an annual allocation of ₹30 crore, and the extension of the 6% interest subsidy scheme for the purchase of pre-spinning and post-spinning machinery. Separately, the Tamil Nadu Vanigar Sangangalin Peramaippu representatives, headed by its State president A.M. Vikramaraja, also called on Mr. Stalin and thanked him for extending the time limit for free welfare board membership registration for traders and for issuing orders reducing rents for HR&CE Department properties. Published - February 06, 2026 08:55 pm IST Terms & conditions | Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/representatives-of-textile-industry-and-traders-bodies-meet-chief-minister-mk-stalin/article70599666.ece",
        "date": "Fri, 06 Feb 2026 20:55:25 +0530",
        "fetched_at": "2026-02-06 17:00:37.031655"
    },
    {
        "title": "VTU makes prototype projects mandatory for engineering students",
        "content": "Looking at World Affairs from the Indian perspective. News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Published - February 06, 2026 08:53 pm IST - Bengaluru S. Vidyashankar, Vice-Chancellor, VTU, and Chandrashekar Nagaraju, CEO, Chiac ASI Company, U.K., at an MoU signing in Bengaluru on Friday. | Photo Credit: ALLEN EGENUSE J. The Visvesvaraya Technological University (VTU) has announced that all engineering students under its jurisdiction will have to henceforth develop a prototype project, either machinery or services. A separate app will be developed to monitor these projects, said Prof. S. Vidya Shankar, Vice-Chancellor, VTU. Speaking at a press conference in the city on Friday, he said students have to step out, identify the problems in various fields, analyse them, and find a solution by the end of their first semester. For this, VTU will award one credit to students. “This will provide students with necessary skill training and real-time work experience and make them employable. VTU will include skill programmes, prototyping, idea developing, and design thinking in the first semester itself, to make students entrepreneurs, instead of job seekers,” he said. “A separate app will be developed to monitor these projects, and students will have to upload the prototypes they have developed on this app. These will be examined and given credit points,” Prof. Vidya Shankar explained. VTU has already provided training to 2,000 students in collaboration with ERA Foundation in this regard, he said, adding that a demonstration of the prototypes developed by these students will be organised at all VTU centers on February 28. VTU signed a Memorandum of Understanding (MoU) with Chiac ASI, a United Kingdom-based company, said to be one of the first Super Intelligence firms, to train engineers in Artificial Super Intelligence (ASI), a future technology. “ASI is poised to create a revolution by 2030, while also controlling the ever-expanding AI. By adopting this, VTU students will be introduced to future technology. In addition, Chiac ASI will provide free internships to more than a thousand students and ASI textbooks to engineering college lecturers for effective teaching. These are not ordinary books; rather, they are self-updating research textbooks that evolve as research develops. Workshops have also been conducted for lecturers in VTU-affiliated colleges on this technology,” he added. Chandrashekar Nagaraju, Chief Executive Officer, Chiac ASI, said that from a national security perspective, it was an urgent necessity for India to establish leadership in the field of ASI before 2030. “The United States of America (USA) and China are already advancing technology at great speed. In this regard, our goal is to shape one million engineering talents in India to work in this field. As the world’s largest technological university, VTU is ready to produce 400,000 skilled engineers trained in ASI. This is a highly significant contribution to the nation,” he said. Published - February 06, 2026 08:53 pm IST Terms & conditions | Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/karnataka/vtu-makes-prototype-projects-mandatory-for-engineering-students/article70600500.ece",
        "date": "Fri, 06 Feb 2026 20:53:13 +0530",
        "fetched_at": "2026-02-06 17:00:37.640112"
    },
    {
        "title": "‘Empower Nilgiris’ portal launched for donations to support causes and projects in The Nilgiris",
        "content": "Looking at World Affairs from the Indian perspective. News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Published - February 06, 2026 08:50 pm IST - UDHAGAMANDALAM Dignitaries at the third edition of the Nilgiris Economic Dialogue that began in Udhagamandalam on Friday. | Photo Credit: SATHYAMOORTHY M The Nilgiris District Collector, Lakshmi Bhavya Tanneeru, announced the launch of the ‘Empower Nilgiris’ portal, described as being a “dedicated portal to bring together individuals, institutions and CSR contributors who wish to support meaningful causes and projects in the Nilgiris,” on Friday. Ms. Tanneeru made the announcement at the inauguration of the third edition of the Nilgiris Economic Dialogue, which is being held in Udhagamandalam till Sunday. “Very often, well-intentioned donors want to contribute, but are unsure where to begin, whom to approach or how to ensure transparency and measurable impact,” said Ms. Tanneeru, who went onto state that the ‘Empower Nilgiris’ portal has been launched with the intention of bridging such gaps by curating “verified, needs-based-projects across sectors.” The portal allows donors two clear modes of contributing. “First, the donors may take up and implement a project in its entirety in coordination with the district administration and concerned department, or secondly, they can contribute funds to concerned government departments, which will then implement the project as per the norms,” said the collector. “In both cases, the emphasis is on transparency, accountability and outcomes. The portal provides mechanisms to track progress, monitor implementation and ensure that the contributions translate into real, on-ground impact,” she added. Donors can access more information through the website www.empowernilgiris.org. Ms. Tanneeru said that the portal allows contributions to be made easier, transparent and effective, without donors having to navigate multiple offices and informal channels. “The Nilgiris has always attracted people who care about nature, about communities and the future. ‘Empower Nilgiris’ is an attempt to channel that goodwill into a structured, credible and result-oriented framework,” said the Collector, who went onto add that development in places like the Nilgiris cannot be measured by economic indicators, but in how ecosystems are protected and how equitably livelihoods are supported. Present at the inauguration was Unnikrishnan A.R., Chairman of Confederation of Indian Industries (CII) Tamil Nadu; P. Ravichandran, Deputy Chairman, CII Southern Region; Thomas John Muthoot, Chairman CII Southern Region; Shankar Vanavarayar, Convenor of the Nilgiris Economic Dialogue, and C. Devarajan, Vice-Chairman, CII Tamil Nadu State Council. Published - February 06, 2026 08:50 pm IST Terms & conditions | Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/cities/Coimbatore/empower-nilgiris-portal-launched-for-donations-to-support-causes-and-projects-in-the-nilgiris/article70599669.ece",
        "date": "Fri, 06 Feb 2026 20:50:07 +0530",
        "fetched_at": "2026-02-06 17:00:38.241816"
    },
    {
        "title": "Kerala government reiterates stand against NPR; issues fresh notification ahead of Census",
        "content": "Looking at World Affairs from the Indian perspective. News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Published - February 06, 2026 08:39 pm IST - THIRUVANANTHAPURAM The Kerala government has issued a fresh notification to reaffirm that the National Population Register (NPR) will not be implemented in the State under any circumstances. The order comes even as preparations begin for the upcoming national Census. The gazette notification, issued by the General Administration (Protocol) department on Thursday, reiterates that all activities related to the updation of the NPR in Kerala have remained suspended with effect from December 20, 2019. According to the Chief Minister’s Office (CMO), the notification has been issued to remove any ambiguity amid speculation that the NPR could be conducted along with the Census exercise. In a statement on Friday, the CMO stated that the government had ordered a complete halt to all procedures connected with the NPR as early as 2019 when the Centre proposed its implementation along with the Census. Subsequently, the Census process itself was stalled nationwide due to the COVID-19 pandemic. With indications that the Census operations may resume across the country from next year, concerns have resurfaced that NPR-related exercises could be revived as part of the process. Moreover, the Union Budget 2026-27 made allocations for the NPR and Census, triggering further discussions in this regard after a hiatus. The Left Democratic Front (LDF) government has consistently maintained that the NPR will not be implemented in Kerala. The State was also the first in the country to pass a resolution in the Legislative Assembly opposing the Citizenship (Amendment) Act (CAA). The State government had also challenged the constitutional validity of the CAA by filing a suit against the Centre in the Supreme Court. Published - February 06, 2026 08:39 pm IST Terms & conditions | Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/kerala/kerala-government-reiterates-stand-against-npr-issues-fresh-notification-ahead-of-census/article70600936.ece",
        "date": "Fri, 06 Feb 2026 20:39:06 +0530",
        "fetched_at": "2026-02-06 17:00:38.863562"
    },
    {
        "title": "T.N. govt. transfers 13 police officers",
        "content": "Looking at World Affairs from the Indian perspective. News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Published - February 06, 2026 08:36 pm IST - CHENNAI The State government on Friday ordered the transfer of 13 police officers including 10 Indian Police Service (IPS) officers. According to the order, Ankit Singh, Assistant Superintendent of Police, Kumbakonam Sub-Division, Thanjavur district has been promoted to the rank of Superintendent of Police and posted as Deputy Commissioner of Police, North, Salem City, in place of N.U. Sivaraman, who has been posted as Superintendent of Police, Vellore district. Shristi Singh, Assistant Superintendent of Police, Pollachi Sub-Division, Coimbatore district, has been promoted to the rank of Superintendent of Police and posted as Deputy Commissioner of Police, South, Tiruchi City, in place of T. Eswaran, who has been posted as Deputy Commissioner of Police, Traffic, Avadi Police Commissionerate. S. Rajeswari, Inspector General of Police and Member Secretary, Tamil Nadu Uniformed Services Recruitment Board, has been transferred and posted as Inspector General of Police, Crime Against Women and Children, Chennai, in place of A. Kayalvizhi, who has been posted as Inspector General of Police and Member Secretary, Tamil Nadu Uniformed Services Recruitment Board. R.V. Ramya Bharati, Inspector General of Police on compulsory wait in the DGP/HoPF office, has been posted as Inspector General of Police, Crime, Chennai, in place of P.K. Senthil Kumari. A. Mylvaganan, Superintendent of Police, Vellore district, has been transferred and posted as Superintendent of Police, Vigilance and Anti-Corruption, Southern Range, Chennai. G. Nagajothi, Superintendent of Police, Tamil Nadu Uniformed Services Recruitment Board, Chennai has been transferred and posted as Principal, Police Training College, Chennai. I. Eswaran, Superintendent of Police, Railways, Chennai, has been transferred and posted as Deputy Commissioner of Police, Anna Nagar, in place of R. Udhayakumar, who has been transferred and posted as Deputy Commissioner of Police, Koyambedu. Sujit Kumar, Deputy Commissioner of Police, Koyambedu, has been transferred and posted as Deputy Commissioner of Police, Traffic West, in place of R. Sughasini, who has been transferred and posted as Superintendent of Police, Tamil Nadu Uniformed Services Recruitment Board, Chennai. Published - February 06, 2026 08:36 pm IST Terms & conditions | Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/tn-govt-transfers-13-police-officers/article70599893.ece",
        "date": "Fri, 06 Feb 2026 20:36:34 +0530",
        "fetched_at": "2026-02-06 17:00:39.490118"
    },
    {
        "title": "24 booked in Cyberabad drive against wrong-side driving in Madhapur",
        "content": "Looking at World Affairs from the Indian perspective. News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Published - February 06, 2026 08:34 pm IST - HYDERABAD Criminal cases were registered against 24 two-wheeler riders for wrong-route driving during a special enforcement drive conducted by Cyberabad traffic police in Madhapur on Friday. The drive was carried out along the 100-feet road, Cyber Towers, COD junction, Durgam Cheruvu and the Mindspace stretch under the Madhapur Traffic police station limits. Officials said the operation was aimed at curbing the growing menace of motorists flouting traffic rules and endangering other road users. Madhapur Traffic Inspector A. Sridhar Kumar noted that until now, police had been issuing challans for such violations, but many commuters were taking the offence lightly. “Wrong-route driving has become a serious safety concern. Despite repeated penalties, violations continued. As per the Commissioner’s orders, we have now started booking criminal cases to act as a stronger deterrent,” he said. Published - February 06, 2026 08:34 pm IST Terms & conditions | Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/cities/Hyderabad/24-booked-in-cyberabad-drive-against-wrong-side-driving-in-madhapur/article70600487.ece",
        "date": "Fri, 06 Feb 2026 20:34:20 +0530",
        "fetched_at": "2026-02-06 17:00:40.089101"
    },
    {
        "title": "Kerala HC directs imposing of fine on unauthorised boards, banners in public spaces",
        "content": "Looking at World Affairs from the Indian perspective. News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Published - February 06, 2026 08:31 pm IST - KOCHI The Kerala High Court has directed that special drives be conducted by joint secretaries of the Local Self-Government (LSG) department to remove unauthorised boards, banners and flags from public spaces, and to impose fine on those who installed them. On their part, the secretaries of local bodies too must clear such materials from public spaces. The special drives must be concluded in a fortnight, following which the Principal Secretary of the LSG department must submit a report on this to the court. Officials who do not adhere to the order would have to appear online before the court and submit their explanation, said a Bench of Justice Devan Ramachandran on Friday. The amicus curie who had been appointed in this regard submitted before the court that unauthorised boards, flags etc. have begun to reappear at many places in Kerala, including in Ernakulam district. To this, the court observed that secretaries of these local bodies who failed to impose fines on the violatiors, should quit their post. The rule violators include the ruling fronts in the Centre and the State, who cite the excuse that the boards and similar materials were placed by migrant workers, said the court and reminded that the police too ought to play their part in ending the menace posed by such unauthorised materials. Published - February 06, 2026 08:31 pm IST Terms & conditions | Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/kerala/kerala-hc-directs-imposing-of-fine-on-unauthorised-boards-banners-in-public-spaces/article70600912.ece",
        "date": "Fri, 06 Feb 2026 20:31:19 +0530",
        "fetched_at": "2026-02-06 17:00:40.702450"
    },
    {
        "title": "Prasanth Ezhavan wins first P.K. Rosy Film Award",
        "content": "Looking at World Affairs from the Indian perspective. News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Published - February 06, 2026 08:25 pm IST - THIRUVANANTHAPURAM Prasanth Ezhavan, who directed the film Oru Jaathi Pillerishta, has been chosen for the first P.K. Rosy Film Award instituted by the P.K. Rosy Foundation in memory of the first female actor in Malayalam cinema. The film is set in the background of the reservation for Economically Weaker Sections (EWS) and its impact on students from Dalit and Other Backward Classes. The jury observed that the director has used the medium as a tool for social transformation. Published - February 06, 2026 08:25 pm IST Terms & conditions | Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/kerala/prasanth-ezhavan-wins-first-pk-rosy-film-award/article70600933.ece",
        "date": "Fri, 06 Feb 2026 20:25:20 +0530",
        "fetched_at": "2026-02-06 17:00:41.303864"
    },
    {
        "title": "₹236 crore sanctioned for development works in Nellore Rural, says MLA",
        "content": "Looking at World Affairs from the Indian perspective. News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Published - February 06, 2026 08:17 pm IST - NELLORE MLA Kotamreddy Sridhar Reddy displaying Nellore Rural constituency map at a media conference on Friday. | Photo Credit: By Arrangement Nellore Rural MLA Kotamreddy Sridhar Reddy on Friday (February 06, 2026) announced that the government has released funds to the tune of ₹236 crore for the development of the constituency and that works will be launched soon. The project involves laying of a 200 km-long pipeline to connect to all the merged villages in the predominantly-rural constituency. Water tanks will be built at a cost of ₹125 crore in Parameswari Nagar, YSR Nagar, Akkacheruvupadu, and Ambapuram to rid the backward areas of drinking water crisis. Similarly, ₹111 crore would be used to lay underground drainage system (UDS) for a running length of 51 km in six divisions of the Nellore city. Speaking to the media, Mr. Sridhar Reddy recalled that his pleas for sanction of funds had fallen on deaf ears during the erstwhile YSR Congress Party regime, but the NDA government was quick to respond and sanction funds profusely, giving a concrete shape to his dream of making Nellore Rural ‘a developed constituency’. He thanked Chief Minister N. Chandrababu Naidu, HRD Minister Nara Lokesh, district Ministers P. Narayana and Anam Ramanarayana Reddy, district in-charge minister N. Md. Farook and Member of Parliament Vemireddy Prabhakar Reddy for their positive intervention in getting the funds sanctioned. Mr. Sridhar Reddy announced that the works would be formally set in motion soon. Published - February 06, 2026 08:17 pm IST Terms & conditions | Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/236-crore-sanctioned-for-development-works-in-nellore-rural-says-mla/article70600762.ece",
        "date": "Fri, 06 Feb 2026 20:17:57 +0530",
        "fetched_at": "2026-02-06 17:00:41.910723"
    },
    {
        "title": "Government ropes in students for governance feedback through college consultations",
        "content": "Looking at World Affairs from the Indian perspective. News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Published - February 06, 2026 08:10 pm IST - THIRUVANANTHAPURAM With Assembly elections only a few months away, the Directorate of Collegiate Education has directed universities and colleges in Kerala to organise student consultation programmes as part of the State government’s Navakerala citizen response programme. In a formal communication, the institutions have been instructed to conduct student group discussions to collect suggestions and ideas related to governance and development. The consolidated suggestions will have to be uploaded to a citizen response programme portal to enable the formulation of the Left Democratic Front (LDF) government’s Vision 2031 policy. The directive comes close on the heels of a meeting chaired by the Special Secretary of the Information and Public Relations department on Wednesday, during which the modalities of student participation were finalised. The National Service Scheme (NSS) has been designated as the nodal agency for organising the programmes at the college level. Moreover, the details of students who have registered on the portal and are willing to participate in household surveys must be forwarded to the State-level coordinator of the programme. The communication also noted that the State government’s Vision 2031 seminars, which aim to position Kerala as “a progressive and developed State by 2031,” will commence from February 15. Colleges have been instructed to complete student-level discussions and upload consolidated suggestions to the portal before the date. The order has been circulated to all major universities, including Kerala University, APJ Abdul Kalam Technological University, Mahatma Gandhi University, Calicut University, Kannur University, and other higher education institutions. Published - February 06, 2026 08:10 pm IST Terms & conditions | Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/kerala/government-ropes-in-students-for-governance-feedback-through-college-consultations/article70600814.ece",
        "date": "Fri, 06 Feb 2026 20:10:24 +0530",
        "fetched_at": "2026-02-06 17:00:42.507836"
    },
    {
        "title": "Hyderabad undergoing infra transformation with 45 projects worth over ₹7,000 crore, says Telangana Deputy CM",
        "content": "Looking at World Affairs from the Indian perspective. News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Updated - February 06, 2026 09:06 pm IST - HYDERABAD (From left) CREDAI president N. Jaideep Reddy, Irrigation Minister N. Uttam Kumar Reddy, Deputy Chief Minister Mallu Bhatti Vikramarka, Chief Secretary K. Ramakrishna Rao and CREDAI Hyderabad president-elect B. Jagannath Rao at the inauguration of CREDAI Hyderabad Property Show at HITEX Exhibition Centre in Hyderabad on Friday. | Photo Credit: SPECIAL ARRANGEMENT Hyderabad is witnessing a significant phase of infrastructure expansion, with more than 45 projects worth over ₹7,000 crore currently under way across the city, said Telangana Deputy Chief Minister Mallu Bhatti Vikramarka on Friday. Speaking at the inauguration of the CREDAI Hyderabad Property Show 2026, he said the ongoing works include underpasses, major road widening projects and multi-level flyovers at key junctions. He added that dedicated infrastructure packages in Hi-Tec City, upgrades to the southern corridor and improvements in emerging growth corridors are aimed at ensuring balanced development across the city’s core areas and peripheral zones. The Deputy Chief Minister noted that long-term planning initiatives such as the Blue Green Master Plan and the Comprehensive Mobility Plan are focused on sustainable and climate-resilient urban growth. Irrigation Minister N. Uttam Kumar Reddy said Hyderabad’s growth is rooted in its inclusive and cosmopolitan legacy dating back to the Nizam era. He said the government has introduced simplified and digitised approval processes, along with proactive measures to ease departmental clearances, including irrigation-related approvals. Visitors at the Hyderabad Property Show -2026, hosted by the Confederation of Real Estate Developers Associations of India (CREDAI) at HITEX Exhibition Centre in Hyderabad on Friday. RAMAKRISHNA G. Chief Secretary K. Ramakrishna Rao said stamp and registration revenues in the State have grown by five to six times since 2014. Annual revenue from the Stamps and Registration Department, which stood at around ₹3,000 crore in 2014, has now increased to nearly ₹15,000 crore. The three-day property show will continue till February 8. The exhibition features over 300 RERA-approved projects, offering visitors access to verified residential and commercial developments, including apartments, villas, plotted layouts and office spaces across established and emerging areas of the city. Published - February 06, 2026 08:06 pm IST Terms & conditions | Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/cities/Hyderabad/hyderabad-undergoing-infra-transformation-with-45-projects-worth-over-7000-crore-says-telangana-deputy-cm/article70600664.ece",
        "date": "Fri, 06 Feb 2026 21:06:53 +0530",
        "fetched_at": "2026-02-06 17:00:43.108249"
    },
    {
        "title": "Former Union Minister demands thorough probe into death of forest watcher",
        "content": "Looking at World Affairs from the Indian perspective. News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Published - February 06, 2026 07:54 pm IST - Kalaburagi A Forest Department employee was reportedly found dead in his official quarters near the forest office in Bhalki town in Bidar district on Friday. Police have suspected it to be a case of suicide. The deceased has been identified as Ankush Sudham, 57, a forest watcher from Bolegaon village in Bhalki taluk. According to sources, he was found hanging in his residence on Friday morning. Former Union Minister Bhagwanth Khuba called for a thorough investigation into the incident, noting that it had occurred in the constituency of Forest, Environment and Ecology Minister Eshwar Khandre. He demanded a thorough probe into the matter and sought Mr. Khandre’s resignation until the investigation was completed. (Those in distress or having suicidal tendencies can seek help and counselling by calling Arogya Sahayavani 104.) Published - February 06, 2026 07:54 pm IST Terms & conditions | Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/karnataka/former-union-minister-demands-thorough-probe-into-death-of-forest-watcher/article70600753.ece",
        "date": "Fri, 06 Feb 2026 19:54:05 +0530",
        "fetched_at": "2026-02-06 17:00:43.733495"
    },
    {
        "title": "‘Aksharam Aarogyam’ programme launched in Kollam",
        "content": "Looking at World Affairs from the Indian perspective. News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Published - February 06, 2026 07:47 pm IST - KOLLAM The Health department, in collaboration with the General Education and Local Self-Governments departments, has launched Aksharam Aarogyam, a comprehensive school health and wellness programme. Aimed at students from Classes I to XII in all government and aided schools across the State, the objective of the project is to ensure early intervention and systematic health monitoring for the younger generation. In the initial phase, 61,264 primary school students (Classes I to IV) in the district will undergo thorough health screenings. Trained health care professionals will evaluate general physical health, vision and hearing impairments, and learning disabilities. All findings, along with essential data such as blood group and vaccination status, will be documented in a dedicated Health Card prepared by the Health department. The programme includes a robust follow-up system where students requiring specialised care after the primary screening will be referred to the nearest health centres for expert consultation. To ensure smooth implementation, specialised training sessions have already been conducted for health care workers across all health blocks in the district. Beyond physical screenings, the project extends its reach to upper primary, high school, and higher secondary students through educational sessions. These classes will focus on physical and mental well being, right diets, importance of regular exercise and anti-drug awareness. District medical officer A.L. Sheeja inaugurated the programme at St. Joseph’s School while Principal Sr. Rose Margaret presided over the function. District reproductive and child health (RCH) officer Linda Joseph, district programme manager of Arogya Keralam Dev Kiran and Education department senior superintendent Aji Kumar also spoke on the occasion. Published - February 06, 2026 07:47 pm IST Terms & conditions | Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/kerala/aksharam-aarogyam-programme-launched-in-kollam/article70600326.ece",
        "date": "Fri, 06 Feb 2026 19:47:29 +0530",
        "fetched_at": "2026-02-06 17:00:44.344317"
    },
    {
        "title": "CM, DCM to initiate ₹200 crore Benni Halla flood control project on Feb. 8",
        "content": "Looking at World Affairs from the Indian perspective. News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Updated - February 06, 2026 07:47 pm IST - HUBBALLI N.H. Konaraddi, MLA for Navalgund, briefing reporters in Hubballi on Friday. Chief Minister Siddaramaiah, Deputy Chief Minister D.K. Shivakumar, Union Minister Pralhad Joshi and a host of Ministers are expected to attend the initiation of ₹200 crore Benni Halla flood control Project, which is aimed at mitigating the losses farmers faced during recurring flash floods in the stream during rainy season. The laying of foundation stone will be held at Shiraguppi in Hubballi taluk of Dharwad district on February 8. Addressing reporters here on Friday, MLA for Navalgund N.H. Konaraddi said that the ₹200 crore project had been prepared as per the recommendations of the G. Paramashivaiah Committee on preventing flash floods and mitigating the losses. Mr. Konaraddi said that in the State Budget of 2024-25, Chief Minister Siddaramaiah had earmarked ₹200 crore under the State Disaster Management Fund (SDMF) and the administrative approval was given on October 9, 2024 for taking up the project. “Under the project, it has been planned to take up channelising work in Benni Halla from KM 53.30 to KM 148. The work involves building retaining walls for 1.05 km in flood-prone areas along the stream ad 7.15 km of tank bund. Development work will also be done at 83 places where smaller streams converge with Benni Halla. Seven box culverts and seven weirs will be constructed and ‘snana ghatta’ (bathing ghat) has been proposed at Yamanur,” he said. Mr. Konaraddi said that once the project was completed within the scheduled 18 months, 37 villages and 20,000 hectare farmlands in Gadag and Dharwad district would be free from flood damages. He said that although the cost of the project was ₹200 crore, the actual cost would be ₹163 crore after deduction of 18% GST. “It is part of the ₹1,610 comprehensive Detailed Project Report envisaged for the development of Benni Halla that passes through Dharwad, Haveri and Gadag districts, for which central assistance is also being sought through Union Minister Pralhad Joshi,” Mr. Navalgund said. Other BJP MLAs C.C. Patil and M.R. Patil have also been requested to take efforts to get grants for the project, he said. Mr. Konaraddi said that in addition to the ₹200 crore project, the Chief Minister and Deputy Chief Minister and other Ministers would also be initiating various development works worth ₹150 crore in Navalgund Assembly constituency on February 8. Published - February 06, 2026 07:45 pm IST Terms & conditions | Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/karnataka/cm-dcm-to-initiate-200-crore-benni-halla-flood-control-project-on-feb-8/article70600352.ece",
        "date": "Fri, 06 Feb 2026 19:47:52 +0530",
        "fetched_at": "2026-02-06 17:00:44.957261"
    },
    {
        "title": "Seven more bodies recovered, death toll in Meghalaya coal mine blast mounts to 25",
        "content": "Looking at World Affairs from the Indian perspective. News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Published - February 06, 2026 07:40 pm IST - Shillong Search and rescue operation underway after an explosion in an illegal coal mining site at Thangsku area, in East Jaintia Hills district, Meghalaya, Friday, Feb. 6, 2026. The death toll in the explosion in an illegal coal mine in Meghalaya's East Jaintia Hills mounted to 25 on Friday following the recovery of seven more bodies, Director General of Police I Nongrang said. Follow the Meghalaya coal mine explosion updates The explosion occurred on Thursday (February 5, 2026) at the mine in the Thangsku area of Umsngat village, prompting the authorities to begin large-scale search and rescue operations involving multiple agencies. Eighteen bodies had been found on Thursday. \"So far, seven additional bodies have been recovered today, taking the total number of deaths to 25. Out of these, 12 bodies have been identified,\" Ms. Nongrang told PTI. Search operations are continuing at the site as teams of the State Disaster Response Force, Special Rescue Team and the National Disaster Response Force were pressed into service. Medical teams and ambulances have also been deployed, officials said. \"The search operation is still underway, and all efforts are being made to find out any remaining victims and complete the identification process at the earliest,\" the DGP said. Officials said that the Army and the Air Force remain on standby as the district administration and the State Disaster Management Authority continue to monitor the situation closely. Published - February 06, 2026 07:40 pm IST Terms & conditions | Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/meghalaya/meghalaya-coal-mine-explosion-death-toll-rescue-operation-updates/article70600637.ece",
        "date": "Fri, 06 Feb 2026 19:40:21 +0530",
        "fetched_at": "2026-02-06 17:00:45.557697"
    },
    {
        "title": "Election manifesto: BJP’s urban vision - AI to curb corruption, no tax hike, one week building permits",
        "content": "Looking at World Affairs from the Indian perspective. News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Published - February 06, 2026 07:36 pm IST - HYDERABAD The Telangana BJP, on Friday, unveiled its urban local body election manifesto, promising that there would be no increase in any taxes, including house tax, if the party was voted to power in municipalities and municipal corporations. Party president N. Ramchander Rao said that the manifesto — Viksit Telangana: BJP Sankalp Patra 2026 — outlines a model of urban governance centred on transparency, basic infrastructure, and technology-driven services. Mr. Rao said that building permits would be issued within a week through an online, single‑window system, with extensive use of AI to curb corruption. Measures would also be taken to tackle civic issues caused by mosquitoes, pigs, monkeys, and stray dogs. The party also promised 100% garbage segregation, expansion of underground sewerage networks, and the strengthening of SHE Teams across all urban local bodies. Strengthening local community health centres, establishing skill development centres, conducting regular job fairs, and creating one multi‑purpose park in each urban local body form key components of the manifesto. Protection of temple lands and removal of encroachments also find mention. “This is an action plan to transform Telangana’s cities and towns into world‑class urban spaces. When amenities, infrastructure, employment, education, and healthcare improve, the quality of life improves significantly,” Mr. Rao said. The core objective of the manifesto is corruption‑free governance through full utilisation of Finance Commission grants and an efficient administrative system that ensures benefits reach citizens directly. Water supply, drainage, roads, parks, and community halls would be prioritised for development. “We want to send a clear message to the people, and we believe they are ready to give the BJP an opportunity,” he said. Later, addressing a campaign meeting in Narsapur (Medak), he accused the two parties of having a “secret understanding”, citing what he called delays in the probes into the phone‑tapping case and the Kaleshwaram project. He challenged the government to hand over the entire project to the CBI, alleging that only three barrages were under investigation. Published - February 06, 2026 07:36 pm IST Terms & conditions | Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/telangana/election-manifesto-bjps-urban-vision-ai-to-curb-corruption-no-tax-hike-one-week-building-permits/article70600389.ece",
        "date": "Fri, 06 Feb 2026 19:36:16 +0530",
        "fetched_at": "2026-02-06 17:00:46.173622"
    },
    {
        "title": "Two-day water sports festival held at Suvarnavathi reservoir in Chamarajanagar",
        "content": "Looking at World Affairs from the Indian perspective. News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Published - February 06, 2026 07:34 pm IST - MYSURU A two-day adventure water sports festival was held at Suvarnavathi reservoir in Chamarajanagar on February 5 and 6. The festival at Suvarnavathi reservoir, which is situated at Attigulipura, about 15 km from Chamarajanagar town, was organised jointly by the Chamarajanagar district administration, Chamarajanagar Zilla Panchayat, Department of Youth Empowerment and Sports, and the General Thimayya National Academy of Adventure, Bengaluru. The aim of the festival, inaugurated by C. Puttarangashetty, Mysore Sales International Ltd. chairman and MLA, was to encourage youth and the general public to participate in sports activities. Mr. Puttarangashetty said that Chamarajanagar district, known as the home of rich folk arts, is also emerging as a tourist destination. Pointing out that he had been working for the development of the Suvarnavathi reservoir as a tourist destination since 2008 using special grants, Mr. Puttarangashetty said a ₹43 crore project has already been submitted to the government, and funds are expected to be sanctioned soon. He said Chamarajanagar district has favourable conditions for water adventure sports. “If Suvarnavathi reservoir and surrounding lakes remain filled, they can support such activities regularly,” he said while urging the youth and public to actively participate in such festivals and help make water adventure sports a regular feature in the district. He also mentioned that a proposal worth ₹15 crore has been prepared for construction of a swimming pool at the district stadium in Chamarajanagar. Urban Development Authority Chairman Mohammed Asgar Munna said that adventure sports help motivate youngsters. He added that water adventure sports should be organised more frequently in the district so that the youth and public can reap the benefits. Deputy Commissioner Shreeroopa said that such events provide a good platform for emerging sportspersons and emphasised the importance of proper training for participation in sports. Mona Roth, Zilla Panchayat CEO, K. Suresh, Assistant Director of the Department of Youth Empowerment and Sports, Dr. S. Chidambar, District Health and Family Welfare Officer, Shabbir and Dinesh S. Suvarna, trainers from General Thimayya National Academy of Adventure, Dharmaraj, secretary of Attugulipura Gram Panchayat, and others were present during the inauguration. Published - February 06, 2026 07:34 pm IST Terms & conditions | Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/karnataka/two-day-water-sports-festival-held-at-suvarnavathi-reservoir-in-chamarajanagar/article70600558.ece",
        "date": "Fri, 06 Feb 2026 19:34:42 +0530",
        "fetched_at": "2026-02-06 17:00:46.817963"
    },
    {
        "title": "Siddaramaiah calls upon farmers to ‘unanimously oppose’ VB G-RAM-G Act",
        "content": "Looking at World Affairs from the Indian perspective. News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Updated - February 06, 2026 07:31 pm IST - Bengaluru Chief Minister Siddaramaiah with Agriculture Minister N. Cheluvarayaswamy during the inauguration of the International Trade Fair 2026, themed 'Agriculture beyond Production – Empowering Farmers', in Bengaluru on Friday. Chief Minister Siddaramaiah has called upon farmers of the State to “unanimously oppose” the Viksit Bharat-Guarantee for Rozgar and Ajeevika Mission (Gramin) (VB-G RAM G) Act, 2025, brought in by the Union government in place of the Mahatma Gandhi Rural Employment Guarantee (MGNREGA) Act, 2005. He was speaking after inaugurating this year’s edition of International Trade and Organic Fair here on Friday. This comes days after the State government passed a resolution demanding the reinstatement of MGNREG Act, 2005 repealing the VB G-RAM-G Act, 2025. On the floor of the House, the Chief Minister and several Congress leaders had vowed to take the struggle against the new law to the streets and warned the BJP that this could again trigger an agitation like the one that successfully forced the Union government to backtrack on farm laws. Mr. Siddaramaiah alleged that MGNREGA was scrapped without consulting State governments and replaced with the VB-G RAM G Act, from which Mahatma Gandhi’s name has been removed. He told farmers across Karnataka to demand the reinstatement of MGNREGA and reject the new law. Criticising the Centre’s move, the Chief Minister said MGNREG Act, 2005, introduced during former Prime Minister Manmohan Singh’s tenure, had ensured employment for women, tribal people and labourers, with works decided at the gram sabha level. He pointed out that these powers have now been centralised, with the Union government deciding works and grants. Under MGNREG Act, 2005, he said, the Centre earlier bore the full wage cost and guaranteed 100 days of work, whereas under the new arrangement, only 60% of the subsidy is provided, leaving States to bear the remaining 40%. Mr. Siddaramaiah said the State government had reinstated the Krishi Bhagya Yojana, which he termed as one of the most important promises fulfilled from the Congress manifesto. “The scheme, which was suspended during the previous BJP government’s tenure, has now been revived with an allocation of about ₹200 crore,” he said, highlighting other welfare schemes such as Shakti, Gruha Jyothi and Gruha Lakshmi, describing them as crucial for women. Published - February 06, 2026 07:30 pm IST Terms & conditions | Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/karnataka/siddaramaiah-calls-on-farmers-to-unanimously-oppose-vb-g-ram-g-act/article70600496.ece",
        "date": "Fri, 06 Feb 2026 19:31:15 +0530",
        "fetched_at": "2026-02-06 17:00:47.412418"
    },
    {
        "title": "Kochi Corporation warns of ₹5,000 fine for unauthorised flex boards and banners",
        "content": "Looking at World Affairs from the Indian perspective. News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Published - February 06, 2026 07:29 pm IST - KOCHI Unauthorised installations such as flex boards, banners, flags, and hoardings will attract a fine of ₹5,000 per item, along with legal action, the Kochi Corporation has warned. The Corporation issued the directive after noticing several such unauthorised installations at various locations within its limits. The order, issued by the Corporation secretary, reiterated that all unauthorised flex boards, banners, flag arches, and hoardings erected in public spaces and along roads are being removed immediately, and fines are being imposed in compliance with a Kerala High Court order dated November 19, 2025. However, it has come to notice that in several areas within the Corporation limits, such unauthorised flex boards, banners, flag arches, and hoardings are once again being installed in violation of the court order. These must be removed; failing which, a fine of ₹5,000 per board will be imposed and strict legal action, including the registration of a first information report (FIR), will be initiated, the statement said. The Kerala High Court, in its order, had granted two weeks’ time to the secretaries of all local bodies in the State to ensure that unauthorised boards, banners, flags, festoons, and other materials put up by political parties and other entities were removed from public spaces. The court had directed that necessary action be taken against those responsible for such installations, while instructing the State Election Commission and District Election Officers to scrupulously monitor their respective jurisdictions and remove such materials. Amicus curiae Harish Vasudevan informed the court that many handrails, pedestrian pathways, and related infrastructure still carried banners, boards, flags, and festoons of political parties and other organisations. The Senior Government Pleader subsequently submitted that the government had already issued instructions to the secretaries of local bodies to act in accordance with the directions of the earlier court judgment. In January, the Thiruvananthapuram Corporation had faced sharp criticism from the court for failing to prevent the illegal installation of flex boards and banners across footpaths in the city. Published - February 06, 2026 07:29 pm IST Terms & conditions | Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/kerala/kochi-corporation-warns-of-5000-fine-for-unauthorised-flex-boards-and-banners/article70599774.ece",
        "date": "Fri, 06 Feb 2026 19:29:13 +0530",
        "fetched_at": "2026-02-06 17:00:48.016041"
    },
    {
        "title": "Kerala launches comprehensive school health programme",
        "content": "Looking at World Affairs from the Indian perspective. News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Updated - February 06, 2026 07:34 pm IST - Thiruvananthapuram Health Minister Veena George with students of Government Higher Secondary School for Girls, Cotton Hill, Thiruvananthapuram during the launch of Aksharam Arogyam on Friday. Launching Aksharam Arogyam, the comprehensive school health programme, here on Friday, Health Minister Veena George said that the initiative will earn a place in the history of the State’s health sector. A collaborative project of the Health and General Education departments, Aksharam Arogyam will screen children for various health parameters, create comprehensive health documents of every child in a school, and issue them health cards which may be converted later to electronic medical records. This is also an initiative wherein schools will take an active lead in promoting health awareness and healthy lifestyle habits among children through dedicated training programmes, so that children pick up good eating and living habits in school and take these back to their families and the community. The initiative thus envisages children becoming health ambassadors for the society. All schools that join the initiative will conduct health assemblies and set up health corners to encourage healthy lifestyles and discourage unhealthy habits. In each school, a designated teacher will act as the health mentor. These teachers will undergo training based on modules jointly prepared by the Health and Education departments. They will provide structured health education to students at regular intervals, covering 11 themes across four key domains. Ms. George also launched a 24-hour toll-free number, 104, through which parents can know all about the free health initiatives available for children in the State as well as clear any doubts they may have about children’s health requirements, such as immunisation schedule. She reminded children that going forward in life, good health was the basis of all their dreams. General Education Minister V. Sivankutty said that the project was a proof that the government was committed to maintaining academic excellence as well as the physical and mental well-being of children. The health cards to be issued to students after health screening was released on the occasion. Mr. Sivankutty presented a souvenir titled “Butterflies That Flew Above the Sky” to the Health Minister, marking the successful completion of 10 years of District Early Intervention Centres that focus on early detection and management of developmental delays in children. Senior Health and General Education department officials were present at the function. Published - February 06, 2026 07:28 pm IST Terms & conditions | Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/kerala/kerala-launches-comprehensive-school-health-programme/article70600226.ece",
        "date": "Fri, 06 Feb 2026 19:34:37 +0530",
        "fetched_at": "2026-02-06 17:00:48.611009"
    },
    {
        "title": "Annual sports competition for journalists on February 8",
        "content": "Looking at World Affairs from the Indian perspective. News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Published - February 06, 2026 07:21 pm IST - Yadgir The annual sports competitions for journalists under the Karnataka Union of Working Journalists (KUWJ) will be held at the district stadium on February 8, Mallappa Sankin, president of KUWJ, said. In a release, Mr. Sankin said that Superintendent of Police Prutwik Shankar would inaugurate the event. Sharanappa Saladapur, Chairman of the Karnataka State Temperance Board; Baburao Kadlur, Chairman of the Yadgir Urban Development Board; and Bandappa Arali, president of the JD(S) city unit, will distribute awards to winners at the valedictory function on the same day. He said that a ₹5,000 cash prize and trophy would be distributed to winners of kabadi, volleyball, and cricket, and a medal for runners-up. Winners in shot put, 100-meter running competition, and the carrom and badminton single division competitions will be given a ₹1,000 cash prize and medals, he added. Published - February 06, 2026 07:21 pm IST Terms & conditions | Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/karnataka/annual-sports-competition-for-journalists-on-february-8/article70600393.ece",
        "date": "Fri, 06 Feb 2026 19:21:03 +0530",
        "fetched_at": "2026-02-06 17:00:49.214586"
    },
    {
        "title": "Samana College of Design Studies launches new brand",
        "content": "Looking at World Affairs from the Indian perspective. News and reviews from the world of cinema and streaming. Your download of the top 5 technology stories of the day. The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Decoding the headlines with facts, figures, and numbers Ramya Kannan writes to you on getting to good health, and staying there Books of the week, reviews, excerpts, new titles and features. Published - February 06, 2026 07:20 pm IST - VIJAYAWADA The Samana College of Design Studies (SCDS) in Vijayawada launched a new brand, Aliyana, in collaboration with the Maulana Azad National Urdu University (MANUU) on Thursday. “The objective of launching this brand is to support and empower students,” said founder chairperson of the fashion institute, Samana Moosavi. She said the institute wanted to align with the objectives of the National Education Policy (NEP) that stresses on skill education The SCDS, which has branches in Kadapa, Hyderabad, Lucknow, and Varanasi, plans to launch this brand at its Varanasi branch also on February 18. “The students need hands-on experience before they can start their own business. This programme is designed to equip them with the wherewithal to start their own business with confidence,” said Ms. Moosavi. Published - February 06, 2026 07:20 pm IST Terms & conditions | Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/samana-college-of-design-studies-launches-new-brand/article70596963.ece",
        "date": "Fri, 06 Feb 2026 19:20:16 +0530",
        "fetched_at": "2026-02-06 17:00:49.819638"
    },
    {
        "title": "'Shamelessness of government and police': AAP's Saurabh Bhardwaj hits out at BJP over Janakpuri youth's death",
        "content": "File photo: AAP leader Saurabh Bhardwaj",
        "link": "https://timesofindia.indiatimes.com/india/shamelessness-of-government-and-police-aaps-saurabh-bhardwaj-hits-out-at-bjp-over-janakpuri-youths-death/articleshow/127999907.cms",
        "date": "2026-02-06T22:16:42+05:30",
        "fetched_at": "2026-02-06 17:00:50.715721"
    },
    {
        "title": "'Will Inspire Many Young Sportspersons': PM Modi's Message To U-19 Cricket Team On World Cup Win",
        "content": "Prime Minister Narendra Modi on Friday praised India’s Under-19 cricket team after their World Cup victory, saying the win would “inspire many young sportspersons\". In a post on X, the Prime Minister said India’s cricketing talent had once again shone on the global stage. He congratulated the team for bringing home the U-19 World Cup and said they had played very well throughout the tournament. “Proud of our U-19 team for bringing home the World Cup. The team has played very well through the tournament, showcasing exceptional skill. This win will inspire several young sportspersons too. Best wishes to the players for their upcoming endeavours,\" PM Modi wrote. India’s cricketing talent shines!Proud of our U-19 team for bringing home the World Cup. The team has played very well through the tournament, showcasing exceptional skill. This win will inspire several young sportspersons too. Best wishes to the players for their upcoming… — Narendra Modi (@narendramodi) February 6, 2026 India clinched the U-19 World Cup title for a record-extending sixth time after defeating England by 100 runs in the final held in Harare, Zimbabwe. With this win, India strengthened their position as the most successful team in the history of the U-19 World Cup. A major highlight of the final was opener Vaibhav Sooryavanshi, who delivered a brilliant performance on the biggest stage of his young career. The teenage batter scored a stunning century, reaching the milestone in just 55 balls and playing a key role in India’s dominant win. The 14-year-old Sooryavanshi smashed a record 80-ball 175, an innings comprising an astonishing 15 fours and 15 sixes as India also broke the record for the highest total ever in a U19 World Cup final. His innings is also the highest individual score in a summit clash of the tournament.",
        "link": "https://www.news18.com/sports/will-inspire-many-young-sportspersons-pm-modis-message-to-u-19-cricket-team-on-world-cup-win-ws-l-9885509.html",
        "date": "Fri, 6 Feb 2026 21:49:28 +0530",
        "fetched_at": "2026-02-06 17:00:55.740335"
    },
    {
        "title": "Rent Promises, Red Flags & Runaway Dues: Saket Court Seeks Police Report On '32nd Milestone' Project Promoters",
        "content": "What began as a promise of guaranteed rentals and glossy commercial returns has now landed the promoters of Gurugram’s “32nd Milestone\" project in a Delhi courtroom, with a magistrate seeking a detailed police response to allegations of cheating, fund diversion, and large-scale financial irregularities. A Judicial Magistrate First Class at Saket Courts has issued notice on an application seeking registration of an FIR and a slew of stringent measures against the promoters and entities behind the commercial project, including freezing of bank accounts, a forensic audit of finances, suspension of passports, and issuance of Look Out Circulars. The order was passed on February 5 by JMFC Devanshi Janmeja, directing the police to file an Action Taken Report (ATR). The matter is scheduled for further hearing on March 13. The application has been moved by investor Arvind Gupta, who has accused the promoters of financial misconduct, cheating, and siphoning of investors’ funds. Action has been sought against M/s 32nd Vistas Private Limited, Growth Hospitality LLP, and their promoters, including Dhruv Dutt Sharma, Shirin Sharma, Mamta Sharma, and others. According to the complaint, the investor had purchased a commercial unit in the project after being assured that the unit would be demarcated shortly. The promoters allegedly offered guaranteed lease rentals for a period of 30 years, along with a buyback option at any stage if the investor chose to exit. A leasing arrangement was subsequently executed, under which the unit was placed on a long-term lease with assurances of regular monthly rental income. However, the complaint alleges that lease rental payments stopped from August 2025 onwards. It further claims that the promoters failed to deposit Tax Deducted at Source (TDS) from September 2024 and defaulted on GST dues, statutory filings, and employee-related contributions such as ESI and PF, allegedly causing losses to investors, employees, and the public exchequer. The complainant has alleged that investors were repeatedly told that rental payments and TDS deposits had already been credited but were not reflecting due to “technical issues\", claims that later turned out to be false. It is further alleged that fabricated TDS certificates were circulated among investors to create the impression that statutory deposits had been made, despite no such entries appearing in official records. When the investor sought demarcation and possession of the purchased unit or invoked the buyback option, the promoters allegedly expressed their inability to hand over possession. The application suggests that one possible reason could be multiple sales of the same commercial units. Serious allegations of diversion and siphoning of funds have also been raised. The plea claims that despite earning rental income from operational restaurants and commercial establishments at the project, the promoters failed to clear dues owed to investors, employees, financial institutions, and statutory authorities. It is also alleged that substantial borrowings were raised from banks and private investors and were misused. The application further states that protests have been taking place outside the project premises, offices have allegedly been shut, and essential utilities such as electricity and water supply disconnected due to non-payment of dues, while the promoters are claimed to be untraceable. Concerns have also been raised regarding alleged expenditure on promotional campaigns and high-profile endorsements. The plea refers to associations involving public figures such as Malaika Arora, Abhay Deol, Karan Johar, Manish Malhotra, and Akshay Kumar, and seeks investigation into the financial trail of such promotional spending at a time when investor dues allegedly remain unpaid. No allegations have been levelled against these celebrities, and the plea confines itself to examining the source of funds used for such promotions. On these grounds, the application seeks registration of an FIR, attachment of assets, forensic audit of accounts, suspension of passports of the promoters, and issuance of Look Out Circulars to prevent them from leaving the country. Taking note of the allegations, the Saket court has directed the police to submit a detailed status report and listed the matter for further consideration on March 13. The company has said in a statement that recent delays in rental payments have been driven by a short-term vacancy in a limited portion of its Gurugram property, arising from normal tenant churn and a change in tenancy, and that “replacement leasing is already underway and being prioritised\". Notably, the legal action in Delhi follows recent FIRs registered by Gurugram Police against the owner and certain officials associated with “32nd Avenue\", the popular retail and entertainment hub, after investor protests.",
        "link": "https://www.news18.com/india/rent-promises-red-flags-runaway-dues-saket-court-seeks-police-report-on-32nd-milestone-project-promoters-9885011.html",
        "date": "Fri, 6 Feb 2026 18:21:49 +0530",
        "fetched_at": "2026-02-06 17:00:56.404158"
    },
    {
        "title": "In Rare Move, Delhi Police Book IPS Officer, Others Over 'Illegal Detention & Unauthorised Raids'",
        "content": "Delhi Police’s vigilance unit has registered a case following an internal inquiry into a November 2023 police operation carried out in Mizoram. The case was registered after an inquiry concluded that there was prima facie material suggesting procedural and jurisdictional irregularities during the operation. According to the FIR, the case has been filed under Sections 166, 341, 342, and 409 of the Indian Penal Code to allow a formal criminal investigation into the conduct of officers involved against IPS Shankar Choudhary, a 2011 batch officer, along with others. The inquiry examined a cross-state police action conducted between November 21 and 30 in 2023 by a Delhi Police team in Mizoram in connection with a narcotics investigation. The FIR records that the team stayed and conducted operations outside Delhi’s territorial jurisdiction and that questions were later raised by Mizoram authorities about authorisation and custody procedures. The document talks about an unauthorised stay and operations without lawful written orders from a competent authority. The inquiry reviewed CCTV footage, travel records, PCR logs, and witness accounts to reconstruct the events. According to the FIR, the vigilance inquiry found sufficient preliminary material to justify criminal registration, so the matter could be independently investigated. “These observations constitute prima facie material for registration of a case to enable fair and independent investigation,\" the report states. “The purpose of the present registration is to enable a fair and independent investigation into the circumstances of the operation.\" The FIR names IPS officer Shankar Choudhary as part of the raiding team whose conduct is under review. The document records, “Shankar Choudhary IPS… was part of the raiding team which stayed and conducted operations in Mizoram during the period under inquiry.\" On authorisation, the inquiry notes, “The officer stayed in Mizoram and continued operational activity without obtaining written permission from the competent authority.\" The report also raises concerns over detention procedures: “Illegal detention… demonstrates that Harrison House premises were taken under control and individuals were confined without lawful authority.\" Investigators further recorded, “No proper documentation of seizure, custody or inter-state coordination was found at the time of inquiry.\" According to the FIR, the Delhi Police officials only provided assistance in conducting the raid under the bona fide impression that the Mizoram Police team, led by a senior police officer who earlier served as DCP/Dwarka, was carrying out the investigation legally. “The onus was on Mizoram Police to comply with the procedural safeguard, prepare all necessary documentation related to search, seizure and arrest/detention including case diaries,\" the FIR says. It further states that the role of Delhi Police officials was limited to making an entry whenever the staff moved with Mizoram Police and a detainee was brought to the police station or Anti-Narcotic Squad of Dwarka/South West. “Upon holistic examination of the facts, evidence, and testimonies, the following findings emerge: Shankar Choudhary, IPS, acted beyond his legal and territorial authority. He conducted unauthorised raids and seizures within Delhi, violating legal and administrative protocols. He kept a suspect, Harrison, in illegal custody for four days at Mizoram House. He failed to document seized property, thereby violating legal, procedural and evidentiary norms. Delhi Police Officials (HC Shalju, HC Vikash, HC Prashant) accompanied the officer and participated in raids without requisite sanction. Their actions, while irregular, do not establish mens rea or criminal culpability but warrant departmental action,\" the report says. Recommendations were made to book Shankar Choudhary for abusing authority, wrongful confinement, and misappropriation of seized property.",
        "link": "https://www.news18.com/india/in-rare-move-delhi-police-book-ips-officer-others-over-illegal-detention-unauthorised-raids-9884615.html",
        "date": "Fri, 6 Feb 2026 17:34:25 +0530",
        "fetched_at": "2026-02-06 17:00:57.012850"
    },
    {
        "title": "'Govt In Touch With Indians In Iran, Closely Monitoring Situation': Jaishankar To Parliament",
        "content": "External Affairs Minister S Jaishankar on Friday told the Parliament that the Indian government is closely monitoring the ongoing situation in Iran after a wave of protests triggered by economic stagnation, and its embassy in Tehran was in regular touch with Indian nationals. “The Government is closely monitoring the situation in Iran. The Embassy of India in Tehran is in regular contact with Indian nationals, including students, in Iran, and is providing them regular advice,\" he said in the Parliament. “The Embassy continues to assist, advise, and guide Indian citizens as required.\" “The Government does not currently view Indian nationals in Iran as stranded, given that Iranian airspace remains open and there is regular air connectivity between Iran and India and with the countries in the region. A special evacuation has therefore not been arranged by the Government so far. The Government continues to assess the situation as circumstances evolve,\" he also said. He also informed the House that there were 9,000-10,000 Indian nationals across 16 provinces in Iran, mainly students (and their families), workers, pilgrims, tourists, business persons and seafarers. “Since Iranian airspace remains open as on date, Indian nationals wishing to leave Iran have been advised to do so using available means, including commercial flights,\" he said. He also highlighted a telephonic conversation with his Iranian counterpart Abbas Araghchi, where they discussed the evolving situation in and around Iran. He also reaffirmed that India remains in touch with various interlocutors regarding the situation. This came against the backdrop of the Iranian authorities’ deadly response to anti-government protests that began in late December and continued through last month, in which thousands of people were killed and tens of thousands arrested, prompting military threats from US President Donald Trump. This came against the backdrop of the Iranian authorities’ deadly response to anti-government protests that began in late December and continued through last month, in which thousands of people were killed and tens of thousands arrested, prompting military threats from US President Donald Trump. Recently, in the Budget 2026 unveiled on February 1, India earmarked zero funds for the Chabahar port in Iran despite the landmark 10-year agreement signed in 2024 for India to operate the Shahid Beheshti terminal. Analysts suggest this withdrawal is a precautionary response to the renewed geopolitical friction involving the United States. Furthermore, Trump has also asserted that India will buy Venezuelan oil instead of Iranian crude, signalling a possible shift in global energy trade flows. However, India said it will prioritise its own energy needs and remains open to all crude deals.",
        "link": "https://www.news18.com/india/govt-closely-monitoring-situation-in-iran-in-touch-with-indians-jaishankar-to-parliament-ws-kl-9884898.html",
        "date": "Fri, 6 Feb 2026 17:32:12 +0530",
        "fetched_at": "2026-02-06 17:00:57.648729"
    },
    {
        "title": "Delhi Govt Moves To Create Unified Transport Authority, Sets Up Task Force",
        "content": "In a major institutional reform aimed at transforming urban mobility in the national capital, the Delhi government has initiated the process of drafting a comprehensive Bill for the creation of the Delhi Unified Metropolitan Transport Authority (DUMTA) along with a dedicated Delhi Urban Transport Fund (DUTF). The proposed legislation seeks to rationalise, integrate and coordinate Delhi’s presently fragmented transport ecosystem under a single, coherent planning and governance framework. The move marks a significant milestone in the government’s vision to create a modern, efficient, people-centric and environmentally sustainable transport system for the Capital. To fast-track and ensure inclusive drafting of the proposed law, the Chief Minister has set up a high-level task force chaired by the Chief Secretary to prepare and submit the draft Bill at the earliest. The move reflects the government’s urgency and responds to long-standing demands from experts and civic stakeholders for a unified transport authority to coordinate planning, investment and operations, a press statement said. Recognising that Delhi’s rapid urbanisation, rising population and mounting vehicular pressure demands systemic solutions rather than piecemeal interventions, the Chief Minister has taken a proactive step by setting the legislative process in motion. The task force includes senior officials from key departments and representatives of major civic and transport bodies such as DDA, MCD, DMRC, DTC, NCRTC and Indian Railways. The Chief Minister has also proposed co-opting leading urban transport experts to integrate global best practices with local needs. Explaining the rationale behind the initiative, Chief Minister Rekha Gupta noted that Delhi’s transport agencies have historically functioned in silos, with limited coordination in route planning, infrastructure development and service delivery. “DUMTA will bring cohesion to Delhi’s entire urban mobility system. By placing all modes of transport like metro, buses, regional rail, railways and feeder services, within a single planning jurisdiction, we will ensure that mobility solutions are integrated, efficient and citizen-focused,\" the CM said.",
        "link": "https://www.news18.com/cities/new-delhi-news/delhi-govt-moves-to-create-unified-transport-authority-sets-up-task-force-ws-kl-9884698.html",
        "date": "Fri, 6 Feb 2026 16:51:11 +0530",
        "fetched_at": "2026-02-06 17:00:58.250550"
    },
    {
        "title": "Weight Loss Drug Semaglutide Boom Pushes India To Consider Defining Biological Medicines",
        "content": "India is moving to formally define ‘biological drugs’ under its medicines law, as the category expands with the launch of some of the world’s top-selling therapies, including anti-obesity and diabetes blockbuster semaglutide, News18 learnt. The move comes as drug regulators grapple with fast-evolving manufacturing technologies that blur the lines between synthetic medicines and biologically derived products, often produced within the same facility. The Drugs Technical Advisory Board (DTAB) is now set to deliberate on a proposal that seeks to introduce a legal definition of biological products, mandate origin-based labelling, and update legacy schedules under the Drugs Rules, 1945, to reflect modern biologics. The matter has now been formally placed before the apex drug approval panel, Drugs Technical Advisory Board, with the agenda document concluding that “DTAB may kindly deliberate and give its recommendation in the matter.\" If approved, industry experts believe the changes would mark a significant overhaul of India’s biological drug regulation, bringing long-overdue legal clarity at a time when biologics and peptide-based therapies are rapidly reshaping the pharmaceutical landscape. The move is also significant considering India itself is planning to become hub of biological and biosimilar drug making with finance minister Nirmala Sitharaman announcing the “BioShakti Pharma Hub\" scheme in the union budget last Sunday. According to the agenda document accessed by News18, the proposal has been triggered by a growing number of applications received by the Central Drugs Standard Control Organisation, where manufacturers are seeking regulatory approval to produce both synthetic and recombinant products at the same site. The document said that “CDSCO receives multiple applications wherein manufacturers seek permission to manufacture synthetic and r-DNA origin drug products in the same manufacturing facility.\" Regulatory agency in the document noted that this convergence has become especially prominent in peptide-based therapies. “Certain peptide-based therapeutic products, such as Semaglutide and similar products are available in both synthetic and r-DNA origin and in injectable as well as oral dosage forms,\" the agenda paper says, underlining the regulatory complexity such products pose. While the existing framework allows limited flexibility, the regulator acknowledges that the rules lack clarity on core definitions. “Schedule M of the Drugs Rules, 1945 provides provision for campaign-based manufacturing with appropriate cleaning validation and risk mitigation measures,\" the document said but adds that “the substantive provisions of the Drugs Rules do not define ‘Biological drugs’.\" The absence of a formal definition has also created uncertainty around licensing, particularly when different categories of drugs are produced at the same location. The agenda paper flags that “currently, there are no provisions on licensing overlap between facilities licensed under Form 28 and Form 28D at the same site,\" raising concerns about regulatory oversight, inspections and compliance. To address these gaps, the proposal recommends incorporating a definition of “biological products\" into both the Drugs Rules and the New Drugs and Clinical Trials (NDCT) Rules, 2019. Citing global standards, it reproduces the World Health Organization’s definition, describing biological products as “a product containing a substance produced by or extracted from biological sources, such as living cells or organisms, and which require complex manufacturing processes and control.\" The document further clarifies that “biological products include vaccines, blood and blood components, allergenic, somatic cells gene therapies, tissues, recombinant therapeutic proteins and monoclonal antibodies.\" In a move aimed at improving transparency, the regulator has also proposed mandatory origin-based labelling. The agenda note states that “mandatory labelling provisions may be introduced to clearly indicate the origin of the drug as ‘Synthetic Origin,’ ‘r-DNA Origin,’ ‘Human Origin,’ or ‘Animal Origin,’ as applicable.\" Additionally, the proposal calls for “consequential amendments\" to Schedule C and Schedule C1 of the Drugs Rules, 1945, to explicitly include biological-origin products in both parenteral and non-parenteral forms, reflecting the growing diversity of modern biological therapies.",
        "link": "https://www.news18.com/india/weight-loss-drug-semaglutide-boom-pushes-india-to-consider-defining-biological-medicines-ws-el-9884395.html",
        "date": "Fri, 6 Feb 2026 15:39:44 +0530",
        "fetched_at": "2026-02-06 17:00:59.149078"
    },
    {
        "title": "NIA Raids Government Medical College Anantnag Linked To 'White Collar' Terror Module",
        "content": "The National Investigation Agency (NIA) conducted a search operation at the Government Medical College in Anantnag district of Jammu and Kashmir on Friday. This was in connection with the “white collar\" terror module that was dismantled in November last year. According to officials, the NIA team arrived at GMC Anantnag to carry out the searches related to the recovery of a rifle found in a doctor’s locker in November of the previous year. Dr. Adeel Ahmad Rather was one of the nine individuals arrested during the investigation into the terror module, which also led to the discovery of a significant amount of explosives in Faridabad, NCR. In a parallel development, security forces continued their search operations in the Koil Karewa area of Pulwama district. Officials stated that the operation was initiated following intelligence reports about the presence of terrorists in the region. No arrests or significant recoveries have been made so far in this ongoing operation. One Terrorist Killed In J-K’s Kishtwar Earlier this week, a suspected Pakistani terrorist was killed in an operation in the snow-bound higher reaches of Jammu and Kashmir’s Kishtwar district. The operation took place on Wednesday. “In the continuing search and elimination of terrorists in the Kishtwar region, where the hunt has already led to several contacts in the dense forests and challenging terrain, a contact was re-established with the terrorists on the run in the ongoing joint operation (Trashi-I), by the troops of Counter-Insurgency Force Delta, White Knight Corps, J&K Police and CRPF at around 5:45 pm today in the general area of Dichhar, Kishtwar. One terrorist has been successfully neutralised. Operation is in progress,\" Army’s White Knight Corps said in a post on X.",
        "link": "https://www.news18.com/india/nia-raids-government-medical-college-anantnag-linked-to-white-collar-terror-module-ws-l-9884205.html",
        "date": "Fri, 6 Feb 2026 15:46:15 +0530",
        "fetched_at": "2026-02-06 17:00:59.772997"
    },
    {
        "title": "'Ego-Driven Killing': How Overseas Gangsters Orchestrated AAP Leader's ‘Remote Control’ Murder",
        "content": "The killing of Aam Aadmi Party (AAP) leader Lucky Oberoi has once again exposed the growing challenge posed by overseas-based criminal networks directing violence in Punjab from thousands of kilometres away. CCTV visuals showed a hooded assailant shooting Oberoi at close range before fleeing the scene on a scooter, pointing to a well-planned execution rather than a spontaneous act. Top intelligence sources have told CNN-News18 that the murder was allegedly orchestrated by Jograj Singh, also known as Joga Pholriwal — a known gangster originally from the Jalandhar–Phulriwal belt — who is currently believed to be operating from either the United States or Canada. According to security agencies, the killing did not stem from a deep political conspiracy but was triggered by pride, online provocation, and the unchecked influence of criminals operating from abroad. Intelligence sources allege that a minor altercation between Oberoi and Jograj Singh escalated over social media in the days leading up to the murder. Investigators claim the online exchanges were not random and played a direct role in provoking the attack. “This was a classic case of ego-driven violence amplified through digital platforms,\" a source claimed. Sources further revealed that Jograj Singh began his criminal journey as a small-time offender involved in intimidation, assault, and extortion-related activities in Punjab. Mounting pressure from law enforcement eventually forced him to flee the country. Once abroad, distance provided him a degree of immunity, allowing him to operate with greater confidence and reduced fear of immediate arrest. Security agencies have described the killing as a “remote control murder\" — an emerging pattern in Punjab’s crime landscape. According to Punjab Police and central intelligence agencies, overseas handlers no longer pull the trigger themselves. Instead, they use encrypted messaging apps, social media provocations, and digital payments to recruit and motivate local foot soldiers to carry out violent acts. Jograj Singh is also said to be associated with Sonu Khatri, another gangster based overseas. Intelligence sources suggest that Khatri functions less as a street-level criminal and more as a network facilitator. Agencies believe his role includes connecting overseas gangsters with local shooters, arranging logistics, and routing money through informal channels to finance murders. The Oberoi killing, intelligence sources warn, underscores a dangerous trend where digital reach and transnational criminal networks are turning minor disputes into deadly outcomes, posing a growing challenge for Indian law enforcement agencies.",
        "link": "https://www.news18.com/india/ego-driven-killing-how-overseas-gangsters-orchestrated-aap-leaders-remote-control-murder-ws-l-9884114.html",
        "date": "Fri, 6 Feb 2026 14:59:33 +0530",
        "fetched_at": "2026-02-06 17:01:00.402418"
    },
    {
        "title": "Karnataka Cabinet Gives Nod To Use Of Ballot Papers In Panchayat Polls",
        "content": "The Karnataka government on Thursday gave its approval to use ballot papers and ballot boxes for upcoming panchayat elections. The decision clears the way for changes in the law ahead of the Panchayat polls. Speaking about the same, State Minister HK Patil said that the approved Karnataka Gram Swaraj and Panchayat Raj (Amendment) Bill, 2026, will allow elections to be conducted using traditional voting methods instead of electronic machines. Patil stated that the existing law does not contain provisions for ballot papers and boxes, and necessary legal changes will now be made wherever required. He confirmed that the forthcoming Panchayat elections will be conducted through this method. The state government has expressed concerns about the use of Electronic Voting Machines (EVMs). It believes public confidence in the machines has declined, prompting the shift to paper ballots. Last September, the Congress government had already decided to recommend to the State Election Commission that future panchayat and urban local body elections be held through ballot papers rather than EVMs, citing questions raised by people over their credibility.",
        "link": "https://www.news18.com/india/karnataka-cabinet-gives-nod-to-use-of-ballot-papers-in-panchayat-polls-ws-l-9884272.html",
        "date": "Fri, 6 Feb 2026 14:56:06 +0530",
        "fetched_at": "2026-02-06 17:01:01.033501"
    },
    {
        "title": "405 Air Purifiers Bought For Parliament, Govt Offices, SC In Last Four Years: Minister Informs Lok Sabha",
        "content": "Amid the ongoing woes of Delhi air pollution, the Central Public Works Department (CPWD), a prime construction and maintenance agency of the central government, has procured 405 air purifiers between 2021 and 2025. As per the official data, the highest number of air purifiers — 156 units — were purchased during the last financial year (2024-25), the Lok Sabha was informed on Thursday. The data was provided in response to a question asked by TMC MP Mahua Moitra. Union Minister of State for Housing and Urban Affairs Tokhan Sahu informed that the air purifiers were issued to government offices, chambers, VVIP lounges and dining halls of judges and registrars of the Supreme Court of India. Detailing the use of the device, it was mentioned that the air purifiers were also installed in courtrooms and offices associated with the apex court. Besides this, the air purifiers were also provided to the offices of ministers, ministries at Nirman Bhawan, Sewa Bhawan, Vigyan Bhawan and key institutional locations such as the Constitution Club of India. Air purifiers were also issued to the Lok Sabha and Rajya Sabha secretariats, besides CPWD offices in Jodhpur and Varanasi. In the written reply, it is clearly mentioned that in 2021-22, the CPWD purchased 24 air purifiers, which rose to 81 units in 2022-23. The numbers then grew in 2023-24 with the procurement of 144 air purifiers, followed by the highest purchase in 2024-25 in the last five years. The reply included the details of the purchases made through the government’s online procurement portal, which showed air purifiers of Eureka Forbes, Honeywell, Phillips, Dyson and other brands being bought over the four years. Apart from major construction projects, the CPWD, which comes under the Union Housing and Urban Affairs Ministry, also looks after the maintenance of central government buildings.",
        "link": "https://www.news18.com/india/cpwd-purchased-405-air-purifiers-for-parliament-govt-offices-supreme-court-in-last-four-years-9883778.html",
        "date": "Fri, 6 Feb 2026 13:52:12 +0530",
        "fetched_at": "2026-02-06 17:01:01.683209"
    },
    {
        "title": "Delhi | Shocking That Delhi Authorities Have Not Learned A Lesson From Noida Techie's Death: Lawyer",
        "content": "| Delhi biker dies after falling into a massive pit dug by water board, murder angle also being probed\"Shocking that Delhi authorities have not learned a lesson from Noida techie's death\": Abhasinghlawyer Mobile App - https://onelink.to/desc-youtube",
        "link": "https://www.news18.com/videos/india/delhi-shocking-that-delhi-authorities-have-not-learned-a-lesson-from-noida-techie-s-death-lawyer-9885298.html",
        "date": "Fri, 6 Feb 2026 13:13:41 +0530",
        "fetched_at": "2026-02-06 17:01:02.349242"
    },
    {
        "title": "A Farmer, A Megaphone And His Radish Harvest Outside A Govt Office In Karnataka",
        "content": "On a recent morning in Tumakuru district, visitors to the Madhugiri taluk office were met with an unusual sight. A farmer stood outside the building with a megaphone, speaking calmly but firmly about a problem that, he said, had gone unresolved for months. Beside him was a scooter loaded not with files or placards, but with freshly harvested radish. The farmer, Prasanna Kumar from Dodderi Jakkenahalli village, said he has been seeking a proper connecting road to his agricultural land. According to him, the absence of a motorable access road has made it difficult to transport produce and carry out routine farming work. Prasanna told officials and onlookers that he had repeatedly approached the local administration for help. Over time, the issue moved beyond the village level and reached higher authorities. Orders Issued, But No Action on Ground According to Prasanna, the matter was taken up with the Lokayukta, which directed officials to resolve the issue within a month. He also said he approached senior political leaders, including the chief minister and the revenue minister, following which letters were issued asking the local administration to act. Despite these directions, Prasanna claimed no work had begun even after nearly two months. The lack of progress, he said, pushed him to stage a public protest. Standing outside the taluk office, Prasanna alleged that officials linked to the village administration and revenue department demanded money to move the file forward. He accused the village accountant and panchayat-level revenue inspectors of seeking a bribe. “I don’t have cash to pay,\" he said through the megaphone, explaining why he chose to bring radish from his field. His message was symbolic: if money was the obstacle, he was willing to offer what he had grown instead. Videos and photographs of the farmer’s protest, radish stacked on a scooter and slogans amplified through a megaphone quickly spread on social media. The visuals drew widespread attention, with many users interpreting the protest as a reflection of frustration with bureaucratic delays and alleged corruption. Following the online attention, senior officials responded. Gotur Shivappa, assistant commissioner of Madhugiri, said he had instructed the tahsildar to look into the farmer’s complaint on priority. Officials Deny Bribery Allegations Revenue officials, however, rejected the farmer’s claims. Srinivas, the current tahsildar of Madhugiri, said the issue was not administrative delay but a family dispute. According to him, a previous tahsildar had already arranged for an eight-foot-wide road, and an existing asphalted road already provided access to the land. Officials also said they had visited the village and that the remaining disagreement involved relatives and an adjacent plot. While the farmer maintains that official inaction and alleged bribe demands forced him to protest publicly, authorities insist the road issue has largely been addressed and that the conflict is personal rather than procedural. With the matter now under scrutiny and senior officials involved, attention has shifted to what action follows and whether the farmer’s access road will finally move from paper to ground. The farmer, Prasanna Kumar from Dodderi Jakkenahalli village, said he has been seeking a proper connecting road to his agricultural land. According to him, the absence of a motorable access road has made it difficult to transport produce and carry out routine farming work. Prasanna told officials and onlookers that he had repeatedly approached the local administration for help. Over time, the issue moved beyond the village level and reached higher authorities. Orders Issued, But No Action on Ground According to Prasanna, the matter was taken up with the Lokayukta, which directed officials to resolve the issue within a month. He also said he approached senior political leaders, including the chief minister and the revenue minister, following which letters were issued asking the local administration to act. Despite these directions, Prasanna claimed no work had begun even after nearly two months. The lack of progress, he said, pushed him to stage a public protest. Standing outside the taluk office, Prasanna alleged that officials linked to the village administration and revenue department demanded money to move the file forward. He accused the village accountant and panchayat-level revenue inspectors of seeking a bribe. “I don’t have cash to pay,” he said through the megaphone, explaining why he chose to bring radish from his field. His message was symbolic: if money was the obstacle, he was willing to offer what he had grown instead. Videos and photographs of the farmer’s protest, radish stacked on a scooter and slogans amplified through a megaphone quickly spread on social media. The visuals drew widespread attention, with many users interpreting the protest as a reflection of frustration with bureaucratic delays and alleged corruption. Following the online attention, senior officials responded. Gotur Shivappa, assistant commissioner of Madhugiri, said he had instructed the tahsildar to look into the farmer’s complaint on priority. Officials Deny Bribery Allegations Revenue officials, however, rejected the farmer’s claims. Srinivas, the current tahsildar of Madhugiri, said the issue was not administrative delay but a family dispute. According to him, a previous tahsildar had already arranged for an eight-foot-wide road, and an existing asphalted road already provided access to the land. Officials also said they had visited the village and that the remaining disagreement involved relatives and an adjacent plot. While the farmer maintains that official inaction and alleged bribe demands forced him to protest publicly, authorities insist the road issue has largely been addressed and that the conflict is personal rather than procedural. With the matter now under scrutiny and senior officials involved, attention has shifted to what action follows and whether the farmer’s access road will finally move from paper to ground. Scan the QR code to download the News18 app and enjoy a seamless news experience anytime, anywhere.",
        "link": "https://www.news18.com/india/a-farmer-a-megaphone-and-his-radish-harvest-outside-a-govt-office-in-karnataka-skn-ws-l-9883580.html",
        "date": "Fri, 6 Feb 2026 12:13:08 +0530",
        "fetched_at": "2026-02-06 17:01:03.048206"
    },
    {
        "title": "'People Rejected You': SC Rejects Prashant Kishor-Led Party's Plea Challenging Bihar Elections",
        "content": "The Supreme Court on Friday dismissed a petition filed by Jan Suraaj, the political party led by poll strategist-turned-politician Prashant Kishor, challenging the outcome of the Bihar Assembly elections held in November last year. Refusing to entertain the plea, a bench headed by Chief Justice Surya Kant made sharp remarks on the party’s electoral defeat, saying, “The people rejected you and now you are using this judicial platform to gain publicity?\" Justice Joymalya Bagchi also questioned the maintainability of the petition, asking Jan Suraaj’s counsel how such claims could be raised directly before the apex court. The bench declined to hear the matter under Article 32 and asked the petitioner to approach the Bihar High Court instead. Jan Suraaj had sought to have the election results declared null and void, alleging large-scale violations of the Model Code of Conduct by the ruling Janata Dal (United)–Bharatiya Janata Party alliance. The party argued that the state government’s decision to disburse Rs 10,000 to one woman per family during the election period compromised the fairness of the polls. According to the petition, the benefit was extended to an estimated 25–35 lakh women voters while the Model Code was in force, amounting to “corrupt practices\" by the ruling coalition. Kishor had earlier claimed that the JD(U) distributed crores of rupees per constituency and said the party should not have won more than 25 seats under normal circumstances. In the election, however, Chief Minister Nitish Kumar’s JD(U) emerged as the largest party, winning 85 seats, far exceeding both its 2015 tally and Kishor’s own predictions. The Supreme Court noted that the broader issue of election freebies is already under its consideration in a separate case. In earlier observations, the court had warned that competitive promises of financial benefits could push states towards fiscal distress and has referred the issue to a three-judge bench. On Friday, the court said it was serious about examining the matter but would prefer petitions from “public-spirited\" individuals rather than parties that had suffered a complete electoral defeat. Jan Suraaj’s challenge follows a disappointing electoral debut for the party, which contested 238 seats but failed to win a single constituency, ending with a vote share of under four per cent. Kishor, who had previously engineered successful campaigns for both the BJP and JD(U), had predicted a decisive outcome for his party, either a major breakthrough or total failure.",
        "link": "https://www.news18.com/india/people-rejected-you-sc-rejects-prashant-kishor-led-partys-plea-challenging-bihar-elections-9883643.html",
        "date": "Fri, 6 Feb 2026 12:17:00 +0530",
        "fetched_at": "2026-02-06 17:01:03.774626"
    },
    {
        "title": "No Surge in Missing Cases: Delhi Police Warns Against Rumours for Monetary Gains | News18",
        "content": "'No need to panic, no surge in number of missing persons cases,' says Delhi Police\"Creating panic for monetary gains will not be tolerated,\" statement adds, , , , , , , , , n18oc_indiaNews18 Mobile App - https://onelink.to/desc-youtube",
        "link": "https://www.news18.com/videos/india/no-surge-in-missing-cases-delhi-police-warns-against-rumours-for-monetary-gains-news18-9885304.html",
        "date": "Fri, 6 Feb 2026 12:07:18 +0530",
        "fetched_at": "2026-02-06 17:01:04.440125"
    },
    {
        "title": "Big Blow to Thalapathy Vijay Before 2026 Elections: Income Tax Penalty Upheld | News18 Breaking",
        "content": "| Madras High Court dismisses actor and TVK chief Vijay's plea challenging Rs 1.5 crore tax penalty ‌ n18oc_indiaNews18 Mobile App - https://onelink.to/desc-youtube",
        "link": "https://www.news18.com/videos/india/big-blow-to-thalapathy-vijay-before-2026-elections-income-tax-penalty-upheld-news18-breaking-9885333.html",
        "date": "Fri, 6 Feb 2026 11:43:52 +0530",
        "fetched_at": "2026-02-06 17:01:05.063125"
    },
    {
        "title": "TVK's Vijay To Pay Rs 1.5 Cr Income Tax Penalty After Madras High Court Rejects Plea",
        "content": "The Madras High Court on Friday dismissed a petition filed by actor and Tamilaga Vetri Kazhagam (TVK) founder Vijay, who had challenged a Rs 1.5 crore penalty imposed by the Income Tax Department. Justice Senthilkumar Ramamoorty rejected the plea and upheld the demand notice issued by the department. The penalty relates to the assessment year 2015–16 and concerns alleged non-disclosure of income. According to the tax authorities, documents seized during a 2015 search at Vijay’s residence indicated that he had not declared Rs 15 crore earned from the film Puli. Based on these findings, the department issued an order on June 30, 2022 imposing the penalty. Vijay, however, maintained that he had declared an income of Rs 35.42 crore for the financial year 2016–17 and challenged the department’s action in court. A single judge had earlier admitted his petition on August 16, 2022 and granted interim relief by staying the operation of the penalty order. With Friday’s ruling, the High Court has now dismissed his challenge and allowed the tax department’s action to stand. Vijay argued that the penalty order ought to have been issued before June 30, 2019 and claimed that the delay made it invalid. The Income Tax Department, however, maintained that the action was lawful under the provisions of the Income Tax Act and urged the court to reject his petition. After considering both sides, the court agreed with the department’s stand and dismissed Vijay’s plea.",
        "link": "https://www.news18.com/india/tvks-vijay-to-pay-rs-1-5-cr-income-tax-penalty-after-madras-high-court-rejects-plea-9883505.html",
        "date": "Fri, 6 Feb 2026 11:26:34 +0530",
        "fetched_at": "2026-02-06 17:01:05.742502"
    },
    {
        "title": "Parliament Budget Session 2026 Highlights: Both Houses Adjourned Till Monday 11 AM",
        "content": "Parliament Budget Session Highlights: The Lok Sabha has been adjourned after witnessing a ruckus by the Opposition leaders on Friday. The MPs of the opposition walked out of the lower house and staged a protest against the government over the India-US trade deal. Earlier on Thursday, the Lok Sabha was adjourned amid the ruckus by the opposition. Meanwhile, Prime Minister Narendra Modi spoke on the Motion of Thanks on the President’s address in the Rajya Sabha. He also attacked Congress leader and Leader of Opposition in Lok Sabha Rahul Gandhi over a controversial “traitor” remark made against BJP MP Ravneet Singh Bittu, calling it an insult to the Sikh community and a reflection of Congress’ “arrogance at its peak. “What happened yesterday — the ‘Yuvraj’ of Congress, who has a ‘shaatir dimaag’ called a member of this House a traitor. His arrogance is at its peak. He did not call others who left Congress traitors, but he said it to this MP because he is a Sikh. This is an insult to Sikhs, an insult to the Gurus. This shows the hatred Congress carries,” PM Modi said. Raj Sabha proceedings began at 2 AM. BJP MP PP Chaudhary criticised the Congress over disruptions during the ongoing session, saying the party lacked facts and ideology. He urged the Opposition to adopt a constructive role in Parliament instead of what he called a destructive approach. “The way the Congress disrupted the House in this session, they have no facts and ideology… The Congress should take a constructive approach, but it has a destructive one,” he said. Rajya Sabha has been adjourned till 2 PM. Opposition MPs are holding protest against the government at the Makar Dwar of the Parliament. Lok Sabha proceedings continued with sloganeering by the Opposition. A ruckus began in Lok Sabha again after the proceedings began at 12 PM. Shiv Sena (UBT) MP Priyanka Chaturvedi criticised personal remarks made against former Prime Ministers, calling them “reprehensible”. She said those aligned with the BJP and RSS ideology should also acknowledge the contributions of past Prime Ministers. Lok Sabha proceedings adjourned till 12 PM amid ruckus by Opposition. Reacting to the prime minister’s speech in the Rajya Sabha and the opposition’s walkout, BJP MP Shashank Mani Tripathi alleged that the Congress has disregarded the Sikh community since 1984. He demanded that Rahul Gandhi apologise for calling Union MoS Ravneet Bittu a “traitor” and termed the Opposition’s walkout as condemnable. From 3:30 pm, the Lok Sabha will take up Private Members’ Business, during which several Bills are set to be introduced. These include proposals for constitutional changes, electoral law amendments, and welfare measures for farmers, fishermen, students, senior citizens, women and workers, along with legislation related to education, healthcare, environment, artificial intelligence, digital platforms, labour reforms and social security. Prime Minister Narendra Modi criticised Congress leader and Leader of Opposition Rahul Gandhi in Rajya Sabha on Thursday over his alleged “traitor” remark against BJP MP Ravneet Singh Bittu, calling it an insult to the Sikh community and a sign of Congress’ “arrogance at its peak”. The Lok Sabha will start the general discussion on the Union Budget at 11 AM, beginning with Question Hour. The House is also scheduled to take up Private Members’ Business later in the afternoon, where several proposed laws — including constitutional changes, electoral reforms and welfare measures — are expected to be introduced.",
        "link": "https://www.news18.com/india/parliament-budget-session-2026-live-updates-pm-modi-lok-sabha-rajya-sabha-rahul-gandhi-bjp-congress-latest-news-liveblog-9883252.html",
        "date": "Fri, 6 Feb 2026 14:55:49 +0530",
        "fetched_at": "2026-02-06 17:01:06.764419"
    },
    {
        "title": "Delhi To Launch Double-Decker Tourist Buses For Key Heritage Sites Soon | Check Routes And Fares",
        "content": "The national capital is gearing up to introduce a new sightseeing experience for visitors with the launch of double-decker tourist buses later this month. The initiative, led by the Delhi government, will link major heritage and cultural landmarks through a specially designed tourism circuit across the heart of the city. Senior officials said the service, likely to start in February, is being developed primarily for domestic and foreign tourists, with a strong focus on the central vista and nearby national monuments. The aim is to make some of Delhi’s most prominent attractions easier to access through a single, organised route. Major Heritage Sites To Be Linked Via This Service The planned circuit will include destinations such as the Pradhanmantri Sangrahalaya, National War Memorial, Bharat Mandapam, the new Parliament complex, Kartavya Path and Dilli Haat. Officials said the project seeks to present these landmarks as part of a unified tourism experience rather than isolated sites. The use of double-decker buses is expected to enhance sightseeing, with elevated seating offering wider views of monuments and ceremonial avenues. Authorities believe this format will provide a more engaging and relaxed way for visitors to explore the city. In addition to daytime operations, the tourism department is also working on evening sightseeing services. While the night-tour route has largely been finalised, details on operating hours are yet to be announced. An electric double-decker bus, along with two other buses, is expected to begin service around February 20, coinciding with the first anniversary of the Delhi government. The electric vehicle has been supplied by a private firm under a corporate social responsibility initiative. Originally housed at the Okhla depot under the transport department, the bus has now been transferred to the tourism department. According to officials, the service will operate from the Pradhanmantri Sangrahalaya and cover several major landmarks along the route. The fare has been fixed at Rs 500 for adults and Rs 300 for children aged between six and twelve years, news agency PTI reported. A guide will be on board to brief passengers about the historical and cultural significance of each location. Information on booking procedures and schedules will be released ahead of the official launch. Double-decker buses were once a familiar sight on Delhi’s roads, run by the Delhi Transport Corporation under the name “Suvidha\", before they were discontinued in 1989 following the gradual withdrawal of the ageing fleet.",
        "link": "https://www.news18.com/cities/new-delhi-news/delhi-to-launch-double-decker-tourist-buses-for-key-heritage-sites-soon-check-routes-and-fares-ws-l-9883094.html",
        "date": "Fri, 6 Feb 2026 08:21:55 +0530",
        "fetched_at": "2026-02-06 17:01:07.451020"
    },
    {
        "title": "Roads, Mining, Hydel Projects Claimed Nearly 1 Lakh Hectares Of India's Forest Land Since 2020",
        "content": "Nearly 97,050 hectares of forest land was diverted for non-forestry purposes in the last five financial years, starting 2020-21, the Union Environment Ministry told Parliament. Madhya Pradesh accounted for the largest share, with 902 such proposals for non-forestry use approved and only six rejected between 1st April 2020 and 31st March 2025. The government said that it gave the go-ahead to as many as 10,026 proposals during this period and rejected just 120 proposals—an overwhelmingly high approval rate, with only a handful of rejections. Some regions, like the Andaman and Nicobar Islands, where 26 projects were approved, saw no rejection. Jammu and Kashmir, as well as Manipur, Meghalaya, Tripura, and Mizoram in the Northeast, also saw no rejections. Out of the total projects considered during the last five years, most of them were approved in Gujarat (1560), with Haryana (1424) and Uttar Pradesh (1188) following closely behind. Roads cut the deepest into India’s forests, with nearly 22,233 hectares of forest land diverted for construction of roads alone. Mining and quarrying followed close behind, claiming 18,913 hectares of forest land, while hydel and irrigation projects claimed 17,434 hectares, and power transmission lines nearly 13,859 hectares. Remaining diversions were mostly for Defence (6,041 hectares), railways (5,957 hectares), and other developmental projects. Responding to questions, Minister of State (Environment, Forests, and Climate Change) Kirti Vardhan Singh said the diversion was approved under the Van (Sanrakshan Evam Samvardhan) Adhiniyam, 1980. “The central government, following the prescribed statutory approval process, takes prompt decisions on proposals for diversion of forest land, including all development projects, that are complete in all respects,\" he told Parliament. As per the conditions of approval, the states/UTs concerned have to ensure that a minimum number of trees are felled, and wherever feasible, translocation of trees is to be done, and the permission for felling of trees is given by the concerned states/UTs, he added. While Madhya Pradesh recorded the maximum diversion of forest land—24,346 hectares—it was followed by Odisha (12,875 hectares), Gujarat (6,850), and Arunachal Pradesh (6,656 hectares), as per the data from 2020-21 to 2024-25. The government attributed the reduction in timelines observed in the processing of Environmental Clearance (EC) proposals to “comprehensive regulatory reforms undertaken by the Environment Ministry, supported by technology-driven interventions such as GIS layers, Decision Support System\". The minister also cited the recently launched online single-window system for processing such proposals, as well as amendments to the Environment Impact Assessment (EIA) Notification, 2006, and office memorandums issued from time to time for reducing the duration. The government had also recently given appraisal powers to the State Environment Impact Assessment Authorities (SEIAAs) for sectors like mining, irrigation, and power projects, and also increased Expert Appraisal Committee meetings to at least twice a month to speed up proposal review. Under the Environment Impact Assessment (EIA) Notification, 2006, project proposals are examined by an Expert Appraisal Committee (EAC), which reviews their environmental impacts. The committee recommendations are then placed before the ministry, which takes the final decision on granting or rejecting environmental clearance. Forest diversion proposals from states are reviewed by an advisory committee under the Van (Sanrakshan Evam Samvardhan Adhiniyam), 1980.",
        "link": "https://www.news18.com/india/roads-mining-hydel-projects-claimed-nearly-1-lakh-hectares-of-indias-forest-land-since-2020-9882951.html",
        "date": "Fri, 6 Feb 2026 00:56:17 +0530",
        "fetched_at": "2026-02-06 17:01:08.139455"
    },
    {
        "title": "Centre, Nagaland Govt, Naga Tribes Body Sign Pact To Create Frontier Nagaland Territorial Authority",
        "content": "The Government of India, the Government of Nagaland and representatives of the Eastern Nagaland Peoples’ Organisation (ENPO) on Wednesday signed a historic agreement in New Delhi. The pact paves the way for the creation of the Frontier Nagaland Territorial Authority (FNTA) for six eastern districts of Nagaland that include Tuensang, Mon, Kiphire, Longleng, Noklak and Shamator and provides for the devolution of powers over 46 subjects to the new authority. The agreement was signed in the presence of Union Home Minister and Minister of Cooperation Amit Shah and Nagaland Chief Minister Neiphiu Rio. Calling the day “a very significant moment\" for a dispute-free Northeast, Shah said the Modi government is committed to resolving every long-pending issue through dialogue and democratic means. He noted that since 2019, the Centre has signed 12 major agreements in the region, stressing that, unlike earlier governments, the current administration ensures their implementation “in letter and spirit.\" Shah assured ENPO representatives that the Centre would actively support the development of Eastern Nagaland and shoulder its responsibilities. A fixed amount will be allocated annually for the region’s development, while the Union Ministry of Home Affairs will bear the initial expenditure for setting up the FNTA. The Home Minister said people of Eastern Nagaland had long felt deprived since the state’s formation and acknowledged the region’s strategic importance. He credited sustained efforts by the Ministry of Home Affairs for bridging differences between the ENPO and the Nagaland government, leading to the resolution of the dispute. Expressing gratitude to Chief Minister Neiphiu Rio and the Nagaland cabinet, Shah said their openness and cooperation helped take negotiations to a logical conclusion. “There will now be no obstacles in the path of Eastern Nagaland’s development,\" he said, adding that the agreement reflects the government’s commitment to fulfilling the genuine aspirations of the people. Under the arrangement, a mini-secretariat for the FNTA will be set up, headed by an Additional Chief Secretary or Principal Secretary. Development outlay for Eastern Nagaland will be shared in proportion to population and area. The agreement clarifies that it does not affect the provisions of Article 371(A) of the Constitution. The pact envisages accelerated development of Eastern Nagaland through greater financial autonomy, enhanced decision-making, improved infrastructure, economic empowerment and optimal use of resources. Senior officials from the Centre and the Nagaland government, along with the Deputy Chief Minister and other dignitaries, were present at the signing ceremony.",
        "link": "https://www.news18.com/india/centre-nagaland-govt-naga-tribes-body-sign-pact-to-create-frontier-nagaland-territorial-authority-ws-l-9882805.html",
        "date": "Thu, 5 Feb 2026 21:40:18 +0530",
        "fetched_at": "2026-02-06 17:01:08.746574"
    },
    {
        "title": "204 Special Train Trips For Holi Announced By North Central Railway | Check Routes",
        "content": "To deal with heavy passenger rush likely during Holi festival, the North Central Railway (NCR) has released a comprehensive plan to ensure smooth travel across key corridors. According to the zonal railway, 204 trips of special trains have been notified. The statement issued by the NCR, stated it will have primary ownership of five pairs of special trains, totalling 10 trains and 36 trips. “These trains will originate from key stations from NCR to accommodate travelers heading towards Mumbai, Pune, and South India. These services are scheduled to operate as per respective time tables from February 15, 2026, to March 31, 2026, facilitating travel during the peak festive period,\" it said. The five pairs of originating trains are: The 204 trips of special trains will pass through the NCR network, covering various stations including important stations like Agra, Kanpur, Prayagraj, and Jhansi, among others. The NCR said that the ticket booking for these “Festival Specials\" will begin soon. “Passengers can check specific train numbers, timings, and availability on the IRCTC website or the NTES app. These are the trains notified till date and the services of more special trains will be notified as per the requirement and increase in rush,\" it said, adding that passengers should book early to secure confirmed berths.",
        "link": "https://www.news18.com/india/204-special-train-trips-for-holi-announced-by-north-central-railway-check-routes-ws-l-9882787.html",
        "date": "Thu, 5 Feb 2026 21:31:57 +0530",
        "fetched_at": "2026-02-06 17:01:09.356858"
    },
    {
        "title": "'To Protect Buyers, Deliver Their Dream Homes': SC Asks NBCC To Take Over Stalled Supertech Projects",
        "content": "The Supreme Court on Thursday intervened to bring relief to thousands of Supertech homebuyers, issuing a landmark ruling for the state-owned National Buildings Construction Corporation to take over and finish 16 stalled projects under the real estate developer. The court said this is to protect thousands who have waited over a decade for their Supertech housing units and to finally deliver their “dream homes\" to them. By invoking its extraordinary powers under Article 142 of the Constitution, the SC said the National Buildings Construction Corporation (NBCC) must take over. A bench comprising Chief Justice Surya Kant and Justice Joymalya Bagchi used these plenary powers to uphold a December 2024 order by the National Company Law Appellate Tribunal (NCLAT). The court said approximately 51,000 homes had been booked between 2010 and 2012, leaving families in limbo for years. To ensure progress remains uninterrupted, the bench has prohibited other legal bodies, including all high courts and tribunals, from issuing orders that might freeze the ongoing work. This is intended to allow the NBCC to complete the debt-ridden projects expeditiously and without further judicial interference. The apex court said judicial priority is now focused entirely on the delivery of completed homes equipped with essential utilities, rather than the immediate demands of corporate creditors. Chief Justice Surya Kant made it clear that the interests and dues of financial and operational creditors will only be addressed after the delivery of fully-furnished houses to the buyers. These must have all the assured facilities, including water, electricity, sewage connections, roads, and parks. As a result of this prioritisation, financial lenders are expected to accept reduced payments, or a “haircut\", to facilitate the recovery process. The bench described these reduced payments as “just and equitable\" and ruled that the NBCC’s takeover is not contrary to the Insolvency and Bankruptcy Code (IBC). “We find that the order passed by the NCLAT on December 12, 2024, in bringing the NBCC on record for the completion of the pending housing projects is neither unfair nor contrary to the provisions of the Insolvency and Bankruptcy Code (IBC),\" the bench ordered while taking recourse of Article 142, which grants the top court plenary power to pass any decree or order necessary for doing “complete justice\" in any case. The NBCC will now undertake the projects – previously estimated to cost approximately Rs 9,500 crore – with the support of an expert committee. While disposing of the pleas, the bench noted that parties may still approach the court should any new developments obstruct the ongoing construction. On February 21, 2025, the court had stayed an order appointing the NBCC as the project management consultant to complete the 16 housing projects of Supertech at a cost of nearly Rs 9,500 crore.",
        "link": "https://www.news18.com/india/to-protect-buyers-deliver-their-dream-homes-sc-asks-nbcc-to-take-over-stalled-supertech-projects-ws-l-9881884.html",
        "date": "Thu, 5 Feb 2026 20:05:13 +0530",
        "fetched_at": "2026-02-06 17:01:10.047508"
    },
    {
        "title": "Poll Body's Big Attack On TMC Govt, Cites 'Systematic Pattern Of Violence' Against Officials",
        "content": "The Election Commission of India (ECI) has accused the Trinamool Congress (TMC) government in West Bengal of “systematic pattern of violence and threats\" against election officials, while also alleging police of unwillingness to act against such incidents. After West Bengal Chief Minister Mamata Banerjee appeared in the Supreme Court and spoke against the Special Intensive Revision (SIR) of electoral rolls, the poll body filed a counter in the apex court, alleging numerous instances of violence, intimidation and obstruction against election officials engaged in the SIR process. Sujeet Kumar Mishra, Secretary, ECI, alleged a “pervasive reluctance\" among local police authorities to register FIRs in response to grievances articulated by BLOs, and many of them were only filed after the direct intervention of the DEO (District Election Officer). While other states promptly adhered to ECI directives regarding SIR, West Bengal willfully neglected to do so. In its response, the ECI claimed that protesters claiming to be BLOs attempted forceful entry into the office of Bengal’s Chief Electoral Officer (CEO), broke the police blockade and vandalised the office. It said officers were prevented from entering and leaving the office complex as the office was also gheraoed, resulting in significant impediments to the execution of duties by officers. The ECI said it directed the Kolkata Police Commissioner to ensure that no untoward incident occurs again. Despite explicit directives to the police, the protesters were not removed and remained in the office premises for 28 hours. It further said that the CEO was the sole electoral official in the country who had been accorded ‘Y+’ category security. It also detailed a disturbing pattern of conduct “previously unseen during electoral roll revision exercises\" in Bengal, including a statement by a cabinet minister that he will “break the legs of Election Commission\". The poll agency observed that groups of women, allegedly mobilised by political operatives, obstructed the activities of BLOs and EROs. ‘Provocative’ Statements Of Mamata Banerjee, Police Inaction The Election Commission also observed that Chief Minister Mamata Banerjee “persistently delivered a series of public addresses that are inherently provocative, thereby engendering an atmosphere of intimidation among the election officials tasked with the separation and revision of the electoral roll.\" It also accused the CM of engaging in fear-mongering, disseminating misleading and erroneous information about the SIR process and threatening election officials, which prompted several observers to withdraw from their SIR responsibilities due to fear of violent assaults. It also said BLOs are facing overwhelming stress due to systematic police indifference and the failure to register FIRs, interference by Booth Level Agents of political factions. A roll observer reported that women’s mob in Debipur shouting “BJP dalal\" slogans, chasing team with broomsticks after the CM’s “kitchen tools\" call. The affidavit blamed “inadequacies of state machinery\" and “prevailing climate of political interference\" for a “singular and alarming breakdown\" in West Bengal SIR. The Commission warned that political rhetoric from TMC leaders vitiates conditions for a “free, fair and fearless\" revision process in West Bengal. Mamata Banerjee has previously characterised the exercise as a vehicle for “unspeakable harassment\", alleging it has resulted in “as many as 140 deaths\" and violates the Representation of the People Act. In a series of letters addressed to the CEC, she has sounded an alarm on what she describes as “institutional overreach\" and a “dangerous erosion of trust\" in democratic processes.",
        "link": "https://www.news18.com/india/ecis-big-attack-on-tmc-govt-claims-systematic-pattern-of-violence-against-poll-officials-ws-kl-9882552.html",
        "date": "Thu, 5 Feb 2026 20:14:32 +0530",
        "fetched_at": "2026-02-06 17:01:10.655232"
    },
    {
        "title": "News18 Evening Digest: PM Modi Slams Congress, Hails Govt's Big Trade Deals & Other Top News",
        "content": "‘No Vision, No Willpower’: PM Modi Slams Congress, Touts Govt’s Big Trade Deals With US, EU ‘Sahkar, Not Sarkar’: Amit Shah Launches Bharat Taxi Service, Promises Big Benefits For Drivers ‘You Appear In Court To Defend Illegals’: PM Modi’s Jibe At Mamata Banerjee’s SIR Plea 16 Labourers Killed, Several Trapped After Explosion Rocks Meghalaya Coal Mine ‘Korean Was Our Life’: Ghaziabad Sisters’ Diary Flags Distress, Isolation Before Deaths Honeymoon Murder 2.0: Man Dies In Hit-And-Run Planned By Wife, Her Boyfriend On a breezy Friday evening, a newlywed couple from Rajasthan – Ashish and Anju – went out for a walk, just when a vehicle hit them. While Ashish died on the spot, Anju was robbed of her gold jewellery and left unconscious on the road. Pakistan’s ‘Brotherhood With Muslim Cousins’ Termed ‘Disaster’ For India: ‘We’re Not Going…’ Ranbir Kapoor Drops BIG Hint About Sandeep Reddy Vanga’s Animal Park: ‘There’s Another Character…’ The journey of Animal is far from over. Months after the film’s explosive run at the box office, Ranbir Kapoor and director Sandeep Reddy Vanga have begun openly speaking about its sequel, Animal Park, offering fans fresh insight into what lies ahead.",
        "link": "https://www.news18.com/india/news18-evening-digest-pm-modi-slams-congress-hails-govts-big-trade-deals-other-top-news-ws-l-9882308.html",
        "date": "Thu, 5 Feb 2026 18:47:19 +0530",
        "fetched_at": "2026-02-06 17:01:11.362578"
    },
    {
        "title": "PM Modi Says Unmanned Railway Crossings Eliminated, Villages Electrified as He Attacks Congress",
        "content": "Prime Minister Narendra Modi said unmanned railway crossings have been eliminated, villages electrified, and defence preparedness strengthened, while accusing the Opposition of targeting him for pursuing welfare-driven governance during his Rajya Sabha address. n18oc_india News18 Mobile App - https://onelink.to/desc-youtube",
        "link": "https://www.news18.com/videos/india/pm-modi-says-unmanned-railway-crossings-eliminated-villages-electrified-as-he-attacks-congress-9884127.html",
        "date": "Thu, 5 Feb 2026 18:37:39 +0530",
        "fetched_at": "2026-02-06 17:01:11.998067"
    },
    {
        "title": "PM Modi Escalates Attack On Congress, Highlights Banking, PSU and Agricultural Reforms | News18",
        "content": "Prime Minister Narendra Modi highlighted reforms in banking, public sector undertakings (PSUs), and agriculture while escalating his attack on the Congress during his address in Parliament. n18oc_india News18 Mobile App - https://onelink.to/desc-youtube",
        "link": "https://www.news18.com/videos/india/pm-modi-escalates-attack-on-congress-highlights-banking-psu-and-agricultural-reforms-news18-9884088.html",
        "date": "Thu, 5 Feb 2026 18:24:32 +0530",
        "fetched_at": "2026-02-06 17:01:12.596432"
    },
    {
        "title": "PM Modi Quotes Indira Gandhi To Criticise Congress Govt's Functioning: ‘Knew Shortcomings But...'",
        "content": "Prime Minister Narendra Modi launched a sharp attack on former Prime Minister Indira Gandhi’s development record, citing what he called systemic rigidity in India’s planning apparatus that hampered infrastructure projects for generations. Addressing Parliament during the Motion of Thanks to the President’s Address, PM Modi invoked Indira Gandhi’s own acknowledgment of the disconnect between policymakers and ground realities, using it to criticize the Planning Commission she once chaired. “I had gone to Himachal Pradesh. When I returned, I told the Planning Commission that our workers need mules, not jeeps. But we were told that the funds are only available for jeeps; there is no policy to fund mules. They said, if there are no proper roads, then what use is a jeep,\" PM Modi said, quoting Indira Gandhi’s remarks. PM Modi said this reflected “a system that knew its shortcomings but did not reform itself.\" The Planning Commission, established in 1950 with Jawaharlal Nehru- Indira Gandhi’s father- as its first chairman, was responsible for drafting and implementing India’s Five-Year Plans. The Planning Commission was dissolved in 2014 under PM Modi’s government and replaced with NITI Aayog. PM Modi highlighted the Congress party’s historical failure to deliver timely and efficient development, asserting, “A significant part of our energy is being spent on correcting the mistakes of the past. It takes great effort to erase the image that was created in the minds of the world during that period.\" The Prime Minister also cited the Sardar Sarovar Dam on the Narmada River as a case study of delayed execution and policy inertia under previous administrations. The multipurpose dam’s foundation stone was laid in 1961 but it officially became operational only in 2017- more than five decades later and roughly 30 years after construction began in earnest. The Sardar Sarovar Dam, part of the broader Narmada Valley development initiative, faced numerous obstacles over its decades-long journey. Construction was stalled in the 1990s by court orders related to rehabilitation and resettlement conditions for displaced communities. Procedural and clearance issues further bogged down progress, keeping it mired in administrative hurdles. PM Modi contrasted the delays and inefficiencies of past governments with his administration’s emphasis on future-ready policies, strategic governance and faster project execution, arguing that India is now on a more decisive development path. “That is why we have placed strong emphasis on future-ready policies. Today, the country is being governed on the basis of policy and strategy,\" PM Modi said.",
        "link": "https://www.news18.com/india/pm-modi-quotes-indira-gandhi-to-criticise-congress-govts-functioning-knew-shortcomings-but-ws-l-9882188.html",
        "date": "Thu, 5 Feb 2026 18:26:59 +0530",
        "fetched_at": "2026-02-06 17:01:13.201415"
    },
    {
        "title": "Playing Obscene Songs In Public? Jail And Fines Await, Warns Bihar Govt",
        "content": "The Bihar government has announced a strict crackdown on the playing of obscene and double-meaning songs in public places and vehicles, warning of legal action, including fines and imprisonment, for violators. Deputy Chief Minister and Home Minister Samrat Choudhary has issued firm directions to the police headquarters, instructing officers across all districts to immediately stop the playing of vulgar songs, whether in Bhojpuri, Magahi, Maithili or any other language. He has asked the police to launch special drives to identify offenders and initiate strict legal action against them. Mr Choudhary said the decision was taken in the interest of social decency and public safety, noting that obscene songs played in public spaces have a deeply negative impact on society, particularly on children. He added that such content not only promotes vulgarity but also undermines women’s safety and dignity. Banning obscene songs, he said, is essential to creating a secure and respectful environment for women. As part of the move, obscene songs will no longer be permitted in buses, auto-rickshaws, taxis, trains or any other public place. Following the government’s directive, Bihar Police has launched a statewide campaign along with a public appeal under the slogan “No obscene songs, build a civilised society\". The police have clarified that playing obscene or double-meaning songs in public will now be treated as a serious punishable offence. Drivers and vehicle owners found violating the order will face heavy fines and may also be sent to jail. Under the new enforcement measures, police will register cases under Sections 296 and 79 of the Bharatiya Nyaya Sanhita (BNS), 2023, along with other applicable provisions. Citizens have been urged to oppose such acts and report violations to the nearest police station. The state government has emphasised that public participation is crucial to eliminating obscenity from public life. Bihar Police, appealing to citizens, said a civilised and safe society can be achieved not only through strict laws but also through collective responsibility and cooperation.",
        "link": "https://www.news18.com/india/playing-obscene-songs-in-public-jail-and-fines-await-warns-bihar-govt-ws-kl-9881890.html",
        "date": "Thu, 5 Feb 2026 18:04:18 +0530",
        "fetched_at": "2026-02-06 17:01:13.887754"
    },
    {
        "title": "India Has Become a Beacon of Hope, PM Modi Cites High Growth, Low Inflation In Rajya Sabha | News18",
        "content": "Prime Minister Narendra Modi said India has emerged as a “beacon of hope” amid global challenges while highlighting strong economic indicators, including high growth and low inflation, during his reply to the Motion of Thanks in Parliament. n18oc_india News18 Mobile App - https://onelink.to/desc-youtube",
        "link": "https://www.news18.com/videos/india/india-has-become-a-beacon-of-hope-pm-modi-cites-high-growth-low-inflation-in-rajya-sabha-news18-9884091.html",
        "date": "Thu, 5 Feb 2026 17:26:25 +0530",
        "fetched_at": "2026-02-06 17:01:14.488487"
    },
    {
        "title": "'No Vision, No Willpower': PM Modi Slams Congress, Touts Govt's Big Trade Deals With US, EU",
        "content": "Prime Minister Narendra Modi said India’s recent trade agreements with the United States and the European Union have generated a sense of economic stability and forward momentum, while creating wide-ranging opportunities for the country’s youth. Addressing the Rajya Sabha during the Motion of Thanks to the President’s Address, PM Modi described the agreements as “future‑ready\" pacts that are strengthening India’s position in the global economy. “After the trade deal with the US, there is a feeling of stability and a sense of forward movement,\" he said. The Prime Minister said India is increasingly signing major trade deals with key global partners. “In the past few days, we have signed agreements with nine significant nations. The most comprehensive of these is with a bloc of 27 countries, including the European Union,\" he added. PM Modi highlighted that major economies are keen to strengthen trade ties with India. “Countries around the world are eager to expand trade relations with India. Whether it is the EU deal or the recent pact with the US, these agreements are receiving broad international praise,\" he said. He also stressed the global significance of these agreements. “When we signed the trade deal with the EU, the world became more confident about the greater likelihood of global stability. After the trade deal with the US, the world became even more confident that with stability, they can sense a speed too. This is a positive sign for the world,\" the Prime Minister said. Highlighting the domestic impact, PM Modi said the agreements would directly benefit India’s youth across regions and social groups. “The US trade deal will be most beneficial to the youth, including those from urban areas and rural, as well as for girls and boys. The demand for young professionals is growing around the world, and since so many foreign companies are setting up here, the opportunities are abundant for Indian young professionals as well,\" he said. Placing India’s economic trajectory in a broader geopolitical context, the Prime Minister said the world is witnessing a major transition. “There was a new world order after the Second World War, and now the world is moving towards a new world order. The bent is towards India, which is a vishvabandhu,\" he said. Launching a sharp attack on the Congress, PM Modi said past governments had left behind a damaged global image. “A significant part of our energy is being spent on correcting the mistakes of the past. It takes great effort to erase the image that was created in the minds of the world during that period. They left things in such a damaged state,\" he said. He said this is why the NDA government has prioritised long-term policy planning. “That is why we have placed strong emphasis on future-ready policies. Today, the country is being governed on the basis of policy and strategy,\" PM Modi said, taking a swipe at past controversies. “Even now, when people speak about them, they don’t talk about trade deals. They talk about deals like Bofors,\" he said. Asserting that global confidence in India is steadily rising, the Prime Minister said, “Global trust in India is growing. Guided by the mantra of ‘reform, perform, transform,’ we have moved forward, and the reality today is that the nation has boarded the Reform Express.\" Describing the current decade as a defining phase for India, he added, “The first quarter of the 21st century has completed. But this second quarter is decisive, just like the second quarter of India’s freedom struggle in the last century was. I can clearly see that in the direction of building Viksit Bharat, this second quarter is going to be equally capable.\"",
        "link": "https://www.news18.com/india/no-vision-no-willpower-pm-modi-slams-congress-touts-ndas-big-trade-deals-ws-l-9882048.html",
        "date": "Thu, 5 Feb 2026 18:12:47 +0530",
        "fetched_at": "2026-02-06 17:01:15.170124"
    },
    {
        "title": "Asaram's Ashram To Be Demolished? Gujarat HC Allows Govt To Take Over Rs 500-Crore Land",
        "content": "The long-running dispute over nearly 45,000 square metres of land at Asaram’s ashram in Motera, Ahmedabad, has reached a decisive end, with the Gujarat High Court allowing the state government to reclaim the land, paving the way for the removal of illegal constructions and future development. Following the ruling, authorities have accelerated preparations to clear unauthorised structures from the ashram complex. The land has been earmarked for expansion of the Sardar Patel Sports Enclave, a key project linked to the state’s preparations for the Commonwealth Games 2030. According to official records, the premises contained at least 32 illegal structures, valued at around Rs 500 crore. Investigations found that these structures were not only illegal but were also being used for commercial purposes. Citing violations of building rules and encroachment on government land, the collector’s office had earlier issued notices to the ashram trust. The trust subsequently sought to regularise the constructions by paying an “impact fee\", but the request was rejected by the authorities, leading to the legal battle. Delivering the verdict, Justice Vaibhavi Nanavati ruled in favour of the state, observing that the government’s action was justified in view of serious rule violations and the larger public interest involved in development projects. With the court’s clearance, the Ahmedabad Municipal Corporation is now authorised to remove the illegal structures at any time after completing security and procedural formalities. Officials said the land would be utilised for a modern sports complex, training facilities and a proposed Olympic village as part of the Sports Enclave project. The verdict is being seen as a significant boost to Gujarat’s infrastructure plans, particularly its ambition to host the Commonwealth Games 2030. State officials have maintained that world-class sports facilities are essential for the event and that the Motera land is strategically critical to these preparations. Asaram, who is serving a life sentence in a rape case and was recently granted conditional bail on medical grounds, visited the Surat ashram on January 2 after nearly 13 years. Videos showing followers welcoming him with music and celebrations had drawn public attention.",
        "link": "https://www.news18.com/india/asarams-ashram-to-be-demolished-gujarat-hc-allows-govt-to-take-over-rs-500-crore-land-ws-kl-9881465.html",
        "date": "Thu, 5 Feb 2026 15:43:06 +0530",
        "fetched_at": "2026-02-06 17:01:15.778478"
    },
    {
        "title": "'Sahkar, Not Sarkar': Amit Shah Launches Bharat Taxi Service, Promises Big Benefits For Drivers",
        "content": "Union Home Minister Amit Shah on Thursday launched Bharat Taxi, a cooperative-owned platform that enables drivers to operate as owners, ensuring zero commission and eliminating surge pricing. The service aims to compete with apps like Uber and Ola. The Cooperation Ministry described Bharat Taxi as a transformative initiative in the mobility sector, placing drivers —referred to as sarathis (charioteers) — at the centre of ownership, operations, and value creation, thereby freeing them from exploitative aggregator-based models. Speaking at the launch event, Amit Shah said the Bharat Taxi service will provide major convenience for taxi drivers, saying that “sahkar (helper), not Sarkar (government)\" is formally entering the taxi sector. “In this system, every driver (Sarathi) is the owner of the taxi, and this structure will bring a revolutionary economic transformation. Like Amul in Gujarat, this is a unique cooperative model of its kind in the world. The wheels of your taxi will run for the benefit of the Sarathi community—this is the spirit of cooperation,\" he said. Shah further revealed that Bharat Taxi was envisioned as a unified mobility platform that offered two-wheelers, three-wheelers and four-wheelers. “Bharat Taxi “Sarathi Didi\" will play a key role in ensuring the safety, dignity, and empowerment of women riders and drivers,\" he added. The Home Minister said the taxi service will be rolled out in three years, and the government will charge 20% of the revenue earned by the platform, while the rest will be transferred into the accounts of each Sarathi. “Until now, fares were first credited to the company’s account and a commission was deducted. That system ends here. Bharat Taxi will charge zero commission. Not even one percent,\" he added. “All payments will be transferred directly from the customer to the Sarathi’s account — no middleman, no delays.\" Furthermore, the platform will also exclude booking fees, heavy platform charges, and hidden commissions from the Sarathi app, making it more convenient for drivers and travellers. All the profits earned will be directly transferred into accounts of the drivers associated with the Bharat Taxi service. However, Amit Shah also cautioned drivers to maintain professional standards and behaviour with travellers. The event was also graced by Union Minister of State for Cooperation Krishan Pal Gurjar; Union Minister of State for Cooperation Murlidhar Mohol; Dr. Ashish Kumar Bhutani, Secretary, Ministry of Cooperation and other senior dignitaries. The Cooperation Ministry said Amit Shah will distribute share certificates to the top six performing Sarathis, further reinforcing the core principle of ‘Sarathi Hi Malik’. Each honoured Sarathi will be provided with a personal accident insurance cover of Rs 5 lakh and a family health insurance cover of Rs 5 lakh, reflecting Bharat Taxi’s commitment to driver welfare and long-term social security. Bharat Taxi prioritises social security for Sarathis through health insurance, accident insurance, retirement savings, and a dedicated driver support system. Support centres are being operated at seven key locations in Delhi. The platform provides rapid emergency assistance, verified ride data, and allows drivers the freedom to work on other platforms without any exclusivity clauses. To promote women’s empowerment, initiatives such as “Bike Didi\" are being implemented, under which more than 150 women drivers have joined Bharat Taxi so far.",
        "link": "https://www.news18.com/india/sahkar-not-sarkar-amit-shah-launches-bharat-taxi-service-promises-big-benefits-for-drivers-9881648.html",
        "date": "Thu, 5 Feb 2026 15:59:27 +0530",
        "fetched_at": "2026-02-06 17:01:16.412004"
    },
    {
        "title": "SC Directs West Bengal Govt To Recalculate DA, Pay Pending Arrears, 1st Installment By March 31",
        "content": "In a major relief for West Bengal Government employees, the Supreme Court on Thursday directed the Mamata Banerjee-government to refix Dearness Allowance (DA) for its employees for the period 2008 to 2019, holding that DA must be calculated as per the formula laid down in the ROPA Rules. The court said DA is a statutory right as it forms part of the calculation of total emoluments under these rules. SC ordered that arrears of DA from 2009 to 2019 be released to the employees. Considering the financial implications, the Supreme Court set up a committee headed by former Supreme Court judge Justice Indu Malhotra. The panel will also include two retired High Court Chief Justices and the Comptroller and Auditor General (CAG) or a senior officer deputed by the CAG to determine the payment of DA to Bengal state employees. The bench comprised Justice Sanjay Karol and Justice P K Mishra. The committee will calculate the total dearness allowance due and set a payment schedule in consultation with state authorities. The Supreme Court directed completion of this exercise before March 6, 2026. It also ordered the first installment to be paid by March 31, 2026, extending benefits to retired employees. The appeals were filed by the state of West Bengal after it faced adverse orders in earlier litigation. The court framed and examined 13 questions, including the scope of powers under Article 309 of the Constitution, the scope of the ROPA Rules, whether state rules on DA align with ROPA, whether DA is static or dynamic, and whether employees’ legitimate expectations were violated. It also examined the impact of directions of the Central Administrative Tribunal to follow AICPI rules, whether financial capacity can be grounds to deny DA, and whether DA is a fundamental right. The court held that DA is not static and is subject to change under the rules. It said DA is necessary for computing total emoluments. The Supreme Court said the West Bengal government’s decision to change DA rules was a deviation without underlying reasons or principles and described the decision as “capricious\". Legitimate expectations of employees The court observed that employees had legitimate expectations due to changes in the ROPA and AICPI rules. It rejected the state’s argument that the Centre was imposing its power, calling it a “figment of imagination\". On judicial review, the court said that once a right is conferred on employees, fiscal policy cannot stand in the way of granting it. The court, however, left the question of whether DA is a fundamental right to be decided in an appropriate forum. It also noted that DA cannot be granted twice in a year.",
        "link": "https://www.news18.com/india/sc-directs-west-bengal-govt-to-recalculate-da-pay-pending-arrears-1st-installment-by-march-31-9881147.html",
        "date": "Thu, 5 Feb 2026 14:03:44 +0530",
        "fetched_at": "2026-02-06 17:01:17.083161"
    },
    {
        "title": "You Cancelled Your Train Ticket, Railways Made Rs 90 Crore From It",
        "content": "Railway ticket cancellations are often seen as a minor inconvenience for passengers, but over time, they add up to significant numbers for the system. Recent data from South Western Railway shows how routine changes in travel plans have translated into substantial revenue, offering a glimpse into shifting post-pandemic travel behaviour and the growing flexibility passengers expect from train journeys. Data from South Western Railway shows that cancellation charges, also known as clerkage fees, brought in about Rs 90.4 crore between 2021 and 2025 across its Bengaluru, Mysuru, and Mangaluru divisions. Post-Pandemic Travel Patterns Drive Cancellations In 2021, when train services were still restricted due to Covid-19 protocols, revenue from ticket cancellations was negligible, amounting to just a few lakh rupees. However, as services resumed and passenger confidence returned, cancellation collections rose sharply. In 2022, South Western Railway earned around Rs 28 lakh through cancellations. The number surged in the following years, reaching about Rs 27 crore in 2023, Rs 30.3 crore in 2024, and approximately Rs 32.9 crore in 2025. Officials say the steady increase mirrors the return of regular travel and greater flexibility in how passengers plan their journeys. Railway officials say most cancellations occur due to changes in travel plans, waiting-list tickets failing to get confirmed, or passengers opting for alternative modes of transport. They clarified that the rise in cancellation revenue is not linked to ticket hoarding or misuse but reflects more dynamic travel decisions. As train connectivity stabilised after the pandemic, more passengers booked tickets early, confident that services would operate as scheduled. At the same time, the option to cancel when plans changed meant a higher number of tickets were refunded with applicable deductions. How Cancellation Charges Are Calculated Under Indian Railways rules, cancellation charges vary based on the time of cancellation and the class of travel. When a ticket is cancelled more than 48 hours before departure, a fixed clerkage fee is deducted. This ranges from Rs 240 for AC First Class to Rs 60 for Second Sitting, with different slabs for other classes. If a ticket is cancelled between 48 hours and 12 hours before departure, 25 percent of the fare is deducted, subject to the minimum clerkage applicable to that class. Closer to departure, higher deductions apply. South Western Railway has collected more than Rs 90 crore from ticket cancellation charges over the last five years, turning last-minute changes in passenger travel plans into a steady revenue stream. The figures highlight how rail travel has rebounded after the pandemic, with more passengers booking reserved tickets and cancelling them when plans change. Despite the sharp rise in cancellation revenue, railway officials said there has been no significant increase in passenger complaints related to cancellation charges in the South Western Railway zone. This suggests that most travellers are aware of the rules and accept the deductions as part of the booking process. What This Means for Passengers For frequent rail travellers in Karnataka and neighbouring regions, the data underlines the importance of planning cancellations carefully to minimise deductions. While cancellation charges help railways offset administrative and operational costs, passengers can avoid higher losses by cancelling tickets well in advance. Officials expect cancellation revenue to remain stable as travel demand normalises, reflecting both the growing use of reserved tickets and the flexibility passengers now expect from rail travel. Post-Pandemic Travel Patterns Drive Cancellations In 2021, when train services were still restricted due to Covid-19 protocols, revenue from ticket cancellations was negligible, amounting to just a few lakh rupees. However, as services resumed and passenger confidence returned, cancellation collections rose sharply. In 2022, South Western Railway earned around Rs 28 lakh through cancellations. The number surged in the following years, reaching about Rs 27 crore in 2023, Rs 30.3 crore in 2024, and approximately Rs 32.9 crore in 2025. Officials say the steady increase mirrors the return of regular travel and greater flexibility in how passengers plan their journeys. Railway officials say most cancellations occur due to changes in travel plans, waiting-list tickets failing to get confirmed, or passengers opting for alternative modes of transport. They clarified that the rise in cancellation revenue is not linked to ticket hoarding or misuse but reflects more dynamic travel decisions. As train connectivity stabilised after the pandemic, more passengers booked tickets early, confident that services would operate as scheduled. At the same time, the option to cancel when plans changed meant a higher number of tickets were refunded with applicable deductions. How Cancellation Charges Are Calculated Under Indian Railways rules, cancellation charges vary based on the time of cancellation and the class of travel. When a ticket is cancelled more than 48 hours before departure, a fixed clerkage fee is deducted. This ranges from Rs 240 for AC First Class to Rs 60 for Second Sitting, with different slabs for other classes. If a ticket is cancelled between 48 hours and 12 hours before departure, 25 percent of the fare is deducted, subject to the minimum clerkage applicable to that class. Closer to departure, higher deductions apply. South Western Railway has collected more than Rs 90 crore from ticket cancellation charges over the last five years, turning last-minute changes in passenger travel plans into a steady revenue stream. The figures highlight how rail travel has rebounded after the pandemic, with more passengers booking reserved tickets and cancelling them when plans change. Despite the sharp rise in cancellation revenue, railway officials said there has been no significant increase in passenger complaints related to cancellation charges in the South Western Railway zone. This suggests that most travellers are aware of the rules and accept the deductions as part of the booking process. What This Means for Passengers For frequent rail travellers in Karnataka and neighbouring regions, the data underlines the importance of planning cancellations carefully to minimise deductions. While cancellation charges help railways offset administrative and operational costs, passengers can avoid higher losses by cancelling tickets well in advance. Officials expect cancellation revenue to remain stable as travel demand normalises, reflecting both the growing use of reserved tickets and the flexibility passengers now expect from rail travel. Scan the QR code to download the News18 app and enjoy a seamless news experience anytime, anywhere.",
        "link": "https://www.news18.com/india/you-cancelled-your-train-ticket-railways-made-rs-90-crore-from-it-skn-ws-l-9881097.html",
        "date": "Thu, 5 Feb 2026 13:27:18 +0530",
        "fetched_at": "2026-02-06 17:01:17.823712"
    },
    {
        "title": "Air Force To Hold Mega Firepower Exercise 'Vayu Shakti' Near Western Border On February 27",
        "content": "The Indian Air Force (IAF) will conduct its mega firepower exercise, Vayu Shakti, on February 27, defence sources have told CNN-News18. The exercise, which will feature the frontline weapon systems and platforms of the force, will be held close to the western borders in Rajasthan and preparations for the same are ongoing. The high-profile drill will feature live armament firing and real-time weapon system engagements aimed at demonstrating the IAF’s operational readiness and combat capabilities. Delegations from around 40 countries, along with some VVIPs from within the country, will be witness to the live exercise. Frontline combat platforms, including Su-30 MKI, Rafale, LCA Tejas and Mirage aircraft, will participate and put up a show with coordinated air operations, precision strikes and integrated mission execution. Several missile systems like Akash will also be featured, the sources added. The exercise will highlight the IAF’s combat experience and deterrence capability, coming a year after Operation Sindoor in which Indian air power played a decisive role in striking Pakistani bases, downing enemy fighters and forcing Islamabad to seek a ceasefire. As part of the build-up, a Full Dress Rehearsal (FDR) is scheduled for February 24. The 2025 edition of Exercise Vayu Shakti had drawn wide attention for its scale and complexity, with extensive live firing, precision bombing and network-centric warfare drills. Multiple fighter types operated in a simulated high-intensity conflict environment, demonstrating the IAF’s ability to conduct swift, coordinated and lethal air operations across the battlespace. In 2025, the exercise saw participation of 121 aircraft, including the indigenous Tejas, Prachand and Dhruv. Indigenous Surface to Air Weapon systems Akash and Samar were placed demonstrate their capability to track and shoot down an intruding aircraft. Special operations by the IAF transport and helicopter fleets, involving the Garuds and Indian Army elements were also on display.",
        "link": "https://www.news18.com/india/air-force-to-hold-mega-firepower-exercise-vayu-shakti-near-western-border-on-february-27-ws-kl-9881023.html",
        "date": "Thu, 5 Feb 2026 13:04:46 +0530",
        "fetched_at": "2026-02-06 17:01:18.525602"
    },
    {
        "title": "Karnataka Government To Launch Special Drive To Identify, Deport Bangladeshi Immigrants",
        "content": "Karnataka Home Minister G Parameshwara has ordered a special drive to identify illegal immigrants residing in the state. Authorities have also been asked to conduct a statewide verification drive. The move comes after the Karnataka High Court pulled up the Foreigners Regional Registration Office (FRRO) and the State Government for failing to effectively identify illegal immigrants, asserting the issue must be “nipped in the bud\" as it poses a threat to national security. The government has directed the police to trace illegal Bangladeshis and other undocumented immigrants across the state. On Monday, Parameshwara announced in the Karnataka State Assembly that a special drive would be initiated to track and identify Bangladeshis and other immigrants. “I have told police officers to take the drive to identify and deport the Bangladeshis. It has come to our notice that the Bangladeshis are largely concentrated in Chikkamagaluru, Hassan, Bengaluru City, Bengaluru Rural and Kodagu,\" Parameshwara told the Assembly. The Karnataka minister further questioned the centre over the presence of Bangladesh immigrants across the country. “Who looks after the Indian border? It’s our military and the Border Security Force (BSF). How do they enter the country so easily? Isn’t this the very basic question?\" he asked. Parameshwara refuted the claims that there are lakhs of illegal Bangladeshis in Karnataka, asserting that the government will not let them roam freely. “196 people were deported after our government came to power. We have identified 370 people. Since various cases are pending against them. We have initiated the process to deport them,\" the minister told the House. The issue of illegal infiltration in the country remains a concern for the government – particularly in border states such as Assam and West Bengal – as it poses security risks, impacts employment, and strains local resources.",
        "link": "https://www.news18.com/india/karnataka-government-to-launch-special-drive-to-identify-deport-bangladeshi-immigrants-ws-l-9880705.html",
        "date": "Thu, 5 Feb 2026 11:26:41 +0530",
        "fetched_at": "2026-02-06 17:01:19.192512"
    },
    {
        "title": "‘North Indians Know Only Hindi, Sell Pani Puri’: TN Minister Sparks Fresh Language Row",
        "content": "With only a few months left for the state Assembly elections, Tamil Nadu’s Agriculture Minister MRK Panneerselvam has reignited the long-running state versus centre and two-versus-three language debate after making crude remarks about migrant workers from northern states. He said people from the north, “having learnt only Hindi\", had limited job opportunities in Tamil Nadu and ended up in menial work, while Tamilians benefitted from the state’s two-language policy, learnt English and secured jobs abroad. “… those from the north are coming to Tamil Nadu to clean tables… they are coming here to work as construction labourers pani puri sellers as they have only learnt Hindi,\" he said. “But our children have gone abroad… as we follow a two-language policy and learned English well. They are going abroad and getting opportunities to earn in crores… in USA, London.\" Panneerselvam was not the only Tamil Nadu minister to speak on the issue. Earlier in an interview with a news channel, Industries Minister TRB Rajaa offered a more nuanced view. He said the government would never stop people from speaking Hindi and pointed to the presence of large German and Japanese communities in the state. “All these foreigners can find their happiness in Tamil Nadu. I wonder why my Hindi-speaking friends can’t…\" he said, adding that the state also has a duty to protect Tamil. The remarks come weeks before a crucial Assembly election. The ruling DMK, allied with the Congress though ties are strained over seat-share talks, is seeking a second consecutive term and a fourth straight major election win over its Dravidian rival, the AIADMK, which has joined hands with the Bharatiya Janata Party. Language, an emotive issue in Tamil Nadu, is expected to be a key campaign theme, with the National Education Policy once again in focus. The NEP triggered a massive row when it was announced in 2019 and has flared up periodically. In February last year, tensions rose again after the centre pushed its three-language policy, which requires students to learn a third language in addition to English and the state language. The Tamil Nadu government described this as an attempt to impose Hindi on non-Hindi speaking states. Historically, southern states have been wary of attempts by the centre to impose Hindi over regional languages. In Tamil Nadu, this tension led to riots in the 1930s and 1960s. The state follows a two-language policy, teaching Tamil and English in state-run schools. Education Minister Anbil Mahesh Poyyamozhi told last year that this helps students connect with their linguistic heritage while learning English allows them to engage globally. Responding to the protests from Tamil Nadu, Union Education Minister Dharmendra Pradhan told there is “no question of imposing any language\" and said the NEP would only correct an “over-reliance on foreign languages, limiting students’ exposure to linguistic roots\".",
        "link": "https://www.news18.com/india/north-indians-know-only-hindi-sell-pani-puri-tn-minister-sparks-fresh-language-row-9880690.html",
        "date": "Thu, 5 Feb 2026 11:20:24 +0530",
        "fetched_at": "2026-02-06 17:01:19.807978"
    },
    {
        "title": "Bharat Taxi Set To Launch Today; To Take On Uber, Ola With Govt-Backed Model",
        "content": "The cab-hailing landscape in India is set to undergo a massive change today as Bharat Taxi gears up for an official launch in New Delhi. Backed by the Government of India, Bharat Taxi is a cab service based on a cooperative model. Union Minister of Cooperation Amit Shah will launch the app today, February 5. In a post on ‘X’, Shah announced that Bharat Taxi — the first taxi service in the cooperative sector — will be launched today. “How many people can come together through cooperation, pooling small amounts of capital to make a big beginning —‘Bharat Taxi’ is an example of this. Today is a very important day for taxi driver sisters and brothers. The launch of ‘Bharat Taxi,’ the first taxi service in the cooperative sector started by them, will take place in New Delhi\", the minister wrote. सहकारिता से बहुत सारे लोग मिलकर छोटी-छोटी पूँजी लगाकर कैसे बड़ी शुरुआत कर सकते हैं, ‘भारत टैक्सी’ इसका उदाहरण है।आज का दिन टैक्सी चालक बहनों-भाइयों के लिए बहुत ही अहम है। उनके द्वारा शुरू की गई सहकारी क्षेत्र की पहली टैक्सी सर्विस ‘भारत टैक्सी’ का नई दिल्ली में शुभारंभ होगा।… — Amit Shah (@AmitShah) February 5, 2026 “Through ‘Bharat Taxi,’ the driver sisters and brothers will not only be able to earn more profit but will also become its owners with dignity. I am eager to participate in this program today\", he added. Based on a cooperative model, Bharat Taxi is a ride hailing app, which is backed by the Union Government. According to an official statement from the Ministry of Cooperation, the service will place drivers “at the centre of ownership, operations, and value creation\". The government argues that the arrangement will shield the drivers against exploitation by private players. However, it might be noted that the initiave is not directly by the Government of India. Rather, it is run by Sahakar Taxi Cooperative Limited, which has been backed by key people who previously worked at Amul. Each driver, or ‘Sarathi’, holds five shares in the cooperative. Unlike private aggregators, no commission will be deducted from each fare — an effort to address longstanding complaints by drivers about high commission rates. Instead, the driver will require to pay a fixed daily fee of Rs 30 to access the app. For riders, experts have been estimating that the fares will be upto 30 per cent cheaper than private players. Unlike private aggregators, Bharat Taxi’s zero-commission model passes the benefit directly to passengers, enabling access to lower-fare cab options.",
        "link": "https://www.news18.com/india/bharat-taxi-set-to-launch-today-to-take-on-uber-ola-with-govt-backed-model-ws-l-9880417.html",
        "date": "Thu, 5 Feb 2026 09:37:23 +0530",
        "fetched_at": "2026-02-06 17:01:21.362159"
    },
    {
        "title": "The Untold Story: When An Army General's Book On India-China War Rattled Nehru In 1967",
        "content": "A political storm erupted in Parliament this week after Congress leader Rahul Gandhi sought to quote from a book by former Army Chief General MM Naravane that is yet to be published, triggering protests from the Treasury benches and forcing repeated adjournments of the House. While the incident has reignited debate over propriety and privilege, it is not without precedent. Nearly 60 years ago, a similar incident took place when a book written by a retired general caused an uproar so intense that members of the ruling Congress demanded his arrest, shaking the foundations of the government led by then-Prime Minister Jawaharlal Nehru. The book in question was The Untold Story, authored by Lieutenant General BM Kaul (Retd), who had served as the General Officer Commanding of the Indian Army’s IV Corps during the 1962 India-China war. Kaul’s corps suffered a major defeat during the conflict, following which he resigned from the Army, said a News18 Hindi report. In March 1967, he published his account of the war in the book. Rajya Sabha records show that Congress MPs raised sharp questions over the publication of the book, demanding to know whether Kaul had sought prior permission from the government or submitted his manuscript for official scrutiny before publication. Then Defence Minister Swaran Singh informed the House that Kaul had neither sought permission nor shared the manuscript with the government. Several Congress MPs demanded punitive action, with some even calling for Kaul’s arrest. Members sought clarification on whether defence personnel, serving or retired, were free to use information acquired during service in their writings. Singh responded that while serving officers were required to obtain permission, retired personnel were not, though they remained bound by the Official Secrets Act. Any violation of the law, he said, would invite action. According to reports published at the time by The Indian Express, Congress MP Rajendra Pratap Sinha asked what steps the government was taking to prevent retired generals from using sensitive or secret information acquired during service in public writings. Singh replied that the government was examining the book to determine whether it contained classified material that could attract provisions of the Official Secrets Act. Congress MP Loknath Mishra went on to describe Kaul as an “enemy informant\", questioning why he had not been detained despite allegedly exposing the functioning and shortcomings of the Defence Ministry. Another MP, G Murahari, reportedly labelled Kaul a “double agent\". The Defence Minister assured Parliament that the book was under careful examination and that appropriate action would be taken if violations were established. Much like Rahul Gandhi’s attempt today to question the Modi government’s policies by citing General Naravane’s forthcoming book, Kaul’s memoir in 1967 became a prism through which opposition, and even ruling party MPs, scrutinised the roles of Jawaharlal Nehru and then Defence Minister VK Krishna Menon in the 1962 debacle. MPs at the time also demanded that the government make public the Henderson Brooks Committee Report, commissioned to examine the failures of the 1962 war, arguing that Kaul’s allegations warranted transparency. That report, notably, remains classified even today.",
        "link": "https://www.news18.com/india/the-untold-story-when-an-army-generals-book-on-india-china-war-rattled-nehru-in-1967-ws-kl-9879916.html",
        "date": "Thu, 5 Feb 2026 08:24:11 +0530",
        "fetched_at": "2026-02-06 17:01:22.010372"
    },
    {
        "title": "Parliament Budget Session 2026 Updates: PM Modi Takes Dig At Gandhis, Says They Stole 'Gandhi' Surname Of A Gujarati",
        "content": "Parliament Budget Session 2026 Live Updates: Parliament witnessed fresh disruptions today, with the Lok Sabha adjourned till 12 noon shortly after proceedings began amid protests by Opposition members. In the Rajya Sabha, a heated argument broke out between the government and the Opposition. Leader of Opposition Mallikarjun Kharge accused the ruling side of not allowing Rahul Gandhi to speak earlier in the House. Union Minister Kiren Rijiju rejected the claim and said the House functions according to rules, not anyone’s wishes, and belongs to everyone. He stated the Leader of Opposition in the Lok Sabha had been given around 40 minutes by the Speaker but repeatedly spoke beyond the rules, adding it was wrong to say Rahul Gandhi was prevented from speaking. BJP president JP Nadda also attacked the Opposition, saying the Prime Minister was ready to reply to issues raised in the Lok Sabha but the House was not allowed to function. Opposition members also staged a walkout from the Rajya Sabha, but the House continued its proceedings. Union Minister Giriraj Singh strongly defended Prime Minister Narendra Modi after a political row erupted over remarks about “digging his grave.” Reacting to the controversy, Singh said that those making such statements should remember that Modi will continue to work for the country and the poor, and it is instead those spreading negativity who will face consequences. — Press Trust of India (@PTI_News) February 5, 2026 The Rajya Sabha has been adjourned until 11 AM tomorrow. Congress leader Rahul Gandhi targeted Prime Minister Narendra Modi, accusing him of being “so scared of the truth” that he “sought refuge in lies.” मोदी जी सच्चाई से ऐसा डरे,झूठ की शरण ले ली। — Rahul Gandhi (@RahulGandhi) February 5, 2026 PM Modi said, “Stealing is in their (Congress’s) family business. They stole a Gujarati surname, Mahatma Gandhi’s surname, and the people are now teaching them a lesson… We are moving forward with the resolve of a ‘Viksit Bharat,’ but they continue to raise questions about it.” PM Modi recalled how UP CM Yogi Adityanath had once broken down in the Assembly over the deaths of children due to brain fever (encephalitis), saying the previous government had failed to act. He added that his government stepped in to provide relief to affected families and also addressed Trachoma eye disease, describing these interventions as key successes that he said are now being criticised by opponents. — Press Trust of India (@PTI_News) February 5, 2026 During the Parliament Budget Session 2026, PM Modi targeted the Opposition, saying those talking of ‘mohabbat ki dukan’ are raising slogans like ‘Modi teri kabr khudegi’. PM Modi said the Opposition had turned Parliament into a spectacle by throwing papers at the presiding officers, which he said insulted both the Northeast and a Dalit member from Andhra Pradesh. He added that he was also hurt by the way Bharat Ratna Bhupen Hazarika was spoken about, saying such behaviour showed a lack of respect for people’s sentiments. — Press Trust of India (@PTI_News) February 5, 2026 PM Modi said, “The Congress party has always considered the citizens of this country as a problem. Once, Indira Gandhi visited Iran and, during a speech, quoted a conversation with her father, Nehru ji. I am quoting what she said, ‘When someone asked my father how many problems he has, he answered 35 crore.’ At that time, the country’s population was 35 crore.” Prime Minister Modi accused the Congress of having an “anti-Sikh mindset” after Lok Sabha Leader of Opposition Rahul Gandhi called BJP MP Ravneet Singh Bittu a “traitor” outside Parliament on Wednesday. PM Modi accused the Congress of repeatedly insulting the President, calling the language used against her after the elections shameful. He said the disruption of the discussion on the President’s Address in the Lok Sabha was an insult to the office, adding that those who behave this way have no moral right to speak about the Constitution. PM Modi alleged that the Congress focused more on imagination than implementation, and cited the long delay in the Bogibeel bridge project in Assam, which he said was stalled for years before his government reviewed and completed it, turning it into a key facility for Assam and the Northeast. — Press Trust of India (@PTI_News) February 5, 2026 He said, “We wanted to raise a few things in Lok Sabha, as well as Rajya Sabha, one is in favour of democracy, also to give people relief by saving democracy. We were pursuing as per the rules, but they are adamant to not let the opposition leaders speak in Lok Sabha, as well as Rajya Sabha.” VIDEO | Budget Session: Rajya Sabha LoP and Congress president Mallikarjun Kharge (@kharge) says both the LoPs are not being allowed to speak deliberately. — Press Trust of India (@PTI_News) February 5, 2026 PM Modi referred to a statement made by former Prime Minister and Congress leader Indira Gandhi, saying she herself had flouted the Planning Commission. Quoting her remarks from a speech in Himachal Pradesh, he said Indira Gandhi had pointed out that workers needed mules instead of jeeps but were told funds were only available for vehicles due to policy restrictions. PM Modi said that despite being aware of the problem, she had not taken steps to reform the system, adding that the Planning Commission she criticised was set up by her own father. PM Modi said the Congress had betrayed farmers, especially small landholders, and never cared for their needs. He said his government understood their pain and launched the PM Kisan Yojana to support nearly 10 crore farmers owning less than two hectares of land. — Press Trust of India (@PTI_News) February 5, 2026 PM Modi said the TMC leaders spoke on several issues but should also reflect on their own failures, alleging that people in West Bengal are suffering under their government and accusing them of trying to protect infiltrators by going to court, driven only by the desire to stay in power. — Press Trust of India (@PTI_News) February 5, 2026 PM Modi said that recently all-party delegations visiting different countries had witnessed a positive change in how India is viewed globally. He said representatives from across parties shared their experiences on returning, noting that India is now being engaged with by other nations on equal terms. — Press Trust of India (@PTI_News) February 5, 2026 PM Modi said he was grateful to the people for giving him the opportunity to serve, adding that much of the government’s energy is being spent on correcting past mistakes and rebuilding India’s global image. He said the focus is now on future-ready policies, governance based on strategy, and the mantra of “reform, perform, transform,” which has strengthened global trust in India. — Press Trust of India (@PTI_News) February 5, 2026 Speaking in the Rajya Sabha, PM Modi said that those engaged in vote-bank politics never focus on strengthening key areas, and accused the Congress of lacking vision, which he said caused the country to suffer. He added that the Congress had no planning or foresight, and that his government is now spending significant time correcting their mistakes. — Press Trust of India (@PTI_News) February 5, 2026 Addressing the Rajya Sabha, PM Modi said that India is now entering into future-ready trade agreements with several countries and has recently concluded major deals with some of the world’s most advanced economies, including a landmark agreement with the 27-nation European Union. — Press Trust of India (@PTI_News) February 5, 2026 Targeting the Congress party, Prime Minister Modi said that those who are tired or have left will one day have to answer for why they created the present condition of the country. As Opposition MPs created a ruckus in the Rajya Sabha, PM Modi said that considering LoP Mallikarjun Kharge’s age, he urged the Chairman to allow him to sit and raise slogans so that he did not face any discomfort, adding that younger members were standing at the back. PM Modi said that in the journey towards Viksit Bharat, the past few years have seen rapid development, marking an era of change across all walks of life, with the country moving in the right direction at a fast pace. Opposition MPs raised slogans such as “Tanaashahi nahi chalegi”, “LoP ko bolne do” and “Can’t crush opposition voice” during Prime Minister Narendra Modi’s speech in the Rajya Sabha. Opposition MPs raised slogans such as “Tanaashahi nahi chalegi”, “LoP ko bolne do” and “Can’t crush opposition voice” during Prime Minister Narendra Modi’s speech in the Rajya Sabha. BJP MP Ravishankar Prasad said, “The speaker has expressed his anguish. In the history of the Indian Parliament, it has never happened before that the Prime Minister was forcibly prevented from speaking, surrounded, and the Speaker had to tell him not to come. What happened in the Speaker’s chamber, what the opposition and the Congress members did, and what they want to achieve? Parliament is a place for debate; express your views within the limits of the law. What kind of coercion is this? This is the Congress party under Rahul Gandhi’s leadership.” Congress MP Priyanka Gandhi Vadra said, “The Prime Minister is hiding behind the Speaker. Yesterday, he did not have the guts to come to the House because three women were standing before the bench. What nonsense is this?..There is no discussion because the govt doesn’t want discussion to happen.” Before the House was adjourned for the day, Lok Sabha Speaker Om Birla today said, “The country saw what happened in the House yesterday. Everyone saw how the MPs approached the PM’s chair in the House. I got information that any mishap could have happened. To ensure that such a situation does not arise, I conveyed to PM Modi not to come to the House.” Lok Sabha speaker Om Birla on Thursday said that he advised PM Modi not to come to Lok Sabha today. Lok Sabha proceedings have been adjourned till 3 PM amid ruckus. Lok Sabha proceedings began at 2 PM amid ruckus in Lok Sabha. Congress MP Shashi Tharoor said the Leader of Opposition should have been permitted to speak, noting the material he intended to cite was already public. “The LoP should be allowed to speak, and what is more, is that what he is quoting is already in the public domain. All he wanted to do was make his point. By raising such a big objection and not allowing him to speak, a much larger problem has been created.” Congress MP Jairam Ramesh said the Opposition’s main concern in Parliament was that the Leader of Opposition in the Lok Sabha was not allowed to speak, leading to protests and a walkout in the Rajya Sabha. ” There is only one issue in Parliament that is agitating the opposition that the LoP in Lok Sabha has been prevented from speaking in Lok Sabha. LoP in the Rajya Sabha raised this issue. Oppisition MPs in the Rajya Sabha have also walked out of the house today on this. Let me remind the PM and BJP that on 19th June 2004, Dr Manmohan Singh, the then PM, did not reply to the Motion of Thanks because he was prevented from replying. On 19th June 2002, a debate had taken place. LoP belongs not to just one party but the whole opposition. In 2005, then PM Dr Manmohan Singh had had thanked the President twice, as he could not thank him in 2004. This is the BJP’s track record…All Opposition parties are united that if Lop is not allowed to speak, then there is very little opportunity for the House to run…” Congress MP Priyanka Gandhi Vadra criticised Union Minister JP Nadda for referring to Lok Sabha Leader of Opposition Rahul Gandhi as “abodh”. She said he should be allowed to speak and questioned the intent behind the remark. “He should be allowed to speak. Is this a way to talk about anyone? What are they scared of? That he will quote from a book? Or are they scared of the Epstein files? Or that we will question them on this deal (US-India trade agreement)?” The Lok Sabha has passed Motion of Thanks without Prime Minister Narendra Modi’s reply amid a ruckus by the opposition. Lok Sabha has been adjourned again till 2 PM amid the ruckus. The Lok Sabha proceedings began at 12 PM amid a ruckus. BJP MP Nishikant Dubey said the Speaker will decide whether he violated any rules and that he would abide by the ruling. He criticised Rahul Gandhi, alleging he continued speaking even after being asked to stop and showed disrespect to the Chair. Dubey added that he had brought several books, documents and files containing information “the country does not yet know.” The Lok Sabha saw uproar on Wednesday after Opposition members protested remarks made by BJP MP Nishikant Dubey during his speech in the Lower House. Referring to three books, Dubey made statements about former prime ministers Jawaharlal Nehru and Indira Gandhi, which angered Congress leaders. Nirmala Sitharaman objected to Mallikarjun Kharge’s ‘lynching’ remark and cited the beheading of a tailor in Udaipur in 2022 during Congress’ rule. Union Minister Kiren Rijiju said the House does not function according to anyone’s wishes but by rules, and it belongs to everyone. He accused Mallikarjun Kharge of misleading the House, stating that the Leader of Opposition in the Lok Sabha was given 40 minutes by the Speaker to speak but repeatedly went beyond the rules. Rijiju said it was incorrect to claim that Rahul Gandhi was not allowed to speak. Taking a swipe at the Opposition, BJP leader JP Nadda said, “In the Lok Sabha, the Prime Minister was ready to respond to the issues raised, but you did not allow the House to function.”",
        "link": "https://www.news18.com/india/parliament-budget-session-2026-live-bjp-congress-clash-rahul-gandhi-pm-modi-rajya-sabha-lok-sabha-news-today-liveblog-ws-l-9880246.html",
        "date": "Thu, 5 Feb 2026 21:03:20 +0530",
        "fetched_at": "2026-02-06 17:01:23.041786"
    },
    {
        "title": "Invite To PM Modi, Rs 100 Crore Budget: Bengal Set For Grand Ram Mandir Bhoomi Poojan | Exclusive",
        "content": "West Bengal, which has entered election mode, is all set to get its very own Ram Mandir and an invitation for the temple’s Bhoomi Poojan will soon be extended to Prime Minister Narendra Modi. The temple will come up on a private land gifted to a trust—Shri Krittibas Ram Mandir Trust. According to the trust, unlike former Trinamool Congress (TMC) MLA Humayun Kabir’s Babri Masjid plan, their grand scheme is not based on ‘micro donations’ but a sense of public participation. Hence, in next leg, in Shantipur in Nadia district where the proposed grand Ram Temple will come up, Hindus have been encouraged to carry bricks with ‘Jai Shri Ram’ inscribed on them to the temple site. “We invited representatives from BJP and RSS on Tuesday at the temple site. We held a meeting of the trust where it has been decided the Bhoomi Poojan of Bengal’s Ram Temple will be on a date when the prime minister is available. A brick with ‘Jai Shri Ram’ inscribed on it will be placed in the ground on that day,\" Litton Bhattacharya, the secretary of the trust, told News18. While the prime minister is planned to be invited through senior BJP leadership, a board about the temple has also come up outside BJP’s national headquarters in Delhi. The over-21-acre land was under Bhattacharya’s private ownership before he handed it over to the trust. According to him, the trust has already gathered Rs 100 crore, which it estimates to be the temple’s construction cost. “We have our own funds, Rs 100 crore right now. All of our trustees are well-acclaimed personalities. We don’t need to beg unlike others,\" Bhattacharya said, taking a dig at Kabir. So, how will it differ from Ayodhya’s Ram Mandir? According to its website, it will “preserve the legacy of Krittibas Ojha\", a famous medieval Bengali poet best known for writing a Bengali version of the Hindu epic Ramayan. The Bengali version, known as “Krittivasi Ramayan\", wasn’t just a translation but helped spread devotional (Bhakti) traditions and inspired later Bengali literature and culture. Bengal’s Ram Temple will project this ‘Bengali’ side of ‘Ram’ and ‘Ramayan’ through the temple. There will also be spiritual education for children focusing on moral values and stories from Ramayan, workshops for teenagers (14-25) to develop leadership skills “rooted in Dharma\", monthly gatherings for women empowerment, spiritual discourse, and skill development, weekly satsang & kirtan, yoga & wellness, and provision of scholarships. The 600-year-old original manuscript written by Krittibas was in France, claims the trust, which has now been transported to Netherlands with the personal endeavour of the trust’s president, Arindam Bhattacharjee. “Once the temple is built, the original manuscript can be brought back here,\" says Litton Bhattacharya. While Bhattacharya may wish to delink from the supposed ‘Babri’ mosque in Murshidabad, comparisons are bound to be drawn. Kabir laid the foundation stone for the Masjid replica in Rejinagar, Murshidabad, on December 6 last year, sparking a political controversy. They are reported to have collected over Rs 1.30 crore in donations by early December 2025. Construction is scheduled to begin on February 11, 2026, amid security concerns. As the polls draw near, Bengal seems set for a Ram Mandir vs Babri Masjid debate.",
        "link": "https://www.news18.com/india/invite-to-pm-modi-rs-100-crore-budget-bengal-set-for-grand-ram-mandir-bhoomi-poojan-exclusive-ws-kl-9878728.html",
        "date": "Thu, 5 Feb 2026 07:00:14 +0530",
        "fetched_at": "2026-02-06 17:01:23.716528"
    },
    {
        "title": "Gold Loan Scam: PNB Manager Accused Of Stealing Customers' Gold Worth Rs 6.5 Crore",
        "content": "The contours of a major gold loan scam at a Punjab National Bank (PNB) branch at Nawalgarh in Rajasthan’s Jhunjhunu district are gradually emerging, with investigations pointing to the alleged misappropriation of more than 4 kgs of gold valued at around Rs 6.5 crore. According to investigators, the fraud took place at the bank’s Nansa Gate branch, where the then branch manager, in collusion with two associates, is accused of siphoning off gold pledged by customers as collateral for loans. Police say the accused allegedly used the proceeds to purchase high-value land parcels and establish a dairy plant. The scam came to light after tampering was detected in gold packets stored in the bank’s strong room, triggering panic among hundreds of customers who had deposited their jewellery for gold loans. As per the police report, 73 packets were found to contain fake jewellery instead of real gold, while three other packets were discovered to be underweight compared to official records. An initial internal audit by the bank revealed a shortage of 4,198 grams of gold, pegged at approximately Rs 6.5 crore. However, police officials cautioned that the actual quantum of stolen gold would be ascertained only after a comprehensive verification of all pledged assets. Investigators noted that the gold safe was secured with a dual-key system, operated jointly by then senior branch manager Amit Kumar Jangid and deputy manager Anant Prakash Chaudhary. The irregularities surfaced on January 28, when charge of the strong room was being transferred to deputy manager Seema Mehla. Following this, the incumbent branch manager initiated an internal probe, which flagged the role of the former branch manager as suspicious. Based on the bank’s complaint, police have registered a case against Amit Kumar Jangid, Anant Prakash Chaudhary, and bank business correspondent (BC) operator Santosh Kumar. Searches have revealed that Jangid acquired properties worth several crores in recent years, including land on which a dairy plant was established. Additional properties linked to the accused have been identified at multiple locations. His family reportedly resides in Sithal village of Gudhagaurji area in Jhunjhunu. The investigation has also uncovered evidence of fictitious gold loans issued from the branch. Several loan accounts were found to be in the names of non-existent individuals, with indications that fraudulent loans may also have been sanctioned under government schemes. Police officials said the total amount embezzled in the scam would be known only after the investigation is completed, adding that preliminary findings suggest the losses could be significantly higher than initially estimated.",
        "link": "https://www.news18.com/india/gold-loan-scam-pnb-manager-accused-of-stealing-customers-gold-worth-rs-6-5-crore-ws-kl-9879893.html",
        "date": "Wed, 4 Feb 2026 20:58:36 +0530",
        "fetched_at": "2026-02-06 17:01:24.458777"
    },
    {
        "title": "Bengaluru’s 5-Year Construction Rule May Hit 68,000 Vacant BDA Plots With New Fines",
        "content": "If you own a BDA plot in Bengaluru and have been holding on to it without building a house, you may soon have to rethink your plans. The Bangalore Development Authority is considering revising penalty charges for vacant residential sites, a move that could impact tens of thousands of plot owners across the city. With more than 68,000 sites lying unused in multiple BDA layouts, authorities are now weighing stricter slab-based fines aimed at discouraging long-term land banking and encouraging timely construction. Until now, site owners were required to pay a penalty if they failed to construct a house within the permitted timeframe. However, many allottees have reportedly not paid the existing fines. In response to public demands, BDA officials are discussing a revised penalty structure that could make payments more manageable. What is The Proposed Revised Penalty Structure? As per existing rules, beneficiaries must construct a house within five years of allotment. The BDA had earlier planned to revise penalties by 10%, in line with guideline rates, from September 2024. However, due to low compliance, officials are now considering a slab-based penalty system. Under the proposed revision, penalties may be imposed as follows: The proposal is still under discussion and is yet to receive final approval. The BDA acquires land from farmers by paying compensation and develops layouts before allotting plots at concessional rates. However, officials have observed that several allottees purchase plots for investment purposes and delay or avoid construction for many years. Authorities state that vacant plots often create inconvenience for neighbouring residents and affect planned urban development. The penalty system is intended to discourage long-term vacancy and encourage construction within the stipulated timeframe. What Are The Rules Regarding Plot Cancellation? Earlier, BDA required house construction within two years, which was later extended to three years and then to five years. As per current regulations, if construction is not completed within the allowed period, 12.5 per cent of the site value may be deducted, and the remaining amount refunded before the plot is withdrawn. However, officials have observed cases where allottees have not built houses even after holding plots for two to three decades. Many such owners approach BDA for sale deeds later to obtain e-accounts, which reveals that construction has not taken place. In such cases, penalty charges are collected while issuing the sale deed. The BDA retains administrative control over newly developed layouts for up to ten years after allotment. During this period, some site owners construct houses, while others leave the land vacant and apply for sale deeds later. There have also been instances where plots remain vacant for up to 20 years before owners attempt to sell them. To address such situations, BDA introduced penalties for delayed construction and is now considering revising these charges according to guideline rates. List of Locations With High Number Of Vacant Plots Officials said that most older BDA layouts in Bengaluru continue to have vacant sites. Except for recently developed Nadaprabhu Kempegowda Layout and Arkavathi Layout, several established neighbourhoods still report unutilised plots. Vacant sites have been identified in areas including Jayanagar, BTM Layout, Banashankari, Anjanapura, HAL Layout, HBR Layout, JP Nagar, Nagarbhavi, Koramangala, HSR Layout and Indiranagar. According to BDA data, more than 68,000 plots remain vacant across 64 layouts in Bengaluru. Among these, over 20,000 sites are currently involved in various disputes. BDA Commissioner Manivannan confirmed that the revision of penalties for vacant plots was discussed during a recent management meeting. He stated that the matter will be reviewed in further detail in the upcoming meeting, after which a final decision is expected. What is The Proposed Revised Penalty Structure? As per existing rules, beneficiaries must construct a house within five years of allotment. The BDA had earlier planned to revise penalties by 10%, in line with guideline rates, from September 2024. However, due to low compliance, officials are now considering a slab-based penalty system. Under the proposed revision, penalties may be imposed as follows: The proposal is still under discussion and is yet to receive final approval. The BDA acquires land from farmers by paying compensation and develops layouts before allotting plots at concessional rates. However, officials have observed that several allottees purchase plots for investment purposes and delay or avoid construction for many years. Authorities state that vacant plots often create inconvenience for neighbouring residents and affect planned urban development. The penalty system is intended to discourage long-term vacancy and encourage construction within the stipulated timeframe. What Are The Rules Regarding Plot Cancellation? Earlier, BDA required house construction within two years, which was later extended to three years and then to five years. As per current regulations, if construction is not completed within the allowed period, 12.5 per cent of the site value may be deducted, and the remaining amount refunded before the plot is withdrawn. However, officials have observed cases where allottees have not built houses even after holding plots for two to three decades. Many such owners approach BDA for sale deeds later to obtain e-accounts, which reveals that construction has not taken place. In such cases, penalty charges are collected while issuing the sale deed. The BDA retains administrative control over newly developed layouts for up to ten years after allotment. During this period, some site owners construct houses, while others leave the land vacant and apply for sale deeds later. There have also been instances where plots remain vacant for up to 20 years before owners attempt to sell them. To address such situations, BDA introduced penalties for delayed construction and is now considering revising these charges according to guideline rates. List of Locations With High Number Of Vacant Plots Officials said that most older BDA layouts in Bengaluru continue to have vacant sites. Except for recently developed Nadaprabhu Kempegowda Layout and Arkavathi Layout, several established neighbourhoods still report unutilised plots. Vacant sites have been identified in areas including Jayanagar, BTM Layout, Banashankari, Anjanapura, HAL Layout, HBR Layout, JP Nagar, Nagarbhavi, Koramangala, HSR Layout and Indiranagar. According to BDA data, more than 68,000 plots remain vacant across 64 layouts in Bengaluru. Among these, over 20,000 sites are currently involved in various disputes. BDA Commissioner Manivannan confirmed that the revision of penalties for vacant plots was discussed during a recent management meeting. He stated that the matter will be reviewed in further detail in the upcoming meeting, after which a final decision is expected. Scan the QR code to download the News18 app and enjoy a seamless news experience anytime, anywhere.",
        "link": "https://www.news18.com/cities/bengaluru-news/bengalurus-5-year-construction-rule-may-hit-68000-vacant-bda-plots-with-new-fines-tyd-ws-l-9879433.html",
        "date": "Wed, 4 Feb 2026 18:23:45 +0530",
        "fetched_at": "2026-02-06 17:01:25.141029"
    },
    {
        "title": "Yumnam Khemchand Singh Takes Oath As Manipur Chief Minister After President's Rule Ends",
        "content": "BJP Manipur Legislature Party leader Yumnam Khemchand Singh took oath as the Chief Minister of Manipur on Wednesday, as the President’s Rule ended after nearly a year in the ethnic strife-torn state. Manipur Governor Ajay Bhalla administered the oath to Khemchand at the Lok Bhavan in Imphal. The ceremony was attended by several BJP legislators, senior party functionaries, and top leaders of the NDA in Manipur. “Manipur will play an important role in the Viksit Bharat 2047. Manipur consists of 36 communities, and we hope to bring a peaceful atmosphere in the state,\" he said after his oath-taking ceremony. On February 3, more than 45 MLAs of the Manipur legislative assembly reached a consensus on Khemchand as the next chief minister, representing the Meitei community. As part of the power-sharing deal, Nemcha Kipgen from the Kuki community has been named deputy chief minister, the first woman deputy CM of Manipur, along with Losii Dikho, while Govindas Konthoujam will take charge as home minister. Taking to X, Prime Minister Narendra Modi said, “Congratulations to Shri Yumnam Khemchand Singh Ji on taking oath as the Chief Minister of Manipur. I would like to congratulate Smt. Nemcha Kipgen Ji and Shri Losii Dikho Ji on taking oath as the Deputy Chief Ministers of the state and Shri Konthoujam Govindas Singh Ji as well as Shri Khuraijam Loken Singh Ji on being sworn in as Ministers in the Manipur Government.\" “I’m confident they will work diligently towards furthering development and prosperity for my sisters and brothers of Manipur.\" Congratulations to Shri Yumnam Khemchand Singh Ji on taking oath as the Chief Minister of Manipur.I would like to congratulate Smt. Nemcha Kipgen Ji and Shri Losii Dikho Ji on taking oath as the Deputy Chief Ministers of the state and Shri Konthoujam Govindas Singh Ji as well… — Narendra Modi (@narendramodi) February 4, 2026 The oath-taking ceremony came after the President’s Rule was lifted in Manipur after nearly a year due to ethnic clashes between Meitei and Kuki groups. The President’s rule was first imposed on February 13, 2025 and later extended on August 13 for a period of six months. Who Is Yumnam Khemchand Singh? Yumnam Khemchand Singh, 62, is a Bharatiya Janata Party (BJP) politician from Manipur. He was elected to the Manipur legislative assembly from the Singjamei constituency in both the 2017 and 2022 assembly elections. He served as the Speaker of the assembly from 2017 to 2022. A taekwondo black belt, Khemchand started his political career alongside former Manipur CM N Biren Singh, who resigned last year after he was unable to maintain law and order and prevent ethnic conflict, as part of the Democratic Revolutionary People’s Party. He joined the BJP in 2013 and entered the Assembly in 2017. He was appointed as the Speaker of the Manipur Assembly in the first Biren Singh government. In 2022, he was inducted as a cabinet minister in the second Biren Singh ministry, holding key portfolios, including the Municipal Administration and Housing Development (MAHUD) Department, Rural Development and Panchayati Raj Department, and the Education Department. As ethnic clashes grew in Manipur, anger rose over the government’s inability to address the issue and bring the situation under control, which resulted in a grenade attack on Khemchand’s house in 2023. Despite being a cabinet minister, Khemchand became an outspoken critic of the Biren Singh government and pressured the party to seek his replacement. Biren Singh resigned on February 9, 2025, amid growing dissent within the BJP-led government and the Congress’s plans to move a no-confidence motion in the Assembly. Khemchand had earlier told News18 that Biren Singh had failed to maintain law and order in Manipur for over 18 months. Biren Singh continued as caretaker Chief Minister till President’s rule was imposed. The central government engaged ethnic bodies in talks to defuse the Manipur crisis, and PM Modi’s visit to the state in September 2025 was seen as a big step to restore normalcy. Khemchand was named as the Chief Minister of the politically sensitive state as leaders from both the Meitei and Kuki communities came together to form the government, marking a significant political coordination. The move is believed to have provided a major boost to Manipur by signalling a return to normalcy, especially with elections due next year.",
        "link": "https://www.news18.com/politics/yumnam-khemchand-singh-takes-oath-as-manipur-chief-minister-as-presidents-rule-ends-9879543.html",
        "date": "Wed, 4 Feb 2026 19:50:42 +0530",
        "fetched_at": "2026-02-06 17:01:25.985443"
    }
]