[
    {
        "title": "Japan will connect Northeast India to the Bay of Bengal: Dy Foreign Minister Horii Iwao",
        "content": "Japan's Minister of State for Foreign Affairs, Iwao Horii. File\n| Photo Credit: AP\nJapan will support connectivity plans linking Northeast India to the Bay of Bengal and the Indian Ocean region, said Deputy Foreign Minister of Japan Horii Iwao on Friday (February 27, 2026).\nSpeaking at a foreign policy conclave in Meghalaya’s capital, Shillong, the visiting dignitary said the Northeastern States can serve as a “powerful engine of growth” when harmonised with a grid that includes Southeast Asia, Bangladesh and Nepal.\n“Japan will support connectivity linking Northeast India to the Bay of Bengal and the Indian Ocean. Northeast India is located in a pivotal geopolitical position as a gateway to Southeast Asia,” said Horii Iwao, who spoke at the Sixth India-Japan Intellectual Conclave organised by Asian Confluence, a Shillong-based foreign policy think tank. The visiting dignitary further said that Japan remains “firmly committed to the development of Northeast India”.\n“When we view this region as part of a broader economic region encompassing Nepal, Bhutan, India, Bangladesh and Southeast Asia, it possesses significant potential to serve as a powerful engine of growth,” he further said.\nApart from enhancing connectivity between northeast India and nearby areas, Horii Iwao said Tokyo under the new government led by Prime Minister Sanae Takaichi is also committed to enhance people-to-people ties between Japan and northeast India as well as ensure private-sector cooperation in the areas of economic security, semiconductors and clean energy.\nPrime Minister Narendra Modi travelled to Japan on August 29-30, 2025, and he also met the new and Japan’s first female Prime Minister Sanae Takaichi in November on the sidelines of the G20 summit in South Africa. Subsequently, External Affairs Jaishankar hosted his Japanese counterpart Toshimitsu Motegi at the Hyderabad House on January 16.\nHorii Iwao said, as part of its Free and Open Indo-Pacific (FOIP) policy, Japan will work on an “Industrial Value Chain” that will connect the Bay of Bengal to the Northeast saying Japan “will connect Northeast India to the sea and promote development of the region as a whole”.\nJapan\n/\ndiplomacy",
        "link": "https://www.thehindu.com/news/national/japan-will-connect-northeast-india-to-the-bay-of-bengal-dy-foreign-minister-horii-iwao/article70685390.ece",
        "date": "Sat, 28 Feb 2026 01:26:52 +0530",
        "fetched_at": "2026-02-28 03:28:53.459038"
    },
    {
        "title": "District panchayat Budget proposes jobs for 5,000 women",
        "content": "District panchayat vice-president Cintra Jacob presenting the Budget for the financial year 2026-27 on Friday. District panchayat president K.G. Radhakrishnan is seen.\n| Photo Credit: SPECIAL ARRANGEMENT\nProviding employment to 5,000 women and setting up of ‘She Fitness Centres’ are some of the significant announcements in the Ernakulam district panchayat Budget presented on Friday (February 27).\nPresiding over the Budget presentation, district panchayat president K.G. Radhakrishnan said the job portal designed to provide employment to around 5,000 women in the district was the most notable announcement in the Budget.\nDistrict panchayat vice-president Sinta Jacob presented the budget which envisages a revenue of ₹177,88,20,344 and an expenditure of ₹163,13,02,500.\nThe Budget envisages the comprehensive development of the agricultural sector with an allocation of ₹18 crore. The potential of farm tourism and aqua tourism will be explored through the renovation of agricultural farms. Special emphasis has also been given to the development of dairy and fisheries sectors. A ‘high-tech agriculture vision’ is being put forward.\nThe Budget also proposes to convert a heritage building in Aluva into an agricultural museum with the aim of preserving old agricultural equipment, displaying traditional seeds, and providing practical learning to visitors.\nIn a bid to give thrust to the education sector, an amount of ₹15.60 crore has been allocated for associated activities and the modernisation of computer and science labs in high schools and higher secondary schools. In addition, the Budget also plans to appoint physical education faculty members and counsellors in schools to promote the mental and physical well-being of students.\nThe Budget envisages a ‘Mission 2030’ project, under which grading will be done at various educational institutions under the panchayat. Accordingly, monitoring committees will visit schools.\nWhile ₹18 crore has been allocated for housing, ₹16 crore has been set apart for projects in the Health sector. Infrastructure at primary health centres will be developed in association with grama panchayats. In addition, a special fund has been created for palliative care activities.\nAn allocation of ₹13 crore has been made for the comprehensive development of Scheduled Caste communities. Special schemes have been included to address malnutrition among children in this category.\nIn a bid to address drinking water issues and ensure cleanliness in the district, an amount of ₹11 crore has earmarked.\nThe other projects include the setting up of Indira Canteens to provide quality food at low prices, welfare activities for transgender persons and assistance for liver transplant patients.",
        "link": "https://www.thehindu.com/news/national/kerala/district-panchayat-budget-proposes-jobs-for-5000-women/article70684077.ece",
        "date": "Sat, 28 Feb 2026 02:32:50 +0530",
        "fetched_at": "2026-02-28 03:28:54.107207"
    },
    {
        "title": "Kochi Corporation Budget approved amid Opposition boycott",
        "content": "The Kochi Corporation’s Budget for 2026-27 was passed with amendments suggested during the discussion even as the Opposition Left Democratic Front (LDF) staged a boycott, alleging that the changes had reduced the surplus into a deficit.\nDeputy mayor Deepak Joy had presented a ₹132-crore surplus Budget. Mayor V.K. Minimol said that proposals to address drinking water scarcity and to establish memorials for the late literary critic M.K. Sanoo and ghazal singer Umbayi had been incorporated.\nHowever, LDF Parliamentary Party leader V.A. Sreejith said the Opposition chose to boycott rather than endorse the Budget as he felt that the amendments had rendered it deficit in violation of the Municipal Act.\nFor the Budget to be viable, the Corporation would need to collect property tax worth ₹78 crore in a single month, which, he termed, was “next to impossible.” He pointed out that while the Budget speech referred to projects such as the ₹200-crore renovation of the Pandarachira canal and two new waste treatment plants costing ₹40 crore, they were absent in the Budget estimates. Incorporating them, he argued, would push the Budget into deficit. “This is a ploy to win popular support by announcing projects without allocating funds for their implementation. There is no reason why we should back a deficit budget,” Mr. Sreejith said.\nMs. Minimol countered that the Pandarachira canal rejuvenation was foreign-funded and need not be accounted for in the Corporation’s estimates. It was common practice, she said, for Budgets to reference such projects. For instance, the previous LDF council had earmarked ₹75 crore for the Compressed Biogas plant at Brahmapuram, though it was funded by BPCL-Kochi Refineries.\nMeanwhile, Corporation secretary P.S. Shibu, in a written response to the LDF’s petition alleging leakage of the Budget before its presentation, clarified that only the council agenda generated through the K-Smart module had been shared with councillors and the media. The Municipal Act, he noted, contained no provision mandating secrecy of the Budget estimate prepared by the finance standing committee, though precedent had followed that practice. While the Opposition claimed this vindicated its charge, the ruling council maintained that it only reaffirmed their position.",
        "link": "https://www.thehindu.com/news/national/kerala/kochi-corporation-budget-approved-amid-opposition-boycott/article70685549.ece",
        "date": "Sat, 28 Feb 2026 01:02:01 +0530",
        "fetched_at": "2026-02-28 03:28:54.754285"
    },
    {
        "title": "Tamil Nadu launches its first Dark Sky Park in Kolli Hills for stargazing",
        "content": "According to the Forest Department, the park is equipped with three advanced telescopes for structured sky-watching sessions and solar panels to power onsite operations sustainably.\n| Photo Credit: SPECIAL ARRANGEMENT\nThe Tamil Nadu government on Thursday announced the launch of the State’s first Dark Sky Park at the Ariyur Shola Reserve Forest in Kolli Hills, Namakkal district.\nThe initiative was inaugurated by Forests Minister R.S. Rajakannappan in the presence of senior officials, including Environment, Climate Change and Forests Secretary Supriya Sahu, Principal Chief Conservator of Forests (PCCF) and Head of Forest Force Srinivas R. Reddy, PCCF and Chief Wildlife Warden Rakesh Kumar Dogra.\nAs per an official release, a Dark Sky Park is a protected landscape with minimal artificial light pollution, enabling clear observation of celestial bodies such as the moon, stars and planets. Officials said Kolli Hills, with its elevated terrain, dense forest cover and low urban light disturbance, offers ideal conditions for night-sky preservation and astronomical observation.\nThe project, announced in the Legislative Assembly on June 25, 2024, was established at a cost of ₹1 crore after assessing ecological suitability and sky visibility at the Ariyur Shola Reserve Forest.\nAccording to the Forest Department, the park is equipped with three advanced telescopes for structured sky-watching sessions and solar panels to power onsite operations sustainably. The facility will also function during daytime hours to promote scientific literacy and awareness on astronomy among students, researchers and the public.\nThe release said structured stargazing sessions will be organised regularly, and accommodation will be available at Agaya Gangai eco-huts.\nWhile whole-night stargazing camps are planned two to three times a month during major astronomical events, particularly around the new moon phase for optimal visibility, options without overnight stay will also be offered.\nMs. Sahu said to ensure the safety of participants and the protection of the landscape, only 20 people are allowed at a time. “It is a guided exercise where the Forest Department will provide protection. That area is completely free from any light pollution,” she added.",
        "link": "https://www.thehindu.com/sci-tech/science/tamil-nadu-launches-its-first-dark-sky-park-in-kolli-hills-for-stargazing/article70683166.ece",
        "date": "Sat, 28 Feb 2026 02:12:41 +0530",
        "fetched_at": "2026-02-28 03:28:55.406857"
    },
    {
        "title": "PM Modi to launch nationwide HPV vaccination drive on February 28",
        "content": "India will use Gardasil, a quadrivalent HPV vaccine, for protection from HPV types 16 and 18, which cause cervical cancer, as well as types 6 and 11. Image for representative purposes only.\n| Photo Credit: Getty Images/iStockphoto\nPrime Minister Narendra Modi will launch a nationwide Human Papillomavirus (HPV) vaccination campaign on Saturday (February 28, 2026) from Ajmer.\nThe campaign aims to protect 14-year-old girls across the country from cervical cancer, a disease that remains a significant health concern in India.\nAll States and Union Territories will virtually join the programme that will start at 11.30 a.m., the Ministry of Health and Family Welfare said.\nIndia will use Gardasil, a quadrivalent HPV vaccine, for protection from HPV types 16 and 18, which cause cervical cancer, as well as types 6 and 11.\nA Health Ministry official said the vaccination will be voluntary and free of cost. The one-time vaccine will be administered at designated government health facilities, including the Ayushman Arogya Mandirs (Primary Health Centres), Community Health Centres, sub-district and district hospitals, and government medical colleges.\nCervical cancer remains the second-most common cancer among women in India, with nearly 80,000 new cases and over 42,000 deaths reported annually.",
        "link": "https://www.thehindu.com/news/national/pm-modi-to-launch-nationwide-hvp-vaccination-drive-on-february-28/article70685472.ece",
        "date": "Sat, 28 Feb 2026 06:11:11 +0530",
        "fetched_at": "2026-02-28 03:28:56.064294"
    },
    {
        "title": "Arvind Kejriwal’s court discharge a blow to Union government: Kerala Chief Minister",
        "content": "The discharge of former Delhi Chief Minister Arvind Kejriwal and his former deputy Manish Sisodia by a Delhi court in the liquor policy case was a blow to the Union government’s misuse of power to implicate political foes in false cases, Chief Minister Pinarayi Vijayan has said.\nThe trial court’s decision was not only a setback to the Bharatiya Janata Party (BJP) but also to the Congress that helped the BJP for vested political interests, the Chief Minister said in a statement on Friday.\nThe court had in effect questioned the BJP’s bid to destabilise government in States using Central agencies, Mr. Vijayan said. The court had rapped the Central Bureau of Investigation for implicating Mr. Kejriwal in the absence of any evidence, he pointed out.\nThe Congress was the first to pull the strings to put Mr. Kejriwal in jail. In June 2022, the then Delhi Pradesh Congress Committee president approached the Delhi Police, which is under the Union Home Ministry, alleging corruption in the liquor policy, the Chief Minister said.\nMr. Vijayan said he had spoken to Mr. Kejriwal in the wake of the court verdict.",
        "link": "https://www.thehindu.com/news/national/kerala/arvind-kejriwals-court-discharge-a-blow-to-union-government-kerala-chief-minister/article70685502.ece",
        "date": "Fri, 27 Feb 2026 22:48:13 +0530",
        "fetched_at": "2026-02-28 03:28:56.717753"
    },
    {
        "title": "Didn’t pay influencers to oppose AI Summit, says Congress",
        "content": "Congress social media department head Supriya Shrinate addresses a press conference on February 27, 2026. Photo: Screen grab via X/@SupriyaShrinate.\nThe Congress on Friday (February 27, 2026) dismissed allegations that it had paid Instagram influencers to criticise the recently held AI Summit, calling the charge a “fabricated story” originating from the BJP’s IT Cell.\nAddressing a press conference, Congress social media department head Supriya Shrinate said that neither the party nor the Indian Youth Congress had made any payments to influencers to oppose or malign the summit.\n“It was falsely alleged that the Congress party and the Indian Youth Congress paid Instagram influencers to oppose the AI Summit. We categorically deny this. No one was paid, and this claim is completely false,” she said.\nMs. Shrinate alleged that a “witch-hunt” had been carried out against the party over the past 48 hours on the basis of misinformation. She said several influencers deleted their videos after facing the “threat of legal action”.\n“None of them disclosed the number or identity of those who allegedly contacted them,” she said, adding, “These influencers are part of a pro-Modi, pro-BJP ecosystem and regularly promote BJP narratives.”\nMs. Shrinate said the controversy was an attempt to divert attention from alleged shortcomings at the summit.\n‘This is India, not North Korea’: Rahul slams PM over action against Youth Congress members\nAI Summit protest: Dramatic standoff between Delhi and Shimla police ends after 24 hours\nAI Summit protest: Delhi court extends police custody of five Youth Congress members by four days\n“Serious mismanagement, equipment stolen, no stable internet, and a Chinese robot at an Indian innovation event. How did the Chinese robot and the Korean ball enter the summit? Shockingly, no inquiry has been conducted,” she said.\nArtificial Intelligence\n/\nsummit\n/\nBharatiya Janata Party\n/\nAll India Trinamool Congress",
        "link": "https://www.thehindu.com/news/national/didnt-pay-influencers-to-oppose-ai-summit-says-congress/article70685434.ece",
        "date": "Fri, 27 Feb 2026 22:24:52 +0530",
        "fetched_at": "2026-02-28 03:28:57.365898"
    },
    {
        "title": "Karnataka launches action plan on snakebite and rabies; aims to cut snakebite deaths by half, end dog-related rabies deaths by 2030",
        "content": "Health Minister Dinesh Gundu Rao releasing the State Action Plan for Prevention and Control of Snakebite Envenoming, in Bengaluru on Friday.\n| Photo Credit: SPECIAL ARRANGEMENT\nThe Karnataka government on Friday published the State Action Plan for Prevention and Control of Snakebite Envenoming (SAPSE), becoming the first State in the country to release a comprehensive roadmap dedicated exclusively to tackling snakebite. The government simultaneously launched the State Action Plan for Rabies Elimination (SAPRE), reiterating its target of achieving zero human deaths due to dog-mediated rabies by 2030.\nLaunching the plans under the Integrated Disease Surveillance Programme, Health Minister Dinesh Gundu Rao said the objective was to ensure that “no life is lost due to delay in treatment or lack of access to medicines.”\nSnakebite, classified by the World Health Organisation as a Neglected Tropical Disease, continues to pose a significant public health challenge. In India, estimates suggest around 50,000 deaths each year, besides a large number of survivors left with amputations or permanent disabilities. Public health experts have pointed out that the actual burden is likely higher, as many victims do not reach formal healthcare facilities.\nIn Karnataka, recorded cases of snakebite envenoming and deaths have seen a sharp rise from 6,596 bite cases and 19 deaths in 2023 to 13,235 bite cases and 100 deaths in 2024 and 16,805 bite cases and 154 deaths in 2025. Attributing the increase in number of cases recorded to increased surveillance, Padma M.R., Deputy Director (State Surveillance Unit) said this follows Karnataka declaring snakebite envenoming cases and deaths notifiable under the Karnataka Epidemic Diseases Act, 2020, in February 2024.\nThe State Action Plan seeks to address these gaps through strengthened surveillance, assured availability of anti-snake venom (ASV), early referral and transport, capacity building of healthcare personnel, and sustained public awareness campaigns. Karnataka had earlier declared snakebite a notifiable disease, mandating reporting of all cases and deaths to improve data collection and guide policy response, Dr. Padma said.\nThe plan aligns with the National Action Plan for Prevention and Control of Snakebite Envenoming (NAPSE), launched by the Union government in March 2024, and aims to reduce snakebite deaths and disabilities by half by 2030. It envisages coordinated action by multiple departments, including Health, Animal Husbandry, Agriculture, Forest, Panchayat Raj, Education, Labour, Finance and Home.\nThe Health Minister said key strategies include promoting behavioural change through Information, Education and Communication (IEC) activities, encouraging rural communities to seek treatment at the nearest health facility instead of traditional healers, ensuring early transport of victims, prompt administration of ASV, management of complications and rehabilitation of those left disabled.\nThe Health Department has identified designated snakebite treatment centres, supplied ASV stocks and circulated standard treatment guidelines. Free treatment will be provided in government facilities. Private hospitals have been directed to administer immediate life-saving care without insisting on advance payment, he said.\nAlongside SAPSE, the State rolled out SAPRE under the National Rabies Control Programme. Rabies was declared a notifiable disease in Karnataka in December 2022. The government has mandated the availability of Anti-Rabies Vaccine (ARV) and Rabies Immunoglobulin (RIG) in all Primary Health Centres, Community Health Centres, taluk and district hospitals, with instructions to maintain adequate stocks.\nPrivate hospitals have also been directed to stock ARV and RIG and provide emergency treatment without demanding advance payment. State- and district-level joint committees have been constituted to oversee implementation, in coordination with various government departments and non-governmental organisations.\nA “Rabies-Free Cities Initiative” is being implemented in 11 major cities, including Bengaluru, Mysuru, Mangaluru and Hubballi-Dharwad. City-specific action plans focus on mass dog vaccination, dog population management, strengthened surveillance and improved waste management.\nDr. Padma said the success of both action plans would depend on sustained inter-departmental coordination and community participation, particularly timely wound washing, prompt reporting of bites, and completion of the full course of post-exposure prophylaxis in rabies cases.",
        "link": "https://www.thehindu.com/news/national/karnataka/karnataka-launches-action-plan-on-snakebite-and-rabies-aims-to-cut-snakebite-deaths-by-half-end-dog-related-rabies-deaths-by-2030/article70684393.ece",
        "date": "Fri, 27 Feb 2026 22:13:52 +0530",
        "fetched_at": "2026-02-28 03:28:58.039383"
    },
    {
        "title": "Bicycle literacy campaign launched in women’s college",
        "content": "Students and faculty members participate in a campaign launched to bring 100 percent Bicycle literacy at Government College for Women in Thiruvananthapuram on Friday. The initiative is introduced as part of the 'Vijnana Keralam' project and supported by 'SheCycling' an independent trust promoting cycling.\n| Photo Credit: JAYAMOHAN A.\nTwenty-two students, five teachers, and one parent have been trained in cycling in five days as part of SheCycling’s ‘Bicycle Literacy Campaign’ at Government College for Women, Vazhuthacaud.\nThe campaign aims at achieving 100% bicycle literacy among students and teachers in 2026.\nWith the declaration, the college will become the first higher education institution in Kerala to formally commit to 100% bicycle literacy among both students and faculty members., the organisers said.\nSince more people have evinced interest in learning to ride bicycles, the next phase of the campaign will begin at the college on March 5.\nOn March 8, International Women’s Day, a rally including all those who have learnt how to ride as part of the Bicycle Literacy Campaign will be held from the college to Thycaud and back.\nSince the goal is to teach cycling to all students in all departments of the college, more training phases will likely be needed, the organisers said.\nThe training is being implemented as part of upskilling under the ‘Vijnana Keralam’ initiative of the State government and is powered by SheCycling, an independent trust dedicated to promoting bicycle literacy and mobility empowerment among girls and women.\nThe campaign includes structured training sessions, supervised practice modules, and awareness programmes designed to ensure that every participant gains confidence and safe riding skills. The initiative recognises cycling not merely as a physical activity, but as a life skill that enhances independence, sustainability, and equal access to mobility.\nThe 100% Bicycle Literacy Campaign at Government College for Women is expected to serve as a model for replication across other colleges under the Vijnana Keralam framework.",
        "link": "https://www.thehindu.com/news/national/kerala/bicycle-literacy-campaign-launched-in-womens-college/article70685289.ece",
        "date": "Fri, 27 Feb 2026 23:15:00 +0530",
        "fetched_at": "2026-02-28 03:29:00.710436"
    },
    {
        "title": "Police book unknown motorcyclist for transporting explosives",
        "content": "The Hutti Police on Friday registered a case against an unknown motorcyclist after finding explosive cartridges near the main gate of Hutti Gold Mines in Hutti village of Lingsugur taluk, Raichur district.\nAccording to an FIR, quoting a complaint lodged by Manayya Mallappa, a security guard, as saying, on-duty security guard Habeeb Akar noticed that a thing had fallen from a moving motorcycle, which was coming from Medanapur village side to Hutti, near the main gate of the gold mines and informed him about it.\nHabeeb Akar and the complainant both went near the fallen thing and found that there were a total of 16 explosive cartridges, the FIR said.\nIt is further stated in the FIR that an unknown motorcyclist was transporting explosives, violating rules and, obviously, knowingly that they were harmful to human beings.\nIn a release, Superintendent of Police Arunangshu Giri has stated that a case has been booked under Sections 3 and 4 of the Explosive Substances Act 1908 and Section 288 of the BNS Act 2023.\nHe also said that the police have launched a search for the motorcyclist in different police station limits.",
        "link": "https://www.thehindu.com/news/national/karnataka/police-book-unknown-motorcyclist-for-transporting-explosives/article70685419.ece",
        "date": "Fri, 27 Feb 2026 22:04:16 +0530",
        "fetched_at": "2026-02-28 03:29:01.362304"
    },
    {
        "title": "Return Social Science textbook, delete online posts, NCERT tells public",
        "content": "In its advisory issued on Friday, February 27, 2026, the NCERT called for any “individual or organisation” in possession of the book or any material related to it to return it to the Publication Division of the Department of Education in Social Sciences in New Delhi “at the earliest possible” Photo credit: X/ncert\nA day after the Supreme Court banned a Social Science textbook over a section on “corruption” in the judiciary, the National Council for Education Research and Training (NCERT) on Friday (February 27, 2026) asked people to return the book and take down related social media posts.\nThe NCERT reiterated that it had withdrawn the Class 8 textbook.\nIn its advisory issued on Friday (February 27, 2026), the NCERT called for any “individual or organisation” in possession of the book or any material related to it to return it to the Publication Division of the Department of Education in Social Sciences in New Delhi “at the earliest possible”. Anyone who had posted any material related to the controversial section on social media or online should delete it, it said.\nThe statement was issued by the office of Himanshu Gupta, Secretary, NCERT, and cited the Supreme Court order in this regard.\nThe Supreme Court registered a suo motu case on Wednesday (February 25, 2026) in relation to the section that had appeared in a chapter titled “Role of Judiciary in Our Society”. Chief Justice Surya Kant called the section on “corruption” in the judiciary a “selective reference”, while calling for a suo motu case to be registered.\nOn Thursday (February 26, 2026), while hearing the case, the Supreme Court directed that copies of the book that had already been distributed or sold be seized, further asking officials concerned to file a compliance report regarding this seizure.\nSoon after the Supreme Court heard the issue on Wednesday, the NCERT issued a public statement apologising for the “inappropriate textual material” and “error in judgement” that had “crept into” the said textbook. A day later, as the controversy intensified, Union Education Minister Dharmendra Pradhan expressed regret and noted that a direction had been issued to withdraw the book as soon as this material was noticed. Government officials claimed that the direction was issued on Tuesday, a day after the book was released.\nSources added that Prime Minister Narendra Modi had also taken notice of the section in question and called for accountability to be fixed. Mr. Pradhan told presspersons on Thursday (February 25, 2026) that action will be taken against those found responsible.\nhigher education",
        "link": "https://www.thehindu.com/news/national/return-social-science-textbook-delete-posts-ncert/article70684338.ece",
        "date": "Fri, 27 Feb 2026 21:49:22 +0530",
        "fetched_at": "2026-02-28 03:29:02.012135"
    },
    {
        "title": "Telangana Chief Minister meets recently surrendered former Maoist leaders",
        "content": "Chief Minister A. Revanth Reddy along with Chief Secretary K. Ramakrishna Rao, Director General of Police B. Shivadhar Reddy meeting recently surrendered leaders of the proscribed CPI (Maoist) party.\n| Photo Credit: By Arrangement\nTelangana Chief Minister A. Revanth Reddy assured surrendered leaders and cadres of the proscribed CPI (Maoist) party that  adequate security and rehabilitation benefits would be provided and the government would extend necessary support to enable them to live with dignity.\nThe Chief Minister on Friday (February 27) met the recently surrendered top CPI Maoist leaders at their request.  The Chief Minister held a face-to-face interaction with the former Maoists and congratulated them for joining the social mainstream after spending several years in the forests. He stated that violence cannot provide a lasting solution and that public aspirations can be addressed only through democratic means.\nThe former cadres thanked the Chief Minister and the government for facilitating their return to mainstream life. They also sought enhancement of relief and rehabilitation packages in line with policies implemented in neighbouring States. The Chief Minister assured to look into their requests.\nThe meeting was attended by Chief Secretary K. Ramakrishna Rao, Director General of Police B. Shivadhar Reddy, Additional Director General of Police Intelligence Vijay Kumar and Inspector General of Police SIB Intelligence B. Sumathi, Advisor to the Chief Minister Vem Narender Reddy and Advisor to the Government K. Keshava Rao.\nFormer top Maoist leaders who recently surrendered before Telangana Police going to meet Chief Minister and Home Minister A. Revanth Reddy at Secretariat in Hyderabad on Friday (February 27, 2026).\n| Photo Credit:\nNAGARA GOPAL\nFormer senior functionaries of the CPI Maoist, including former Central Committee member and Polit Bureau member Tipiri Thirupathi alias Devji, former Central Committee members Malla Raji Reddy alias Sangram, Pulluri Prasad Rao alias Shankaranna , Pothula Padmavathi alias Sujatha, former State Committee member and secretary of the Telangana State Committee Bade Chokka Rao alias Damodar and former State Committee member Nune Narsimha Reddy alias Ganganna, called on the Chief Minister.\nThe Director General of Police briefed the Chief Minister on developments over the past two years concerning reintegration efforts in the State. He stated that 591 Maoists had reintegrated during this period and were now leading normal lives. According to officials, coordinated efforts by the police department and revised rehabilitation policies introduced by the government had contributed to changes in the outlook of senior leaders, leading them to rejoin mainstream society.",
        "link": "https://www.thehindu.com/news/national/telangana/telangana-chief-minister-meets-recently-surrendered-former-maoist-leaders/article70685218.ece",
        "date": "Fri, 27 Feb 2026 21:40:00 +0530",
        "fetched_at": "2026-02-28 03:29:02.677553"
    },
    {
        "title": "Student bags bronze medal in Floristry",
        "content": "Valluru Honeygrace, a student of SVSSC Government Degree College in Sullurpeta, Tirupati district, bagged a bronze at the ‘Indiaskills 2025-26’ regional competition conducted by ‘Skill India’, a unit of the Union Ministry of Skill Development and Entrepreneurship, in Hyderabad recently. The third year physics student bagged the medal and a cash prize of ₹25,000 for demonstrating exceptional skill in floristry, principal S.L.B. Sankar Sharma said in a release.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/student-bags-bronze-medal-in-floristry/article70684646.ece",
        "date": "Fri, 27 Feb 2026 21:22:28 +0530",
        "fetched_at": "2026-02-28 03:29:03.318242"
    },
    {
        "title": "Telangana launches ‘GI on Wheels’ to showcase handicrafts on buses",
        "content": "Six TGSRTC express buses were decorated with GI artwork, as part of ‘GI on Wheels’ initiative, in Hyderabad on Friday.\n| Photo Credit: RAMAKRISHNA G\nHyderabad\nThe Telangana State Road Transport Corporation (TGSRTC) on Friday launched their “GI on Wheels”, an initiative that seeks to transform public buses into mobile galleries displaying Geographical Indication (GI) recognised handicrafts of the State.\nAimed at taking Telangana’s cultural heritage closer to people, the programme was inaugurated by Governor Jishnu Dev Verma at the Mahatma Gandhi Bus Station (MGBS) on Friday.\nAddressing the gathering, the Governor said the initiative seeks to create awareness about GI-recognised art forms and strengthen the cultural identity of Telangana. Cultural awareness, he maintaned, was essential for societal development, adding that such programmes would encourage youth to take interest in traditional arts and accord respect to artisans.\nTransport Minister Ponnam Prabhakar described the initiative as a reflection of the Governor’s vision, he said the government was committed to promoting, marketing and expanding GI products. He expressed confidence that the programme would generate employment opportunities for rural artisans and improve their economic conditions, while assuring support to scale it up through TGSRTC.\nSix prominent GI handicrafts of Telangana, including Pochampally ikkat, Warangal carpets, Karimnagar silver filigree, Narayanpet sarees, Cherial scroll paintings, and Nirmal paintings, have been displayed on specially designed bus panels.\nThe bus designs were created by students of Jawaharlal Nehru Architecture and Fine Arts University, who were felicitated by the Governor. Artists representing the six GI traditions and Subhajit Saha, who contributed to securing GI recognition, were also honoured.",
        "link": "https://www.thehindu.com/news/national/telangana/telangana-launches-gi-on-wheels-to-showcase-handicrafts-on-buses/article70684600.ece",
        "date": "Sat, 28 Feb 2026 07:48:25 +0530",
        "fetched_at": "2026-02-28 03:29:03.966497"
    },
    {
        "title": "Govt.  challenges acquittal of Dileep, others  in actor rape case in HC",
        "content": "The State government has challenged the acquittal of actor Dileep and three others in the 2017 actor rape case before the Kerala High Court. It also sought enhancement of the punishment awarded to the other six convicts in the case.\nThe acquittal of Mr. Dileep and others by the Ernakulam Sessions Court was “illegal and contrary to the evidence on record. The judgment was illegal and unsustainable, and liable to be set aside and modified.” The awarded sentence was “highly disproportionate and inadequate, considering the nature of the offences, the manner of execution, and the terror created in society.” The convicts were awarded only the minimum punishment for gang rape and appropriate punishment was not awarded for some other offences proved against them, the State contended.\nAccording to the State government, the trial court gravely erred in law and on facts and failed to “undertake a comprehensive and holistic evaluation of the prosecution evidence in its entirety” against all the accused who have been charged with the same offences for being members of the criminal conspiracy. The judge made sweeping and stigmatic observations against the investigation and the Investigating Officer. The findings were “wholly uncharitable and contrary to the materials on record,” it argued.\nThe State contended that the court seriously impeached the credibility of the investigation, which was “unwarranted, perverse and without any iota of material supporting such conclusion.”\nThe trial court, which rightly found Pulsur Suni and five others guilty of the 11 offences charged against them, made no discussion regarding the role of Mr. Dileep, though the evidence adduced by the prosecution incriminated them equally. The illegality committed by the court led to a “complete failure in appreciating the prosecution evidence against the master conspirator along with other conspirators,” it argued.\nThe judge undertook “illegal exercises” due to her “preconceived notions and a lack of judicious appreciation of the prosecution evidence.” The first five accused and Mr. Dileep who “were participants in a chain of conspiracy hatched to commit various offences” on the survivor and “being members in the same conspiracy, are liable to be punished for all acts done by each of the conspirators.”\nIn the case of Mr. Dileep, “who is the master conspirator,” the Sessions Judge adopted a separate treatment and applied a different standard of appreciation of evidence by illegally dissecting the charges against him.” The reliable legal evidence against him was “rejected arbitrarily to grant him an acquittal.”\nThe discussions of facts related to the criminal conspiracy between Mr. Dileep and Pulsur Suni were dealt with in an improper way by rejecting them. The court wrongly appreciated the admitted and proved facts, which proved the primary conspiracy between Mr. Dileep and Pulsur Suni, “which resulted in the unmerited acquittal” of Mr. Dileep and resulted in serious miscarriage of justice.”",
        "link": "https://www.thehindu.com/news/national/kerala/govt-challenges-acquittal-of-dileep-others-in-actor-rape-case-in-hc/article70684957.ece",
        "date": "Fri, 27 Feb 2026 21:19:51 +0530",
        "fetched_at": "2026-02-28 03:29:04.616009"
    },
    {
        "title": "Chief Minister Pinarayi Vijayan will lead LDF’s Assembly poll campaign in Kerala, confirms CPI(M) PB",
        "content": "Kerala CM Pinarayi Vijayan. Photo credit: The Hindu\nThe Polit Bureau of the Communist Party of India (Marxist) [CPI(M)] stated that Chief Minister Pinarayi Vijayan will lead the Left Democratic Front (LDF) campaign in the Kerala Assembly elections. CPI(M) general secretary M.A. Baby told a press conference in New Delhi that the party would take a call on who should be the Chief Ministerial candidate only after the LDF emerged victorious in the polls.\nMr. Baby said the CPI(M) would announce its candidates for Kerala within a week. “The candidate list will be a mix of young and seasoned leaders. The party would ensure the inclusion of marginalised sections of society, including women, in the list”, he said. When asked whether caste and communal equations would influence candidate selection, Mr. Baby said: “Not community factors, but social factors. For one, women are an oppressed section,” he said.\nMr. Baby said the party was firm on the two-term principle for legislators. “However, the party does not preclude flexibility and exceptions, given the winnability factors in play in every election,” he said. Mr. Baby said the CPI(M) district secretariats would send their respective choices to the party’s State Secretariat and State Committee. “Some names will likely be supplanted, given ground-level political realities,” he said.\nMr. Baby said the LDF would significantly expand in the run-up to the Assembly polls in Assam, West Bengal, Tamil Nadu, Puducherry, and Kerala. “Communist Party of India (Marxist-Leninist) Liberation, and other left socialist groups, will throw in their lot with the LDF. Some groups will evolve as LDF constituents, while others will work in tandem with front under the banner of LDF Plus,” he said.\nMr. Baby said Rashtriya Swayamsevak Sangh’s (RSS) aggressive Hindu majoritarian nationalism has spawned “minority extremist groups,” some of which “are active in Kerala”. “Both the fascist-revanchist groups share a mutually symbiotic relationship, with one feeding off the social insecurity caused by the other. The PB has asked secular democratic forces to maintain social vigil against such schismatic forces,” he said.\nMr. Baby defended CPI(M) leader Chintha Jerome, who had come under social media attack for allegedly resorting to misogynistic sloganeering during a DYFI protest against the Kerala Student Union’s black-flag protest against the Health Minister Veena George. “An immature youth raised the slogan. Some elements used AI to doctor the original video and make it appear as if Ms. Jerome had mouthed the offensive words,” he said.\nThe PB passed a resolution condemning Congress’s “physical targeting” of Ms. George. It noted that a vilification campaign was afoot to besmirch Kerala’s storied public health system. “The misinformation campaign is part of a larger conspiracy to undermine public confidence in the PHS and drive ordinary citizens to prohibitively expensive corporate health sector,” Mr. Baby said. The PB also passed a resolution condemning the Sangh Parivar attack on minorities and Dalits.",
        "link": "https://www.thehindu.com/news/national/kerala/chief-minister-pinarayivijayan-will-lead-ldfs-assembly-poll-campaign-in-kerala-confirms-cpim-pb/article70685035.ece",
        "date": "Fri, 27 Feb 2026 21:08:15 +0530",
        "fetched_at": "2026-02-28 03:29:06.734648"
    },
    {
        "title": "Four arrested, including bank officials, for facilitating mule accounts in cyber fraud case",
        "content": "Four individuals, including two bank officials, were arrested by the cyber crimes wing of the Cyberabad police for facilitating mule bank accounts used in cyber fraud transactions.\nThe accused were identified as Jawwad Qadri Rifai, 28, and Mohammed Naushad, 26, both mule account suppliers, along with Pamula Pranavaraj, 46, sales manager, and Shankar Rathi, 51, branch manager of Jubilee Hills Mercantile Co-operative Urban Bank Ltd.",
        "link": "https://www.thehindu.com/news/cities/Hyderabad/four-arrested-including-bank-officials-for-facilitating-mule-accounts-in-cyber-fraud-case/article70684322.ece",
        "date": "Fri, 27 Feb 2026 21:05:43 +0530",
        "fetched_at": "2026-02-28 03:29:07.468129"
    },
    {
        "title": "NCERT Class VIII textbook: Kerala Minister welcomes SC intervention over references to ‘corruption’ in judiciary",
        "content": "Minister for General Education V. Sivankutty has welcomed the Supreme Court’s intervention on references to ‘corruption’ in the judiciary in the Class VIII Social Science textbook that was published by the National Council of Educational Research and Training (NCERT).\nIt was regrettable that content that demeaned the judiciary, which was the pillar of democracy, had been included in the textbook, Mr. Sivankutty said in a Facebook post on Friday, demanding that an independent expert committee probe all revisions and deletions in all NCERT textbooks in recent times. “It should be investigated whether there are moves to distort history and Constitutional values,” the Minister said in the post.\nMr. Sivankutty said imparting students with incorrect messages about the judicial system was a serious offence. “The younger generation should be taught to respect Constitutional institutions,” he said.\nKerala, he pointed out, had opposed such unilateral deletions of content earlier too and had brought out additional textbooks incorporating key content axed by the NCERT.\nMr. Sivankutty demanded stringent action against those who led the preparation of the controversial content and those who gave it approval. The NCERT director and others concerned were bound to provide clear answers to the court’s questions on the issue, he said.\nHe underscored that communalism or opposition to Constitutional institutions would not be allowed in the education sector. “The State’s position is that a comprehensive probe under the supervision of the Supreme Court should be held on this issue,” the Minister said.\nThe apex court had ordered a blanket ban on the Class VIII Social Science textbooks citing a calculated move to denigrate the judicial system.",
        "link": "https://www.thehindu.com/news/national/kerala/ncert-class-viii-textbook-kerala-minister-welcomes-sc-intervention-over-references-to-corruption-in-judiciary/article70684874.ece",
        "date": "Fri, 27 Feb 2026 21:03:45 +0530",
        "fetched_at": "2026-02-28 03:29:08.116198"
    },
    {
        "title": "Kumbalanghi panchayat Budget lays emphasis on housing project",
        "content": "Kumbalanghi grama panchayat’s Budget has put a strong emphasis on providing housing for the homeless through the LIFE Mission project, with an allocation of ₹1.30 crore while also prioritising social welfare.\nThe Budget presented by vice-president Margaret Lawrence announced a ‘Clean Kumbalanghi-Green Kumbalanghi’ project in collaboration with the Kochi Corporation and Clean Kerala company.\nThe Mahatma Gandhi National Rural Employment Guarantee Scheme is projected to receive ₹2.10 crore. The Budget anticipates a total revenue of ₹46.22 crore.\nPanchayat president Shaji Kuruppassery led the session.",
        "link": "https://www.thehindu.com/news/national/kerala/kumbalanghi-panchayat-budget-lays-emphasis-on-housing-project/article70684579.ece",
        "date": "Fri, 27 Feb 2026 21:01:54 +0530",
        "fetched_at": "2026-02-28 03:29:08.775860"
    },
    {
        "title": "HPV vaccination campaign to be launched on Feb. 28",
        "content": "A campaign to provide the Human Papillomavirus (HPV) vaccine to all girls aged 14 will be launched on Saturday (February 28, 2026) at 2 p.m. at the Ernakulam General Hospital (GH). The campaign aims to vaccinate 15,934 children in the district.\nThe event is part of the national-level vaccination campaign of the Health Ministry, which begins on Saturday, to provide a one-dose HPV vaccination to all girls aged 14 within a span of three months.\nFree HPV vaccination facility is available at all government health centres. To book for vaccination, register on the U-WIN portal. The facility is available on the website https://uwin.mohfw.gov.in/home, a release issued by the District Medical Officer noted.\nThe National Technical Advisory Group on Immunization (NTAGI) and the World Health Organisation had recommended the vaccination.",
        "link": "https://www.thehindu.com/news/national/kerala/hpv-vaccination-campaign-to-be-launched-on-feb-28/article70685094.ece",
        "date": "Fri, 27 Feb 2026 20:59:34 +0530",
        "fetched_at": "2026-02-28 03:29:09.422041"
    },
    {
        "title": "Tamil Nadu CM Stalin inaugurates Cuddalore-Madapattu section of State highway",
        "content": "The Cuddalore-Madapattu section of State Highway, upgraded at a cost of ₹428.59 crore, was inaugurated virtually by Tamil Nadu Chief Minister M.K. Stalin on Wednesday.\n| Photo Credit: SPECIAL ARRANGEMENT\nChief Minister M.K. Stalin on Wednesday inaugurated through video conferencing, the upgraded Cuddalore-Madapattu section of State Highway.\nA sum of ₹428.59 crore was spent for the project, which was carried out by the State Highways Department (Project Wing) with financial assistance from the Asian Development Bank.\nThe overall length of the highway is 37.36 km, of which 33.87 km falls in Cuddalore district, 2.88 km in Villupuram district and 0.610 km in Kallakurichi district. A total of 21.18 hectares of land was acquired for the project and a compensation of ₹33 crore was provided to the landowners.\nThe State Highway includes one major bridge, one road over bridge, four minor bridges, 74 culverts, six major junctions, 38 minor junctions, 35 bus shelters with toilet facilities, 849 street lights, 110 solar blinkers, and seven high mast lights. A total of 8,770 saplings have been planted on both sides of the road.\nThe highway will benefit residents of 24 villages from the three districts and reduce their travel time remarkably.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/tamil-nadu-cm-stalin-inaugurates-cuddalore-madapattu-section-of-state-highway/article70683534.ece",
        "date": "Fri, 27 Feb 2026 21:00:36 +0530",
        "fetched_at": "2026-02-28 03:29:10.074011"
    },
    {
        "title": "Govt. spending ₹13,722 crore to provide free electricity to farmers, says Energy Minister Gottipati Ravi Kumar",
        "content": "Energy Minister Gottipati Ravi Kumar.\n| Photo Credit: File Photo\nEnergy Minister Gottipati Ravi Kumar informed the Legislative Assembly on Friday that the government was spending ₹13,722 crore to provide free electricity to farmers across the State. He also stated that 1.10 lakh agricultural electricity connections had been sanctioned so far to support the farming community.\nReplying to a question raised by MLA Maddipati Venkata Raju regarding distribution of agricultural transformers and safety concerns in oil palm plantations, the Minister said that 177 agricultural transformers had already been distributed in the Gopalapuram constituency. An additional 239 transformers would be released shortly. He attributed minor delays in distribution to the ongoing agricultural season and assured that the remaining transformers would be supplied soon.\nHighlighting the government’s commitment to expanding oil palm cultivation, the Minister said special measures were being taken for the welfare and development of oil palm farmers. However, he expressed concern over rising electrical accidents during oil palm harvesting.\nHe explained that many accidents occur when iron poles used during harvesting come in contact with overhead power lines, leading to electrocutions. To prevent such incidents, he advised the use of covered fibre-reinforced plastic (FRP) poles instead of iron poles. Though FRP poles cost ₹5,000, their usage, along with proper precautions, could significantly reduce accidents, he said, and urged MLAs to create awareness among farmers and agricultural workers about adopting safe practices.\nThe Minister also pointed out that shifting power lines was an expensive process and would be taken up based on availability of funds. He noted that accidents wer also occurring because houses were being constructed under power lines and crops being cultivated directly beneath overhead lines.\nIn oil palm plantations, he advised leaving adequate space under power lines to prevent contact during harvesting, especially as the trees grow up to 10 meters tall.\nAdditionally, he said steps were being taken to address risks posed by low-height transformers and assured that electricity department officials would remain vigilant and be ready to act to prevent accidents.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/govt-spending-13722-crore-to-provide-free-electricity-to-farmers-says-energy-minister-gottipati-ravi-kumar/article70684009.ece",
        "date": "Fri, 27 Feb 2026 20:55:05 +0530",
        "fetched_at": "2026-02-28 03:29:10.723255"
    },
    {
        "title": "Fino Payments Bank MD Rishi Gupta Arrested; CFO Ketan Merchant Named Interim Head",
        "content": "Rishi Gupta, Managing Director and Chief Executive Officer of Fino Payments Bank, has been arrested under the provisions of the Central Goods and Services Tax (CGST) Act and the State Goods and Services Tax (SGST) Act, the bank informed stock exchanges on Friday.\nIn its regulatory filing, the bank said the arrest took place earlier in the day. It clarified that the investigation is related to certain business partners of the bank.\nFollowing Gupta’s arrest, Chief Financial Officer Ketan Merchant has been appointed as the Head of the Organisation, the filing stated.\nThe development was disclosed through an official communication to the exchanges. Further details regarding the nature of the investigation were not immediately available.\nLatest Blogs",
        "link": "https://www.news18.com/india/fino-payments-bank-md-rishi-gupta-arrested-cfo-ketan-merchant-named-interim-head-ws-l-9934412.html",
        "date": "Fri, 27 Feb 2026 23:32:10 +0530",
        "fetched_at": "2026-02-28 03:29:14.957165"
    },
    {
        "title": "Surat Mass Suicide: Main Accused Arrested After Note Reveals Credit Card Fraud, Mental Torture",
        "content": "Days after three members of a family died by suicide, reportedly by consuming a poisonous substance, police have arrested the main accused, identified as Vaibhav Rungta, in Delhi for allegedly forcing the family to take the drastic step.\nBalmukund Khetan, a native of Bihar, his wife Priyanka and their elder daughter died at their residence in Surat’s Vesu area on Tuesday after allegedly consuming a poisonous substance. The couple’s younger daughter, who is seven years old, survived and is currently receiving treatment, according to police.\nThe investigation uncovered a trail of financial abuse. A three-page suicide note was recovered from the scene, which accused Vaibhav Rungta of massive credit card fraud and relentless mental torture, according to a report by NDTV. The note revealed that Rungta allegedly misused Khetan’s credit cards.\nWhen Balmukund, a stock trader who worked from home, demanded his money back, he was met with verbal abuse and death threats. The family chose to take the extreme step due to constant mental and financial pressures.\nYoungest Daughter ‘Spoon-Fed’ Poison\nThe youngest daughter, identified as Prithvi, told cops that she had been “spoon-fed\" something by her parents, which led investigators to believe that the children were poisoned first before the couple consumed the substance themselves, according to the NDTV report.\nThe family consumed aluminium phosphide, a highly toxic substance. On the day of the incident, Priyanka informed her father that they had consumed prison. Although an ambulance rushed the family to the hospital, most of them could not be saved. Balmukund was declared dead at the scene, while Priyanka and their elder daughter, Bhavya, succumbed to their injuries during treatment.\nPolice are now investigating whether other moneylenders or accomplices were involved in the harassment, and the victim’s bank accounts and credit card transactions are being audited for evidence.\nAfter the mass suicide, Vesu police team caught Rungta in Delhi following technical surveillance. A local Delhi court refused transit remand to Rungta, ordering the accused to appear in person before the Surat court instead.\nSuicide Prevention. News 18. If you or someone you know needs help, call any of these helplines: Aasra (Mumbai) 022-27546669, Sneha (Chennai) 044-24640050, Sumaitri (Delhi) 011-23389090, Cooj (Goa) 0832- 2252525, Jeevan (Jamshedpur) 065-76453841, Pratheeksha (Kochi) 048-42448830, Maithri (Kochi) 0484-2540530, Roshni (Hyderabad) 040-66202000, Lifeline 033-64643267 (Kolkata)\nLatest Blogs",
        "link": "https://www.news18.com/india/surat-mass-suicide-main-accused-arrested-after-note-reveals-credit-card-fraud-mental-torture-ws-l-9934393.html",
        "date": "Fri, 27 Feb 2026 22:56:53 +0530",
        "fetched_at": "2026-02-28 03:29:15.822665"
    },
    {
        "title": "Rising Bharat Summit | PM Modi Hails Rise Of 'New India', Assails Congress For 'Defaming Nation'",
        "content": "At the News18 Rising Bharat Summit on Friday, Prime Minister Narendra Modi delivered a powerful address that balanced a scathing critique of the political opposition with a soaring vision of a self-confident, “Aatmanirbhar\" India. The Prime Minister asserted that when the “hidden strength\" of a nation awakens, it achieves accomplishments that amaze the world. However, he lamented that despite decades of independence, certain political factions remain shackled to a “colonial mindset\", acting as a “toolkit\" of opposition that belittles national achievements on the global stage.\nA significant portion of the Prime Minister’s speech was dedicated to the recent AI Summit, which he described as a moment of immense national pride where India moved from being a consumer to a creator of technology. He sharply criticised the Congress party for attempting to turn this global celebration into a political spectacle. PM Modi remarked that the “country’s oldest party\" revealed its “ideological bankruptcy\" by attempting to defame the nation in front of foreign guests. He suggested that when frustration from repeated failure takes over, it manifests as arrogance that harms the country’s image. He further noted that the Congress often uses the name of Mahatma Gandhi as a shield to hide its mistakes while reserving all credit for a single family when things go well.\nThe Prime Minister highlighted the dramatic shift in India’s digital landscape, particularly through the “JAM Trinity\" (Jan Dhan, Aadhaar, and Mobile). He noted that while ATMs arrived in India far later than in developed nations, the country has leapfrogged to become a global leader in digital payments. This infrastructure has revolutionised welfare, allowing the government to transfer Rs 24 lakh crore directly to beneficiaries, effectively plugging the leakages that were once accepted as an unavoidable truth. He pointed out that an India where 30 million families lived in darkness before 2014 is now a global leader in solar power and boasts the world’s third-largest metro rail network.\nThe Prime Minister drew a sharp contrast between the “slow and delayed\" India of the past and the “Fast and Fearless\" India of 2026. He cited the transformation of the Indian Railways through Vande Bharat and Namo Bharat as evidence of this new pace. On the economic front, he noted that India has managed to control inflation—which was once in double digits—and has successfully negotiated trade deals with developed nations from a position of “Aatmanirbhar\" strength. He declared that India has officially become the “world’s growth engine\", driven by a generation of Gen Z voters who are ready to teach a lesson to those immersed in “family loyalty\" rather than national duty.\nThe Prime Minister also took aim at regional governments for stalling central welfare schemes. He highlighted that the Ayushman Bharat health scheme, providing free treatment up to Rs 5 lakh, remains unimplemented in West Bengal. Similarly, he noted that while 9.5 lakh houses were allotted to the poor in Tamil Nadu under PM Awas Yojana, construction for 3 lakh homes has stalled because the DMK government is “not taking interest\". He added that such delays are a result of insincere intentions, contrasting them with his government’s mission to ensure that no citizen is left behind in the journey towards a developed Bharat.\nLatest Blogs",
        "link": "https://www.news18.com/india/rising-bharat-summit-pm-modi-hails-rise-of-new-india-assails-congress-for-defaming-nation-9934364.html",
        "date": "Fri, 27 Feb 2026 22:19:54 +0530",
        "fetched_at": "2026-02-28 03:29:16.634491"
    },
    {
        "title": "PM Modi Underscores India’s Tech Leap, AI Summit Success At News18 Rising Bharat 2026",
        "content": "Addressing the News18 Rising Bharat Summit on Friday, Prime Minister Narendra Modi articulated a transformative vision of India’s journey from a hesitant importer of technology to a dominant global exporter and trendsetter. Speaking at Bharat Mandapam in New Delhi, the Prime Minister noted that the world is now “amazed\" by India’s digital infrastructure, which has bridged the gap between governance and the common citizen through the formidable “JAM Trinity\"—Jan Dhan, Aadhaar, and Mobile. This bedrock of Digital Public Infrastructure (DPI) has enabled the government to transfer a staggering Rs 24 lakh crore directly to beneficiaries via Direct Benefit Transfer (DBT), effectively eliminating the “bitter truth\" of leakages that once plagued India’s welfare systems.\nThe Prime Minister highlighted that India’s leadership in digital payments is no longer just a regional success story but a global case study. He remarked that while ATMs arrived in India much later than in the developed world, the country has leapfrogged traditional banking hurdles to facilitate 20 billion digital transactions every month. This democratic spirit of technology ensures that 50 out of every 100 real-time digital transactions in the world now occur in India alone. This shift from a “consumer mindset\" to a “creator mindset\" was further exemplified by the recent India AI Impact Summit, where India was not merely a participant but a leader, shaping international standards for ethical and inclusive artificial intelligence.\nPrime Minister Modi emphasised that India is now setting new benchmarks in emerging technologies. He noted that a few years ago, initiatives hosted in India were often dismissed as regional matters; today, every major step taken in Bharat is analysed internationally. This rising global stature is a reflection of the “strength within\"—a realisation of national potential that has turned India into a hub for semiconductors, quantum computing, and scalable AI solutions. By moving from “Machine Learning\" to “Learning Machines\", India is ensuring that its MANAV vision for AI (Moral, Accountable, National, Accessible, and Valid) becomes a global blueprint for the common good.\nThe Prime Minister maintained that by stating that India is now a “Fast and Fearless\" nation, contributing nearly 20% to global growth. The transition from importing 2G and 3G technology to exporting indigenous 5G solutions and homegrown AI models signifies a sovereign digital future. For the global community, especially the Global South, the “India Stack\" has become a beacon of hope, proving that technology can be a means of equality rather than a source of divide. As India acts, the world watches, recognising that the nation is no longer just a part of the global dialogue—it is the one leading it.\nLatest Blogs",
        "link": "https://www.news18.com/india/pm-modi-underscores-indias-tech-leap-ai-summit-success-at-news18-rising-bharat-2026-9934324.html",
        "date": "Fri, 27 Feb 2026 21:24:59 +0530",
        "fetched_at": "2026-02-28 03:29:17.677137"
    },
    {
        "title": "'They Tried To Destroy India's Image': PM Modi Lashes Out At Congress Over AI Summit Protest",
        "content": "Prime Minister Narendra Modi on Friday launched a scathing attack on Congress, referring to it as “India’s oldest party\" that tried to destroy India’s image at the AI Impact Summit, which concluded on February 21.\nCalling the shirtless protest at the AI summit by the Youth Congress a “dirty\" tactic, Prime Minister Modi said they deployed it a time when India is shaping the discourse in the age of artificial intelligence.\n“The AI summit was a moment of pride for the entire country, but the country’s oldest party tried to turn the national celebration into a spectacle. In front of foreign guests, the Congress not only exposed itself but also revealed its ideological bankruptcy,\" Modi said, during the News18 Rising Bharat Summit.\nModi took a swipe at the Congress’s “habit\" of protesting, saying when frustration and disappointment from failure fill the mind and arrogance takes over, thinking that defames the country comes to the surface. But he said no matter what, his government will keep doing its work.\n“Congress jitna shirt pharte rahe, hum apna kaam karte rahenge (no matter how many shirtless protests Congress carries out, we will keep doing our work),\" he said.\nRecalling Congress leader Rahul Gandhi’s reference to Mahatma Gandhi over the shirtless protest, he said the grand old party always brings Bapu’s name forward to “hide its mistakes\".\n“There is anger in the country over this act of Congress. That is why, to justify their wrongdoing, they brought Mahatma Gandhi forward. The Congress party does the same thing whenever it wants to hide its mistakes — it brings Bapu to the forefront — and when it wants to claim credit, it gives all the recognition to one family (Nehru-Gandhi family),\" he said.\nListing the Congress’s opposition to Article 370, triple talaq, Swachh Bharat, Covid vaccine, surgical strikes, and the Ashoka stambh, the Prime Minister said the Congress has now been reduced to merely a “toolkit\" of the opposition in the name of ideology.\n“Congress opposed Ashoka stambh in Parliament, they opposed the new Parliament building, opposed the surgical strikes, air strikes, ‘Operation Sindoor. They opposed the CAA, women reservation Bill, UPI, opposed abolition of triple talaq. This mindset of blind opposition has grown so much that it does not miss any opportunity to belittle the country on any stage or platform,\" he said.\nGiving the example of the AI summit, however, Modi said nowadays any event hosted by India starts a global conversation but this was not the case before.\nHe said till a few years ago, events happening in India barely received serious attention in global media. Programmes and initiatives hosted in India were often seen as regional matters, not global ones, he added.\n“But look at the situation today. When India acts, the world watches. When India hosts an event, it becomes part of the global conversation. Every major step taken here is analysed internationally. Take the example of the AI summit. Under the leadership of Narendra Modi, India is not just participating in global technology discussions — it is helping shape them. The world is closely observing India’s initiatives in artificial intelligence, digital governance, and emerging technologies,\" he said.\nHe added that this transformation reflects India’s rising global stature and, today, India is not just part of the dialogue — it is helping lead it.\nLatest Blogs",
        "link": "https://www.news18.com/india/indias-oldest-party-tried-to-destroy-indias-image-at-ai-summit-pm-modi-at-rising-bharat-9934264.html",
        "date": "Fri, 27 Feb 2026 21:41:52 +0530",
        "fetched_at": "2026-02-28 03:29:18.852532"
    },
    {
        "title": "'Some Surprised About India's Trade Deals With Developed World': PM Modi At Rising Bharat Summit",
        "content": "Prime Minister Narendra Modi on Friday said India’s growing global stature and economic confidence have led developed nations across the world to actively seek trade agreements with the country, describing it as a reflection of an “Aatmanirbhar and Aatmavishwaasi Bharat (self-dependent and self-confident)\".\nDelivering the keynote address at News18’s Rising Bharat Summit, PM Modi said over the last 11 years, India has rediscovered its strength and shed what he described as a long-standing colonial mindset. “In the last 11 years, energy has flowed into the consciousness of the country. India has understood its strength and wants to recognise its capabilities,\" the prime minister said.\n#RisingBharatSummit2026 | People are shocked at the trade deals India is doing. How come developed nations are excited regarding making deals with India: PM Narendra Modi (@narendramodi) Watch live: https://t.co/3knrPqR1Sv pic.twitter.com/KGVITcGVQI\n— News18 (@CNNnews18) February 27, 2026\nDrawing a contrast with the past, PM Modi remarked that for decades, India’s potential was “ignored\" and the country remained dependent on foreign models. “There was a time when we used to copy foreign technology. Even after Independence, India could not come out of the mentality of slavery. We are suffering the consequences of that till date,\" he said.\nThe prime minister, highlighting India’s expanding trade footprint, said the world’s leading economies are now eager to partner with India. “India is now so capable that developed countries of the world are themselves coming forward to make trade deals with India,\" he said. “Some people are not able to believe how India managed to do trade deals with developed countries.\"\nAccording to the prime minister, the answer lies in what he termed an “Aatmavishwaasi Bharat\"—a self-confident India that negotiates from a position of strength.\nHe added that India’s macroeconomic stability has strengthened its credibility. “We have made our banking system strong. We have controlled inflation which was once in double digits. We have made India the world’s growth engine,\" he said, asserting that global investors and governments view India as a reliable economic partner.\nPM Modi also pointed to India’s transformation in technology and digital governance as a factor behind rising global interest. “There was a time when India was just a consumer of technology. Today, India is not only using technology at scale but also becoming a leader in it,\" he said, highlighting the global attention around India’s Digital Public Infrastructure.\nReferring to the JAM trinity—Jan Dhan, Aadhaar and Mobile—the prime minister said the integration of these platforms has enabled transparent governance and direct benefit transfers worth Rs 24 lakh crore to beneficiaries, reducing leakages that were once considered inevitable.\n“In a country where even ATMs arrived much later compared to developed nations, how did India achieve global leadership in digital payments?\" he asked, adding that the world is “amazed\" by India’s digital infrastructure.\nLatest Blogs",
        "link": "https://www.news18.com/india/some-surprised-about-indias-trade-deals-with-developed-world-pm-modi-at-rising-bharat-summit-ws-l-9934214.html",
        "date": "Fri, 27 Feb 2026 20:57:15 +0530",
        "fetched_at": "2026-02-28 03:29:19.625945"
    },
    {
        "title": "'Everyone Would Want Good Relations With India': Ex-Singapore FM At Rising Bharat Summit 2026",
        "content": "Former Singapore Foreign Minister George Yeo spoke about India’s role in current geopolitics at the News18 Rising Bharat Summit, where he underscored that everyone wants to build ties with New Delhi due to its rising political clout and economic growth.\nSpeaking to Firstpost’s Managing Editor Palki Sharma, Yeo said relations between India and China were key to regional peace in Asia, adding that India was in a good position globally as it was not a threat to any of the major powers in the world.\n“India is in a good position. India is not a threat to any of the major powers. Everyone wants good relations with India, including China. India has the privilege to sit at every table and enjoy the best,\" he said, when asked about current global uncertainties.\nYeo also appeared confident that all of India’s neighbours, including China, would want good relations with New Delhi in 10-20 years as it would be a “very good source of their own well-being\" and advantageous for them in the long run.\nYeo On India-China Relations\nThe former Singaporean FM said all of China’s neighbours wanted good investment, but they did not want to get too close to Beijing as they didn’t want it to dominate their lives. “China makes use of its economic position for statecraft. In 10-15 years, India will be in the same position in the continent.\"\nAn advocate of peaceful relations between India and China, Yeo said their relationship is key to regional peace, adding that while it is unlikely they will be too close, they do not have to be enemies.\nHe outlined key issues in India-China ties: politics and border security. However, he emphasised that China now understands that India is acting on its own behalf and its alliance with America is not aimed at countering Beijing.\nSelf-Sustaining Development In India\nYeo also asserted that India was on the trajectory for self-sustaining development, which he said was beneficial for Asia, Singapore and the world.\n“India went through a critical test in the last few months, when America piled on pressure. But India did not buckle. Its standing in the world has gone up. t made some tough decisions – to have an FTA with Europe, to undertake further internal reforms, and to move towards a situation where Indian talent is retained within India,\" he remarked.\nIndia’s IT Development & AI\nAlthough Yeo said India has become a major IT power in the world, he cautioned that artificial intelligence was a huge challenge for every nation. “The US and China are moving very fast. I think it’s good that India gave AI its full attention,\" he stated.\n“You (India) had a successful convention here a few weeks ago. You have identified the problems and opportunities, but moving with this technology requires the mobilisation of all people. It’s not just what a few computer scientists could do.\"\nHe also highlighted the use of technology for good and evil. “We have to be very mindful of the harm AI could do,\" he added. “Some societies can respond to new technologies better than others. They can exploit it, they can manage the problems.\"\nLatest Blogs",
        "link": "https://www.news18.com/india/everyone-would-want-good-relations-with-india-ex-singapore-fm-at-rising-bharat-summit-2026-ws-l-9934206.html",
        "date": "Fri, 27 Feb 2026 20:13:50 +0530",
        "fetched_at": "2026-02-28 03:29:20.827847"
    },
    {
        "title": "'Longest Ever Kill In Military History': IAF Showcases S-400’s Operational Might In New Video",
        "content": "The Indian Air Force (IAF) has released a video showcasing the operational capability of its S-400 long-range air defence missile system, claiming what it described as the “longest ever kill recorded in military history.\"\nThe footage shows a radar detecting a distant aerial target, followed by the launch of a missile that successfully intercepts and destroys it at extreme range.\nAn on-screen message reads, “Enemy may be out of sight but never out of reach,\" underscoring the system’s long-distance engagement capability. The IAF said the intercept represents the longest-range kill achieved so far.\n#WATCH | For the first time, the Indian Air Force shares a video showcasing the Sudarshan S-400 long-range air defence missile system in operation, along with a caption of scoring the longest ever kill recorded in military history.The Indian Air Force had secured the kill… pic.twitter.com/lDxQx2vynu\n— ANI (@ANI) February 26, 2026\nThe video also makes reference to Operation Sindoor, conducted in May 2025, during which the S-400 system reportedly played a critical role.\nAccording to IAF officials, the air defence platform was used to strike a target located nearly 300 km inside Pakistan during the operation.\nThe footage has been released ahead of Exercise Vayu Shakti-2026, a major air power demonstration scheduled to be held at Pokhran, where the IAF is expected to display its operational readiness and advanced combat capabilities.\nThe S-400 Triumf, developed by Russia’s Almaz-Antey and inducted into Indian service as the “Sudarshan Chakra,\" is one of the world’s most advanced long-range surface-to-air missile systems.\nOperated by the IAF, it is designed to detect, track and neutralise a wide range of aerial threats, including fighter jets, drones, cruise missiles and select ballistic missiles.\nIndia signed a $5.4-billion deal with Russia in 2018 to procure five S-400 regiments, with deliveries beginning in 2021.\nThe system employs multiple missile variants, including the long-range 40N6 missile with a reported reach of up to 400 km, supported by medium- and short-range interceptors for layered defence.\nEquipped with powerful surveillance radars capable of detecting targets at distances of up to 600 km under favourable conditions, the S-400 can track and engage multiple threats simultaneously.\nMounted on mobile platforms, each regiment comprises launchers, radar units, command posts and support vehicles, allowing rapid redeployment.\nIntegrated with other Indian air defence systems such as Akash and medium-range surface-to-air missiles, the S-400 forms a key pillar of India’s layered air defence grid.\nVayu Shakti-2026 is also set to feature a wide array of IAF assets, including Tejas, Rafale, Jaguar, Mirage-2000, Sukhoi-30MKI, MiG-29 and Hawk jets, along with transport aircraft and helicopters, highlighting the breadth of India’s air power capabilities.\nLatest Blogs",
        "link": "https://www.news18.com/india/iaf-releases-s-400-strike-video-says-longest-ever-kill-in-military-history-watch-9934196.html",
        "date": "Fri, 27 Feb 2026 22:51:56 +0530",
        "fetched_at": "2026-02-28 03:29:21.598454"
    },
    {
        "title": "'Judiciary Is Supreme': Anna Hazare Reacts As Court Grants Relief To Kejriwal In Excise Policy Case",
        "content": "Social activist Anna Hazare on Friday said the court’s decision to discharge former Delhi chief minister Arvind Kejriwal in the excise policy case must be respected, asserting that the strength of India’s judiciary is what keeps the country functioning smoothly.\nSpeaking to reporters at his native village Ralegan Siddhi, Hazare welcomed the verdict and said the “judiciary remains the supreme institution in the country.\"\n“Our nation runs because of the judicial system. In a country with many parties, castes, religions and ideologies, stability is maintained due to a strong judiciary,\" he said.\nHazare said that without an independent and effective judicial system, criminal elements would gain the upper hand, leading to chaos and unrest. He added that all citizens must accept court rulings in a democracy, irrespective of political differences.\nResponding to his past criticism of Kejriwal during the probe, Hazare said his remarks were made before any judicial finding. “At that time, allegations were being discussed. Now the court has clearly stated that he had no role in any wrongdoing. We must accept the verdict,\" he said.\nA Delhi court on Friday discharged Kejriwal, his former deputy Manish Sisodia, and 21 others in the politically sensitive liquor policy case, observing that there was no “overarching conspiracy or criminal intent\" behind the policy.\nThe court also pulled up the Central Bureau of Investigation for lapses in its probe.\nKejriwal, who was arrested in March 2024 by the Enforcement Directorate and later by the CBI, spent 155 days in jail before being released on bail.\nHazare also described Kejriwal and Sisodia as his former “karyakartas\" (volunteers), recalling their association during the 2011 India Against Corruption movement that demanded a strong Jan Lokpal law.\nThe movement later led to the formation of the Aam Aadmi Party, though Hazare distanced himself when it took a political turn.\nWhen asked what advice he would give Kejriwal following the court relief, Hazare said, “Work for society and the nation. Do not think about yourself or your party.\"\nLatest Blogs",
        "link": "https://www.news18.com/india/judiciary-is-supreme-anna-hazare-reacts-as-court-grants-relief-to-kejriwal-in-excise-policy-case-9934122.html",
        "date": "Fri, 27 Feb 2026 19:10:38 +0530",
        "fetched_at": "2026-02-28 03:29:22.521761"
    },
    {
        "title": "Rising Bharat Summit | From Back-Offices To Nerve Centres: How GCCs Are Anchoring India’s Global Ambitions",
        "content": "The narrative of India as a mere “back-office\" for global corporations has been firmly dismantled at the News18 Rising Bharat Summit 2026. During a high-impact session titled “GCCs Ahoy! All roads lead to India\", industry leaders gathered at Bharat Mandapam in New Delhi on February 27 to map out the meteoric rise of Global Capability Centres (GCCs). The discussion underscored a fundamental shift: India is no longer just providing labour; it is now the strategic “nerve centre\" where high-end R&D, autonomous vehicle technology, and AI-first products are conceived and owned.\nKaran Virwani, Chairperson, MD, and CEO of WeWork India, provided a striking metric for this growth, noting that GCCs now drive 40% of the Indian commercial real estate market. However, the physical expansion is merely a shadow of the intellectual growth occurring within those walls. Virwani highlighted that as digital transformation and AI adoption accelerate, the actual research and development—traditionally kept at global headquarters—is now happening in India. From innovation hubs to front-office functions, the sophisticated nature of the work being migrated is transforming the local talent landscape into a global front-runner.\nKiran Cherukuri, EVP and Global GCC Practice Head at HCLTech, revealed that the mandate for these centres has evolved from execution-based tasks to full product ownership. This transformation is being supercharged by artificial intelligence, with 65% of GCCs having already experimented with or fully rolled out AI pilots. This “AI-first\" approach is allowing Indian centres to transition from being recipients of instructions to becoming the primary architects of global enterprise platforms.\nThe rapid scaling of the sector has brought the challenge of talent retention to the forefront. Aravind Maiya, Co-Founder and CEO of EmbarkGCC, emphasised that as competition intensifies, “leadership depth\" becomes the critical differentiator. To maintain a standalone business in India, firms must offer more than just a job; they must provide a distinct culture and a clear global career path. Maiya predicted a significant rise in global roles being operated directly from India for multinational firms, further solidifying the country’s influence in international boardrooms.\nRohan Lobo, Partner and GCC Industry Leader at Deloitte South Asia, shared an optimistic outlook for the coming years, stating that approximately 5,000 firms are currently looking to establish GCCs in India. The scope of work is also expanding into futuristic sectors, with companies increasingly setting up autonomous vehicle operations within the country. While metro cities remain the primary hubs, Virwani noted that the next phase of growth will likely see a push into Tier-II markets, as firms seek to tap into a wider talent pool and manage rising operational costs in traditional urban centres.\nLatest Blogs",
        "link": "https://www.news18.com/india/rising-bharat-summit-from-back-offices-to-nerve-centres-how-gccs-are-anchoring-indias-global-ambitions-9933858.html",
        "date": "Fri, 27 Feb 2026 17:27:10 +0530",
        "fetched_at": "2026-02-28 03:29:24.023883"
    },
    {
        "title": "When Piyush Goyal Met Howard Lutnick, Sergio Gor: Minister Reveals Inside Details At Rising Bharat",
        "content": "At the Rising Bharat summit on Friday, Piyush Goyal, Union Minister for Commerce and Industry, revealed what transpired in the surprise meet with US Secretary of Commerce Howard Lutnick and US ambassador to India Sergio Gor.\nAfter the meeting, in a post on X, Goyal had written: “Hosted US Secretary of Commerce @HowardLutnick & @USAmbIndia Sergio Gor. Engaged in very fruitful discussions to expand our trade and economic partnership.\"\nCNN-News18’s Rahul Shivshankar asked Goyal about the picture, which he said had sparked a conversation, Goyal, in a lighter vein, said, “You are reminding me of Mona Lisa’s painting when you say sparked a conversation…You don’t like my smile…What do you not like in the picture?\"\nWhen questioned further, he said, “I have an ODOP product which I gifted him. A cow and calf made in an Indian handicrafts shop.\"\nTrade winds are shifting, alliances recalibrating, and India is charting its own course.At #RisingBharatSummit2026, Union Commerce Minister Piyush Goyal speaks candidly on trade, tariffs, and the tactics shaping a new global order.\nWatch the full conversation for deeper… pic.twitter.com/1lqbQ2GkCJ\n— News18 (@CNNnews18) February 27, 2026\nWhen asked if he told Lutnick the importance of dairy as a red line for the US trade deal, Goyal said, “Dairy is exempt, I have said many times. Just because one Rahul does not understand, does not mean all Rahuls won’t understand. Some people are beyond understanding. I am not a person who will say like Shah Rukh Khan, “naam toh suna hi hoga\".\"\nIndia and the United States announced reaching a framework for an Interim Trade Agreement on February 2. The announcement followed a telephonic conversation between Prime Minister Narendra Modi and U.S. President Donald Trump. A formal joint statement detailing the framework was subsequently released by both governments on February 6–7. The U.S. agreed to slash reciprocal tariffs on Indian goods from 50% to 18%. This included removing a 25% penalty tariff previously imposed due to India’s purchase of Russian oil. The Indian government clarified that it has protected sensitive sectors like dairy and several key agricultural products from duty concessions.\nOn February 20, 2026, the U.S. Supreme Court issued a landmark 6–3 ruling in Learning Resources, Inc. v. Trump, striking down the president’s sweeping “reciprocal tariffs\" as unlawful. The Court ruled that the International Emergency Economic Powers Act (IEEPA) does not grant the president the power to unilaterally impose tariffs. Chief Justice John Roberts wrote that the power to “regulate\" importation does not equate to the power to “tax,\" which remains an exclusive authority of Congress.\nThe picture with the key US officials on February 26 sparked a conversation around the deal.\nHosted US Secretary of Commerce @HowardLutnick & @USAmbIndia Sergio Gor.Engaged in very fruitful discussions to expand our trade and economic partnership. 🇮🇳🇺🇸 pic.twitter.com/UjfExNj6wi\n— Piyush Goyal (@PiyushGoyal) February 26, 2026\nElaborating on the deal, Goyal said, “If you remember the lower court had ruled in May or June that IEEPA is not the mechanism which would sustain, but they were in appeal and it was a process that was simultaneously going. For us, the US is a very important trading partner. It is an important strategic relationship that encompasses our Quads, which covers our technological partnership. We are members of Pax Silica, which is our effort to create resilient supply chains. It is a very multifaceted relationship. There are so many opportunities. After all, we had a very successful AI summit at the same venue. If we are looking $200-billion investment in data centres and other AI associated ventures, if we are looking for opportunities for our men and women, we will need investments, technology, we will need GPUs, we will need equipment from the ICT world…these are partnerships… We have a lot of strategic interest in the pharmaceutical world…There are huge opportunities in our gems and jewellery and diamonds sectors…Our textiles will flourish.\"\n“… The US is an evolving situation. We are in dialogue with the administration in the US. We will have to wait and watch and ensure interests of India are protected. I want to assure that India stays committed to engaging for the best possible opportunities which were negotiated with the US for a deal that gives us competitive advantage,\" said Goyal.\n“Should the circumstances change, the deal will be rebalanced…The deal has many elements. There are so many positives. Trade deal or international trade is about comparative and competitive advantage. Trade deal is not about what the tariff is. It is about the advantage you get over competition. At 50% tariff, we were at huge disadvantage and the fact that we were able to bring it down to much lower than the rest of competition, was huge for India’s agriculture, handicrafts, diamonds, pharmaceuticals…India is on the move and our exports this year will be higher,\" he said.\nLatest Blogs",
        "link": "https://www.news18.com/india/piyush-goyals-meet-with-howard-lutnick-sergio-gor-when-cow-calf-rahul-entered-us-trade-deal-story-ws-l-9933708.html",
        "date": "Fri, 27 Feb 2026 17:11:50 +0530",
        "fetched_at": "2026-02-28 03:29:24.844485"
    },
    {
        "title": "‘Wife Admitted Affair’: Hubby Fights Rs 15K ‘Very High’  Maintenance With Loans, Child Costs",
        "content": "A recent court proceeding has caught people’s attention, capturing a man explaining to the honourable judge why he would not be able to pay a certain monthly maintenance to his former wife. He mentioned that he has his kids to look after and gets a limited salary. Once again, this incident has sparked debate on divorce, alimony, and gender-neutral laws in the country.\nIn the clip posted on X (formerly Twitter), the man told the court that he has been facing financial strain while raising his two children alone. He stated that both are minors and are currently in his custody. “There are two children, my Lord, and both are in my custody,\" he said. During the proceedings, he informed the judge that he had married in 2015 but that his wife left him in 2021.\nThe Man Alleged That His Wife Cheated On Him\nAfter she left him, he filed a police complaint. Following this, his former wife allegedly admitted to having an affair with someone else and stated she would no longer continue to live with him. “She only left my company, and then I registered a police complaint on which she has stated that okay, she has an affair with someone else,\" he said.\nThe Man Said He Only Gets Rs 60,000 Monthly\nAs he was about to continue his statement, the judge interrupted and asked whether his ex-wife had demanded Rs 5,000 for rent and Rs 10,000 for living expenses. He nodded yes. This led the judge to ask, “How is it very high?\" The man then talked about his financial constraints, saying that he earns a monthly salary of Rs 60,000 and that Rs 20,000 is deducted each month to repay a housing loan he took in 2020. This leaves him with Rs 40,000 to cover all other expenses, which also include his children’s expenses.\nThe post was shared on the platform with the caption, “Wife is earning. Involved in ADULTERY. Still, the husband must pay maintenance?? Is maintenance now a reward for betrayal?\"\nWife is earning. Involved in ADULTERY.Still the husband must pay maintenance??Is maintenance now a reward for betrayal?For legal help and guidance, visit:👇https://t.co/zUuvYY9xay#Adultery #MensRights #MaintenanceReform #JusticeForMen #GenderNeutralLaws pic.twitter.com/JVT4JX1bG9\n— ShoneeKapoor (@ShoneeKapoor) February 27, 2026\nInternet Calls The Incident “Legal Terrorism\"\nSome people also reacted to the post, saying, “Woww My Lords !!! Nowhere in the world is a woman rewarded for cheating on husband. NVR ever marry a working woman… Better life with a housewife.\"\nAnother quipped, “Allowing maintenance for immoral, unethical act lead to promote more immorality in society and results in more false cases and crimes. Observation should portray ethical norms; otherwise entire society will get drowned. Wake up.\"\n“Adultery is rewarded in this nation,\" a different person mentioned.\n“This is legal terrorism,\" said an individual.\nIt is worth noting that the exact location where the case unfolded was not mentioned in the post.\nLatest Blogs",
        "link": "https://www.news18.com/viral/wife-admitted-affair-hubby-fights-rs-15k-very-high-maintenance-with-loans-child-costs-aa-ws-l-9933785.html",
        "date": "Fri, 27 Feb 2026 16:56:01 +0530",
        "fetched_at": "2026-02-28 03:29:25.669574"
    },
    {
        "title": "'What Matters To Me Is...': 8-Year-Old Ranvir Sachdeva Shares $30 Trillion Economy Dream",
        "content": "News18 Rising Bharat Summit 2026: Ranvir Sachdeva, the eight-year-old child prodigy who stole the spotlight at the India AI Impact Summit 2026, said that he hopes for the future anchored in “sovereign innovation, ethical AI, and inclusive impact.\"\nWhile speaking at the News18 Rising Bharat Summit 2026, he said, “I’m someone who’s about to witness eight decades of an independent India sometime soon. But you know what matters to me more? Will India be a 30 trillion dollar economy when I will be 30?\"\nPositioning his speech between “Rising Bharat in 2026\" and “Viksit Bharat in 2047,\" Sachdeva structured his narrative around two thoughts, opening with a couplet from Prime Minister Narendra Modi, “Kuch aisa nahi jo kar na sako, Kuch aisa nahi jo paa na sako.\"\nReferring to the India AI Mission’s roadmap, he underlined the importance of building a responsible AI ecosystem that is “accountable, sovereign, ethical, accessible and legitimate,\" bringing together technology giants, startups, scientists and students alike.\nWhile quoting Steve Jobs’s “You can never connect the dots looking forward; you can only connect them looking backwards,\" Sachdeva said that he has distilled two guiding principles from this – commitment over focus, and perseverance over fixed goals.\nHe also shared highlights of his journey, from presenting a three-minute IoT sensor project for public safety at age four, to authoring a book on artificial intelligence at six, and delivering a keynote at the AI for Good Global Summit at seven.\nDrawing an analogy from cricket practice, he said he “bleeds blue\" for the sport and believes in “playing on the front foot — whether in technology or cricket.\" His message to the audience was simple: “experience the sunrise, explore potential, and go the distance.\"\nConcluding with gratitude to the audience, he expressed hope that the “dots\" being created today would connect meaningfully by 2047, laying the foundation for a human-centric AI-driven Bharat.\n“Bharat ka anmol samay hai. Yehi samay hai, sahi samay hai,\" he said, urging collective action toward a stronger, future-ready India.\nSachdeva, the eight-year-old technologist and global author, made headlines after he attended the AI Impact Summit as the youngest keynote speaker.\nWhile speaking to news agency ANI after the summit, he explained that his address focused on how different nations are approaching artificial intelligence and how India is carving its own path in AI development.\nHe spoke confidently about innovation, indigenous AI models and the importance of technological self-reliance. His participation at the high-profile summit drew praise on social media, with many lauding his confidence and grasp of complex subjects at such a young age.\nEarlier, he was invited to the United Nations’ AI for Good Global Summit in Geneva, Switzerland, in 2025. There, he had confidently addressed over 10,000 attendees from more than 180 countries, 53 UN partner organisations, and global AI leaders. He spoke for 20 minutes on “Agents of Change: A 7-Year-Old’s Lens on Generation AI for Good\".\nLatest Blogs",
        "link": "https://www.news18.com/india/what-matters-to-me-is-8-year-old-ranvir-sachdeva-shares-30-trillion-economy-dream-ws-l-9932818.html",
        "date": "Fri, 27 Feb 2026 13:46:39 +0530",
        "fetched_at": "2026-02-28 03:29:26.517207"
    },
    {
        "title": "'Trust Factor In Deploying AI Is Crucial': Ashwini Vaishnaw At Rising Bharat Summit 2026",
        "content": "“Trust factor in deploying AI is important,\" Union Minister Ashwini Vaishnaw said while addressing concerns over artificial intelligence and its impact on jobs at the News18 Rising Bharat Summit 2026. Emphasising India’s strengths in the technology sector, Vaishnaw argued that AI adoption would expand opportunities rather than diminish them — provided trust, talent and innovation move in tandem.\nAddressing fears of job losses, the minister said India’s IT industry has historically adapted to technological disruption. “The biggest strength of our IT sector is to be able to go to an enterprise, understand how it works and, based on that, provide a solution. It was demonstrated during the Y2K problem,\" he noted, recalling how Indian IT firms earned global credibility during the millennium bug crisis.\nHe underlined that trust will be central to AI integration in sensitive sectors such as banking and finance. “A bank would not want to hand over its coding to a software it doesn’t trust. That is where the role of IT companies will grow,\" he said. According to Vaishnaw, Indian technology firms are uniquely positioned to act as trusted partners in deploying AI systems securely and responsibly.\nAt the same time, he acknowledged the inevitability of disruption. “We need to scale up innovation in the AI sector. At the same time, we must be prepared for disruption due to the AI boost,\" he said, calling for proactive planning to manage workforce transitions. He stressed the importance of building a strong talent pipeline, adding that state governments must ensure colleges are reoriented to equip students with AI-focused skills and solution-driven training.\nSpeaking about the India AI Impact Summit, Vaishnaw described it as a global success. “The summit was well received and recognised globally. The format was more on the lines of World Economic Focus (WEF) Davos. It was designed in a way that the younger generation, who I call Gen Bharat, gets an opportunity to create their future in the way they want,\" he said, highlighting the focus on youth participation and solution-driven dialogue.\nOn funding, the minister was clear that India must increase investments. “We will have to scale up our investment on AI models,\" he said, signalling a push towards indigenous AI capabilities.\nHe also touched upon the evolving digital content ecosystem. “Content creators must get their fair share for creating content. Media houses should be rewarded accordingly for high-quality content,\" Vaishnaw said, underscoring the need for fair compensation in the AI-driven information economy.\nLatest Blogs",
        "link": "https://www.news18.com/india/trust-factor-in-deploying-ai-is-crucial-ashwini-vaishnaw-at-rising-bharat-summit-2026-ws-l-9933071.html",
        "date": "Fri, 27 Feb 2026 13:34:36 +0530",
        "fetched_at": "2026-02-28 03:29:27.372879"
    },
    {
        "title": "Piyush Goyal At Rising Bharat Summit: Does Rahul Gandhi Even Know What Maize Is?",
        "content": "Piyush Goyal, Union Minister for Commerce and Industry, during a conversation with CNN-News18’s Rahul Shivshankar at Rising Bharat, slammed Opposition leader Rahul Gandhi’s comments on the trade deal with the US.\nOn meeting with United States Secretary of Commerce Howard Lutnick, he said, “We will need more technology for development…There was a cow and calf…\"\nWhen asked if he explained the significance of dairy, Goyal said, “Just because one Rahul doesn’t understand, doesn’t mean other Rahul won’t…I won’t say like Shah Rukh Khan, Rahul, naam toh suna hoga…Dairy, MSMEs, rice, wheat, maize have been protected…Does he even understand maize? I have announced that there are no exemptions on soyabean, poultry… GM foods won’t come to India…Rahul ji misleads people on the basis of false pretext. I feel sad that he is misleading our innocent farmers. May be, he is compromised. The Gandhi family has been compromised for years…I have recently spoken about it. Rahul Gandhi is playing in the hands of international powers…He is misleading India…The deal protects India and its youth…It looks to make India Viksit. Rahul Gandhi ji has not understood it or may be it is beyond his understanding.\"\n#RisingBharatSummit2026 | @PiyushGoyal slams LoP Rahul Gandhi for dragging innocent farmers into his dirty political strategies: ‘Gandhi Family has always played with the feelings of our framers’#RisingBharatSummit2026 #BreakingNews #PiyushGoyal #RahulGandhi | @RShivshankar pic.twitter.com/h8HuVYi5Jp— News18 (@CNNnews18) February 27, 2026\nQuestioning the Youth Congress protest at the AI Summit, Goyal said, “It was a shameful act at a time when 20 foreign leaders were here…To belittle our development, opportunities was the worst anti-national act which needs to be condemned in the strongest words…Their anti-India stand has been exposed…They can’t digest India’s progress and try to run it down. It must have been planned at the very high level of Congress… There has only been one family at the top for 100 years. I will not be surprised if the protest had the blessing of the leadership…\"\nReiterating his statement on the US trade deal, Goyal said, “For us, the US is an important trading partner, strategic and technological partnership…for Quads, Pax Silica… The US is an evolving situation. We are in dialogue with the administration in the US. We will have to wait and watch and ensure interests of India are protected. I want to assure that India stays committed to engaging for the best possible opportunities which were negotiated with the US for a deal that gives us competitive advantage.\"\nPositioned at a pivotal moment in India’s growth journey, the News18 Rising Bharat Summit 2026 brings together top national leadership and international delegates at Bharat Mandapam on February 27–28.\nAnchored in the theme, “Strength Within,\" the summit stands as one of the country’s largest platforms where governance, economic ambition, and strategic thinking converge, reflecting India’s expanding influence in global conversations.\nAgainst this backdrop, Hon’ble Prime Minister Narendra Modi will deliver the keynote address, giving direction to the summit’s central theme. His address will outline India’s long-term developmental roadmap, economic momentum, and strategic priorities in a rapidly shifting global order, while setting the tone for deliberations over the two-day gathering.\nOver the years, the Rising Bharat platform has evolved into a credible venue for substantive policy dialogue, and the 2026 edition signals sharper engagement around the ideas shaping India’s next phase of progress. The theme salutes the collective strength within every citizen-the power that drives innovation, sustains democracy, India as a leading light on the world stage.\nLatest Blogs",
        "link": "https://www.news18.com/india/piyush-goyal-at-rising-bharat-summit-does-rahul-gandhi-even-understand-maize-ws-l-9932951.html",
        "date": "Fri, 27 Feb 2026 13:28:03 +0530",
        "fetched_at": "2026-02-28 03:29:28.226877"
    },
    {
        "title": "Delhi Liquor Policy Case LIVE Updates: CBI Moves HC Against Kejriwal's Discharge; Rekha Gupta Says 'Evidence Tampered'",
        "content": "Delhi Excise Policy Case News Live: Delhi’s Rouse Avenue Court on Friday discharged former Chief Minister Arvind Kejriwal, former Deputy Chief Minister Manish Sisodia and all other accused in the Central Bureau of Investigation (CBI) case linked to the alleged Delhi Excise Policy scam.\nKejriwal hailed the decision as “historic”, accusing Prime Minister Narendra Modi and Union Home Minister Amit Shah of hatching a “conspiracy” to defame him and the Aam Aadmi Party (AAP). He said the court’s order confirmed that there was not an iota of evidence against him.\nMeanwhile, the CBI has approached the High Court, challenging the Rouse Avenue Court’s order discharging former Delhi Chief Minister Arvind Kejriwal, former Deputy Chief Minister Manish Sisodia and all other accused in the alleged Excise Policy Scam case.\nThe court had earlier observed that the agency failed to present material sufficient to proceed against them. The order was passed by Special Judge Jitender Singh, who refused to frame charges in the corruption case, discharging all 23 accused persons.\n‘IMPLICATED WITHOUT MATERIAL’\nThe court noted that no prima facie case was made out against the accused and observed significant shortcomings in the prosecution’s case.\nWhile pronouncing the judgment, Arvind Kejriwal had been implicated without any cogent material linking him to the alleged offence.\nThe court held that it did not find any criminal conspiracy in the case and that the CBI’s allegations “lacked substance”.\nFollow for live updates\nDelhi Chief Minister Rekha Gupta, reacting to legal relief to Arvind Kejriwal, said everyone knew the evidence in the liquor policy case had been tampered with. “This is the lower court’s decision…We all know how evidence (in liquor policy case) was tampered with,” she told reporters.\n“If you (Arvind Kejriwal) were right, then why did you withdraw the liquor policy as soon as the investigation started?…The courts had also expressed their worry on this case and traces of money laundering was found. Even today you are doing ‘nautanki’ (drama),” she added.\nShiv Sena (UBT) leader Aaditya Thackeray commended Arvind Kejriwal and Manish Sisodia after they were discharged in the Delhi excise policy case and accused the Centre of defaming opposition leaders before elections. “We are very proud of Arvind Kejriwal and the case he has fought along with Manish Sisodia… The hope is that the BJP will apologise to Arvind Kejriwal, and the independence of the institution now remains,” he said.\nArvind Kejriwal slammed the Congress for its reaction to his discharge in the excise policy case, “Kejriwal went to jail. Did Robert Vadra go to jail? Sanjay Singh went to jail. Did Rahul Gandhi go to jail? Manish Sisodia went to jail. Did Sonia Gandhi ji went to jail? What is Congress saying? Does it have no shame?”\nThe Central Bureau of Investigation (CBI) has moved the Delhi High Court, challenging the Rouse Avenue Court’s order discharging former Delhi Chief Minister Arvind Kejriwal and others in the liquor excise policy case, CBI sources told CNN-News18.\nReacting to Arvind Kejriwal’s discharge, BJP MP Manoj Tiwari said, “This is a decision of a lower court. The CBI is going to the higher court. All the evidence against the corrupt is solid, and we are confident that the criminals involved in the scams will lose.”\nBJP national spokesperson RP Singh said there are other corruption cases against AAP leader Arvind Kejriwal, which will go for trial. “As per the CAC report, there was scam in building roads, schools and hospitals, all these cases will be under trial,” he said.\nArvind Kejriwal challenged the BJP and PM Modi, saying if elections are held again in Delhi and the BJP wins over 10 seats, he will leave politics. “The people of Delhi are tired of your failures,” he said.\nArvind Kejriwal also said his mother was very sick and had to be admitted to a hospital while he was imprisoned in the excise policy case. He also said Manish Sisodia’s wife suffered from multiple sclerosis.\nIn a strong message to PM Modi, Kejriwal said, “You filed so many cases against us, you sent ED and CBI after us, you even sent us to jail, even then you could do nothing to Kejriwal. Now PM Modi has only one option, to kill Kejriwal. You have tried everything, now you would have to kill me.”\nArvind Kejriwal in his press conference also said he was repeatedly questioned why he disappeared from the public view after his bail, saying he preferred to keep quiet till his name was cleared of all charges.\n“I am an honest man, it affects me when someone calls me dishonest. It affects me when I am sent to jail and my family faces taunts. I had decided that I will keep quiet until I am proven innocent in front of the nation.”\nArvind Kejriwal said he had always led an honest life and never earned a single penny through dubious means, while accusing the BJP of defaming him. He said the court’s decision proved that he was “kattar imaandar”.\nAAP leader Arvind Kejriwal demanded an apology from Prime Minister Narendra Modi and Union Home Minister Amit Shah, alleging that they hatched the “most disgusting conspiracy in independent India” to finish the Aam Aadmi Party.\nIn response to the acquittal of AAP leader Arvind Kejriwal, BJP MP Manan Kumar Mishra said, ”In crying and doing drama, Arvind Kejriwal is very good at it. What is the answer to this?”\nAAP leader Arvind Kejriwal said the Delhi court, in its 600-page order, said there is not the slightest evidence to even have a case on the liquor excise policy issue. He said the verdict of the court was “historic”, which exposed a conspiracy against him and the Aam Aadmi Party.\nArvind Kejriwal held a press conference on Friday, where he thanked the lawyers for his discharge in the Delhi excise policy case. He also attacked the BJP and central agencies, accusing them of ‘conspiring’ to finish the Aam Aadmi Party (AAP) through a false case.\nRJD leader Tejashwi Yadav claimed that central agencies were filing cases against opposition leaders and accused the BJP of defaming people. “The court has also said that a case should be filed against the CBI’s IO (investigating officer) as well. Agencies keep filing cases against opposition parties in the wrong manner. The BJP uses this to defame people. We too have faith in the judiciary that in the coming times, we will also get justice,” he told reporters.\nCongress spokesperson Shama Mohamed questioned how the evidence against Arvind Kejriwal in the Delhi liquor policy case had disappeared. “Let’s understand certain things. No one has said that one is innocent. They’re saying there is no evidence… There was evidence before; suddenly, the evidence has disappeared,” she said.\nAam Aadmi Party (AAP) leader Atishi on Friday said that Arvind Kejriwal’s honesty is before entire nation.\n“Arvind Kejriwal’s ‘kattar imaandaari’ is before the entire nation today… On one side, it is the BJP’s conspiracy, hunger for power and misuse of central agencies; on the other side is Arvind Kejriwal’s and AAP’s honesty,” she said.\n#WATCH | Delhi | On Arvind Kejriwal’s acquittal in excise policy case, AAP leader Atishi says, “Arvind Kejriwal’s ‘kattar imaandaari’ is before the entire nation today…On one side, it is the BJP’s conspiracy, hunger for power and misuse of central agencies; on the other side is… pic.twitter.com/HPEPLd6DGk\n— ANI (@ANI) February 27, 2026\nReacting to the acquittal of Arvind Kejriwal, Manish Sisodia, and other accused in the liquor policy case, the wife of AAP leader Sanjay Singh called it a big day, adding that “everyone is very happy.”\n“This is a big day for AAP and our family. We have received more than what we expected. Everyone is very happy. Our senior leaders have been acquitted and there is immense joy in the AAP. I thank the judiciary,” she said.\n#WATCH | Delhi: On the acquittal of Arvind Kejriwal, Manish Sisodia and other accused in Liquor Policy case, wife of AAP leader Sanjay Singh says, “This is a big day for AAP and our family. We have received more than what we expected. Everyone is very happy. Our senior leaders… pic.twitter.com/gGdrd54FAu\n— ANI (@ANI) February 27, 2026\nFollowing the Delhi court, discharging Arvind Kejriwal and Manish Sisodia in the alleged excise policy scam, AAP leader Sanjay Singh alleged conspiracy into the case, asserting the court has put a stamp on Kejriwal’s honesty.\n#WATCH | Ayodhya, UP | On Arvind Kejriwal’s acquittal in excise policy case, AAP MP Sanjay Singh says,” As per a conspiracy, you (BJP) defamed the AAP govt, Arvind Kejriwal, Manish Sisodia…Today’s judgment makes it clear that the CBI never had any evidence against Arvind… pic.twitter.com/wfj47BqAhd\n— ANI (@ANI) February 27, 2026\nAAP leader Satyendar Jain reacted to the Delhi court’s order, clearing Arvind Kejriwal and Manish Sisodia of charges in the alleged liquor scam case, saying the “truth has come out today”.\n#WATCH | Chandigarh | On Arvind Kejriwal’s acquittal in excise policy case, AAP leader Satyendra Jain says, “The truth has come out today. We will now show them…It has become clear to everyone that Arvind Kejriwal is honest.” pic.twitter.com/xnlT9zRkcj\n— ANI (@ANI) February 27, 2026\nCelebrations at AAP’S Punjab office after Delhi court order, acquitting Arvind Kejriwal and Manish Sisodia in the alleged excise policy scam.\n#WATCH | Chandigarh: Celebrations at AAP Punjab office after the acquittal of the party’s national convener Arvind Kejriwal and party leader Manish Sisodia in Delhi Liquor Policy case. pic.twitter.com/JN7WGqrfAz\n— ANI (@ANI) February 27, 2026\nAfter AAP leaders Arvind Kejriwal and Manish Sisodia were cleared of charges in the alleged excise policy scam, Congress leader Pawan Khera targeted the BJP, saying the decision was “not surprising”.\n#WATCH | Delhi | On Arvind Kejriwal’s acquittal in excise policy case, Congress leader Pawan Khera says, “Not surprising at all; most predictable…This is what the BJP does before every election. If it suits them to weaken the congress, they will strengthen Congress’ rivals.… pic.twitter.com/PEWDPdXx06\n— ANI (@ANI) February 27, 2026\nHours after being cleared of charges in the alleged excise policy case, AAP leader and former Deputy Chief Minister embraced party leader Atishi, expressing joy over the decision.\n#WATCH | AAP leader Manish Sisodia shares a hug with Delhi LoP Atishi and shares laddoos with party leaders as he reaches his residence after acquittal in Delhi Liquor Policy case. pic.twitter.com/8kzxfYH2RN\n— ANI (@ANI) February 27, 2026\nAfter a Delhi court discharged former Chief Minister Arvind Kejriwal in the alleged excise policy scam, the Aam Aadmi Party (AAP) hailed the decision, calling its supremo a “revolution”.\nआम आदमी पार्टी और अरविंद केजरीवाल जी एक इंक़लाब हैं और BJP की तानाशाही के हर ज़ुल्म का जवाब हैं????#KattarImaandarKejriwal pic.twitter.com/8RF4mYxLMC\n— AAP (@AamAadmiParty) February 27, 2026\nFormer Delhi Chief Minister and AAP chief broke down after being discharged in the alleged excise policy scam case.\n“I always used to say that the truth is with us. A sitting Chief Minister was dragged out of his home and thrown into jail. Mud was flung at us,” Kejriwal said while speaking to reporters.\nFormer Delhi Chief Minister Arvind Kejriwal will hold a press conference at 4 P.M., after he and former Deputy CM Manish Sisodia were cleared of all charges in the alleged excise policy scam case.\nAfter a Delhi court cleared former Chief Minister Arvind Kejriwal and Deputy CM Manish Sisodia of charges related to the alleged excise policy scam, the latter took to ‘X’, and wrote, “Satyamev Jayate. Today, once again, I feel proud of Baba Saheb Ambedkar Ji’s visionary thinking and the Constitution he crafted. Despite all the attempts by Modi Ji’s entire party and all their agencies to prove us dishonest, today it has been proven that Arvind Kejriwal – Manish Sisodia are staunchly honest.”\nसत्यमेव जयते।\nआज एक बार फिर बाबा साहेब अम्बेडकर जी की दूरदर्शी सोच और उनके बनाए संविधान पर फ़ख़्र महसूस हो रहा है।\nमोदी जी की पूरी पार्टी और सारी एजेंसियों की हमें बेईमान साबित करने की तमाम कोशिशों के बावजूद आज साबित हो गया कि अरविंद केजरीवाल – मनीष सिसोदिया कट्टर ईमानदार…\n— Manish Sisodia (@msisodia) February 27, 2026\nAam Aadmi Party (AAP) leader Sanjay Singh targeted the BJP and demanded its apology after a Delhi court cleared Arvind Kejriwal, Manish Sisodia and other accused of all charges in the liquor policy case.\nकोर्ट ने हमारे नेताओं को बरी कर दिया।ये साबित हो गया की देश की सत्ता पर एक खतरनाक षड्यंत्रकारी राज कर रहा है।जिसने साजिश रच कर देश के सबसे लोकप्रिय ईमानदार मुख्यमंत्री @ArvindKejriwal सबसे योग्य ईमानदार शिक्षा मंत्री @msisodia सबसे बेहतरीन ईमानदार पार्टी @AamAadmiParty को बदनाम…\n— Sanjay Singh AAP (@SanjayAzadSln) February 27, 2026\nDelhi former Chief Minister Arvind Kejriwal reacted to the court order, discharging him and other accused in the alleged excise policy scam case.\nआख़िर में अधर्म और अन्याय हारता है और सच ही जीतता है।\nसत्यमेव जयते pic.twitter.com/GZghEdhJf3\n— Arvind Kejriwal (@ArvindKejriwal) February 27, 2026\nFormer Delhi Chief Minister Arvind Kejriwal was greeted with a warm welcome as he arrived at his residence following the court’s order, clearing him of the charges linked to the alleged liquor policy scam case.\n#WATCH | Family of former Delhi CM Arvind Kejriwal welcomes him as he, along with former Deputy CM Manish Sisodia, arrives at his residence.\nThe Rouse Avenue court discharged both AAP leaders in the Delhi Excise policy case.\n(Video Source: AAP) pic.twitter.com/nblU348jvz\n— ANI (@ANI) February 27, 2026\nAam Aadmi Party (AAP) leader Atishi hailed Delhi court’s order, clearing former Chief Minister Arvind Kejriwal, former Deputy Chief Minister Manish Sisodia and all other accused in the Central Bureau of Investigation (CBI) case linked to the alleged Delhi Excise Policy scam.\nसत्यमेव जयते!\nचाहे कितने भी झूठे आरोप लगाये, चाहे कितना अत्याचार किया, लेकिन आख़िरकर सच की जीत हुई।\nआज पूरे देश के सामने है – भाजपा का षड्यंत्र और अरविंद केजरीवाल की कट्टर ईमानदारी\n— Atishi (@AtishiAAP) February 27, 2026\nAfter Delhi’s Rouse Avenue Court cleared former Chief Minister Arvind Kejriwal, former Deputy CM Manish Sisodia, and other accused of all charges in the corruption case related to the alleged liquor policy scam, the AAP chief’s wife, Sunita Kejriwal expressed joy over the decision.\n“We faced a lot of problems.. God was with us. Grateful to those who stood with us during difficult times”, she said.\nFormer Delhi Chief Minister Arvind Kejriwal broke down before media after the Rouse Avenue Court order discharging him, former Deputy Chief Minister Manish Sisodia and all other accused in the Central Bureau of Investigation (CBI) case linked to the alleged Delhi Excise Policy scam.\n“I am not corrupt. The court has said that Kejriwal and Manish Sisodia are honest”, Kejriwal said, ANI reported.\nThe Central Bureau of Investigation (CBI) will approach the High Court, challenging the Rouse Avenue Court’s order discharging former Delhi Chief Minister Arvind Kejriwal, former Deputy Chief Minister Manish Sisodia and all other accused in the alleged Excise Policy Scam case.\nLatest Blogs",
        "link": "https://www.news18.com/india/delhi-liquor-policy-case-live-cbi-to-approach-hc-against-order-discharging-kejriwal-sisodia-in-excise-policy-scam-liveblog-ws-l-9932767.html",
        "date": "Fri, 27 Feb 2026 18:33:34 +0530",
        "fetched_at": "2026-02-28 03:29:29.605879"
    },
    {
        "title": "CBI Moves Delhi High Court Against Relief To Kejriwal, Sisodia In Excise Policy Case",
        "content": "The Central Bureau of Investigation (CBI) has approached the Delhi High Court, challenging the Rouse Avenue Court order clearing former Delhi Chief Minister Arvind Kejriwal and former Deputy Chief Minister Manish Sisodia in the Delhi Excise Policy case, according to CBI sources.\nThe move comes soon after the special court granted relief to the two senior Aam Aadmi Party leaders, holding that the allegations against them did not stand up to judicial scrutiny.\nWhile pronouncing the order, the court observed that the alleged central conspiratorial role attributed to them by the investigating agency could not be substantiated.\nThe court noted that the accusations placed before it “failed judicial scrutiny.\"\nIn its observations, the court found no criminal intent on the part of Manish Sisodia and stated that the prosecution’s conspiracy theory “cannot survive against one constitutional authority.\"\nThe court concluded that the material presented was insufficient to proceed against the two leaders at this stage.\nCBI’S CASE AND ALLEGATIONS\nThe CBI had registered the case in connection with alleged irregularities in the now-scrapped Delhi excise policy.\nThe agency filed its first chargesheet in 2022 and later submitted multiple supplementary chargesheets as part of the investigation.\nAccording to the agency, a “south lobby\" allegedly paid Rs 100 crore to influence the excise policy in its favour.\nIn total, 23 accused were charge-sheeted in the matter, including Arvind Kejriwal, Manish Sisodia, K Kavitha, Kuldeep Singh, Narender Singh, Vijay Nair, Abhishek Boinpally, Arun Ramchandra Pillai, Mootha Goutam, Sameer Mahendru, Amandeep Singh Dhall, Arjun Pandey, Butchibabu Gornatla, Rakesh Joshi, Damodar Prasad Sharma, Prince Kumar, Chanpreet Singh Rayat, Arvind Kumar Singh, Durgesh Pathak, Amit Arora, Vinod Chauhan, Ashish Mathur and P Sarath Chadra Reddy.\nDuring arguments before the trial court, the CBI maintained that the alleged offence of criminal conspiracy must be examined in its entirety and argued that the sufficiency of evidence should be assessed during trial rather than at the discharge stage.\nRepresented by Additional Solicitor General DP Singh and advocate Manu Mishra, the agency contended that adequate material existed to frame charges against all accused persons.\nDEFENCE ARGUMENTS BEFORE COURT\nSenior advocate N Hariharan, appearing for Kejriwal, argued that there was no incriminating material linking his client to the alleged conspiracy.\nThe defence submitted that the fourth supplementary chargesheet naming Kejriwal merely reiterated earlier allegations and that he was performing his official duties as Chief Minister.\nHariharan further pointed out that Kejriwal was not named in the original chargesheet or in the first three supplementary chargesheets and was included only in the fourth.\nThe defence also questioned the basis of further investigation and the evidentiary value of certain statements, including that of approver Raghav Magunta.\nLatest Blogs",
        "link": "https://www.news18.com/india/cbi-to-challenge-court-order-clearing-arvind-kejriwal-manish-sisodia-delhi-excise-policy-liquor-policy-case-9932765.html",
        "date": "Fri, 27 Feb 2026 17:42:48 +0530",
        "fetched_at": "2026-02-28 03:29:30.544979"
    },
    {
        "title": "'Unmitigated Disaster': Jyotiraditya Scindia Takes Swipe At Congress For AI Summit Protest",
        "content": "Union Minister Jyotiraditya Scindia on Thursday strongly criticised the Indian Youth Congress (IYC) for staging a shirtless protest during the AI Impact Summit in New Delhi, terming the disruption “an unmitigated disaster\" at a global platform meant to showcase India’s technological leadership. Speaking at the News18 Rising Bharat Summit 2026, Scindia said the summit represented India’s national interest and was not a party event.\nMembers of the Indian Youth Congress gathered outside the high-security venue and staged a dramatic shirtless protest, raising slogans and attempting to march toward the site where global leaders and delegates had assembled. With over two dozen heads of state and international representatives in attendance, security was heightened. Delhi Police detained and later arrested several protesters for breaching barricades and attempting to disrupt the proceedings.\nReacting to the incident, Scindia said, “It was an unmitigated disaster. The AI Impact Summit was not a BJP programme. It was Bharat’s programme. You had 26 heads of state visiting India because everyone realises India is the next growth potential in the world.\" He argued that protests of this nature at an international forum damaged the country’s image at a time when India is emerging as a major technology and innovation hub.\nIn a sharp political swipe, he added, “If you want to exhibit the vacuousness of desh bhakti, then good luck to you. India has rejected you multiple times. It is the people in that arena there that took these people down,\" asserting that electoral mandates had already delivered their verdict.\nOn Congress leader Rahul Gandhi, Scindia was brief, saying, “I have nothing to say to Rahul Gandhi.\" However, responding to Gandhi’s criticism of the India-US trade deal, he said, “If you are so anti your own country in your own mind, then I don’t think this country has any place for you.\"\nScindia positioned the controversy as a clash between India’s global ambitions and what he described as disruptive political theatrics.\nThe News18 Rising Bharat Summit 2026 is a two-day national platform hosted in New Delhi that brings together political leaders, policymakers, industry captains, innovators, thinkers and cultural voices to spotlight India’s expanding role on the global stage and chart the country’s future trajectory across technology, policy, trade, culture and social development.\nLatest Blogs",
        "link": "https://www.news18.com/india/unmitigated-disaster-jyotiraditya-scindia-takes-swipe-at-congress-for-ai-summit-protest-ws-l-9932677.html",
        "date": "Fri, 27 Feb 2026 11:11:59 +0530",
        "fetched_at": "2026-02-28 03:29:31.309929"
    },
    {
        "title": "'Truth Has Won': Arvind Kejriwal Breaks Down After Delhi Court Clears Him In Liquor Policy Case",
        "content": "Arvind Kejriwal turned emotional and broke down before cameras on Friday after a Delhi court discharged him and former Deputy Chief Minister Manish Sisodia in the Central Bureau of Investigation (CBI) case linked to the now-scrapped Delhi Excise Policy, calling the verdict a victory of truth and justice.\nSpeaking to reporters after the order, an emotional Kejriwal said the verdict reaffirmed his long-held claim of innocence.\n“I am not corrupt. The court has said that Kejriwal and Manish Sisodia are honest,\" the former Chief Minister said.\n“BJP was making allegations against us, but the court acquitted everyone, truth has prevailed,\" Kejriwal said, breaking down during the interaction.\n“We always said that the truth emerges victorious. We have full faith in the Indian legal system. (Union Home Minister) Amit Shah and (Prime Minister) Modi ji together hatched the biggest political conspiracy to finish the Aam Aadmi Party, and five big leaders of the party were put in jail.\"\n“The sitting Chief Minister was dragged out of his house and put in jail. Kejriwal is not corrupt. I have only earned honesty in my life,\" he added.\nhttps://images.news18.com/ibnlive/uploads/2026/02/tweeload_din1v3jh-2026-02-68eab43061680bb06648899428108cab.mp4\nFormer Deputy Chief Minister Manish Sisodia also reacted to the verdict, saying the outcome strengthened faith in constitutional institutions.\n“We are proud of our Constitution,\" Sisodia said, crediting the judicial process for ensuring justice after a prolonged legal battle.\nMeanwhile, Arvind Kejriwal’s wife, Sunita Kejriwal, took to X and wrote, “In this world, no matter how powerful one becomes, one cannot rise above Shiva Shakti. Truth always prevails.\"\nSeparately, speaking to reporters, she said, “We faced a lot of problems, but God was with us. We are grateful to those who stood with us during such difficult times.\"\nThe order was passed by Special Judge Jitender Singh of the Rouse Avenue Court, who discharged all 23 accused in the matter and declined to frame charges in the corruption case.\nThe court held that the prosecution had failed to establish a prima facie case and flagged serious deficiencies in the investigation.\nThe court also rapped the CBI for implicating the accused without sufficient material and noted that the voluminous chargesheet contained several lacunae unsupported by witness statements or evidence.\nCOURT FLAGS INVESTIGATIVE LACUNAE\nThe court’s order underscored the importance of a fair investigation for ensuring a fair trial.\nThe judge criticised the investigative process, pointing to gaps in evidence and inconsistencies in the prosecution’s case.\nWith the refusal to frame charges, all accused persons in the matter stand discharged.\nDuring hearings, the CBI had argued that the alleged conspiracy should be viewed in its entirety and that the sufficiency of evidence ought to be tested during trial.\nThe defence, however, maintained that there was no incriminating material linking Kejriwal to the alleged wrongdoing and questioned why his name appeared only in a later supplementary chargesheet.\nTHE DELHI EXCISE POLICY CASE\nThe case stems from allegations surrounding the formulation and implementation of Delhi’s excise policy, which was probed by the CBI.\nThe agency had alleged that a “south lobby\" paid around Rs 100 crore to influence the policy in its favour.\nThe court had reserved its order on February 12 after hearing detailed arguments from both the prosecution and the accused, including Kejriwal and Sisodia, before pronouncing its decision on February 27.\nLatest Blogs",
        "link": "https://www.news18.com/india/arvind-kejriwal-breaks-down-on-camera-delhi-liquor-policy-excise-policy-case-delhi-court-discharges-kejriwal-sisodia-9932678.html",
        "date": "Fri, 27 Feb 2026 12:06:57 +0530",
        "fetched_at": "2026-02-28 03:29:32.167036"
    },
    {
        "title": "Arvind Kejriwal, Manish Sisodia Cleared By Delhi Court In Liquor Policy Case",
        "content": "Delhi’s Rouse Avenue Court on Friday discharged former Chief Minister Arvind Kejriwal, former Deputy Chief Minister Manish Sisodia and all other accused in the Central Bureau of Investigation (CBI) case linked to the alleged Delhi Excise Policy scam, observing that the agency failed to present material sufficient to proceed against them.\nThe order was passed by Special Judge Jitender Singh, who refused to frame charges in the corruption case and discharged all 23 accused persons.\nCOURT FINDS NO EVIDENCE AGAINST ACCUSED\nThe court held that no prima facie case was made out against the accused and noted significant shortcomings in the prosecution’s case.\nThe judge observed that Arvind Kejriwal had been implicated without any cogent material connecting him to the alleged offence.\nThe court emphasised that a fair investigation is fundamental to ensuring a fair trial and found that the evidence placed on record did not substantiate the allegations levelled by the CBI.\nThe judge also said the voluminous chargesheet filed by the agency contained several lacunae and was not supported by witness statements or corroborative material.\nAs reported by Live Law, the judge held that the CBI failed to make out even a prima facie case against Sisodia, leading to his discharge from the matter along with the other accused.\nThe order came after the Rouse Avenue Court had reserved its decision on February 12, following detailed arguments from both the CBI and the accused.\nThe case relates to alleged irregularities in the now-scrapped Delhi Excise Policy.\nThe CBI had alleged that a “south lobby\" paid around Rs 100 crore to influence the policy in its favour.\nThe agency filed its first chargesheet in 2022 and later submitted multiple supplementary chargesheets naming 23 accused, including Kejriwal and Sisodia.\nDuring arguments, the CBI maintained that the offence of criminal conspiracy should be viewed in its entirety and argued that the adequacy of evidence should be tested during trial proceedings.\nThe defence, however, contended that there was no incriminating material linking the accused to the alleged conspiracy.\nLatest Blogs",
        "link": "https://www.news18.com/india/delhi-liquor-policy-case-arvind-kejriwal-manish-sisodia-discharged-of-accusations-excise-policy-corruption-case-9932533.html",
        "date": "Fri, 27 Feb 2026 11:54:30 +0530",
        "fetched_at": "2026-02-28 03:29:33.020896"
    },
    {
        "title": "Rising Bharat Summit 2026 Highlights: PM Modi Slams TMC, Says Ayushman Bharat Scheme Not Implemented In Bengal",
        "content": "News18 Rising Bharat Summit 2026 Day 1 Highlights: Prime Minister Narendra Modi addressed the News18 Rising Bharat Summit 2026, which brought together top national leadership and international delegates at Bharat Mandapam on February 27, Friday, reflecting the confidence and capabilities driving India’s rise.\nDuring the speech, PM Modi hailed the nation’s internal strength and said that the country has realised its potential in the last 11 years.\nBuilt around the theme — “Strength Within” — the two-day summit brings together leaders, policymakers, and industry voices to shape a future powered by India’s own resolve and ambition. This is where national purpose meets global ambition, transforming resilience into a roadmap for excellence on the world stage.\nAmong the other dignitaries were: Union Ministers Piyush Goyal, Ashwini Vaishnaw,  and Jyotiraditya Scindia, among others.\nAddressing the gathering, Prime Minister Narendra Modi said, “Ayushman Bharat scheme has not been implemented in Bengal till today.”\nHe added, “If the intention had been sincere, this scheme providing free treatment up to ₹5 lakh for the poor would not have been stopped in Bengal.”\nReferring to housing initiatives, he said, “Under the PM Awas Yojana, permanent houses are being built for the poor across the country.”\nCiting Tamil Nadu, PM Modi said, “In Tamil Nadu, 9.5 lakh permanent houses have been allotted to poor families, but construction of 3 lakh houses has stalled because the DMK government is not taking interest in building homes for the poor.”\nHe concluded, “Because the intention is not sincere.”\nAddressing the role of the opposition in a democracy, Prime Minister Narendra Modi said, “In democracy, the role of the opposition is not just about blind opposition but about presenting an alternative vision. That is why the enlightened public of the country is teaching a lesson to Congress.”\nAddressing the gathering, Prime Minister Narendra Modi said, “A nation’s progress is determined not by today’s comforts, but by preparation for tomorrow. The hard work done with foresight is the foundation of a self-reliant, strong, and prosperous India by 2047. And no matter how much the Congress may protest, we will continue working relentlessly.”\nContinuing his criticism, PM Modi said, “There is anger in the country over this act of Congress. That is why, to justify their wrongdoing, they brought Mahatma Gandhi forward. The Congress party does the same thing whenever it wants to hide its mistakes — it brings Bapu to the forefront — and when it wants to claim credit, it gives all the recognition to one family.”\nHe also said, “In the name of ideology, Congress has now been reduced to merely a ‘toolkit’ of opposition. This mindset of blind opposition has grown so much that it does not miss any opportunity to belittle the country on any stage or platform.”\nPrime Minister Narendra Modi launched a sharp attack on Congress over its protest during the AI Summit, calling it an attempt to undermine a moment of national pride. He said, “The AI Summit was a moment of pride for the entire country, but the country’s oldest party tried to turn the national celebration into a spectacle. In front of foreign guests, Congress not only exposed itself but also revealed its ideological bankruptcy.”\nHe further added, “When frustration and disappointment from failure fill the mind and arrogance takes over, such thinking that defames the country comes to the surface.”\nAddressing the Rising Bharat Summit 2026, Prime Minister Narendra Modi criticised Congress over its shirtless protest during the AI Summit. He said, “incidents like this occur due to a mindset of arrogance, which is portrayed by Congress,” linking the episode to what he described as a larger pattern of behaviour.\nSpeaking at the Rising Bharat event, Prime Minister Narendra Modi said, “there was a time when india was just a consumer of a technology, but today india is manufacturing it.” He further added, “There was a time when India was importer of new technologies, now we are exporter of new technology.”\nHighlighting India’s infrastructure growth, PM Modi said, “world is amazed with our digital infrastructure.” He also noted, “India has world third largest metro network,” pointing to rapid urban and connectivity expansion.\nPrime Minister Narendra Modi said, “When the hidden strength within a nation awakens, it achieves new accomplishments.” He underlined the importance of national confidence and collective resolve in driving progress.\nAddressing the Rising Bharat event, Prime Minister Narendra Modi said, “India is now so capable that developed countries of the world are themselves coming forward to make trade deals with India.” He emphasised growing global confidence in India’s economic strength and expanding international partnerships.\nHighlighting India’s growing global economic engagement, PM Modi said, “countries are coming forward to do trade deal with india,” underscoring rising international interest in partnering with India.\nPrime Minister Narendra Modi asserted that “We have made india world’s growth engine.” He also said, “we have controled the inflation which was in double digit,” pointing to efforts aimed at stabilising the economy.\nSpeaking at the Rising Bharat event, Prime Minister Narendra Modi said, “In the last 11 years, energy has flowed into the consciousness of the country.” He added that “we have made our banking system strong,” highlighting structural reforms undertaken during this period.\nSpeaking about India’s growing global standing, Prime Minister Narendra Modi said, “some people are not able to believe how india managed to do trade deals with developed countries.” He explained, “why are developed countries so eager to do trade deal with india…answer is aatma vishwasi bharat,” attributing the interest to a confident and self-assured India.\nPrime Minister Narendra Modi said, “Even after independence, India could not come out of the mentality of slavery. We are suffering the consequences of this till date.” He further added, “unfortunately after independence india could not come out of colonial mindset, because of which we are suffering even today,” highlighting the long-term effects of that mindset.\nAddressing the Rising Bharat event, Prime Minister Narendra Modi said, “we want to recognise our capabilities and strength.” He noted that in the past, “we use to copy foreign countries technology,” stressing the need for greater self-reliance and confidence in India’s own potential.\n“We want to recognise our capabilities and strength,” PM Modi said. “We use to copy foreign countries technology,” he added.\nPM Modi said that the Summit focuses on the “internal strength of the nation,” adding that India has realised its strength in the last 11 years.\nPrime Minister Narendra Modi will address the Rising Bharat Summit 2026 shortly.\nAt a time when India’s global identity is being shaped not just by economic policy but by cinema, sport and culture, conversations around storytelling have also evolved. At the News18 Rising Bharat Summit 2026, themed Strength Within, actor Yami Gautam addressed whether her choice of politically charged films ever cost her professional opportunities.\nIf Congress wants to save itself, it must look for a better face, Bollywood actor and Mandi MP Kangana Ranaut said at the Rising Bharat Summit on Friday, calling out Leader of Opposition Rahul Gandhi’s behaviour in political life.\nResponding to the question — “Kabhi aapke saath aisa nahi hua ki certain film makers said main aapko cast karta but you did that film toh uske baad I don’t want to cast you?” — Yami offered a candid reflection.\n“Our relation go long back in time. We follow development in India very closely. India is now on the trajectory of self sustaining development,” said Singapore politician George Yeo on India-Singapore relations.\nSpeaking at the News18 Summit, “BJP MP Kangana Ranaut on Friday said,”We learn from Rahul Gandhi what not to do and how not to become. Somewhere Rahul Gandhi has lost his mind. Behaving like this, taking off clothes in that manner.”\n“After Independence, Mahatma Gandhi had said that Congress should be dissolved, but Nehru ji did not listen to him. I feel that now Rahul Gandhi is fulfilling that dream — he is showing how to completely destroy Congress. His behaviour in Parliament is like that of a tapori (street ruffian),” she said.\nVeteran actor Anil Kapoor reflects on his remarkable 45-year journey in the film industry, sharing insights into his enduring appeal, disciplined fitness routine, and the mindset that keeps him energized and relevant even today.\n#RisingBharat2026 | ‘It’s been a journey of discovering and learning’\nAnil Kapoor (@AnilKapoor) shares his timeless appeal, fitness secrets, and what keeps him energized after 45 years in the industry. #AnilKapoor #News18 | @KishoreAjwani pic.twitter.com/smqhmOPr9Y\n— News18 (@CNNnews18) February 27, 2026\nResponding to a question, Yami Gautam said, “I am fortunate, in the last 5–6 years the kind of work I have received connected me with the audience in a way, I really value that sentiment. Somewhere, that inspires me to do better work. We are not in competition with each other. We need to stand together as an Indian film industry and present ourselves to the world that we are ready. Keeping that in mind, I do as much work as I can, nothing beyond that.”\nActor and politician Khushbu Sundar praised the film Dhurandhar, calling it one of the finest cinematic experiences in recent times.\n“For me, Dhurandhar was one of the best films ever made in recent times. It was a long one, 3 and a half hours, so I was told the movie is too long. But then I have my two young girls; they said, “Mummy, go and watch this in theater.” And I didn’t realise how 3.5 hours passed.\nSpeaking about people calling films an agenda, Swanand Kirkire said, “I don’t understand why you are watching a movie assuming there is an agenda. A film is a medium of entertainment — why aren’t you looking for an agenda in other things?\nIf that is the case, then when a poor girl falls in love with a rich boy, is that also an agenda? If an inter-caste marriage is shown on screen, is that too an agenda?\n“Govt has said 30-35 per cent of the vehicles will be electrified by 2030. India’s driven solar manufacturing in India to the size and scale that is unbelievable. It is now driving in a very big way critical mineral processing and the battery manufacturing PLI in India,” said Former NITI Ayog CEO Amitabh Kant.\nAmitabh Kant, former CEO, NITI Ayog believed urbanisation must become the key driver of India’s growth story.\n“There are 46 per cent people in agriculture, which is too high, it will drag down the productivity. You need to take away people from agriculture into manufacture and from manufacturing to exports. Manufacturing led urbanization is the key,” he said .\n“Today we have 315 universities across India where students are using the world’s most advanced EDA tool. And compare globally, outside India there are not even 20 universities where students will get end to end capability of designing a chip, manufacturing it, and using it in a module,” said Ashwini Vaishnaw.\nUnion Minister Ashwini Vaishnaw on Friday spoke about AI diffusion in India and said, “If you look at all the economies, we have probably highest AI diffusion rate both in the consumer sector and in the enterprise sector. It is actually giving us big strength. The IT sector is working rapidly towards providing AI services, and in consumer sector lots and lots of creators are coming up. So ofcourse it is happening.”\nSpeaking at the News18 Rising Bharat Summit, BJP’s Shudhanshu Tiwari said, “Today, India is leading the AI summit and has become the world’s number 1 country in digital transactions, and if we look at it, in iPhone manufacturing, it stands at number 2 after China.”\nAt the News18 Rising Bharat Summit 2026, Winselow Tucker, President & GM, Eli Lilly India, will address the urgent need to reframe obesity from stigma to science. The session will explore evolving medical understanding, breakthrough therapies, and the importance of building awareness-led, patient-centric healthcare solutions in India.\nObesity is not a choice, it’s a challenge demanding a serious rethink.\nAt News18 Rising Bharat Summit 2026, Winselow Tucker, President & GM, Eli Lilly India, will address the urgent need to reframe obesity from stigma to science. The session will explore evolving medical… pic.twitter.com/JBPd3vbKnD\n— CNBC-AWAAZ (@CNBC_Awaaz) February 27, 2026\nSIM binding has become a crucial safeguard in India’s digital ecosystem to tackle rising financial fraud and national security threats, said Jyotiraditya Scindia, Communications Minister.\n“SIM binding has become a critical, mandatory security requirement in India to curb massive financial fraud and address severe national security concerns,” he said.\nThe minister underlined that the move is aimed at strengthening digital security frameworks as online transactions and mobile-based services continue to expand rapidly across the country.\n#RisingBharatSummit2026 | ‘SIM binding has become a critical, mandatory security requirement in India to curb massive financial fraud and address severe national security concerns, ‘ says Jyotiraditya Scindia, Communications Minister#CNBCTV18Digital #RisingBharatSummit2026… pic.twitter.com/iONWQj89lW\n— CNBC-TV18 (@CNBCTV18News) February 27, 2026\nReflecting on how family businesses have evolved into global forces, Prashant Ruja, Group Chief Executive of Essar Group, pointed to the current positive business environment and changing global dynamics.\n“The environment which we are in now is positive and our strength is what is in demand, for many years the commodity business whether it was metals mining or infrastructure, things we think we do well. We were little bit left behind. ]Everybody felt that energy transition, something that we easily adopted, that will take over and leave behind a lot of these other sectors. That’s completely changed and globally there is huge demand for energy whether it’s oil or gas, AND along with renewable power and other things. We found ourselves at a place where we can really contribute strength in building assets and bringing it up to the scale and making it operational.”\nHe stressed that the renewed global demand across oil, gas, renewable power and core infrastructure has created fresh opportunities for businesses with proven strengths in asset building and operational scale.\nUnion Minister Ashwini Vaishnaw said at the Rising Bharat Summit that two more semiconductor plants will soon be announced following the Micron Technology project in India.\nIndia’s economy is undergoing significant changes, driven by reforms and renewed global engagement, according to Rajiv Memani, Chairman and CEO of EY India.\nSpeaking about the country’s performance in the last few months amid rising global competitiveness and back-to-back trade deals, Memani identified three major shifts over the past 12 months.\n“If you look up to last 12 months and if you were to pick up 3 big changes, I’d say first one is this period which reforms are happening.”\nHe stressed that reforms are critical for scaling up and improving the ease of doing business across sectors.\n“And for scaling up, it is critical doing business. lots of sectors, if you reflect back three years, were not there. those sectors are there. And govt is putting a lot of pressure in all sectors whether it is on data centres, electronics, nuclear, medical devices. You can go on and on.”\nMemani also pointed to India’s increasing global engagement through trade agreements as another major development.\n“Second is the way India is now reengaging globally through FTA, bilateral agreements, I think that’s fantastic.”\n“Instead of just using AI, we should work on developing them”\nThe 8-year-old coder @ranvirsachdeva shares his vision for rising Bharat with @KuheenaSharma #RisingBharatSummit2026 #TechNews #Coding pic.twitter.com/pOVaZlY1gy\n— News18 (@CNNnews18) February 27, 2026\nLatest Blogs",
        "link": "https://www.news18.com/india/rising-bharat-summit-2026-live-updates-day-1-network18-flagship-event-pm-modi-keynote-speech-highlights-new-delhi-india-latest-news-liveblog-9932447.html",
        "date": "Fri, 27 Feb 2026 23:29:40 +0530",
        "fetched_at": "2026-02-28 03:29:34.455503"
    },
    {
        "title": "Congress's Bihar Election Funds May Have Been Used To Back AI Summit Protest, Probe Suggests",
        "content": "Congress’s election funds may have been used to finance a protest by members of the Indian Youth Congress (IYC) at the AI Summit at Bharat Mandapam, investigators are probing.\nThe funds were allegedly collected for the Bihar elections, officers privy to the investigation told News18.\nA Special Investigation Team (SIT) set up to probe the “organised\" protest has scanned multiple bank accounts linked to those arrested in the case.\nAccounts associated with the Indian Youth Congress have also been examined.\n“Some amount was received in bank accounts linked to Shri Krishna Hari, the national secretary of the IYC. Questioning has indicated that the money may have been unused funds from the Bihar elections. We are examining bank accounts and the possible money trail further to establish this,\" one of the investigators said, requesting anonymity.\nPolice have found that nearly Rs 35,000 was allegedly used to arrange logistics such as printing T-shirts and placards for the protest.\nInvestigators said umbrellas were also printed but could not be used for unspecified reasons.\nSo far, at least 11 persons associated with the Indian Youth Congress have been arrested. Three of them were brought to Delhi in the early hours of Friday from Himachal Pradesh on transit remand.\nAmong those arrested, IYC president Uday Bhanu Chib and National Secretary Shri Krishna Hari are suspected to be the masterminds behind the protest.\nOfficers familiar with the probe said Hari’s bank account is linked to the IYC’s account and has received funds on multiple occasions.\n“We are examining how and when the money was spent and for what purposes,\" another officer said, also requesting anonymity.\nThe February 20 protest was staged at Bharat Mandapam on the final day of the AI Summit, in the lobby area of Hall Number Five.\nFour persons, National Secretary Krishna Hari, who hails from Bihar; Bihar state secretary Kundan Yadav; Eastern Uttar Pradesh vice president Ajai Kumar; and Narsimha Yadav from Telangana, were initially arrested at the spot, while a search was launched for others involved.\nOn Tuesday, the investigation into the protest was handed over to the Delhi Police Crime Branch.\nThe same day, Special Commissioner of Police (Crime Branch) Devesh Srivastava addressed the media and said the protesters attempted to breach the security cordon in front of visitors at the AI Summit, during which some police personnel were injured.\nHe added that the involvement of several individuals had been confirmed at the preliminary stage of the probe.\n“CCTV footage was examined, and some individuals who had provided assistance were identified. Office bearers of the Indian Youth Congress are also involved in the case,\" the officer said.\nFollowing the February 20 incident, Delhi Police registered a case under various sections of the Bharatiya Nyaya Sanhita (BNS), including Sections 61(2) (criminal conspiracy), 121(1) (voluntarily causing hurt or grievous hurt to deter a public servant from duty), 132 (assault or criminal force to deter a public servant from discharge of duty), 195(1) (assaulting or obstructing a public servant while suppressing a riot), 221 (obstructing a public servant in discharge of public functions), 223(A) (disobedience to an order duly promulgated by a public servant), 190 (unlawful assembly), 196 (promoting enmity between groups), 197 (acts prejudicial to national integration), and 3(5) (common intention).\nLatest Blogs",
        "link": "https://www.news18.com/india/ai-summit-protest-bharat-mandapam-congress-funded-indian-youth-congress-protest-investigations-delhi-police-arrest-ws-l-9932419.html",
        "date": "Fri, 27 Feb 2026 08:54:22 +0530",
        "fetched_at": "2026-02-28 03:29:35.362824"
    },
    {
        "title": "Fewer Trackside Signals, Kavach: How Indian Railways Is Clearing The Tracks For 160 Kmph Travel",
        "content": "The “superfast\" mission looks a step closer for Indian Railways, which has undertaken a modernisation initiative to facilitate high-speed travel up to 160 kmph.\nThis will be reflected in how the railways manages its traffic: a move towards fewer trackside signals and a significant increase in the distance between them, as well as thorough Kavach implementation.\nAccording to a report published by the Times of India, to ensure the safety of these faster journeys, the Railway Board has approved a proposal to double the distance between signals from the current 1 km to 2 km.\nThe report said this adjustment is a vital safety enhancement, as when the trains reach speeds of 160 kmph, the physics of braking dramatically change. This will require a longer stretch of track to decelerate and make a safe stop.\nIt said by spacing signals 2 km apart, the railways will provide locomotive pilots with a longer braking window and earlier warnings. Experts said this will significantly reduce the need for the abrupt, sudden braking that can compromise both safety and passenger comfort.\nThe Times of India reported that before this is implemented across the vast national network, it will undergo rigorous testing. A pilot project managed by Southern Railway has been given the “green light\" to prepare a detailed proposal for the Railway Board.\nIt said if this pilot proves successful in maintaining safety while facilitating higher speeds, the system is expected to be rolled out nationwide with other zones like the North Central Railway already identified for future expansion. This initiative has been solidified following high-level consultations between the additional member (traction) and zonal principal chief electrical engineers, culminating in a pivotal meeting on January 27, where the 2-km spacing was officially suggested.\nThe shift away from traditional trackside (or “wayside\") signals represents a major technological leap.\nHistorically, the railways has relied on physical signals — essentially sophisticated “traffic lights\" on poles — that a locomotive pilot must visually spot. This system, however, will prove to be a hurdle as the network aims for higher speeds.\nAt speeds exceeding 130 kmph, the “sighting distance\" — the time between a driver seeing a signal and reaching it — becomes dangerously short. This problem is worsened by external factors such as heavy rain, sharp curves, or the thick fog common in North India, which often forces drivers to slow down because they cannot see the signal clearly.\nTo overcome these constraints, the railways is transitioning to “cab signalling\". Under this system, the signal aspect (red, yellow, or green) is directly displayed on a screen inside the locomotive cockpit.\nThis allows the train to maintain its top speed regardless of external visibility or weather conditions, effectively moving the “intelligence\" of the railway from the ground into the train.\nThe primary driver of speed upgrade is the implementation of Kavach, India’s indigenous automatic train protection (ATP) system, alongside ETCS Level 2 (European Train Control System).\nKavach acts as an electronic “shield\", creating a digital communication bubble around every train to prevent collisions. The system operates through a sophisticated “digital handshake\" between several components.\nThis allows the railways to move from “fixed blocks\" — where only one train can occupy a set section of track — to optimised or “moving\" blocks. By knowing the exact position and braking distance of every train via radio communication, the gap between trains can be safely reduced, allowing more trains to run at higher speeds without waiting for a physical “all clear\" from a distant pole.\nKavach also introduces continuous speed supervision. Unlike physical signals, which are “static\" and only tell a driver to “stop\" or “go\", it provides a continuous speed curve.\nThe system calculates the train’s weight, the track’s gradient, and the distance to the next restriction to determine the exact moment braking is required. If a conflict is detected, Kavach initiates a three-stage safety protocol.\nAdditionally, it includes a network-wide SOS feature. If an accident occurs, a pilot can press an SOS button, sending a radio signal that automatically slows or stops every other train within a several-kilometre radius, preventing secondary collisions on adjacent tracks.\nBeyond speed and safety, reducing trackside signals offers significant cost and maintenance benefits.\nPhysical signal posts are expensive to install and prone to failure, theft, or damage. Each signal requires extensive wiring, power, and individual maintenance.\nBy contrast, it is far more cost-effective to maintain a network of radio towers for Kavach and ETCS than thousands of individual signal lamps and hundreds of kilometres of copper signalling cables. This reduction in a “signal failure\" is expected to significantly improve the punctuality of the network.\nAs of February, the rollout of Kavach 4.0 has significantly accelerated. The project is focused on two critical high-speed corridors under ‘Mission Raftar’.\nAccording to the ministry of railways, the vendor base has expanded to over five companies in 2026, shifting the pace from experimental to mass production. With over 1,300 route kilometres already commissioned and more than 4,150 locomotives fitted with Kavach, the full activation of this system remains the final “permission slip\" needed to officially raise the speed limit to 160 kmph across these vital corridors.\nLatest Blogs",
        "link": "https://www.news18.com/explainers/indian-railways-160-kmph-speed-fewer-trackside-signals-kavach-travel-ws-l-9932354.html",
        "date": "Fri, 27 Feb 2026 08:00:53 +0530",
        "fetched_at": "2026-02-28 03:29:36.154876"
    },
    {
        "title": "News18 Rising Bharat Summit 2026 Showcases India’s Sporting And Cultural Surge",
        "content": "India’s emergence is no longer limited to economic graphs and policy. Today, it is seen on the podiums, red carpets, and virtual stages of the world. From unprecedented sporting achievements to globally acclaimed cinematic and musical accomplishments, Bharat is asserting its strength with confidence and clarity.\nCapturing this defining moment, the News18 Rising Bharat Summit 2026, themed Strength Within, will bring together some of the most influential voices from sports and entertainment on 27-28 February at Bharat Mandapam, New Delhi.\nIndian sport is in one of its most dynamic phases. From the Women’s Cricket Team lifting the World Cup and the U-19 men reclaiming global dominance, to boxers securing nine gold medals at BOXAM, shooters commanding ISSF podium finishes, wrestlers sustaining Asian supremacy, and chess champions conquering international tournaments, the surge is both sustained and significant.\nThis is reflected in the fact that badminton icons Saina Nehwal, bronze medallist and previous World No. 1, and PV Sindhu, two-time Olympic medallist, will join Mohammed Shami, Mithali Raj, and Yuzvendra Chahal to talk about the importance of resilience, discipline, and the winning mindset required to not only compete globally but also win.\nParallel to its sporting ascent, Indian entertainment is commanding unprecedented international recognition. Homebound received a standing ovation at Cannes and reached the top 15 at the Oscars. All We Imagine As Light secured the Cannes Grand Prix. Boong won at the BAFTAs. Musical collaborations such as Dhurandhar – Part 1 are expanding India’s creative footprint beyond borders.\nAs India’s creative voice grows louder, the summit will feature cinema and storytelling voices, including Kangana Ranaut, Anil Kapoor, and Yami Gautam. Joining them are author Advaita Kala and critic Baradwaj Rangan, who will examine how narrative, identity, and influence are shaping India’s cultural discourse.\nGiving it a modern touch, hip-hop and rap artists Reble (Daiaphi Lamare), who rose to fame through the popular track “Run Down the City – Monica\" in Dhurandhar – Part 1, Yung DSA (Yash Deshmukh), and South Korean singer Aoora will bring to the fore the changing music scenario that is connecting with the youth of India.\nBalancing performance with perspective, kirtan singer Radhika Das and balance artist Gautam Vaishnav will bring to the table conversations on mindfulness and self-discipline, while DJ Lil Aarohi, Nikhil Chinapa, and DJ Skipster will focus on the role of music in shaping identity and culture.\nFrom sports to cinema to music, it is clear that the underlying factor is excellence achieved through inner conviction. As India moves from aspiration to achievement, the News18 Rising Bharat Summit 2026 will bring together performance and purpose, with talent and national pride.\n27-28 February 2026 | Bharat Mandapam, New Delhi\nRegister now: https://www.news18features.com/risingbharatsummit/\nLatest Blogs",
        "link": "https://www.news18.com/india/news18-rising-bharat-summit-2026-showcases-indias-sporting-and-cultural-surge-9932321.html",
        "date": "Thu, 26 Feb 2026 23:47:47 +0530",
        "fetched_at": "2026-02-28 03:29:37.492443"
    },
    {
        "title": "Assam Cabinet Moves Gauhati HC, Seeks Fast-Track Court In Zubeen Garg Case",
        "content": "The Assam Cabinet has decided to formally approach the Gauhati High Court seeking the constitution of a fast-track court to hear the high-profile death case of popular Assamese singer Zubeen Garg. The move follows mounting public pressure and demands from the singer’s family for a speedy trial.\nAnnouncing the decision after a Cabinet meeting on February 26, Chief Minister Himanta Biswa Sarma said the state government would request the Chief Justice of the Gauhati High Court to facilitate day-to-day hearings to ensure swift justice.\n“The Assam Cabinet has decided to recommend or formally request the Gauhati High Court to constitute a fast-track court for the trial in the death case of popular Assamese singer Zubeen Garg. This move aims to expedite proceedings and ensure timely, day-to-day hearings for swift justice,\" Sarma said.\nThe case has drawn widespread attention across Assam, with opposition parties, civil society organisations, and prominent individuals repeatedly demanding faster judicial progress. A regional political party had also announced plans to launch an agitation over delays in the case.\nHowever, some political voices have raised concerns over whether shifting the matter to a fast-track court could have implications for bail conditions or ongoing legal proceedings.\nIn a related development, the Gauhati High Court has ordered the reopening of a packaged drinking water unit linked to Siddharth Sarma, one of the prime accused in the case. Sarma, who served as Garg’s manager, faces allegations of mismanagement and alleged misappropriation of the singer’s funds.\nThe water plant Mahavir Aqua (also referred to as Mahabir Aqua) — located in an industrial area near Guwahati, had been sealed by the Special Investigation Team (SIT) during the probe. Investigators suspect that funds allegedly siphoned from Garg were invested in the business, citing it as part of the possible motive in the case.\nA Public Interest Litigation (PIL) seeking the reopening of the plant was filed by Sarma’s associate, Chetan Dhirasia. The matter was heard on February 25, 2026.\nIn its order, the court observed that public welfare-oriented business operations should not remain indefinitely shut due to ongoing criminal proceedings against an individual. The bench stressed the need to balance the interests of justice with broader community and economic considerations.\nMeanwhile, Siddharth Sarma, event manager Shyamkanu Mahanta, co-signer Amritprabha Mahanta, accompanist Sekhar Goswami, and other accused individuals remain in judicial custody.\nObservers noted that during recent court appearances, the accused appeared composed, with no visible display of remorse.\nThe case continues to generate significant public and political interest as calls grow louder for a time-bound trial and accountability.\nLatest Blogs",
        "link": "https://www.news18.com/india/assam-cabinet-moves-gauhati-hc-seeks-fast-track-court-in-zubeen-garg-case-ws-l-9932295.html",
        "date": "Thu, 26 Feb 2026 23:20:59 +0530",
        "fetched_at": "2026-02-28 03:29:38.315679"
    },
    {
        "title": "Rising Bharat Summit 2026: PM Modi, Union Ministers And Global Voices To Shape India’s Growth Agenda",
        "content": "Positioned at a pivotal moment in India’s growth journey, the News18 Rising Bharat Summit 2026 will bring together top national leadership and international delegates at Bharat Mandapam on February 27–28. Anchored in the theme, “Strength Within,\" the summit stands as one of the country’s largest platforms where governance, economic ambition, and strategic thinking converge, reflecting India’s expanding influence in global conversations.\nAgainst this backdrop, Hon’ble Prime Minister Shri Narendra Modi will deliver the keynote address, giving direction to the summit’s central theme. His address will outline India’s long-term developmental roadmap, economic momentum, and strategic priorities in a rapidly shifting global order, while setting the tone for deliberations over the two-day gathering. Over the years, the Rising Bharat platform has evolved into a credible venue for substantive policy dialogue, and the 2026 edition signals sharper engagement around the ideas shaping India’s next phase of progress.\nAmong the Union Cabinet ministers joining the dialogue is Piyush Goyal, Minister for Commerce and Industry, who is expected to steer conversations on trade expansion, manufacturing growth, and export competitiveness, alongside India’s deeper integration into global supply chains.\nTechnology and infrastructure discussions will be led by Ashwini Vaishnaw, Minister for Railways, Information & Broadcasting, and Electronics & IT, highlighting digital transformation and next-generation connectivity as pillars of growth. Jyotiraditya M. Scindia, Minister for Communications and Development of North Eastern Region, will focus on telecom expansion and inclusive regional development.\nAt the state level, Rekha Gupta, Chief Minister of Delhi, will bring a governance lens to discussions on urban development and administrative innovation. Strategic and defence dimensions will be addressed by Rajesh Kumar Singh, aligning with the summit’s emphasis on security preparedness and strategic autonomy.\nBeyond national leadership, the summit will host foreign delegates, diplomats, policy experts, and industry leaders, reinforcing its standing as a forum where domestic priorities align with global realities. With participation spanning government, industry, diplomacy, and defence, the News18 Rising Bharat Summit 2026 stands as a substantive platform for policy engagement and strategic clarity. To be part of the conversations shaping India’s next chapter, register now at https://www.news18features.com/risingbharatsummit/.\nLatest Blogs",
        "link": "https://www.news18.com/india/rising-bharat-summit-2026-pm-modi-union-ministers-and-global-voices-to-shape-indias-growth-agenda-9932259.html",
        "date": "Thu, 26 Feb 2026 23:07:02 +0530",
        "fetched_at": "2026-02-28 03:29:39.106231"
    },
    {
        "title": "Textbook Row: NCERT Identifying People Responsible For Inclusion Of Chapter On 'Judiciary Corruption'",
        "content": "The NCERT is ascertaining the process of making textbooks, which led to the error in judgement about inclusion of a chapter on “judicial corruption\" after Supreme Court observed that there appeared to be a “well-orchestrated conspiracy\" to defame the judiciary.\n“The NCERT is ascertaining the process of making textbooks which has led to this error of judgement and also identify the persons responsible for the same. This would also ensure that this kind of inappropriateness is completely avoided in future. This shall be done with utmost strictness,\" reported PTI citing sources.\nThis comes after a sharp remarks from the apex court, which termed it a “well-orchestrated conspiracy\" to defame the judiciary. The court imposed a “complete blanket ban\" on the Class 8 NCERT book and directed that all copies, both physical and digital, be seized.\nThe controversial chapter in Social Science textbook mentioned corruption, a large backlog of cases and an insufficient number of judges as challenged faced by judicial system.\nUnion Education Minister Dharmendra Pradhan on Thursday also expressed deep concern over the inclusion of the chapter. He assured that accountability would be fixed and action taken against those involved in drafting the content.\nAfter the court made it clear that it would not allow “anyone on earth\" to tarnish the integrity of the judiciary, NCERT removed the textbook from its official website.\nAccording to the sources, the government was extremely upset over the references included in the curriculum.\nEarlier on Wednesday, NCERT issued an apology for what it called “inappropriate content\". It also stated that the textbook would be rewritten in consultation with the appropriate authorities.\n“The error is purely unintentional and NCERT regrets the inclusion of inappropriate material in the said chapter. NCERT reiterates that the objective of the new textbooks is to strengthen constitutional literacy, institutional respect, and informed understanding of democratic participation amongst students,\" it said.\nLatest Blogs",
        "link": "https://www.news18.com/india/textbook-row-ncert-identifying-people-responsible-for-inclusion-of-chapter-on-judiciary-corruption-ws-l-9932199.html",
        "date": "Thu, 26 Feb 2026 22:46:12 +0530",
        "fetched_at": "2026-02-28 03:29:39.895997"
    },
    {
        "title": "PM Modi Sets Reform Agenda: Ministers Asked To Present ‘Report Card’ Of Third-Term Performance",
        "content": "Prime Minister Narendra Modi has outlined an ambitious reform roadmap for the coming years, asking all Cabinet ministers to come prepared with a detailed report card of reforms undertaken in their respective ministries during the government’s third term.\nSources say the Cabinet Secretariat has circulated a specific form, laying out the format in which each ministry must present its reform initiatives and achievements.\nThe ministries will need to highlight what exactly the reform is, when it was implemented, and what the results are after that.\nApart from the regular Cabinet agenda, a special segment has been set aside for ministries to share key achievements and positive developments. Ministers will individually brief the Cabinet on the reforms carried out under what is being described as a “Reforms Express\".\nAccording to sources, the Prime Minister has conveyed that regardless of whether a minister continues in the present Cabinet or not, every ministry must immediately focus on its reform priorities.\nIn the long term, this reform drive is envisioned as part of a broader roadmap leading up to 2047.\nAmong the most significant reforms carried out during Prime Minister Narendra Modi’s tenure has been the rollout of GST 2.0, implemented during the last festive season, which was projected as a major step toward rationalising the indirect tax regime.\nMore recently, Railways Minister Ashwini Vaishnaw announced that his ministry would undertake 52 reforms in 52 weeks—an ambitious, time-bound reform agenda aimed at accelerating modernisation and efficiency in the railway sector.\nIn the sports sector, one of the key milestones has been the passage of the Sports Development Bill, designed to place athletes at the centre of governance and institutional reform.\nThe Prime Minister has repeatedly emphasised that India is on board the “Reform Express,\" describing reforms as the driving force behind the journey toward a Viksit Bharat—a developed India by 2047.\nDuring the Cabinet discussions, each minister will present a detailed account of reform measures undertaken within their ministry.\nLatest Blogs",
        "link": "https://www.news18.com/india/pm-modi-sets-reform-agenda-ministers-asked-to-present-report-card-of-third-term-performance-9932196.html",
        "date": "Thu, 26 Feb 2026 22:27:28 +0530",
        "fetched_at": "2026-02-28 03:29:41.368871"
    },
    {
        "title": "Global Military Outreach: Indian Army Set For Large Multinational Exercise In May-June",
        "content": "In continuation with international engagements conducted in the past, the Indian Army is now preparing to conduct a large-scale multinational exercise. The groundwork has begun, and outreach to partner nations will start soon.\nOfficials familiar with the planning indicate that the exercise is likely to be held in May or June this year. The aim is to enhance interoperability and operational synergy in an evolving security environment. In the year 2025-26, the Indian Army has conducted 27 bilateral exercises with foreign partners. While such engagements are part of its annual training calendar, the upcoming multinational drill is expected to be significantly larger in scale and participation, possibly extending beyond traditional partners. Sources suggest that groupings such as ASEAN and BIMSTEC countries could see substantial participation, though invitations may not be limited to these blocs.\nThe exercise is likely to be held in the eastern parts of India. The broader objective is to position India as a key land warfare partner in the Indo-Pacific and the extended neighbourhood.\nLast year, India hosted the United Nations Troop Contributing Countries Chiefs’ Conclave in New Delhi, bringing together senior military leaders from 32 troop-contributing nations.\nThe conclave focused on mandate clarity, operational challenges, and reforms in UN peacekeeping. In 2023, the Indian Army organised IPACC, IPAMS and SELF-2023 with the US Army as the co-host.\nThe event witnessed participation from 30 countries. 18 countries were represented by Chiefs of their respective armies, and 12 countries were represented by Heads of Delegations.\nWith another multinational Army exercise on the horizon, the military is set to further deepen defence diplomacy through boots-on-ground engagement.\nSeveral bilateral exercises of the Indian Army are also lined up in the upcoming months. Exercise La Mitiyé with Seychelles is scheduled for March, followed by drills with Egypt and Saudi Arabia in April. In May, India and Uzbekistan are also set to hold a joint exercise.\nLatest Blogs",
        "link": "https://www.news18.com/india/indian-army-plans-major-multinational-exercise-in-may-june-to-boost-global-military-cooperation-ws-l-9932088.html",
        "date": "Thu, 26 Feb 2026 22:02:04 +0530",
        "fetched_at": "2026-02-28 03:29:42.233780"
    },
    {
        "title": "News18 Evening Digest: PM Modi On NCERT Row, WEF CEO Resigns Over Epstein & Other Stories",
        "content": "In today’s News18 evening digest, we bring you the latest on Prime Minister Narendra Modi’s trip to Israel, his comments on the ongoing NCERT row, and other top stories.\nPM Modi Expresses Displeasure Over NCERT Judiciary Chapter, Demands Accountability: Govt Sources\n‘Humanity Must Never Become A Victim Of Conflict’: PM Modi Says India Supports Gaza Peace Efforts\nBorge Brende Quits As World Economic Forum CEO After Epstein Links Emerge\nNew Air Ticket Refund Rules: No Extra Charge For Cancellation Of Booking Within 48 Hours\nIndia Vs Zimbabwe Live Cricket Score, T20 World Cup 2026: Samson, Axar Set To Return\nIndia are up against Zimbabwe in their second Super 8s match of the ICC Men’s T20 World Cup 2026 today. The match between India and Zimbabwe is taking place at MA Chidambaram Stadium in Chennai. Both India and Zimbabwe suffered humiliating defeats in their first Super 8s match of the ongoing tournament, and so today’s match is a must-win for both of them. India are expected to make multiple changes to their playing XI for the game against Zimbabwe. CHECK LIVE UPDATES HERE\nRashmika Mandanna, Vijay Deverakonda Wedding LIVE Updates: Actors Now Married, First Photos To Be Out Soon\nLatest Blogs",
        "link": "https://www.news18.com/india/news18-evening-digest-pm-modi-on-ncert-row-wef-ceo-resigns-over-epstein-other-stories-ws-l-9931796.html",
        "date": "Thu, 26 Feb 2026 18:26:24 +0530",
        "fetched_at": "2026-02-28 03:29:43.261576"
    },
    {
        "title": "PM Modi Expresses Displeasure Over NCERT Judiciary Chapter, Demands Accountability: Govt Sources",
        "content": "Prime Minister Narendra Modi expressed displeasure over the ongoing NCERT row, government sources told CNN-News18, after the Supreme Court strongly criticised a chapter referring to “corruption in judiciary\" in a Social Science textbook for Class 8 students.\nAccording to top government sources, PM Modi expressed his displeasure over the NCERT controversy and demanded to know the person who was overseeing the matter. He also questioned how Class 8 students could discuss judicial corruption and called for accountability in the matter.\nPrime Minister Modi’s reaction came after the NCERT tendered an unconditional apology over the controversy and said it would retract the Social Science textbook for Class 8 containing the chapter on judicial corruption, after strong criticism from Chief Justice of India Surya Kant.\nThe NCERT said it will be rewriting the curriculum of the textbook in question, Exploring Society: India and Beyond, Vol II, which was officially released on February 24. Within hours of its release, the book was taken off the council’s website and all physical circulation was stopped after the SC expressed its ire over the content, which it deemed defamatory and an affront to the integrity of the legal system.\nThe matter was brought to the court’s attention for urgent consideration by senior advocates Kapil Sibal and Abhishek Singhvi. CJI Surya Kant issued a stern warning stating that “nobody on earth will be allowed to defame the judiciary and taint its integrity\".\nThe Supreme Court observed that the publication of the book is a serious misconduct and directed that all copies of the book containing the chapter be immediately “seized\". It also issued a contempt notice to the NCERT chairman, Professor Dinesh Prasad Saklani, and the Secretary of School Education.\n“We would like to have a deeper probe. As head of the judiciary, it is my duty to ensure accountability; heads must roll,\" CJI Kant told Solicitor General Tushar Mehta, who appeared for the NCERT. Mehta tendered an unconditional and unqualified apology on behalf of the Ministry of Education.\nLatest Blogs",
        "link": "https://www.news18.com/india/pm-modi-expresses-displeasure-over-ncert-judiciary-chapter-demands-accountability-govt-sources-9931675.html",
        "date": "Thu, 26 Feb 2026 18:32:32 +0530",
        "fetched_at": "2026-02-28 03:29:44.034225"
    },
    {
        "title": "New Air Ticket Refund Rules: No Extra Charge For Cancellation Of Booking Within 48 Hours",
        "content": "The Directorate General of Civil Aviation (DGCA) on Thursday revised passenger-friendly norms for airline ticket cancellations, changes, and refunds, aiming to make the process simpler and faster.\nUnder the amended rules, passengers can cancel or change air tickets without paying an additional charge within 48 hours of booking, subject to certain conditions. In addition, the DGCA clarified rules for correcting name errors on tickets.\nFor tickets booked directly through an airline’s website, passengers can request a correction in the name of the same passenger within 24 hours of booking without any extra charge.\n“In case of purchase of ticket through travel agent/portal, onus of refund shall lie with the airlines as agents are their appointed representatives. The airlines shall ensure that the refund process is completed within 14 working days,\" the DGCA said.\nThe revised norms also include provisions for ticket cancellations due to medical emergencies, ensuring airlines handle such requests promptly and transparently.\nThe amendments to the Civil Aviation Requirements (CAR) on ‘Refund of Airline Tickets to Passengers of Public Transport Undertakings’ come amid rising complaints from passengers about delayed refunds.\nThe issue gained attention during flight disruptions by IndiGo in December 2025, when the civil aviation ministry had directed the airline to complete refunds within a specified timeline.\n(With inputs from PTI)\nLatest Blogs",
        "link": "https://www.news18.com/india/no-extra-charge-for-air-ticket-name-errors-flagged-within-24-hours-dgca-ws-l-9931453.html",
        "date": "Thu, 26 Feb 2026 17:16:48 +0530",
        "fetched_at": "2026-02-28 03:29:44.830518"
    },
    {
        "title": "Karnataka Ministers Meet Governor Thawar Chand Gehlot Over Internal Reservation Bill",
        "content": "A delegation of Karnataka Ministers on Wednesday met Governor Thawar Chand Gehlot, seeking early assent to the Internal Reservation Bill, as the state government prepares to move ahead with recruitment to vacant posts.\nThe meeting comes amid growing pressure from job aspirants and internal discussions within the government on expediting appointments. At a separate meeting chaired by the Chief Minister with Dalit Ministers, it was decided that the recruitment process should begin without waiting for a final court verdict on the internal reservation matter.\nMinisters are learnt to have opined that pending litigation should not indefinitely delay filling vacancies. They resolved that legal proceedings would continue alongside administrative action.\nFollowing the Chief Minister’s consultation, the Ministers called on the Governor at Raj Bhavan and urged him to consider the Internal Reservation Bill at the earliest. They said delays in granting assent were affecting the recruitment drive.\nThe delegation comprised Home Minister Dr G Parameshwara, Ministers HC Mahadevappa, KH Muniyappa, and Satish Jarkiholi, along with the Chief Minister’s legal adviser, Ponnanna.\nLatest Blogs",
        "link": "https://www.news18.com/india/karnataka-ministers-meet-governor-thawar-chand-gehlot-over-internal-reservation-bill-ws-l-9930051.html",
        "date": "Thu, 26 Feb 2026 15:52:59 +0530",
        "fetched_at": "2026-02-28 03:29:45.607471"
    },
    {
        "title": "New Book Delves Into Ancient Hindu Glory, Seeks To Rekindle The 'Flame Of Resistance'",
        "content": "At a time when debates around India’s civilisational past are often framed through the lens of decline and disruption, a new book seeks to shift the narrative towards rediscovering lost grandeur and drawing lessons for the future. The Decline of the Hindu Civilisation by Shashi Ranjan Kumar reconstructs the intellectual brilliance, scientific achievements and spiritual depth of ancient India, arguing that the civilisation’s enduring “flame of resistance\" ensured its continued relevance despite repeated upheavals. Rather than dwelling solely on decay, the book positions the past as a source of renewal — suggesting that the road ahead lies in understanding and reclaiming civilisational confidence.\nA senior civil servant and an electrical engineering graduate from Indian Institute of Technology Delhi, Kumar writes that his journey began when he read VS Naipaul’s India: A Wounded Civilisation. The book, he says, unsettled his early understanding of Hindu civilisation. But as he turned to primary sources and comparative historical study, Kumar came to see the “wound\" not as fatal, but as a reminder of resilience — a civilisational continuity that refused to be extinguished. Through deep research and comparisons with other great cultures, he examines whether internal rigidities, political fissures or external invasions best explain periods of decline, even as he foregrounds the enduring strength that survived them.\nStructured in four parts and sixteen chapters, the book re-evaluates Indian history from what Kumar describes as an indigenous perspective, challenging colonial and Marxist frameworks. The first part, comprising eight chapters, offers a comparative study of ancient Indian, Greco-Roman and Chinese civilisations. It draws parallels between institutions such as Nalanda and Alexandria, and devotes detailed chapters to astronomy, mathematics and medicine. Kumar revisits the “sciences of the Hindus,\" comparing Indian cosmological models with Greek thought, and highlighting contributions such as Aryabhata’s astronomical insights, the formalisation of zero, and the early foundations of calculus developed by the Kerala school.\nThe book also addresses civilisational self-perception. Kumar argues that “Bharat\" — or the Idea of India — is not a 19th-century construct but finds clear articulation in ancient texts such as the Puranas, which describe a culturally unified geography. He challenges the claim that “Hinduism\" was merely a British-era invention, contending instead that it represents a long-standing civilisational continuum. According to him, India’s historical trajectory is marked by wounds that “refuse to heal,\" accompanied by what he calls a stubborn denial of past humiliations. Yet this very continuity, he suggests, is proof of resilience rather than rupture.\nA substantial section of the book analyses five key battles — from the Battle of Hydaspes to the Battle of Assaye — to understand recurring military setbacks. Kumar attributes these to tactical inflexibility, lack of political unity and delayed adaptation to changing technologies of warfare. He also contests Sheldon Pollock’s thesis on the “death of Sanskrit,\" arguing that Sanskrit intellectual culture remained vibrant in regions such as the Sena and Gahadavala kingdoms until the onset of foreign invasions.\nDrawing comparisons with the Roman, Greco-Roman and Chinese civilisations, Kumar notes that while several great empires collapsed or were entirely replaced, Hindu civilisation retained a living core. That persistent “flame of resistance,\" he argues, prevented total extinguishment and preserved cultural memory through centuries of turmoil.\nThe book ultimately returns to its central proposition: that the past is not merely a chronicle of defeats but a reservoir of inspiration. By revisiting ancient achievements and honestly examining historical setbacks, Kumar suggests that India can shape a future worthy of its civilisational inheritance — one that generations to come will regard with pride.\nLatest Blogs",
        "link": "https://www.news18.com/india/new-book-delves-into-ancient-hindu-glory-seeks-to-rekindle-the-flame-of-resistance-ws-l-9931068.html",
        "date": "Thu, 26 Feb 2026 15:01:43 +0530",
        "fetched_at": "2026-02-28 03:29:46.393097"
    },
    {
        "title": "Row Erupts Over Use Of Urdu In Karnataka Govt Event Invite, BJP Alleges Appeasement",
        "content": "A controversy has erupted after the Karnataka government issued an invitation in Urdu, prompting the BJP to allege appeasement politics by the Congress.\nThe invitation was related to a key Health Department programme to launch preventive treatment and free ambulance services for haemophilia patients. In addition to Kannada and English, the Department of Health and Family Welfare also released the invitation in Urdu.\nThe BJP termed the decision appeasement politics and asked why the invitation needed to be published in Urdu. The party alleged that the government had created a new precedent in the name of minority appeasement.\nCiting the Karnataka Official Language Act, the BJP pointed out that Urdu does not have official status in the state. It accused the government of issuing invitations in a language that is not recognised as an official administrative language in Karnataka.\nLatest Blogs",
        "link": "https://www.news18.com/india/row-erupts-over-use-of-urdu-in-karnataka-govt-event-invite-bjp-alleges-appeasement-9930912.html",
        "date": "Thu, 26 Feb 2026 13:32:21 +0530",
        "fetched_at": "2026-02-28 03:29:47.202424"
    },
    {
        "title": "Centre To Launch Nationwide HPV Shots For Girls Aged 14 On February 28",
        "content": "Prime Minister Narendra Modi is set to launch the nationwide Human Papillomavirus Vaccination campaign for 14-year-old girls on February 28 from Ajmer, Rajasthan, marking the formal start of India’s large-scale push to prevent cervical cancer through immunisation.\nIn an official letter dated February 25, sent to states and union territories, the Union Health Ministry said the launch has been planned “tentatively at 11.30 am on 28th February 2026\" and that “The Prime Minister has kindly consented to launch the campaign from Ajmer, Rajasthan.\"\nThe letter underscores the public health rationale, stating, “Cervical cancer is a significant public health concern in our country as well as globally. It is caused by Human Papilloma Virus (HPV) and it is the only cancer which can be prevented by a vaccine.\"\nThe campaign will initially target girls aged 14 years — those who have celebrated their 14th birthday but have not yet turned 15 — and will run as a three-month intensive drive before being integrated into routine immunisation services.\nTo minimise stress-related reactions among adolescents, the document advises ensuring girls are not vaccinated on an empty stomach, observing them for 30 minutes post-vaccination and avoiding overcrowding.\nWHAT DOES THE LETTER SAY?\nThe operational guidelines annexed to the letter direct states to begin implementation immediately after the Prime Minister’s launch. “Initiate the HPV vaccination on 28th February 2026 after the launch event as per the following detailed guidelines,\" the letter said.\nDefining eligibility, it said, “Target Population: Girls aged 14 years (those who have celebrated their 14th birthday but have not yet celebrated their 15th birthday).\" It further clarifies that “Girls who will turn 15 years within 90 days of the launch will also be eligible for vaccination during the intensive three-month HPV vaccination activity.\"\nOn consent, the reiterated that “The HPV vaccination is voluntary and obtaining consent from the parent/guardian is mandatory before vaccination of girls.\"\nAll vaccinations will be administered at public health facilities including Ayushman Arogya Mandir-Primary Health Centers, Community Health Centers, Sub District/District Hospitals & Government Medical Colleges & Hospitals),\" the letter notes, adding that these facilities will have “a Cold Chain Point (CCP) and dedicated medical officer for AEFI management.\"\nAddressing safety, the annexure of the letter said, “HPV vaccine is generally safe but beneficiaries may experience mild side effects following vaccination. Most side effects last no more than a couple of days and are part of the immune system’s natural response to the vaccine.\"\n“All HPV vaccination session sites will be equipped with AEFI Kits for anaphylaxis management,\" it adds, and will be linked to the nearest 24×7 health facility. A helpline is to be operational in all states and UTs.\nDigital tracking has been mandated for registration, recording and reporting the vaccination.\n“The digital U-WIN platform will be used for registration, recording and reporting and all vaccine stocks and logistics to be managed & monitored through e-VIN,\" the guidelines state.\nWHAT IS THE PLAN?\nThe rollout will run for three months as a focused campaign. “HPV vaccination Duration: 3 months (90 days). After the completion of the three-month HPV vaccination, HPV vaccine will be available on the routine immunization session days,\" it specifies.\nStates have been asked to complete microplanning and ensure facility readiness. “For the rollout of the HPV vaccination, microplanning and health facility readiness are to be undertaken as per the standard formats already shared with States/UTs as part of training material,\" the guidelines state.\nWith the Prime Minister set launch the initiative on February 28, the government will begin implementation across States and UTs the same day, starting with a tightly defined age cohort and a digitally monitored campaign aimed at building momentum for cervical cancer prevention nationwide.\nLatest Blogs",
        "link": "https://www.news18.com/india/centre-to-launch-nationwide-hpv-shots-for-girls-aged-14-on-february-28-ws-l-9930882.html",
        "date": "Thu, 26 Feb 2026 13:30:03 +0530",
        "fetched_at": "2026-02-28 03:29:47.982671"
    },
    {
        "title": "Karnataka Self-Styled Godman Booked Under POCSO For Inappropriate Behaviour With Minor",
        "content": "A case under the Protection of Children from Sexual Offences (POCSO) has been filed against Mallikarjun Mutya, a self-proclaimed seer in Karnataka’s Yadgir district, after a video allegedly showing him behaving inappropriately with a minor girl went viral on social media platforms.\nThe incident reportedly took place on February 19 at Mahal Roja village, where the Yamanurappa Mutya Mutt is located. The minor girl, who is originally from Solapur in Maharashtra, had visited the mutt with her family.\nIt was alleged that Mallikarjun Mutya kissed the minor girl in the presence of her relatives. The video of the incident later surfaced online, triggering widespread public outrage.\nTaking suo motu cognisance of the matter, the Karnataka State Commission for Protection of Child Rights directed authorities to initiate action. Following instructions from Commission Chairman Shashidhar Kosambe, a case was registered at Gogi Police Station.\nThe complaint was filed by the Child Development Project Officer of Shahapur taluk. Police have booked the case under relevant sections of the Protection of Children from Sexual Offences (POCSO) Act and the Bharatiya Nyaya Sanhita.\nReportedly, Mallikarjun Mutya has left the mutt late at night and travelled to Telangana. A notice has been issued asking him to appear for questioning. Officials said that if he fails to comply, a special team may be formed to secure his arrest.\nFurther investigation into the matter is underway.\nMallikarjun Mutya, who is believed to be around 26–27 years old, has gained popularity in recent years through social media platforms, on Instagram, YouTube, and Facebook.\nHe is widely known as “Appaji\" among his followers. According to local reports, he is revered by many devotees in North Karnataka and surrounding districts, who regard him as a “walking god\" or a local deity.\nHe has become widely known over the past four years due to his active presence on social media and has drawn attention for his sometimes controversial “miracles.\"\nHe is known to have a large following not only in Karnataka but also in Andhra Pradesh, Telangana and Maharashtra.\nLatest Blogs",
        "link": "https://www.news18.com/india/karnataka-self-styled-godman-booked-under-pocso-for-inappropriate-behaviour-with-minor-ws-l-9930616.html",
        "date": "Thu, 26 Feb 2026 11:40:41 +0530",
        "fetched_at": "2026-02-28 03:29:48.751674"
    },
    {
        "title": "'Heads Must Roll': SC Bans Controversial NCERT Book, Issues Contempt Notice To Chairman",
        "content": "The Supreme Court on Thursday demanded accountability as it strongly criticised the NCERT over a chapter referring to “judicial corruption\" in a  Social Science textbook for Class 8 students. Taking action, the Chief Justice of India banned the NCERT textbook chapter and prohibited the publication, re-printing, and digital sharing of the copies.\nIn its order, the CJI directed that all copies of the book containing the chapter be immediately “seized\", and stated that those sharing the copies in any form will face legal action. In addition to this, the CJI has also issued a contempt notice to the NCERT chairman, Professor Dinesh Prasad Saklani, and the Secretary of School Education.\nPrima facie, the top court observed that the publication of the book is a serious misconduct, which can come within the purview of criminal contempt of court, if proved to be a deliberate act to scandalise the judiciary.\n“We would like to have a deeper probe. As head of the judiciary, it is my duty to ensure accountability; heads must roll,\" Chief Justice Surya Kant said as he grilled Solicitor General Tushar Mehta, appearing for the NCERT.\n“I will not close these proceedings until there is some accountability. We want to know who the people behind this are,\" the Chief Justice added.\n“They fired a gunshot and the judiciary is bleeding today,\" the Chief Justice raged, stating, “This looks like a deep-rooted conspiracy. A very calculated move.\"\nTaking exception to the NCERT’s Wednesday communication, the SC said there was not a single word of apology in it, and instead, they have tried to justify it.\nAt the outset, Solicitor General Tushar Mehta tendered an unconditional and unqualified apology on behalf of the Ministry of Education.\nThe NCERT corruption in the judiciary chapter controversy escalated on Wednesday after the CJI sharply criticised the content as a grave matter and raised concerns over the biased narrative. CJI Kant also stated that the Supreme Court would not permit any attempt to defame or undermine the integrity of the judiciary.\nLatest Blogs",
        "link": "https://www.news18.com/india/biased-narrative-sc-issues-show-cause-notice-to-ncert-chairman-over-corruption-in-judiciary-reference-9930647.html",
        "date": "Thu, 26 Feb 2026 16:12:27 +0530",
        "fetched_at": "2026-02-28 03:29:49.760337"
    },
    {
        "title": "'Disappointing': Iran's Foreign Minister On Budgetary Cuts For The Strategic Chabahar Port",
        "content": "Iran’s Foreign Minister Abbas Araghchi expressed his disappointment over India’s decision to not allocate any funds this year for the Chabahar port project, stating that the project could have played a key role in enhancing connectivity to Central Asia and Europe.\nTalking about the budgetary cuts to the jointly developed project, Araghchi in an interview with India Today said, “Well, I think it’s a disappointment for both Iran and India.\"\n“Chabahar, as Prime Minister Modi once said, is a golden gate that connects the Indian Ocean area to Central Asia, the Caucasus, and then to Europe — and vice versa. It is a very strategic port. If fully developed, it can play a very important role in connecting India through Iran to Central Asia, to the Caucasus, and then to Europe,\" the Iranian minister was quoted by India Today.\nThe Iranian minister added that the port can probably act as the best transit route. “I hope that one day we can witness the full development of this port,\" he said.\nWith huge strategic importance, the Chabahar Port project is being developed by India at Chabahar in southeastern Iran. The port will open immense opportunities towards creating direct trade and transit route to Afghanistan and Central Asia while bypassing Pakistan.\nThe port will help India increase its regional connectivity, boost trade access to landlocked Central Asian markets, counter China’s influence in Pakistan’s Gwadar Port, and strengthen India’s geopolitical presence in the region.\nHowever, amid renewed tensions between the US and Iran, this year’s Union Budget marks the first time since India signed a deal to develop the port in 2024 that no allocation has been made for the project.\nNotably, India in previous budgets had earmarked Rs 100 crore annually for the major connectivity project in Iran’s southern Sistan-Balochistan province, where it continues to remain a key development partner.\nLatest Blogs",
        "link": "https://www.news18.com/india/disappointing-irans-foreign-minister-on-budgetary-cuts-for-the-strategic-chabahar-port-9930366.html",
        "date": "Thu, 26 Feb 2026 10:01:49 +0530",
        "fetched_at": "2026-02-28 03:29:50.537128"
    },
    {
        "title": "Holi 2026: Is It A Public Holiday? State-Wise Schools, Banks Holiday List",
        "content": "Holi 2026 School, Bank Holiday: Different astrological interpretations have caused a sense of confusion regarding Holi celebrations for the year 2026. Uncertainty persists in citizens’ minds over the exact dates for the festivities of Holika Dahan and Dhulandi. At the crux of confusion are the variations in the almanack readings, lunar calculations, the impact of Adhik Maas and the occurrence of a lunar eclipse on March 3.\nAccording to the traditional panchang interpretations, Holika Dahan is set to take place late at night on March 2, with the colourful celebrations for Dhulandi observed two days later on March 4. However, since official holiday announcements across various states have been different from each other, uncertainty remains.\nIn certain North-Western and Central states, the festivities and puja rituals for the Holika Dahan will be hosted on March 2. The occasion will fall on the next day in the other parts of the region, with the Dhulandi celebrated the following morning.\nIn Uttar Pradesh, there is a different kind of confusion about the festivities and overall Holi celebrations this time. The state government had announced that students can enjoy a prolonged observance of the festival in the first week of March.\nMarch 1, 2026, falls on a Sunday and is a regular weekly holiday for school students, according to the annual academic calendar released by the State Education Department. In certain schools, March 2 will see a close due to Holika Dahan and March 4 has been announced a holiday for the celebrations of Dhulandi.\nSince Holika Dahan is generally observed one day before the Holi festivities, there is confusion whether the UP government will also have March 3rd as a public holiday.\nLatest Blogs",
        "link": "https://www.news18.com/india/holi-2026-is-it-a-public-holiday-state-wise-schools-banks-holiday-list-aa-9928485.html",
        "date": "Thu, 26 Feb 2026 09:45:15 +0530",
        "fetched_at": "2026-02-28 03:29:51.302602"
    },
    {
        "title": "British Government Borrowed Rs 35,000 Over A Century Ago; Now Indian Family Wants It Back",
        "content": "A family in Madhya Pradesh’s Sehore has claimed that the then British government failed to repay a loan of Rs 35,000 taken during the First World War in 1917 and is now exploring legal options to recover  what they describe as a historic sovereign debt with interest\nThe family of late businessman Seth Jumma Lal Ruthia claimed that he lent Rs 35,000 to the British administration in 1917 during the First World War, as per a report by News18 Hindi. At the time, the amount was considered substantial and was reportedly provided to support wartime administration in the princely state of Bhopal.\nNow, more than a century later, Seth Jummalal’s grandson, Vivek Ruthia, said he is preparing to send a legal notice to the British government to recover the loan which was never repaid. He said that the documentary evidence of the transaction was recently discovered among old family records following his father’s death.\nThe document, dated June 4, 1917, stated that Seth Jumma Lal, of the firm Seth Rama Kishan Jaskaran Ruthia, “subscribed Rs 35,000 to the Indian War Loan and thereby showed his loyalty to the Government and Empire.\" It beares the signature of W S Davis, who was then the political agent in Bhopal.\nWar loans during that period were debt instruments issued by the British government to raise funds for military expenses during World War I, typically offering 5.5% interest.\nSeth Jummalal Ruthia died in 1937, nearly 20 years after the loan was extended. The matter, the family claimed, remained unsettled and gradually slipped into obscurity until now.\nRuthia said that he is consulting lawyers to explore whether a claim can be made against the current UK government.\n“It’s not just about money, it’s about justice and history,\" he said, adding that when adjusted for compound interest, inflation or gold prices, the original Rs 35,000 could now be worth several crores of rupees.\nThe Ruthia family was once among the most prominent and affluent in Sehore and the Bhopal princely state, with significant landholdings and business interests. Seth Jumma Lal Ruthia was a prominent trader in cloth and grain in Sehore during British rule. At the time of World War I, when the colonial administration was facing financial strain, local officials reportedly approached him for assistance.\nThey family continues to own property in Sehore, Indore and Bhopal.\nLegal experts note that claims involving pre-Independence transactions between colonial authorities and private individuals are rare and legally complex. While no legal notice has yet been sent, the family said that it is determined to pursue the matter.\nLatest Blogs",
        "link": "https://www.news18.com/india/british-government-borrowed-rs-35000-over-a-century-ago-now-indian-family-wants-it-back-ws-l-9930207.html",
        "date": "Thu, 26 Feb 2026 08:53:20 +0530",
        "fetched_at": "2026-02-28 03:29:52.115443"
    },
    {
        "title": "‘Will Pee In Your Mouth’: Mathura Cop Assaults Tea Seller Over Delay | Video",
        "content": "In a shocking incident, a Government Railway Police (GRP) sub-inspector allegedly assaulted and hurled obscene abuses at a tea vendor at Mathura Railway Station over a delay in preparing tea.\nThe incident took place on Wednesday morning at Platform No. 8 at a stall named “Krishna Foods.\" According to reports, the vendor, identified as Suraj was cleaning the stall when GRP sub-inspector Vivek Kumar approached him around 8 am and asked him to prepare tea.\nWhen the vendor said it would take a few minutes as he was still finishing his work, the officer allegedly lost his temper and went away. Around 8:15 am, he returned to the stall and, upon being told again to wait briefly, reportedly began abusing the vendor and slapped him multiple times.\nThe CCTV footage, which has since gone viral on social media, allegedly showed the officer using abusive language and threatening the vendor, saying, “I’ll pee in your mouth.\"\nAt Mathura Junction, GRP constable allegedly abused a tea vendor with filthy slurs and assaulted him over a slight delay in making tea. @Uppolice @upgrphq @RailMinIndiaPS (Abusive language) pic.twitter.com/hrQAybC5FI\n— Sanjay Jha (@JhaSanjay07) February 25, 2026\nThe video triggered widespread condemnation online, with many questioning the misuse of authority.\nSenior officials took cognisance of the viral video and suspended the sub-inspector. Confirming the action, Circle Officer Rajesh Dixit said the officer has been placed under suspension pending further inquiry.\nGRP station in-charge Jitendra Kumar said that no formal complaint had been received from the vendor till evening.\nLatest Blogs",
        "link": "https://www.news18.com/india/will-pee-in-your-mouth-mathura-cop-assaults-tea-seller-over-delay-video-ws-l-9930144.html",
        "date": "Thu, 26 Feb 2026 07:46:24 +0530",
        "fetched_at": "2026-02-28 03:29:52.898996"
    },
    {
        "title": "Kerala Health Minister Veena George Injured During KSU Black Flag Protest In Kannur",
        "content": "Kerala Health Minister Veena George sustained injuries to her neck and hand during a black flag protest staged by members of the Kerala Students’ Union (KSU) at Kannur Railway Station on Wednesday.\nAccording to officials, the incident took place near the ticket counter when the minister arrived at the station to board the Vande Bharat train. Amid the protest, a scuffle broke out during which George was injured. She was later shifted to Kannur District Hospital for treatment. Following the incident, her travel was cancelled.\n#WATCH | Kannur: Kerala Health Minister Veena George sustained injuries to her neck and hand during a KSU (Kerala Students’ Union) black flag protest at the Kannur Railway Station. The incident occurred near the ticket counter when the minister arrived to board the Vande Bharat… pic.twitter.com/0hvacLlmLt— ANI (@ANI) February 25, 2026\nProtests against the minister have been reported at multiple locations in Kannur in recent days.\nReacting to the incident, Kerala Education Minister V Sivankutty alleged that the Health Minister was “brutally attacked\" by KSU and Youth Congress activists and described her condition as serious. “This is the first time in Kerala’s political history that such an incident has taken place. Youth Congress and KSU workers would not have carried out such an attack on their own. It may have happened based on the advice or direction of the Leader of the Opposition,\" he said.\nSivankutty claimed that George suffered injuries to her neck, arm and shoulder and was undergoing treatment in hospital. He strongly condemned the incident, calling it a “barbaric, crude and disgraceful political act.\"\nThiruvananthapuram | Kerala Education Minister V Sivankutty says, “The Health Minister of Kerala was brutally attacked by activists of KSU and Youth Congress. She is currently in the hospital in a very serious condition. This is the first time in Kerala’s political history that… https://t.co/ZSELdFgRpq pic.twitter.com/Ggr7M7a8zg— ANI (@ANI) February 25, 2026\nHe further questioned how the Congress would have reacted if a similar incident had happened to senior leader Sonia Gandhi, adding that the Congress leadership must answer for the episode.\nMeanwhile, police are assessing the situation, and further details are awaited.\nLatest Blogs",
        "link": "https://www.news18.com/india/kerala-health-minister-veena-george-injured-during-ksu-black-flag-protest-in-kannur-ws-l-9929618.html",
        "date": "Wed, 25 Feb 2026 18:01:25 +0530",
        "fetched_at": "2026-02-28 03:29:53.678212"
    },
    {
        "title": "Indian Armed Forces Hold Pan-India Drills, Including Joint Exercises With US, Japan",
        "content": "The Indian Armed Forces have had a packed week. Four exercises running in parallel, across mountains, forests, open skies, and open waters paint a picture of a military that is not just preparing for the future but is also actively invested in rehearsing for it.\nStarting with the hills – The 16th edition of Exercise “Vajra Prahar\" kicked off on February 24 at the Special Forces Training School in Bakloh, Himachal Pradesh, and runs through March 16. India has put 45 Special Forces personnel on the ground, soldiers trained for high-altitude infiltration through HALO and HAHO jumps, covert reconnaissance, and counter-terrorism operations in terrain that defeats most conventional units.\nTraining with them are 12 soldiers from the US Army’s Green Berets, specifically one full Operational Detachment Alpha, or ODA. An ODA is the core unit of Green Beret operations, with each soldier holding a specialist role in weapons, medicine, communications, or engineering. The exercise is focussed on joint mission planning, tactical drills, and building the kind of trust that makes two different armies function as one.\nAlongside “Vajra Prahar\", Exercise Dharma Guardian 2026 is also underway at the Foreign Training Node in Chaubattia, Uttarakhand. This is the 7th edition of India’s joint military exercise with Japan and will continue till March 9.\nIndian Army troops and soldiers from the Japanese Ground Self-Defence Force are working through counterinsurgency and jungle warfare drills, reinforcing a defence relationship that has been picking up real momentum in recent years.\nDown south, Exercise “Kalari Leap\" was held across the Lakshadweep and Minicoy archipelago, with landings at by special forces teams at Agatti airport. This was a high-tempo joint maritime exercise involving the Indian Air Force’s Southern Air Command, the Armed Forces Special Operations Division, and the Indian Coast Guard. The exercise brought together airborne insertions, amphibious assaults, anti-ship strikes, and maritime search and rescue operations. Platforms deployed included the An-32 transport aircraft, Mi-17V5 helicopters, and Su-30MKI fighter jets. Coast Guard ships, Gemini boats, and Dornier 228 aircraft rounded out the force package. AFSOD special forces executed Combat Free Fall insertions and amphibious assault missions as part of the drill. The exercise tested India’s ability to project coordinated air, maritime, and special operations forces across its island territories simultaneously.\nAnd then there is Vayu Shakti. On February 27, the Indian Air Force is scheduled to hold its annual firepower demonstration at the Pokhran range in Rajasthan. Fighter jets and precision munitions in a live-fire showcase that needs no translation. President Droupadi Murmu is also scheduled to attend the exercise as part of her two-day visit to Jaisalmer from February 26 to 27. According to the official programme, the President is set to fly in the indigenously developed Light Combat Helicopter (LCH) ‘Prachand’ on Friday and shall conduct an aerial survey of the exercise area.\nLatest Blogs",
        "link": "https://www.news18.com/india/four-fronts-one-week-indias-military-means-serious-business-ws-l-9928685.html",
        "date": "Thu, 26 Feb 2026 11:43:46 +0530",
        "fetched_at": "2026-02-28 03:29:54.932684"
    },
    {
        "title": "'Corruption In Judiciary' Chapter: NCERT Apologises, Retracts Class 8 Social Science Textbook",
        "content": "The NCERT on Wednesday issued an official apology and said it will retract the new social science textbook for Class 8, which mentioned a chapter on “corruption in judiciary\".\nThe chapter attracted sharp criticism from the Supreme Court, following which the National Council of Educational Research and Training (NCERT) said it has put the textbook’s distribution on hold.\nAccording to a press release, the NCERT will be rewriting the curriculum of the textbook in question – Exploring Society: India and Beyond, Vol II, which was officially released on February 24. Within hours of its release, the book was taken off the council’s website and all physical circulation was stopped after the SC expressed its “ire\" over the content, which it deemed defamatory and an affront to the integrity of the legal system.\nA three-judge bench, comprising Chief Justice of India Surya Kant and Justices Joymalya Bagchi and Vipul M Pancholi, took suo motu cognisance of the “objectionable\" statements regarding the judiciary. The matter was brought to the court’s attention for urgent consideration by senior advocates Kapil Sibal and Abhishek Singhvi.\nDuring the proceedings, CJI Surya Kant issued a stern warning stating that “nobody on earth will be allowed to defame the judiciary and taint its integrity\".\nIn a swift response, the NCERT released a statement acknowledging that “certain inappropriate textual material and error of judgement have inadvertently crept into\" Chapter 4, titled ‘The Role of Judiciary in our Society’.\nIt said the inclusion of such material was “purely unintentional\" and expressed deep regret for the oversight. The ministry of education, through the department of school education and literacy, intervened in the matter and ordered the distribution of the textbook to be on “strict hold\" until further notice.\nThe NCERT further said it holds the judiciary in the “highest esteem\", viewing the institution as the “upholder of the Indian Constitution and protector of Fundamental Rights\". It said the primary objective of its new textbooks is to “strengthen constitutional literacy, institutional respect, and informed understanding of democratic participation amongst students\", rather than questioning the authority of constitutional bodies.\nThe controversial chapter had listed corruption, along with a massive backlog of cases and an inadequate number of judges, as significant challenges currently facing the Indian judicial system.\nTo rectify the situation, the NCERT has announced that the curriculum will be completely rewritten. This process will involve close consultation with “appropriate authorities\" to ensure the material is accurate and respectful of the country’s institutions.\nThe revised version of the textbook is expected to be made available to Class 8 students in time for the commencement of the 2026-27 academic session.\nThe textbook noted that judges are bound by a code of conduct and that mechanisms exist to address complaints, including the Centralised Public Grievance Redress and Monitoring System, which received over 1,600 complaints between 2017 and 2021.\nIt also explained that Parliament has the authority to impeach judges after due inquiry in cases of serious misconduct. The book stated that corruption experienced at various levels of the judiciary could affect access to justice, particularly for disadvantaged sections and highlighted efforts to improve transparency.\nThe previous Class 8 textbook published by NCERT explained the structure, role and independence of the judiciary but did not mention corruption as a challenge.\nLatest Blogs",
        "link": "https://www.news18.com/india/ncert-withdraws-class-8-textbook-after-row-over-judiciary-corruption-mention-ws-l-9929292.html",
        "date": "Thu, 26 Feb 2026 00:49:31 +0530",
        "fetched_at": "2026-02-28 03:29:56.071596"
    },
    {
        "title": "Rumours Of Forced Religious Conversion By 'Pani Wale Baba' Grips Bihar Village",
        "content": "Tension briefly gripped a village in Bihar’s Bhojpur district after allegations of forced religious conversion surfaced, prompting police intervention and an official inquiry that has so far found no evidence to support the claims.\nThe incident occurred on Monday, February 23, in Chatar village under the Barhara police station area, where residents of Pakdiya Tola and Bind Toli accused a man, locally known as ‘Pani Wale Baba’, of encouraging villagers to change their religion under the guise of healing rituals involving water.\nAccording to villagers, the man was allegedly distributing religious literature said to have been brought from Nepal and speaking about religious conversion. As word spread, anger grew among local residents, who alleged that members of the Mahadalit community were being misled in the name of treatment and miracles. Some local activist groups were also informed, leading to a gathering of people and a brief period of unrest in the area.\nHowever, several women present at the site rejected the allegations, stating that the man had only been treating people with water-based rituals and had not promoted any religious conversion.\nFollowing information about the incident, a team from Barhara police station reached the village and began questioning residents. The man is reportedly a native of Muzaffarpur and is believed to be associated with Christianity. When police attempted to take him for questioning, some women allegedly protested and pushed the personnel, allowing the man to leave. The situation remained tense for some time, forcing the police team to withdraw.\nHowever, acting on the instructions of the SP, SDPO (Sadar-2) Ranjit Kumar Singh visited the village, interacted with residents and conducted an enquiry. Singh said no concrete evidence of religious conversion had been found so far. According to Singh, the man had visited the village for treatment purposes and several women recorded statements in his support.\nUnder existing laws, forced or induced religious conversion is a punishable offence, and police action can be initiated only after proper investigation. Officials said that no confirmed case of religious conversion has been registered at Barhara police station so far.\nThe incident continues to be discussed among villagers, with some describing it as a rumour while others have demanded a thorough probe. Police have appealed to residents to maintain peace and avoid drawing conclusions before the investigation is completed.\nLatest Blogs",
        "link": "https://www.news18.com/cities/patna-news/rumours-of-forced-religious-conversion-by-pani-wale-baba-grips-bihar-village-ws-kl-9928688.html",
        "date": "Wed, 25 Feb 2026 14:50:06 +0530",
        "fetched_at": "2026-02-28 03:29:57.691953"
    },
    {
        "title": "News18 Rising Bharat Summit 2026: Defining India’s Next Global Chapter",
        "content": "As India sharpens its voice on the world stage, the News18 Rising Bharat Summit returns as a defining platform for ideas, influence and impact. Scheduled for February 27-28, 2026 at Bharat Mandapam, the summit will convene distinguished leaders from government, diplomacy, business and strategic affairs for two days of consequential dialogue.\nAnchored in the theme ‘Strength Within’, this edition underscores a simple conviction: India’s global rise is powered by its internal resilience, institutional depth, economic momentum, technological innovation and cultural confidence. More than 50 carefully curated sessions will traverse public policy, defence strategy, economic partnerships, scientific advancement and digital transformation, turning high-level dialogue into clear direction and tangible outcomes.\nThe summit arrives at a moment of renewed global focus on India’s economic and geopolitical ascent. As the country advances toward greater ambitions, leaders and policymakers will deliberate on India’s expanding role in global governance, supply chains, innovation ecosystems and regional security frameworks. Youth engagement and forward-looking policymaking remain central to the platform’s design, ensuring that dialogue reflects both present realities and future aspirations.\nAcross two days, the summit will host prominent Union ministers, government officials, defence experts, industry captains and foreign dignitaries. Building on the momentum of previous editions that featured addresses by Prime Minister Narendra Modi and senior cabinet members, the 2026 summit is set to deliver high-impact policy discourse alongside cross-sector collaboration. Discussions are expected to connect India’s domestic priorities with broader global shifts in security, technology and economic cooperation.\nInternational engagement remains a cornerstone of the summit, with delegates from across the globe participating in strategic conversations on global realignment, sustainability, technology partnerships and emerging growth corridors. The diversity of voices reflects India’s expanding diplomatic and economic footprint.\nThe summit is presented by Jio Financial Services and co-presented by PhonePe and DS Group. It is powered by Pernod Ricard India, driven by Kia Seltos, and anchored by state partners Uttar Pradesh and Chhattisgarh. Key collaborators include WeWork India, DTDC, Vikram Solar, Essar, NSE India, M3M Foundation and Reliance Industries Limited, reflecting strong support from across sectors.\nAt a time when India’s decisions carry global weight, the News18 Rising Bharat Summit 2026 stands as a forum for shaping consensus, strengthening partnerships and articulating a confident national vision. Be part of the dialogue that defines what comes next. Know more at https://www.news18features.com/risingbharatsummit/\nLatest Blogs",
        "link": "https://www.news18.com/india/news18-rising-bharat-summit-2026-defining-indias-next-global-chapter-ws-l-9928780.html",
        "date": "Wed, 25 Feb 2026 14:17:14 +0530",
        "fetched_at": "2026-02-28 03:29:58.500800"
    },
    {
        "title": "Human Leg In Dog’s Mouth Sparks Probe At Shimla AIMSS Hospital",
        "content": "A disturbing incident occurred on Tuesday at the Atal Institute of Medical Super Specialties (AIMSS) in Shimla, Himachal Pradesh. At the super speciality hospital campus in Chamyana, a stray dog was seen roaming with a human leg in its mouth, triggering shock and outrage.\nA video of the incident later went viral on social media.\nAccording to reports, a 61-year-old man underwent surgery at the hospital on February 19, during which his leg was amputated. The severed limb was placed in a sealed envelope and stored in a designated room.\nThe hospital administration had granted permission to an authorised organisation to collect and transfer the amputated limb. However, no representative from the organisation arrived to take custody of it. As a result, the limb remained stored in the hospital premises.\nOn February 22, hospital staff were removing trolleys from the storage room. During the process, the door was reportedly left open and was not locked afterwards. Later that night, strong winds caused the door to swing open, allowing a stray dog to enter the room and carry away the sealed envelope containing the limb.\nThe following day, February 23, staff discovered an empty envelope near the store and realised the amputated leg was missing. Shortly afterwards, the limb was seen in the mouth of a stray dog within the hospital campus, and the footage quickly circulated online.\nलापरवाही की हद! किसकी थी वो टांग, जिसे शिमला के सरकारी अस्पताल में मुंह में दबाकर घूमता रहा कुत्ता, जांच में खुलासाFull Story Link: https://t.co/bTp8bNL0aG https://t.co/4B4OokjU7F— Vinod Katwal (@Katwal_Vinod) February 25, 2026\nA fact-finding committee was constituted to investigate the incident. The committee has identified negligence in biomedical waste management procedures. For the time being, show-cause notices have been issued to the cleaning staff and the supervisor who were on duty on the night of February 21.\nFurther action will be taken after their responses are reviewed.\nDr Sudhir Sharma from Chamyana confirmed that disciplinary notices had been served to the concerned staff members. He stated that security personnel attempted to retrieve the limb from the stray dog, but the animal reportedly became aggressive, preventing them from doing so immediately.\nThe incident has raised serious concerns over safety protocols and the handling of biomedical waste within the hospital premises.\nLatest Blogs",
        "link": "https://www.news18.com/cities/shimla/human-leg-in-dogs-mouth-sparks-probe-at-shimla-aimss-hospital-ws-l-9928641.html",
        "date": "Wed, 25 Feb 2026 13:52:56 +0530",
        "fetched_at": "2026-02-28 03:29:59.279075"
    },
    {
        "title": "Who Was Veer Soren? Former Jharkhand CM's Grandson Dies Mysteriously In Manali — 'Severe Headache, Fall From Bed, Mouth Foam'",
        "content": "A shocking incident has shaken the family of former Jharkhand Chief Minister Champai Soren after his grandson, Veer Soren, was found dead at a homestay in the popular hill station of Himachal Pradesh’s Manali.\nIn a post on X (formerly Twitter), Champai Soren confirmed the sudden demise of his grandson. He wrote, “With profound sorrow, we inform you that our beloved grandson Veer Soren passed away untimely on 24 February 2026.\"\n“After his health suddenly deteriorated in Manali, Himachal Pradesh, he was rushed to the hospital, but fate had other plans. With Veer’s departure, our family has been shattered. In deep grief, The Soren Family,\" he added.\nअत्यंत दुःख के साथ सूचित करते हैं कि हमारे प्रिय पोते वीर सोरेन का 24 फरवरी 2026 को असामयिक निधन हो गया है। हिमाचल प्रदेश के मनाली में अचानक तबियत बिगड़ने के बाद उन्हें अस्पताल ले जाया गया, लेकिन नियति को कुछ और ही मंजूर था।\nवीर के जाने से हमारा परिवार बिखर गया है।\nशोकाकुल,…\n— Champai Soren (@ChampaiSoren) February 25, 2026\nWhat Happened At The Homestay\nAccording to a report in ETV Bharat, Veer had arrived in Manali on February 22 along with two friends for a brief vacation. They were staying at a homestay in the Simsa area. His friends went out to explore the Solang and Sethan regions on February 24. Veer reportedly chose to stay back at the homestay.\nWhen his friends returned around 12:30 PM, they found Veer asleep. Upon waking him, they said he complained of a severe headache. They ordered some medicine online, gave it to him, and Veer reportedly went back to sleep. But around 2 PM, his friends heard a crash from his room. On entering, they found him lying unconscious on the bed.\nImmediate Medical Response\nAccording to reports, Veer was rushed to Civil Hospital, Manali, by his friends. They said foam had begun oozing from his mouth while he was being taken there. Doctors attempted CPR to revive him, but he was declared dead at the hospital.\nPolice Investigation Underway\nFollowing the news of Veer’s death, Manali police rushed to the homestay and took control of the scene. Early checks by the authorities showed no visible external injuries on the body.\n“A post-mortem examination is underway, and the exact cause of death will be determined after the report is received. The family has been informed, and the body will be handed over to them after the post-mortem,\" Manali DSP KD Sharma told ETV Bharat.\nVeer’s family has reached Manali. According to The Times of India, citing a senior police official, the death may be linked to high-altitude sickness. However, the exact cause will be confirmed only after the post-mortem examination.\nLatest Blogs",
        "link": "https://www.news18.com/india/jharkhand-ex-cm-champai-soren-grandson-veer-soren-found-dead-in-manali-aa-ws-l-9928615.html",
        "date": "Wed, 25 Feb 2026 14:08:44 +0530",
        "fetched_at": "2026-02-28 03:30:00.134338"
    },
    {
        "title": "'Unacceptable': Govt Issues Show-Cause Notice To BSNL Director Over Prayagraj Visit VIP Protocol Row",
        "content": "A show-cause notice has been issued against a senior Bharat Sanchar Nigam Limited (BSNL) Director, Vivek Banzal, following a controversy over elaborate protocol arrangements prepared for his proposed visit to Prayagraj.\nExpressing regret over the incident, Union minister Jyotiraditya Scindia said the incident is ‘unacceptable’, and explanations have been sought. He added that appropriate action will be taken against him after reviewing the response.\n“I have made it very clear that this is improper and a violation of established rules and traditions. It is unacceptable to me. It is shocking. A show-cause notice has already been issued to the Director with a seven-day response period. We will take appropriate action,\" Scindia was quoted by news agency ANI.\nA massive controversy erupted after an internal office order detailing extensive preparations for BSNL director Vivek Banzal’s planned Prayagraj visit surfaced online, triggering criticism over alleged misuse of public sector staff.\nBanzal’s visit to Prayagraj was called off after the itinerary, which seemed like a royal one, came in the spotlight for all the wrong reasons – involving nearly 50 officials and every little detail pencilled in, including arranging for hair oil, underwear and combs.\nAccording to an office order, which went viral on social media, the proposed two-day visit of Vivek Banzal, director (CFA) of the BSNL Board, was scheduled from February 25-26.\nAccording to news agency PTI, officials assigned to the tasks for Banzal’s visit have confirmed that his trip was cancelled. As per the office order, around 20 tasks were assigned to nearly 50 officials.\nThe office order that mentioned the details regarding the BSNL director’s mentioned very little detail about his visit.\nOn his arrival in Prayagraj, bathing in Sangam, boat ride, and visits to Bade Hanuman Mandir, Akshayavat and Patalpuri temples were planned. The ‘snan‘ kits consisted of towel, undergarment, slippers (mentioned as sleeper in the office order), comb, mirror and an oil bottle.\nThe office order also mentioned that six male kits (consisting of towel, underwear, a mirror, a comb, soap, shampoo, and oil) and two female kits should be arranged. It was also instructed that at least one bedsheet should be arranged for general use at the ghat.\nAt the hotel and Circuit House, dry fruit bowl, fruit bowl, saving kit (shaving kit), towel, toothpaste, brush, soap, shampoo, comb and oil were to be arranged, the order said.\nLatest Blogs",
        "link": "https://www.news18.com/india/unacceptable-govt-issues-show-cause-notice-to-bsnl-director-over-prayagraj-visit-vip-protocol-row-9928597.html",
        "date": "Wed, 25 Feb 2026 13:27:30 +0530",
        "fetched_at": "2026-02-28 03:30:00.895508"
    },
    {
        "title": "Indian Railways To Roll Out RailOne App From March 1: Will UTS App Login Credentials Work? How To Use It",
        "content": "Train passengers will soon have to shift to a new system for booking tickets. Indian Railways has announced that it will introduce a single app called RailOne to bring several railway services together.\nFrom March 1, this year, passengers will not be able to use the existing UTS app to book unreserved tickets or renew season passes. The move is part of a larger plan to simplify digital services and reduce the need for multiple railway apps.\nRailOne Will Bring All Booking Services Together\nRight now, passengers depend on different apps for different needs. One app is used for reserved tickets, another for unreserved tickets, and others for inquiries. RailOne is being introduced to combine all these services in one place.\nThrough RailOne, passengers will be able to:\n– Book reserved train tickets\n– Book unreserved tickets\n– Buy platform tickets\n– Check live train running status\n– Track PNR status\n– Get travel updates and railway information\nThe aim is to make ticket booking simpler and more convenient. This will especially help those who travel occasionally and may find multiple apps confusing. Daily commuters who regularly book unreserved tickets are also expected to benefit from having everything on one platform.\n📢 Important Update for PassengersUTS on Mobile App will be shut down from 01.03.2026.Passengers are requested to switch to the RailOne App for booking unreserved tickets and other railway services. Please download and start using RailOne to avoid inconvenience.#RailOne… pic.twitter.com/u3c9LuDl6p\n— DRM Howrah (@drmhowrah) February 24, 2026\nUTS App Will Be Discontinued From March 1\nThe UTS on Mobile app has been widely used for booking unreserved and season tickets. However, it will stop functioning from March 1, this year, and will no longer offer any ticketing services.\nPassengers are advised to download RailOne before the deadline and get used to the new interface. Railway officials have reportedly said that users will not need to create a new account. They can log in using their existing UTS username and password or their IRCTC login details.\nRailways Offers Discount To Promote Digital Use\nTo encourage people to switch to RailOne, Indian Railways is offering a 3 per cent discount on unreserved tickets booked through digital payment modes until July 14, this year.\nThe discount will apply to payments made through UPI, debit cards, credit cards, net banking, and digital wallets.\nRailOne will soon become the main platform for booking tickets and checking train-related information, replacing several existing apps used by passengers today.\nLatest Blogs",
        "link": "https://www.news18.com/india/indian-railways-to-shut-uts-app-from-march-1-railone-set-to-replace-it-aa-ws-l-9928270.html",
        "date": "Wed, 25 Feb 2026 13:00:04 +0530",
        "fetched_at": "2026-02-28 03:30:01.685434"
    },
    {
        "title": "Feeling Sidelined, 24 Karnataka Congress MLCs Write To Mallikarjun Kharge Seeking Cabinet Berths",
        "content": "Amid power-sharing tensions and speculation over a Cabinet reshuffle, 24 Members of the Legislative Council (MLCs) from the Karnataka Congress have sought representation in the state Cabinet.\nThe MLCs submitted a memorandum to AICC president Mallikarjun Kharge, urging that Council members be given adequate space in the ministry. The signatories had reportedly travelled to Delhi in December to press their case before the party high command.\nThe move comes as discussions continue over Cabinet reconstitution and internal balancing within the government.\nIn their memorandum, the MLCs said the absence of Council members in the Cabinet has created a sense of inequality and demoralisation. They argued that continued exclusion could create a perception that MLCs have limited political prospects, which may weaken the party’s organisational structure over time.\nThey also warned of a ripple effect. Capable leaders may prefer to seek Assembly tickets instead of contesting Council elections, which could fuel factionalism and erode grassroots strength.\nThe signatories said the Karnataka Legislative Council, established in 1907, is among the oldest in the country. They pointed out that MLCs represent large regions, often covering 10 to 15 Assembly constituencies, and that members elected from local bodies maintain direct engagement with grassroots institutions.\nThey stated that, compared to MLAs, MLCs often influence a broader cross-section of voters and play a key role in strengthening the party’s organisational network. They also noted that Graduates’ and Teachers’ constituency MLCs represent 15 to 20 Assembly segments and regularly engage with opinion leaders such as educators and graduates.\nAccording to the memorandum, these members help mobilise youth and intellectual support for the Congress, while teachers, as respected community influencers, shape public perception in favour of the party.\nThe MLCs have urged the high command to induct at least five Council members in the next Cabinet reshuffle. They suggested balanced representation, including one member from local bodies, one from Graduates’ or Teachers’ constituencies, and one from nominated or other categories.\nThey said meaningful Cabinet representation is essential to ensure organisational cohesion and balanced political representation within the government.\nLatest Blogs",
        "link": "https://www.news18.com/politics/feeling-sidelined-24-karnataka-congress-mlcs-write-to-mallikarjun-kharge-seeking-cabinet-berths-9928483.html",
        "date": "Wed, 25 Feb 2026 12:36:31 +0530",
        "fetched_at": "2026-02-28 03:30:02.569602"
    }
]