[
    {
        "title": "How the Green River managed to cut straight through the already existing Uinta Mountains; scientists are surprised to know",
        "content": "At TOI World Desk, our dedicated team of seasoned journalists and passionate writers tirelessly sifts through the vast tapestry of global events to bring you the latest news and diverse perspectives round the clock. With an unwavering commitment to accuracy, depth, and timeliness, we strive to keep you informed about the ever-evolving world, delivering a nuanced understanding of international affairs to our readers. Join us on a journey across continents as we unravel the stories that shape our interconnected world.Read More",
        "link": "https://timesofindia.indiatimes.com/world/rest-of-world/how-the-green-river-managed-to-cut-straight-through-the-already-existing-uinta-mountains-scientists-are-surprised-to-know/articleshow/127937153.cms",
        "date": "2026-02-06T07:00:00+05:30",
        "fetched_at": "2026-02-06 03:54:41.330373"
    },
    {
        "title": "Tejashwi slams government, Nitish calls him child; Jan Suraaj Party moves SC over cash inducement to women voters in Bihar poll",
        "content": "The View From India Looking at World Affairs from the Indian perspective. First Day First Show News and reviews from the world of cinema and streaming. Today's Cache Your download of the top 5 technology stories of the day. Science For All The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point Decoding the headlines with facts, figures, and numbers Health Matters Ramya Kannan writes to you on getting to good health, and staying there The Hindu On Books Books of the week, reviews, excerpts, new titles and features. Bihar Chief Minister Nitish Kumar, State Deputy Chief Ministers Samrat Choudhary and Vijay Kumar Sinha, Bihar Assembly LoP Tejashwi Yadav, RJD senior leader Rabri Devi, and others during the joint sitting of the Bihar Assembly and Legislative Council. File photo: CMO Bihar via ANI In the ongoing budget session of the Bihar Assembly, Leader of Opposition in the House Tejashwi Yadav on Thursday (February 5, 2026) while speaking on the motion of thanks to Governor’s address, slammed the NDA government in Bihar on several issues He accused the State Government of rigging in State Assembly elections through allurement of money to woo women voters, deteriorating law and order situation and questioning on development of the State while, Chief Minister Nitish Kumar repeatedly asked Mr. Yadav to sit-down as he was a bachha (child). Both the leaders eventually engaged in a verbal duel. The newly formed Jan Suraaj Party moved to the Supreme Court on the day alleging cash inducements in recently held Bihar Assembly elections. The Budget session of Bihar legislature commenced on February 2 with the Governor Arif Mohammed Khan addressing the joint session of the legislature. The current session will end on February 27. While slamming the NDA government in Bihar under Chief Minister Nitish Kumar, Tejashwi Yadav charged that it was running on “false praise and complete negligence”. “Had Bihar been a separate country, it would have been the poorest in the world”, alleged Mr. Yadav while questioning the government on development front. “If Bihar is developing so much, would you tell me just one segment where Bihar is ahead of other states …anyone. The per capita income in Bihar is at lowest, and the State is still the poorest State of the country”, he alleged. “Bihar’s development remains stagnant comparable to 1961”, added Mr. Yadav while citing principles over power he asserted that he refused to “become a ruler of the State on the terms of the BJP”. While reading out the recent statistics of crime and criminal incidents across the State, Mr. Yadav further charged, “the BJP has turned democracy into gun-o-cracy”. “The police station is silent, the administration is unconscious and the government is intoxicated”, blamed Mr. Yadav while making reference of the alleged sexual assault and murder of a medical aspirant living in a hostel in Patna and the incident has triggered a widespread outrage in the State, following which it was later, handed over to the investigating agency, CBI. While making reference on the cash inducement to woo voters to win the recently held State Assembly elections, Mr. Yadav further alleged that the “ruling NDA had spent ₹ 40,000 crore to defeat the mahagathbandhan (grand alliance) in the 2025 Assembly elections”. He also made veiled references to a series of sops offered by the NDA government in the run up to the Assembly poll and charged, “the people of the State were defeated in the polls which were won by the power machinery (Lok Hara, Tantra jita). You people have reduced loktantra (democracy) into a rule of dar tantra (fear and intimidation.)”. “The time may be on your side today but our time too will also come”, asserted Mr. Yadav who, later, sought permission from the Speaker to sit down and speak because of pain in his leg injury. Mr. Yadav was declared as the Chief Ministerial face of the Opposition mahagathbandhan. Mr. Yadav alleged further that the ruling NDA government in Bihar has done “little in its 20 years of power”. He also criticized the budget presented by the NDA government in State legislature on February 3 and described it a s a “mere repetition of promises made by the previous grand alliance government”. “Some ponds have started consider themselves oceans; we’ll make them realize their limits at the right time”, Mr. Yadav stated a couplet in Hindi. He also urged Chief Minister Nitish Kumar to demand special status for Bihar and hit the streets to address State’s issue and get the “support from Opposition”. With Chief minister Nitish Kumar and Mr. Yadav interjecting time and again, both the leaders eventually were engaged in sharp verbal duel. “You please sit down. You’re a bachha (child). Now you too have a child. I’m from your father’s time. I have a fondness for you. Sit down, sit down and listen to me”, said Nitish Kumar repeatedly and Mr. Yadav sat down flashing a broad smile on his face. Later, Mr. Kumar attacked Mr. Yadav and his party Rashtriya Janata Dal for doing “something fishy” during previous grand alliance government. “You’re involved in something fishy and wrongdoing and that is why we left you”. Mr. Kumar said while asking “what was the situation before 2005 (Mr. Kumar took over the NDA government as Chief Minister in November 2005)?” and listed development works done during his government’s regime in health, agriculture, electricity, education, road construction, women’s social and economic empowerment, industry and other segments. Meanwhile, the newly formed Jan Suraaj Party founded by former poll-strategist Prashant Kishor too moved to the Supreme Court on Thursday (February 5) alleging cash inducement to women voters during State Assembly elections held in November 2025. The JSP called it “misuse of a state welfare scheme to influence voters ahead of the 2025 Assembly elections”. The party was referring to scheme Mukhyamantri Mahila Rojgar Yojna launched by the ruling NDA government in the State under which ₹ 10,000 was directly transferred to one woman in every family with a further promise of ₹ 2 lakh after assessment for their “self-employment”. Mr. Kishor’s party JSP, though, had failed to win even a single seat in the Assembly poll while losing security deposits in 99% of the seats it contested. Bihar / Patna / election Copyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/bihar/tejashwi-slams-government-nitish-calls-him-child-jan-suraaj-party-moves-sc-over-cash-inducement-to-women-voters-in-bihar-poll/article70595844.ece",
        "date": "Fri, 06 Feb 2026 08:43:56 +0530",
        "fetched_at": "2026-02-06 03:54:42.519794"
    },
    {
        "title": "Haryana MBBS students in dilemma over government’s bond policy; seek clarity on various aspects before consent",
        "content": "The View From India Looking at World Affairs from the Indian perspective. First Day First Show News and reviews from the world of cinema and streaming. Today's Cache Your download of the top 5 technology stories of the day. Science For All The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point Decoding the headlines with facts, figures, and numbers Health Matters Ramya Kannan writes to you on getting to good health, and staying there The Hindu On Books Books of the week, reviews, excerpts, new titles and features. In dilemma over Haryana government’s “Service Incentive Bond” policy, the MBBS students of government medical colleges have sought administrative and policy-level clarifications stressing complete disclosure of service terms and safeguards before giving their consent. The policy to incentivise doctors to opt for government service upon completion of MBBS degree from government and government-aided medical colleges in Haryana was notified in 2022 and is applicable from academic session 2020-21 onwards. As per the policy, the candidates need to execute a tripartite agreement signed between them, the bank and the government, and opt for government service after completion of MBBS degree in lieu of a bond of Rs.30 lakh minus the total annual fee, with a concession of 10 % on bond amount for female candidates. The government will repay the entire bond amount with interest to the bank in lieu of the service rendered by the candidate in government, else the candidates have to repay it. MBBS Intern, PGIMS, Rohtak, Akshat Mittal, a 2020-21 batch student, told The Hindu over phone that the government was seeking written consent from the students slated to complete their degree this month without clarity on various aspects of the policy. He said the students of various government medical colleges had also written to the Director, Medical Education & Research (DMER), Haryana, Yashendra Singh, in this connection through their respective deans. A detailed 17-point memorandum was also submitted by the representatives of the students to a delegation of Haryana Vidhan Sabha Committee on Health Services and Medical Education, comprising 11 MLAs, during their visit to Pt. B.D. Sharma, PGIMS, Rohtak on Tuesday, highlighting the students’ concerns related to the implementation of the policy. The student representatives sought clear written clarification on various aspects of the bond policy, including service conditions, salary structure, posting, medico-legal protection, postgraduate studies, bond exit mechanisms, and document-related issues. They also urged that no binding consent be taken from students until all doubts were formally clarified. The issue was not opposition to government service, but the absence of Standard Operating Procedures and detailed guidelines, said the student representatives. Mr. Mittal, Head, Public Relations, Under-graduate Students and Interns Association, PGIMS Rohtak, said for a bond policy to be ethical and effective, it must be accompanied by guaranteed job availability, transparent posting and transfer policy, fair remuneration, safe working conditions and clear exit clauses. Without these, he said, the bond policy failed its original aim and turned into a coercive, revenue generating or restrictive policy, rather than a public health tool. Haryana / medical education / education Copyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/haryana/haryana-mbbs-students-in-dilemma-over-governments-bond-policy-seek-clarity-on-various-aspects-before-consent/article70595912.ece",
        "date": "Fri, 06 Feb 2026 04:54:00 +0530",
        "fetched_at": "2026-02-06 03:54:43.144960"
    },
    {
        "title": "How the two-language policy impacted the teachers of other languages in 1968",
        "content": "The View From India Looking at World Affairs from the Indian perspective. First Day First Show News and reviews from the world of cinema and streaming. Today's Cache Your download of the top 5 technology stories of the day. Science For All The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point Decoding the headlines with facts, figures, and numbers Health Matters Ramya Kannan writes to you on getting to good health, and staying there The Hindu On Books Books of the week, reviews, excerpts, new titles and features. Groundswell of opposition: As a fall-out of the State-wide protests against Hindi imposition, the first DMK government decided to drop the language from the school curriculum. The photo shows a march in Tiruchi in 1965. | Photo Credit: The Hindu Archives On January 23, 1968, against the backdrop of Parliament passing the Official Languages (Amendment) Act, the first DMK government, headed by C.N. Annadurai, adopted a resolution in the Madras Assembly scrapping the three-language formula in the State. The resolution decided that Tamil and English alone be taught and Hindi be eliminated from the curriculum of all the schools. The decision taken in the middle of the academic year had placed hundreds of other language teachers in a piquant situation. “The wonder expressed by the school authorities and teachers is how the Government, which has given immediate effect to the switchover, will tackle the rehabilitation of over 4,000 teachers, who are now teaching Hindi and Sanskrit in about 2,400 schools in the State,” wrote a correspondent of The Hindu in the days immediately following the adoption of the resolution. “The scrapping of the three-language formula in schools, ordered by the Madras Government in implementing the Assembly resolution, will remove Hindi from most of the schools but will completely wipe out Sanskrit. This is the picture which emerges from talks with headmasters, Hindi and Sanskrit teachers and educational experts,” the report said. A perusal of The Hindu Archives showed their concern stemmed from the fact that most of the Hindi pandits did not have the minimum general qualification of SSLC. They had studied only up to the Fifth or Eighth Standard, but studied Hindi to an advanced stage (Praveen). “In fact, to many of them, Hindi teaching is the only avocation for which they are equipped. Sanskrit pandits too are more or less in the same condition. It is pointed out that quite a number of Sanskrit pandits took to Hindi five or six years ago when it assumed importance in the school curriculum. There are some pandits who have the minimum general qualification and who may, therefore, be absorbed as clerks or Secondary Grade teachers or librarians, after being given some training for these jobs. But these steps of rehabilitation could not be straight away taken now, because it is the middle of the school year. After the introduction of free education in the secondary schools, the number of clerical staff had been drastically cut and the chances of the Hindi pandits being absorbed in those posts are not bright, it is stated,” said a report. Parents whose children were studying languages such as Urdu and Malayalam were also concerned about the suspension of these languages along with Hindi. They asked why should other languages be abolished to counter Hindi imposition. Their views were represented through M. Chelliah, the Vice-Chairman, at the Municipal Council meeting in February. He urged the government to clearly state its stand on the teaching of other languages in the State. Joint Director of Secondary Education V.T. Titus had also held meetings with the District Education Officers of Madurai, Tiruchi, and Thanjavur on ways to offer alternative employment to the language teachers. One of the possibilities that was explored was the deployment of these teachers to handle general subjects. On February 14, the issue echoed in the Madras Legislative Council. Raising the plight of the teachers, M. Raja Aiyar urged the government that care be taken to see that on no account were Hindi teachers sent out of the schools, and as far as possible, they should be continued as language teachers. He said there was information that they were now being treated as clerks or attenders. Education Minister V.R. Nedunchezhiyan said the Hindi teachers, who were affected by the language policy, would be offered alternative jobs. | Photo Credit: The Hindu Archives Education Minister V.R. Nedunchezhiyan said the Hindi teachers, who were affected by the language policy, would be offered alternative jobs. “The Minister said the points raised by the member were all under consideration of the government. The Director had been told that as far as possible Hindi teachers should be continued in service as teachers. After the Education Department furnished full details, further action would be taken,” according to a report in this newspaper. When Raja Aiyar asked whether a similar assurance would be extended in the case of teachers of Sanskrit and Arabic, Nedunchezhiyan said the Chief Minister had already stated that the interests of the minorities would be assured. However, he did not have information as to how many teachers would be affected by the two-language policy. To another supplementary question, the Minister made it clear that the language policy was applicable to all schools. Schools also encountered another problem. Headmasters said the abolition of Part II in the middle of the school year would create administrative problems. “At present, two periods in a week have been allotted to the study of Part II languages (Advanced Tamil, Hindi, or Sanskrit). Now, these periods will have to be distributed to other subjects, which will mean increasing the work-load on the other teachers. If the decision were to be implemented from the beginning of next school year, it would have avoided such administrative problems, they said,” according to a report. Copyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/how-the-two-language-policy-impacted-the-teachers-of-other-languages-in-1968/article70595586.ece",
        "date": "Thu, 05 Feb 2026 22:52:48 +0530",
        "fetched_at": "2026-02-06 03:54:43.808452"
    },
    {
        "title": "Mysuru’s Mylari dosa launches in Bengaluru drawing crowds, and the Chief Minister",
        "content": "The View From India Looking at World Affairs from the Indian perspective. First Day First Show News and reviews from the world of cinema and streaming. Today's Cache Your download of the top 5 technology stories of the day. Science For All The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point Decoding the headlines with facts, figures, and numbers Health Matters Ramya Kannan writes to you on getting to good health, and staying there The Hindu On Books Books of the week, reviews, excerpts, new titles and features. The famous Mylari dosa | Photo Credit: Ravichandran N A legend from Mysuru, the Old Original Vinayaka Mylari, now has an outlet in Bengaluru’s Indiranagar. Since 1938, the humble restaurant has been serving their signature masala dosas to celebrities and noted politicians. The soft dosa, the home-made white butter and the signature green sagu, is what makes the dosa unique. The special sagu sets this dosa apart from the rest | Photo Credit: Ravichandran N “My mother-in-law’s mother-in-law started the restaurant in 1938. I am the third generation owner, and my son is the fourth generation. We have been following the same recipe in the family for all these years. The sagu is our own recipe,” says Usha Rani. “People have been asking us to open a branch in Bengaluru for years. But we did not. We were happy in Mysuru. My son wanted to expand the brand’s footprint. That’s why we have started it in the city now.” The Bengaluru outlet, located on 80 Feet Road is already drawing a crowd. It was inaugurated by Karnataka Chief Minister Siddaramaiah on January 23, 2026. The CM is a fan of the dosa, and in May 2024 he had visited the Mysuru outlet and posted on X, “Today morning, while having breakfast at Mylari Hotel in Mysore, I remembered my college days. All my unforgettable memories of life are intertwined with Mysore. Mysore is not just my hometown but the place that gave me life. Even when physically far away, the memories of Mysore always remain close to my heart. The debt to this soil is very great, but in front of it, we are small.” Crowds throng to the restaurant | Photo Credit: Ravichandran N The menu has the classics— khali dosa, masala dosa, idli, kesari bath and filter coffee. And no, none of this is available on online delivery platforms. The restaurant has two floors, with seating upstairs. It is a self-service setup, so be ready to wait in line, especially on weekends. We get a behind-the-scenes look into the kitchens where cooks are busy flipping dosas. The sagu is added inside with military precision. When they are ready, each dosa is topped with a generous dollop of white butter that is made inhouse. Without hesitating, we go straight for the masala dosa. It is spongy and fluffy, not the crispy kind. The mushy sagu is a secret recipe, but it is green and laced with onions. An interesting change from the conventional potato palya that accompanies Bengaluru dosa. The white butter and freshly made coconut chutney makes the whole dish extra tasty. There is no sambar here, but we do not miss it. But will Bangaloreans like it? We spoke to diners in the restaurant. Few love the taste. While few feel the outlet in Mysuru has a charm that is missing here. It is always hard to live up to legacy. Dosas are priced at ₹99. At HAL 2nd Stage, Indiranagar, Bengaluru, 6.30 AM onwards. food / food and dining (general) / bengaluru / lifestyle and leisure / traditional food / The Hindu MetroPlus Copyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/food/features/mysurus-mylari-dosa-launches-in-bengaluru-drawing-crowds-and-the-chief-minister/article70586615.ece",
        "date": "Thu, 05 Feb 2026 16:53:17 +0530",
        "fetched_at": "2026-02-06 03:54:44.447580"
    },
    {
        "title": "SC tells Bengal govt. to pay 25% DA by March 31",
        "content": "The View From India Looking at World Affairs from the Indian perspective. First Day First Show News and reviews from the world of cinema and streaming. Today's Cache Your download of the top 5 technology stories of the day. Science For All The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point Decoding the headlines with facts, figures, and numbers Health Matters Ramya Kannan writes to you on getting to good health, and staying there The Hindu On Books Books of the week, reviews, excerpts, new titles and features. In a relief to nearly 20 lakh government employees, the Supreme Court on Thursday directed the West Bengal government to pay dearness allowance (DA) to them from 2008 to 2019, saying it is a legally enforceable right. A Bench of Justices Sanjay Karol and Prashant Kumar Mishra directed the State government to pay 25% of the outstanding DA to its employees by March 31. They also formed a four-member committee of three retired Supreme Court judges and one other official to oversee the release of payments. The committee has been directed to work with the State government to fix a payment plan for the rest of the 75% DA. The committee is to send its recommendations by March 6. The State government has to submit a compliance report with the court by April 15 after payments are released. State government employees hailed the order, which marks the culmination of a decade-long fight. Government employees who fought this legal battle were seen rejoicing on the streets with colours. Malay Mukhopadhyay, general secretary of the Confederation of State Government Employees, said they have been fighting a long battle since 2016. “This time, the Supreme Court has set a date for the payment, and now the government can’t refuse to comply. This is a relief for both working and retired government employees,” he told The Hindu. Bhaskar Ghosh, State convener of Sangrami Joutho Mancha, another group that was at the forefront of the DA protests, called it a victory for the “common man”. Chief Minister Mamata Banerjee said that they will study the order and consult lawyers to form a committee to review the verdict. “No other States give pension, we are the only ones. If we did not have to pay this huge amount, we would save so much money,” she told reporters after the State budget presentation. Leader of the Opposition Suvendu Adhikari called the verdict a “defeat” for the government and a “major win” for the government employees. Copyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/west-bengal/sc-tells-bengal-govt-to-pay-25-da-by-march-31/article70596291.ece",
        "date": "Fri, 06 Feb 2026 01:04:50 +0530",
        "fetched_at": "2026-02-06 03:54:45.088906"
    },
    {
        "title": "AIADMK announces stir against DMK government’s move on new rural job guarantee scheme",
        "content": "The View From India Looking at World Affairs from the Indian perspective. First Day First Show News and reviews from the world of cinema and streaming. Today's Cache Your download of the top 5 technology stories of the day. Science For All The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point Decoding the headlines with facts, figures, and numbers Health Matters Ramya Kannan writes to you on getting to good health, and staying there The Hindu On Books Books of the week, reviews, excerpts, new titles and features. The AIADMK will hold demonstrations in front of panchayat union offices all over the State to express its opposition to the DMK government’s move against the new rural job guarantee scheme on February 13. Announcing this in a release, the party general secretary Edappadi K. Palaniswami stated that the proposed scheme, providing job for 125 days, did not envisage reducing the powers of States. It would allow the panchayat unions to decide the nature of job and the capacity of beneficiaries, apart from suspending the scheme in times of peak agricultural season. Mr. Palaniswami emphasised that the new scheme would not weaken local bodies but strengthen them. He contended that the DMK government had been acting against the proposed scheme which, according to the AIADMK leader, had been framed with rules that would go against the ruling party’s “irregularities.” All India Anna Dravida Munnetra Kazhagam / Dravida Munnetra Kazhagam / state politics / Tamil Nadu Copyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/aiadmk-announces-stir-against-dmk-governments-move-on-new-rural-job-guarantee-scheme/article70596651.ece",
        "date": "Fri, 06 Feb 2026 00:38:01 +0530",
        "fetched_at": "2026-02-06 03:54:45.715008"
    },
    {
        "title": "Supreme Court relief to T.N. in case of Vice-Chancellors’ appointments historically significant: Higher Education Minister",
        "content": "The View From India Looking at World Affairs from the Indian perspective. First Day First Show News and reviews from the world of cinema and streaming. Today's Cache Your download of the top 5 technology stories of the day. Science For All The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point Decoding the headlines with facts, figures, and numbers Health Matters Ramya Kannan writes to you on getting to good health, and staying there The Hindu On Books Books of the week, reviews, excerpts, new titles and features. Tamil Nadu Higher Education Minister Govi. Chezhiaan on Thursday said that the relief granted to Tamil Nadu by the Supreme Court in the Vice-Chancellors’ appointment case was ‘historically significant’ and that the government will take steps to fill the vacancies soon. After distributing certificates to graduands at the Graduation Day of College of Engineering, Guindy at Anna University, Dr. Chezhiaan said that Chief Minister M.K. Stalin will now take swift steps to fill the vacant positions. The Supreme Court had on Wednesday set aside an interim stay granted by the Madras High Court on amendments to relevant laws enabling the Tamil Nadu government to appoint Vice-Chancellors to State-run universities and remitted the matter back to the Madras High Court requesting it to decide on the case within six weeks. Sixteen out of 22 State-run universities in Tamil Nadu continue to function without a Vice-Chancellor. Earlier, speaking at the Graduation Day ceremony, Dr. Chezhiaan said the government has allocated ₹500 crore to Anna University to establish a research park and innovation centres to provide a fillip to research and development infrastructure. He congratulated the 841 graduates who received their certificates. He said that 1,834 first generation learners have been admitted to the four constituent colleges of Anna University in the 2024-25 academic year through various government schemes. Also, 619 government school students were admitted under the State government’s 7.5 per cent reservation scheme during the same year. Krishnan Sadagopan, Senior Vice-President, Ashok Leyland, S. Visakan, Director of Technical Education, B.T.N. Sridhar, Professor, Department of Aerospace Engineering, Anna University, and V. Kumaresan, Registrar-in-charge, Anna University, spoke. Copyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/supreme-court-relief-to-tn-in-case-of-vice-chancellors-appointments-historically-significant-higher-education-minister/article70597066.ece",
        "date": "Fri, 06 Feb 2026 00:31:09 +0530",
        "fetched_at": "2026-02-06 03:54:46.344768"
    },
    {
        "title": "TMC govt. hikes monthly aid for women, unveils scheme for unemployed",
        "content": "The View From India Looking at World Affairs from the Indian perspective. First Day First Show News and reviews from the world of cinema and streaming. Today's Cache Your download of the top 5 technology stories of the day. Science For All The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point Decoding the headlines with facts, figures, and numbers Health Matters Ramya Kannan writes to you on getting to good health, and staying there The Hindu On Books Books of the week, reviews, excerpts, new titles and features. West Bengal CM Mamata Banerjee and FinanceMinister Chandrima Bhattacharya with copies of the budget, in Kolkata on Thursday. | Photo Credit: ANI With an eye on the upcoming Assembly election in West Bengal, the Trinamool Congress (TMC) government on Thursday presented its interim budget, focusing on women and unemployed youth. The government has hiked the monthly grant for women under the Lakshmir Bhandar scheme by ₹500 and introduced a new scheme, ‘Banglar Yuba Sathi’, to extend unemployment aid of ₹1,500 to youth in the 21 to 40 age group. It also increased the salaries of civic and village police personnel, para teachers, and Accredited Social Health Activist (ASHA) and anganwadi workers. Finance Minister Chandrima Bhattacharya tabled a ₹4.06-lakh-crore interim budget for the financial year 2026-27. Despite the higher spending, the State has projected that the revenue deficit will narrow to ₹21,759.34 crore in 2026-27 from the revised ₹41,164.05 crore in the current fiscal. Chief Minister Mamata Banerjee told journalists that Lakshmir Bhandar – one of the government’s flagship schemes that provides monthly assistance of ₹1,000 and ₹1,200 to women in the general and reserved categories respectively – will benefit from additional allocation of ₹1,500 crore. Both categories will get a hike of ₹500. The government will add 20.62 lakh women under the scheme, which has 2.21 crore members currently, the budget document stated. The hiked allowance will be available from February, Ms. Banerjee said. The revised allowance comes against the backdrop of the Opposition BJP claiming that it will provide monthly aid of ₹3,000 under the scheme if voted to power. “Our scheme is universal [does not exclude beneficiaries] and theirs [BJP] is controversial,” the Chief Minister said. A total of ₹5,000 crore has been allocated in this financial year for the ‘Banglar Yuba Sathi’ scheme, which will be rolled out from August 15. This means the scheme will be implemented only when, and if, the TMC returns to power. The interim budget has made additional allocation of ₹1,000 crore to increase the salaries of 1.25 lakh civic and village police personnel by ₹1,000. Allocations of ₹100 crore, ₹250 crore, and ₹110 crore have been made to increase the salaries of ASHA workers, anganwadi workers, and para teachers respectively. Pointing out that the number of welfare schemes of the West Bengal government has crossed 100, the CM emphasised that her government is reaching out to all the sections of public and said that there is something for everyone in the budget. “We promise only those things which we can deliver. It is not like this is an election year and we will promise something which we cannot deliver,” she said. Leader of the Opposition Suvendu Adhikari said the promises that the government has vowed to implement from April are “nothing but deception”. “After the publication of the final voter list [on February 14], the model code of conduct (MCC) will be enforced. Under the MCC, the government cannot increase financial benefits or expand the number of beneficiaries,” he said. Copyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/west-bengal/tmcgovt-hikes-monthly-aid-for-women-unveils-scheme-for-unemployed/article70596709.ece",
        "date": "Fri, 06 Feb 2026 00:20:39 +0530",
        "fetched_at": "2026-02-06 03:54:46.968532"
    },
    {
        "title": "T.N. should pursue project to link Godavari and Cauvery to address water needs: VIT Chancellor",
        "content": "The View From India Looking at World Affairs from the Indian perspective. First Day First Show News and reviews from the world of cinema and streaming. Today's Cache Your download of the top 5 technology stories of the day. Science For All The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point Decoding the headlines with facts, figures, and numbers Health Matters Ramya Kannan writes to you on getting to good health, and staying there The Hindu On Books Books of the week, reviews, excerpts, new titles and features. The founder and chancellor of VIT, G. Viswanathan, inaugurated a two-day Agri Expo, organised by the School of Agricultural Sciences of VIT on its campus in Vellore on Thursday. The Tamil Nadu government should pursue project to interlink Godavari (Inchampalli) - Cauvery (Grand Anicut), which will benefit the State to meet its water requirements, especially for agriculture, G. Viswanathan, founder and chancellor, VIT, said on Thursday. In his presidential address at the eighth edition of Agri Expo 2026, which was organised by School of Agricultural Sciences of VIT at its campus here, he said that the interlinking of the two rivers where Andhra Pradesh and Telangana are riparian States would not only benefit farmers of Tamil Nadu but the entire agrarian community in South India. “Tamil Nadu should play a key role in interlinking of these two rivers, which is a long pending one, for the benefit of farmers in the south of Vindhyas,” he said. The Chancellor said that the State government, on its part, should build more check dams and better water harvesting structures in the State. In other words, these proactive measures of the Tamil Nadu government could save at least 400 tmc feet of excess rainwater from the Cauvery river that flows into the sea every monsoon. The excess water from the Cauvery could be diverted to other major seasonal rivers like Palar, Cheyyar, and Pennaiyar to help farming in the region, he said. Mr.Viswanathan emphasised the importance of water for better yield in agriculture. For example, India’s crop yields stand between 30 per cent and 60 per cent of potential levels. In other words, the country’s total wheat yield was about one-third of that of France, and rice yield was roughly half of that of China. “Agriculture should be profitable to retain talent,” he said. Speaking on the occasion, R. Selvarajan, Director, National Research Centre for Banana (NRCB), in Tiruchi under the Indian Council of Agricultural Research (ICAR), highlighted India’s agricultural progress since the Bengal famine of 1943, which claimed millions of lives. The Green Revolution, starting in 1965, boosted food grain production by approximately 6.6 times to around 353 million tonnes, he said. The two-day expo was inaugurated by Mr. Viswanathan in the presence of K. B. Srinivasan, Vice-President, Coromandel International Limited and N. Suresh, State Marketing Manager, IFFCO Tamil Nadu. Copyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/tn-should-pursue-project-to-link-godavari-and-cauvery-to-address-water-needs-vit-chancellor/article70596192.ece",
        "date": "Fri, 06 Feb 2026 00:16:41 +0530",
        "fetched_at": "2026-02-06 03:54:47.620869"
    },
    {
        "title": "Opposition slams Tamil Nadu Agriculture Minister’s remarks on North Indian migrant workers",
        "content": "The View From India Looking at World Affairs from the Indian perspective. First Day First Show News and reviews from the world of cinema and streaming. Today's Cache Your download of the top 5 technology stories of the day. Science For All The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point Decoding the headlines with facts, figures, and numbers Health Matters Ramya Kannan writes to you on getting to good health, and staying there The Hindu On Books Books of the week, reviews, excerpts, new titles and features. Tamil Nadu Agriculture Minister M.R.K. Panneerselvam. File | Photo Credit: The Hindu Tamil Nadu Agriculture Minister and senior DMK leader M.R.K. Panneerselvam has sparked a fresh political row following his remarks regarding North Indian migrants and the nature of jobs they undertake in the State. The comments, made during a public address in Mathuranthakam in this district recently, drew asharp rebuke from the BJP, which accused the ruling DMK of inciting hatred. The AIADMK also hit out against its archrival. The ruling DMK defended the Minister, claiming he was contrasting the state of development in the respective regions. Also Read | In northern India, women are told to stay in kitchen: Maran In a video clip from the event, the Minister is seen contrasting the educational progress of Tamil Nadu's youth with the socio-economic status of migrants. \"North Indians come to Tamil Nadu only to sell panipuri, work in construction (sector), and wipe tables,\" Mr. Panneerselvam said. He added that while migrants are engaged in such labour, \"people over here (in Tamil Nadu) are studying well.” Stating that the Minister's remarks were \"highly condemnable,\" AIADMK spokesperson Kovai Sathyan said people came to Tamil Nadu in search of livelihood, but they were given a raw deal. Also Read | Police say North Indian identity was not behind the attack on Odisha youth in Tiruttani \"You would have seen how a migrant worker from Odisha was beaten. And he went back. And you would have also known that a couple and their child from Bihar were murdered. They don't get a safe home for contributing to the development and welfare of Tamil Nadu economy, that's how they are treated,\" he told PTI Videos. A majority of the brown collared work was taken care of by the migrant workers who contributed significantly to the State economy. \"That's why we proudly say that Tamil Nadu is second largest economy in India and making such derogatory remarks clearly shows the mindset of DMK,\" Mr. Sathyan said. Also Read | The challenges of inter-State migrant workers in Tamil Nadu The State always took pride in saying \"Vandharai Vaazha Vaikkum Thamizhagam\", which meant it shelters anybody who comes to Tamil Nadu in search of living and livelihoods, he stressed. Contending that the Agriculture Minister did not belittle the migrant workers from the north, DMK leader T.K.S. Elangovan said the situation of north Indian workers coming to Tamil Nadu for employment was because the government there did not provide proper education and employment opportunities for its people. \"No, no, its about the other States treating their people. They are not giving proper education. Their system of education is against their growth. That's why they are coming here. Tamil Nadu is providing good education and employment and is also treating people from other States in a decent way,\" he said. Also Read | DMK Ministers take joy in belittling north Indians: BJP leader Annamalai In fact, this was what Mr. Panneerselvam had highlighted. The situation in the BJP-ruled States was not like in Tamil Nadu. \"They are not giving good education or employment. They don't care about their people because BJP is a religious group and not political,\" he charged. The Minister had said that the BJP was not for the people of the country. \"He didn't mean anything wrong. They come here to work because the BJP-ruled states do not give proper education,\" Mr. Elangovan said responding to the Minister's controversial remarks. Reacting strongly to the remarks, BJP Tamil Nadu chief Nainar Nagenthran took to X to condemn the Minister’s \"arrogant\" speech. He alleged that such statements are particularly dangerous given the recent instances of hostility toward migrants in the State. \"I strongly condemn DMK minister M R K Panneerselvam for mocking north Indians by saying they come to Tamil Nadu only to sell panipuri, do construction work, and wipe tables,\" Mr. Nagenthran posted. He further demanded that the Minister \"immediately tender a public apology for his arrogant speech.” The BJP leader invoked Tamil heritage to highlight the contradiction in the DMK’s rhetoric. \"On our Tamil soil, which proclaimed equality and brotherhood through the philosophy of 'Yadhum Oore Yavarum Kelir' (To us all towns are one, all men our kin), it is not only disgusting but also dangerous for DMK leaders to continuously sow hatred against North Indians,\" he stated. Mr. Nagenthran also questioned the silence of the DMK's allies, asking if the Congress and Communist parties endorse this \"divisive politics of North vs South\". The electorate would \"uproot the DMK\" in the upcoming Assembly elections for using north Indians as \"pawns to retain power\". The controversy follows a series of similar remarks by other DMK leaders in recent years, which the Opposition claims is a deliberate strategy to polarise the electorate. Tamil Nadu / Dravida Munnetra Kazhagam / state politics / migration / labour Copyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/tamil-nadu-dmk-minister-mrk-panneerselvam-remarks-on-north-indian-migrant-workers/article70597347.ece",
        "date": "Fri, 06 Feb 2026 00:52:55 +0530",
        "fetched_at": "2026-02-06 03:54:48.250723"
    },
    {
        "title": "Pilot project for mechanised cleaning machines introduced",
        "content": "The View From India Looking at World Affairs from the Indian perspective. First Day First Show News and reviews from the world of cinema and streaming. Today's Cache Your download of the top 5 technology stories of the day. Science For All The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point Decoding the headlines with facts, figures, and numbers Health Matters Ramya Kannan writes to you on getting to good health, and staying there The Hindu On Books Books of the week, reviews, excerpts, new titles and features. Pommala Sunil Kumar | Photo Credit: SUDHAKARA JAIN The Bengaluru North Corporation on Thursday introduced a pilot project to introduce mechanised cleaning machines in place of brooms for sweeping roads, starting with a trial run in Sahakar Nagar. Corporation Commissioner Pommala Sunil Kumar said that mechanised sweepers and blower machines were being introduced to improve daily road-cleaning and reduce physical burden on pourakarmikas. Trolly mounted dust bins would also be used regularly for collecting road waste, he said. He added that machines were being introduced on a pilot basis and after evaluating their use, a proposal would be submitted to the government for procuring additional equipments. Copyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/karnataka/pilot-project-for-mechanisedcleaning-machines-introduced/article70596444.ece",
        "date": "Thu, 05 Feb 2026 23:53:47 +0530",
        "fetched_at": "2026-02-06 03:54:48.862944"
    },
    {
        "title": "Cabinet clears AI-powered software to identify hate speech, misinformation and malicious campaigns",
        "content": "The View From India Looking at World Affairs from the Indian perspective. First Day First Show News and reviews from the world of cinema and streaming. Today's Cache Your download of the top 5 technology stories of the day. Science For All The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point Decoding the headlines with facts, figures, and numbers Health Matters Ramya Kannan writes to you on getting to good health, and staying there The Hindu On Books Books of the week, reviews, excerpts, new titles and features. H.K. Patil | Photo Credit: ALLEN EGENUSE J Content on social media and other digital platforms could come under the scanner as the Karnataka government will deploy AI-powered ‘Social Media Analytics Solution’ software to identify hate speech, misinformation and malicious campaigns in news and advertising. The AI-based software will be used to assess misinformation, disinformation, hate speech and harmful narratives, especially for safety of women, children, and the public. The decision to deploy the AI-powered software at the cost of ₹67.26 crore was arrived at during the Cabinet meeting chaired by Chief Minister Siddaramaiah. “This is not only for fact checking, but also to identify manipulation on social media platforms and digital media platforms. Right now, the AI software will be deployed to assess. Law will come later and action will be initiated,” Law and Parliamentary Affairs Minister H.K. Patil told presspersons during the post-Cabinet briefing. On the legal standing of screening of content, the Minister said, “I think there is no absolute bar to screen or verify criminal intentions or manipulation.” He also clarified that this would not be applicable to news media outlets. “Fake media banners and houses will, however, not be spared,” he said. Mr. Patil also said that there will be no human interference in this, and that no party or government will benefit. The Cabinet note said that the software would be developed adhering to guidelines on data sovereignty and data localisation, and cloud architecture would be developed adhering to the guidelines of MeitY. It also pointed out that the Department of IT/BT has after evaluation found the importance of IDTU project in controlling the spread of misinformation ahead of Lok Sabha elections. The proposed software will be proprietary algorithm, which will be dynamic and continuously renewed AI/ ML units since there is a threat of misinformation evolving and fixed algorithm was not an answer. There will be real-time alerts and geo-specific threat mapping. It would help in identifying new-age misinformation, hate speech, deep fakes, bot networks, multi-language narratives, and subject-based manipulations. With Governor Thaawarchand Gehlot referring the Karnataka Hate Speech and Hate Crimes (Prevention) Bill, 2025, for the consideration of the President, the State government is set to send all information and explanation on it to her by next week. It will be a detailed and point-to-point rebuttal, said sources. The BJP had opposed the Bill stating that it would infringe on the freedom of expression. Copyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/karnataka/cabinet-clears-ai-powered-software-to-identify-hate-speech-misinformation-and-malicious-campaigns/article70597229.ece",
        "date": "Thu, 05 Feb 2026 23:27:21 +0530",
        "fetched_at": "2026-02-06 03:54:49.508334"
    },
    {
        "title": "Government says 2,645 posts vacant at AAI, 3 aviation regulators",
        "content": "The View From India Looking at World Affairs from the Indian perspective. First Day First Show News and reviews from the world of cinema and streaming. Today's Cache Your download of the top 5 technology stories of the day. Science For All The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point Decoding the headlines with facts, figures, and numbers Health Matters Ramya Kannan writes to you on getting to good health, and staying there The Hindu On Books Books of the week, reviews, excerpts, new titles and features. Image used for representational purposes. File | Photo Credit: The Hindu A total of 2,645 positions are lying vacant at the Airports Authority of India (AAI) and three aviation regulators, DGCA, BCAS and AERA, the government said on Thursday (February 5, 2026). In a written reply to the Lok Sabha, Minister of State for Civil Aviation Murlidhar Mohol said adequate steps are taken from time to time to fill up vacancies under the Ministry, including its attached offices and regulatory bodies. At the Directorate General of Civil Aviation (DGCA), there are 787 vacancies, largely due to the creation of 441 additional posts as part of the restructuring undertaken during 2022-2024. The Minister said that at the Airports Authority of India (AAI), there are 1,667 vacancies pertaining to direct recruitment (executive) posts. \"To address these, AAI has expedited recruitment, redeployed staff at operationally sensitive airports, created additional ATCO posts in line with expanding airspace requirements...,\" he said. According to the Minister, at the Bureau of Civil Aviation Security (BCAS) and Airports Economic Regulatory Authority of India (AERA), 180 and 11 positions are vacant, respectively. \"BCAS and AERA are deputation-based organisations; vacancy circulars are issued periodically to fill posts in accordance with the prescribed norms,\" he added. In a separate written reply, Mr. Mohol said that a total of 6,936 flights were cancelled by IndiGo during the last three months affecting 10,81,680 passengers. He also said that over optimisation of operations, inadequate regulatory preparedness along with deficiencies in system software support, shortcomings in management structure and operational control were among the reasons for the airline's flight cancellations in December 2025. Additionally, during December 2025 a considerable number of flights were cancelled due to adverse weather, he added. air transport / Airlines Copyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/business/Industry/government-says-2645-posts-vacant-at-aai-3-aviation-regulators/article70597227.ece",
        "date": "Thu, 05 Feb 2026 23:01:45 +0530",
        "fetched_at": "2026-02-06 03:54:50.131124"
    },
    {
        "title": "Swadeshabhimani-Kesari award presented to Malayinkeezhu Gopalakrishnan",
        "content": "The View From India Looking at World Affairs from the Indian perspective. First Day First Show News and reviews from the world of cinema and streaming. Today's Cache Your download of the top 5 technology stories of the day. Science For All The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point Decoding the headlines with facts, figures, and numbers Health Matters Ramya Kannan writes to you on getting to good health, and staying there The Hindu On Books Books of the week, reviews, excerpts, new titles and features. Published - February 05, 2026 10:56 pm IST - Thiruvananthapuram Chief Minister Pinarayi Vijayan with Malayinkeezhu Gopalakrishnan at the award distribution ceremony in Thiruvananthapuram on Thursday. Media today is moving away from the traditions of Swadeshabhimani Ramakrishna Pillai and Kesari Balakrishna Pillai who believed that journalism was a way to rebuild society, Chief Minister Pinarayi Vijayan has said. He was speaking at the presentation of the 2024 Swadeshabhimani-Kesari award, State media awards, and the photography awards for 2021 and 2022 here on Thursday. Reflecting on the changes in media post-Independence, the Chief Minister observed that the haste to make profits had seen a decline in values. The unhealthy tendencies that the media had fought against during the reformation in the State were now being encouraged by it. Superstitions and regressive customs had gained a foothold in the media. Globalisation led to the emergence of media corporations. Advocates of global capital were close to power centres. This corporate-power centre nexus is protecting both capitalist and political interests. The impact of this could be seen now, the Chief Minister said. He alleged that there was a tendency to attack the government without going into the merits of the claims or charges made. Even if it was proved in court that the charges made were baseless, a majority of the media were not ready to tell the public about the truth. “Media has the responsibility to tell the people what they should know,” the Chief Minister said. At a time when journalists were under attack and even jailed for doing their work, the State government was honouring journalists. Several critics of the government were among the recipients of the awards. Since the government was not afraid of criticism and it was required for independent journalism, it did not intervene in the award selection. The government was firm that merit alone should be the basis for the awards, the Chief Minister said. Malayinkeezhu Gopalakrishnan who had been selected for the Swadeshabhimani-Kesari award was a veteran journalist with decades of experience, Mr .Pinarayi said. He always focussed on facts and was insistent that news should not be rumours, the Chief Minister pointed out. Mr. Gopalakrishnan shared his joy on receiving the award from the Chief Minister at the historic Durbar Hall. Minister for General Education V. Sivankutty presided over the function. Copyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/kerala/swadeshabhimani-kesari-award-presented-to-malayinkeezhu-gopalakrishnan/article70597170.ece",
        "date": "Thu, 05 Feb 2026 22:56:17 +0530",
        "fetched_at": "2026-02-06 03:54:50.770845"
    },
    {
        "title": "Sri Lankan diplomat lauds Indian government, people for relief efforts following Cyclone Ditwah",
        "content": "The View From India Looking at World Affairs from the Indian perspective. First Day First Show News and reviews from the world of cinema and streaming. Today's Cache Your download of the top 5 technology stories of the day. Science For All The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point Decoding the headlines with facts, figures, and numbers Health Matters Ramya Kannan writes to you on getting to good health, and staying there The Hindu On Books Books of the week, reviews, excerpts, new titles and features. Deputy High Commissioner of Sri Lanka for Southern India Ganesanathan Geathiswaran on Wednesday appreciated the government and people of India for their support in the relief efforts in his country after Cyclone Ditwah. Addressing a gathering of over 150 people on the occasion of the 78th Independence Day of Sri Lanka, the Deputy High Commissioner, who hoisted the national flag at an event in Chennai, also acknowledged the contributions of the Sri Lankan community and well-wishers in Tamil Nadu in the relief operations. The diplomat highlighted the government of Sri Lanka’s policy priorities on national rebuilding, economic recovery, strengthening the rule of law, and reconciliation. He also referred to the government’s commitment to relief, rehabilitation, and climate-resilient development following Cyclone Ditwah. Sri Lanka / India-Sri Lanka Copyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/sri-lankan-diplomat-lauds-indian-government-people-for-relief-efforts-following-cyclone-ditwah/article70596244.ece",
        "date": "Thu, 05 Feb 2026 22:43:56 +0530",
        "fetched_at": "2026-02-06 03:54:51.427802"
    },
    {
        "title": "Congress takes out march to condemn Union government for diluting MGNREGA",
        "content": "The View From India Looking at World Affairs from the Indian perspective. First Day First Show News and reviews from the world of cinema and streaming. Today's Cache Your download of the top 5 technology stories of the day. Science For All The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point Decoding the headlines with facts, figures, and numbers Health Matters Ramya Kannan writes to you on getting to good health, and staying there The Hindu On Books Books of the week, reviews, excerpts, new titles and features. TNCC president K. Selvaperunthagai, Telangana Deputy Chief Minister Mallu Bhatti Vikramarka, and other Congress leaders at the march taken out in Chennai on Thursday. | Photo Credit: R. Ravindran The Tamil Nadu Congress Committee (TNCC) on Thursday took out a march at Tambaram in Chennai condemning the BJP-led government at the Centre for diluting the Mahatma Gandhi National Rural Employment Guarantee Act (MGNREGA). The march started near the Kamarajar statue on Bharatha Matha Salai in East Tambaram and passed through Velachery-Tambaram Main Road, Tambaram-Mudichur Road, and concluded at Muthuranga Park in West Tambaram, where the Congress leaders paid respects to a statue of Mahatma Gandhi. TNCC president K. Selvaperunthagai, Congress leader and Deputy Chief Minister of Telangana Mallu Bhatti Vikramarka, Tamil Nadu Congress Legislative Party leader S. Rajeshkumar, All India Congress Committee secretaries Suraj M.N. Hegde and Nivedith Alva, and Congress MLAs were among those who participated. Later, while speaking at a meeting, Mr. Selvaperunthagai said Leader of the Opposition in the Lok Sabha Rahul Gandhi and Congress president Mallikarjun Kharge had expressed concerns about the dilution of MGNREGA, both inside and outside Parliament. In the name of increasing the number of working days under the new scheme (VB–G RAM G), the Centre had increased the financial share of the States. The MGNREGA was hailed by several world leaders and international institutions. The TNCC will not stop until the Centre withdraws the new Act, like how it withdrew the three farm laws after consistent protests, Mr. Selvaperunthagai added. Mr. Vikramarka said the march was organised not for the party but for the agricultural labourers. He said after understanding the sufferings of agricultural labourers and the unemployed, the United Progressive Alliance government brought out the MGNREGA, which was a silent revolution. “In an attempt to nullify the Act and by removing the name of Mahatma, the BJP-led government at the Centre removed the atma of the scheme,” he alleged. Congress workers from Chennai, Chengalpattu, Kancheepuram and Tiruvallur districts participated in the march. Traffic was thrown out of gear for sometime on the arterial Velachery-Tambaram Road. Copyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/congress-takes-out-march-to-condemn-union-government-for-diluting-mgnrega/article70596280.ece",
        "date": "Thu, 05 Feb 2026 22:40:56 +0530",
        "fetched_at": "2026-02-06 03:54:52.050616"
    },
    {
        "title": "Kuki-Zo groups boycott tribal MLAs in Manipur government, accuse them of ‘betrayal’",
        "content": "The View From India Looking at World Affairs from the Indian perspective. First Day First Show News and reviews from the world of cinema and streaming. Today's Cache Your download of the top 5 technology stories of the day. Science For All The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point Decoding the headlines with facts, figures, and numbers Health Matters Ramya Kannan writes to you on getting to good health, and staying there The Hindu On Books Books of the week, reviews, excerpts, new titles and features. Anger was directed at Nemcha Kipgen, who was appointed Deputy Chief Minister on February 4, 2026, and two other MLAs – former DGP L.M. Khaute and Ngursanglur Sanate, who flew to Imphal from New Delhi with other NDA legislators. Photo: Special Arrangement Kuki-Zo tribal groups declared a social boycott on Thursday (February 5, 2026) of Kuki-Zo legislators who have joined the newly formed Manipur government of Yumnam Khemchand Singh. The boycott and a dawn-to-dusk “total shutdown” across the hills inhabited by the Kuki-Zo people, to protest “betrayal” by these MLAs, were enforced hours before the seventh session of the 12th Manipur Assembly began with an address by Governor Ajay Kumar Bhalla. Normal life was hit in Chandel, Churachandpur, Kangpokpi, and Pherzawl districts as protesters rallied with posters calling some Kuki-Zo MLAs “traitors”. There were reports of arson in some of these districts where protesters accused the MLAs of prioritising government formation over pressuring the Centre for a Union Territory-like separate administration for the Kuki-Zo community. Anger was directed at Nemcha Kipgen, sworn in as a Deputy Chief Minister on Wednesday (February 4, 2026), and two other legislators – former Director General of Police L.M. Khaute and Ngursanglur Sanate, who flew to Imphal from New Delhi with other NDA legislators. It was the first such visit by any Kuki-Zo MLA to the State capital since the ethnic conflict between the Kuki-Zo and Meitei communities broke out in May 2023. All three are Bharatiya Janata Party legislators. The Kuki-Zo Council (KZC) said the decision of some Kuki-Zo legislators to join the government was in violation of a resolution adopted unanimously to abstain from government formation till the Central and the State governments gave written political commitment to support a separate administration. The KZC, apex body of the Kuki-Zo community, said these MLAs were party to the resolution along with leaders of Kuki-Zo social organisations and some rebel groups that had signed the Suspension of Operations agreement with the Centre in August 2008. “By joining a Meitei-dominated government, these MLAs have effectively aligned themselves with our enemy, disregarding the immense pain and sacrifices endured by the Kuki-Zo community,” the KZC said, viewing their act as a serious betrayal and a deliberate attempt to undermine the unity, sentiments and collective political stand of the Kuki-Zo people. The KZC urged the Kuki-Zo people not to cooperate or associate with the MLAs in any social, customary, or public matters. “This boycott shall remain in force until they refrain from participation in the Manipur government and realign themselves with the collective position of the Kuki-Zo people,” it added. The Thadou Inpi Manipur (TIM), however, welcomed Ms. Kipgen’s “historic appointment” as a Deputy Chief Minister and asked her to “uphold the Thadou identity, protect Manipur’s territorial integrity, and disassociate from Kuki tags, organisations, and separatist ideology”. TIM urged Ms. Kipgen to undo the damage done by aligning with “Kuki-centric narratives” of separatism and supremacism after the ethnic conflict broke out. The Thadous resent their inclusion in the Kuki group. In his address to the House, the Governor said maintenance of law and order remained the foremost priority of the government. He said coordinated efforts of the Central and State governments, security forces, civil administration, and community institutions enabled Manipur to move towards peace and stability. He acknowledged the guidance of Prime Minister Narendra Modi and Union Home Minister Amit Shah for restoring peace and normalcy in the State. Copyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/manipur/kuki-zo-groups-boycott-tribal-mlas-in-manipur-government-accuse-them-of-betrayal/article70596470.ece",
        "date": "Fri, 06 Feb 2026 02:19:48 +0530",
        "fetched_at": "2026-02-06 03:54:52.696372"
    },
    {
        "title": "Stalin inaugurates additional water supply initiative in Vellore, Tirupattur; permanent commercial complex for traders in Ranipet town",
        "content": "The View From India Looking at World Affairs from the Indian perspective. First Day First Show News and reviews from the world of cinema and streaming. Today's Cache Your download of the top 5 technology stories of the day. Science For All The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point Decoding the headlines with facts, figures, and numbers Health Matters Ramya Kannan writes to you on getting to good health, and staying there The Hindu On Books Books of the week, reviews, excerpts, new titles and features. Vellore Collector V. R. Subbulaxmi inspected the new water storage facility in Gudiyatham town in Vellore on Thursday. Chief Minister M.K. Stalin on Thursday virtually inaugurated the new facility as part of a combined water supply initiative in Vellore and Tirupattur districts. | Photo Credit: Special Arrangement Chief Minister M.K. Stalin on Thursday virtually inaugurated a combined water supply initiative in Gudiyatham and Madhanur that comes under Vellore and Tirupattur districts and a permanent commercial complex for retail and wholesale traders in Ranipet town. Officials of Tamil Nadu Drinking Water Drainage Board (TNDWDB), which executed the work, said that the ₹12.92-crore project was being implemented under the Centrally-sponsored AMRUT 2.0 scheme (Atal Mission for Rejuvenation and Urban Transformation). The initiative will help to meet the rising water requirements of residents, especially during summer. Vellore Collector V. R. Subbulaxmi inspected the new water storage facilities in Gudiyatham. “We are forced to trek to surrounding villages to fetch a few pots of water for domestic use on account of irregular water supply by the civic body. Additional water storage facilities will help in streamlining the water supply in the town,” said S. Pankajam, a resident in Gudiyatham town. The Gudiyatham municipality in Vellore, and five villages and 17 habitations that fall under Madhanur panchayat union, near Ambur town in Tirupattur, are covered under the project. “The initiative would help provide piped water supply to more households, especially during summer. Palar river remains the key water source for the project,” S. Suresh Kumar, commissioner, Gudiyatham municipality, told The Hindu. At present, the municipality manages to generate around 8.85 MLD (millions of litres per day) under Palar and Cauvery Water Supply Scheme (CWSS) everyday. The existing water supply covers residents in only 24 of the 36 wards of the municipality. Even in these 24 wards, residents get piped water supply only once in two days. In other words, 92 litres per capita per day (LPCD) is available for residents in these wards. Tanker lorries and street corner tanks cater to the remaining public. The Thursday’s initiative is aimed at bridging this gap. Under AMRUT 2.0 scheme, the municipality has built two OHTs (overhead tanks) with a storage capacity of 10 lakh litres each. A sump has also been constructed with a capacity of 23 lakh litres. Pipelines have been laid from the dry Palar river bed to the town to draw water to these new facilities to facilitate supply to the uncovered areas. In Tirupattur, TNDWDB has started providing water supply to remote villages such as Chinnapallikuppam, Papanapalli, Vadakarai, Melsanakuppam and Vadacheri under Madhanur panchayat union near Ambur. The ₹4.95-crore project will cover at least 17 tribal habitations in the area. Around 8,000 families have been identified in these villages and habitations to be covered under the new water supply scheme. The Chief Minister also inaugurated a permanent commercial complex for retail and wholesale traders in Ranipet town. The ₹11.52-crore building, which will be maintained by Ranipet municipality, has 300 shops for retailers and 60 shops for wholesale traders. The new facility, established on around 56.23 sq.m., also has air-conditioned rooms for traders and drivers of goods-laden lorries to rest. Water facilities, washrooms, CCTV cameras and parking facilities have been provided. Prior to the new facility, open temporary shops were allotted for traders to sell their products. Copyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/stalin-inaugurates-additional-water-supply-initiative-in-vellore-tirupattur-permanent-commercial-complex-for-traders-in-ranipet-town/article70596235.ece",
        "date": "Thu, 05 Feb 2026 21:53:40 +0530",
        "fetched_at": "2026-02-06 03:54:53.363865"
    },
    {
        "title": "200 substations in A.P. nearing completion, says Energy Minister",
        "content": "The View From India Looking at World Affairs from the Indian perspective. First Day First Show News and reviews from the world of cinema and streaming. Today's Cache Your download of the top 5 technology stories of the day. Science For All The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point Decoding the headlines with facts, figures, and numbers Health Matters Ramya Kannan writes to you on getting to good health, and staying there The Hindu On Books Books of the week, reviews, excerpts, new titles and features. Energy Minister Gottipati Ravi Kumar inaugurates a substation near Mandapeta in East Godavari district on Thursday. | Photo Credit: BY ARRANGEMENT Energy Minister Gottipati Ravi Kumar announced on Thursday that the majority of the 200 new substations being constructed across the State are nearing completion. Mr. Ravi Kumar inaugurated two 33/11 kV substations built at a cost of ₹2.61 crore at Mandapeta and Teki villages in the Mandapeta Assembly constituency. Addressing the gathering, the Minister said: “Works worth ₹175 crore are ongoing in East Godavari district to improve the power infrastructure and ensure nine hours of free quality power supply to farmers and 24-hour uninterrupted power supply for domestic use.” He claimed that nearly 75,000 new agricultural power connections have been granted since the alliance was voted to power. “Chief Minister N. Chandrababu Naidu has set a target to reduce electricity charges by ₹1.19 per unit before the next Assembly elections,” added Mr. Ravi Kumar. Earlier in the morning, Mr. Ravi Kumar directed officials to complete all power sector works in the East Godavari district within the stipulated timeline for the Godavari Pushkarams-2027. “Land has been identified for new substations for the Pushkarams”, he claimed. Copyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/200-substations-in-ap-nearing-completion-says-energy-minister/article70596889.ece",
        "date": "Thu, 05 Feb 2026 21:34:45 +0530",
        "fetched_at": "2026-02-06 03:54:53.974268"
    },
    {
        "title": "Election Commission holds briefing for observers in poll-bound States",
        "content": "The View From India Looking at World Affairs from the Indian perspective. First Day First Show News and reviews from the world of cinema and streaming. Today's Cache Your download of the top 5 technology stories of the day. Science For All The weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point Decoding the headlines with facts, figures, and numbers Health Matters Ramya Kannan writes to you on getting to good health, and staying there The Hindu On Books Books of the week, reviews, excerpts, new titles and features. Chief Election Commissioner Gyanesh Kumar. File | Photo credits: X/@ECISVEEP via ANI Photo The Election Commission (EC) on Thursday (February 5, 2026) began briefings for General, Police and Expenditure Observers to be deployed as Central Observers for the elections to the Legislative Assemblies of Assam, Kerala, Puducherry, Tamil Nadu and West Bengal. A total of 1,444 officers, including 714 General Observers, 233 Police Observers and 497 Expenditure Observers, have been called for the briefing meetings which will be held in three batches over two days from February 5-6. The briefing was done by Chief Election Commissioner (CEC) Gyanesh Kumar, along with Election Commissioners Sukhbir Singh Sandhu and Vivek Joshi. The CEC said the observers should ensure free, fair and transparent elections and said their presence would energise the entire election machinery across 824 constituencies where elections were going to be held. Senior EC officials also briefed the observers on various aspects of preparation of electoral rolls and the conduct of elections. The observers were also briefed on the IT applications and platforms, and media-related matters during the sessions. They were asked to familiarise themselves with all the election laws, rules, guidelines and provide inputs directly to the commission and ensure their strict and impartial compliance. They were instructed to remain fully accessible to political parties, candidates and ensure that the grievances of voters were redressed in a timely manner. The observers were also instructed to visit polling stations and ensure the implementation of the recent initiatives taken by the commission for the convenience of voters, especially ensuring the provision of Assured Minimum Facilities (AMFs). Copyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "link": "https://www.thehindu.com/news/national/election-commission-holds-briefing-for-observers-in-poll-bound-states/article70596590.ece",
        "date": "Thu, 05 Feb 2026 21:19:23 +0530",
        "fetched_at": "2026-02-06 03:54:54.601681"
    },
    {
        "title": "Delhi To Launch Double-Decker Tourist Buses For Key Heritage Sites Soon | Check Routes And Fares",
        "content": "The national capital is gearing up to introduce a new sightseeing experience for visitors with the launch of double-decker tourist buses later this month. The initiative, led by the Delhi government, will link major heritage and cultural landmarks through a specially designed tourism circuit across the heart of the city. Senior officials said the service, likely to start in February, is being developed primarily for domestic and foreign tourists, with a strong focus on the central vista and nearby national monuments. The aim is to make some of Delhi’s most prominent attractions easier to access through a single, organised route. The planned circuit will include destinations such as the Pradhanmantri Sangrahalaya, National War Memorial, Bharat Mandapam, the new Parliament complex, Kartavya Path and Dilli Haat. Officials said the project seeks to present these landmarks as part of a unified tourism experience rather than isolated sites. The use of double-decker buses is expected to enhance sightseeing, with elevated seating offering wider views of monuments and ceremonial avenues. Authorities believe this format will provide a more engaging and relaxed way for visitors to explore the city. In addition to daytime operations, the tourism department is also working on evening sightseeing services. While the night-tour route has largely been finalised, details on operating hours are yet to be announced. An electric double-decker bus, along with two other buses, is expected to begin service around February 20, coinciding with the first anniversary of the Delhi government. The electric vehicle has been supplied by a private firm under a corporate social responsibility initiative. Originally housed at the Okhla depot under the transport department, the bus has now been transferred to the tourism department. According to officials, the service will operate from the Pradhanmantri Sangrahalaya and cover several major landmarks along the route. The fare has been fixed at Rs 500 for adults and Rs 300 for children aged between six and twelve years, news agency PTI reported. A guide will be on board to brief passengers about the historical and cultural significance of each location. Information on booking procedures and schedules will be released ahead of the official launch. Double-decker buses were once a familiar sight on Delhi’s roads, run by the Delhi Transport Corporation under the name “Suvidha\", before they were discontinued in 1989 following the gradual withdrawal of the ageing fleet.",
        "link": "https://www.news18.com/cities/new-delhi-news/delhi-to-launch-double-decker-tourist-buses-for-key-heritage-sites-soon-check-routes-and-fares-ws-l-9883094.html",
        "date": "Fri, 6 Feb 2026 08:21:55 +0530",
        "fetched_at": "2026-02-06 03:55:01.895017"
    },
    {
        "title": "Roads, Mining, Hydel Projects Claimed Nearly 1 Lakh Hectares Of India's Forest Land Since 2020",
        "content": "Nearly 97,050 hectares of forest land was diverted for non-forestry purposes in the last five financial years, starting 2020-21, the Union Environment Ministry told Parliament. Madhya Pradesh accounted for the largest share, with 902 such proposals for non-forestry use approved and only six rejected between 1st April 2020 and 31st March 2025. The government said that it gave the go-ahead to as many as 10,026 proposals during this period and rejected just 120 proposals—an overwhelmingly high approval rate, with only a handful of rejections. Some regions, like the Andaman and Nicobar Islands, where 26 projects were approved, saw no rejection. Jammu and Kashmir, as well as Manipur, Meghalaya, Tripura, and Mizoram in the Northeast, also saw no rejections. Out of the total projects considered during the last five years, most of them were approved in Gujarat (1560), with Haryana (1424) and Uttar Pradesh (1188) following closely behind. Roads cut the deepest into India’s forests, with nearly 22,233 hectares of forest land diverted for construction of roads alone. Mining and quarrying followed close behind, claiming 18,913 hectares of forest land, while hydel and irrigation projects claimed 17,434 hectares, and power transmission lines nearly 13,859 hectares. Remaining diversions were mostly for Defence (6,041 hectares), railways (5,957 hectares), and other developmental projects. Responding to questions, Minister of State (Environment, Forests, and Climate Change) Kirti Vardhan Singh said the diversion was approved under the Van (Sanrakshan Evam Samvardhan) Adhiniyam, 1980. “The central government, following the prescribed statutory approval process, takes prompt decisions on proposals for diversion of forest land, including all development projects, that are complete in all respects,\" he told Parliament. As per the conditions of approval, the states/UTs concerned have to ensure that a minimum number of trees are felled, and wherever feasible, translocation of trees is to be done, and the permission for felling of trees is given by the concerned states/UTs, he added. While Madhya Pradesh recorded the maximum diversion of forest land—24,346 hectares—it was followed by Odisha (12,875 hectares), Gujarat (6,850), and Arunachal Pradesh (6,656 hectares), as per the data from 2020-21 to 2024-25. The government attributed the reduction in timelines observed in the processing of Environmental Clearance (EC) proposals to “comprehensive regulatory reforms undertaken by the Environment Ministry, supported by technology-driven interventions such as GIS layers, Decision Support System\". The minister also cited the recently launched online single-window system for processing such proposals, as well as amendments to the Environment Impact Assessment (EIA) Notification, 2006, and office memorandums issued from time to time for reducing the duration. The government had also recently given appraisal powers to the State Environment Impact Assessment Authorities (SEIAAs) for sectors like mining, irrigation, and power projects, and also increased Expert Appraisal Committee meetings to at least twice a month to speed up proposal review. Under the Environment Impact Assessment (EIA) Notification, 2006, project proposals are examined by an Expert Appraisal Committee (EAC), which reviews their environmental impacts. The committee recommendations are then placed before the ministry, which takes the final decision on granting or rejecting environmental clearance. Forest diversion proposals from states are reviewed by an advisory committee under the Van (Sanrakshan Evam Samvardhan Adhiniyam), 1980.",
        "link": "https://www.news18.com/india/roads-mining-hydel-projects-claimed-nearly-1-lakh-hectares-of-indias-forest-land-since-2020-9882951.html",
        "date": "Fri, 6 Feb 2026 00:56:17 +0530",
        "fetched_at": "2026-02-06 03:55:02.534723"
    },
    {
        "title": "Centre, Nagaland Govt, Naga Tribes Body Sign Pact To Create Frontier Nagaland Territorial Authority",
        "content": "The Government of India, the Government of Nagaland and representatives of the Eastern Nagaland Peoples’ Organisation (ENPO) on Wednesday signed a historic agreement in New Delhi. The pact paves the way for the creation of the Frontier Nagaland Territorial Authority (FNTA) for six eastern districts of Nagaland that include Tuensang, Mon, Kiphire, Longleng, Noklak and Shamator and provides for the devolution of powers over 46 subjects to the new authority. The agreement was signed in the presence of Union Home Minister and Minister of Cooperation Amit Shah and Nagaland Chief Minister Neiphiu Rio. Calling the day “a very significant moment\" for a dispute-free Northeast, Shah said the Modi government is committed to resolving every long-pending issue through dialogue and democratic means. He noted that since 2019, the Centre has signed 12 major agreements in the region, stressing that, unlike earlier governments, the current administration ensures their implementation “in letter and spirit.\" Shah assured ENPO representatives that the Centre would actively support the development of Eastern Nagaland and shoulder its responsibilities. A fixed amount will be allocated annually for the region’s development, while the Union Ministry of Home Affairs will bear the initial expenditure for setting up the FNTA. The Home Minister said people of Eastern Nagaland had long felt deprived since the state’s formation and acknowledged the region’s strategic importance. He credited sustained efforts by the Ministry of Home Affairs for bridging differences between the ENPO and the Nagaland government, leading to the resolution of the dispute. Expressing gratitude to Chief Minister Neiphiu Rio and the Nagaland cabinet, Shah said their openness and cooperation helped take negotiations to a logical conclusion. “There will now be no obstacles in the path of Eastern Nagaland’s development,\" he said, adding that the agreement reflects the government’s commitment to fulfilling the genuine aspirations of the people. Under the arrangement, a mini-secretariat for the FNTA will be set up, headed by an Additional Chief Secretary or Principal Secretary. Development outlay for Eastern Nagaland will be shared in proportion to population and area. The agreement clarifies that it does not affect the provisions of Article 371(A) of the Constitution. The pact envisages accelerated development of Eastern Nagaland through greater financial autonomy, enhanced decision-making, improved infrastructure, economic empowerment and optimal use of resources. Senior officials from the Centre and the Nagaland government, along with the Deputy Chief Minister and other dignitaries, were present at the signing ceremony.",
        "link": "https://www.news18.com/india/centre-nagaland-govt-naga-tribes-body-sign-pact-to-create-frontier-nagaland-territorial-authority-ws-l-9882805.html",
        "date": "Thu, 5 Feb 2026 21:40:18 +0530",
        "fetched_at": "2026-02-06 03:55:03.203419"
    },
    {
        "title": "204 Special Train Trips For Holi Announced By North Central Railway | Check Routes",
        "content": "To deal with heavy passenger rush likely during Holi festival, the North Central Railway (NCR) has released a comprehensive plan to ensure smooth travel across key corridors. According to the zonal railway, 204 trips of special trains have been notified. The statement issued by the NCR, stated it will have primary ownership of five pairs of special trains, totalling 10 trains and 36 trips. “These trains will originate from key stations from NCR to accommodate travelers heading towards Mumbai, Pune, and South India. These services are scheduled to operate as per respective time tables from February 15, 2026, to March 31, 2026, facilitating travel during the peak festive period,\" it said. The 204 trips of special trains will pass through the NCR network, covering various stations including important stations like Agra, Kanpur, Prayagraj, and Jhansi, among others. The NCR said that the ticket booking for these “Festival Specials\" will begin soon. “Passengers can check specific train numbers, timings, and availability on the IRCTC website or the NTES app. These are the trains notified till date and the services of more special trains will be notified as per the requirement and increase in rush,\" it said, adding that passengers should book early to secure confirmed berths.",
        "link": "https://www.news18.com/india/204-special-train-trips-for-holi-announced-by-north-central-railway-check-routes-ws-l-9882787.html",
        "date": "Thu, 5 Feb 2026 21:31:57 +0530",
        "fetched_at": "2026-02-06 03:55:03.831989"
    },
    {
        "title": "'To Protect Buyers, Deliver Their Dream Homes': SC Asks NBCC To Take Over Stalled Supertech Projects",
        "content": "The Supreme Court on Thursday intervened to bring relief to thousands of Supertech homebuyers, issuing a landmark ruling for the state-owned National Buildings Construction Corporation to take over and finish 16 stalled projects under the real estate developer. The court said this is to protect thousands who have waited over a decade for their Supertech housing units and to finally deliver their “dream homes\" to them. By invoking its extraordinary powers under Article 142 of the Constitution, the SC said the National Buildings Construction Corporation (NBCC) must take over. A bench comprising Chief Justice Surya Kant and Justice Joymalya Bagchi used these plenary powers to uphold a December 2024 order by the National Company Law Appellate Tribunal (NCLAT). The court said approximately 51,000 homes had been booked between 2010 and 2012, leaving families in limbo for years. To ensure progress remains uninterrupted, the bench has prohibited other legal bodies, including all high courts and tribunals, from issuing orders that might freeze the ongoing work. This is intended to allow the NBCC to complete the debt-ridden projects expeditiously and without further judicial interference. The apex court said judicial priority is now focused entirely on the delivery of completed homes equipped with essential utilities, rather than the immediate demands of corporate creditors. Chief Justice Surya Kant made it clear that the interests and dues of financial and operational creditors will only be addressed after the delivery of fully-furnished houses to the buyers. These must have all the assured facilities, including water, electricity, sewage connections, roads, and parks. As a result of this prioritisation, financial lenders are expected to accept reduced payments, or a “haircut\", to facilitate the recovery process. The bench described these reduced payments as “just and equitable\" and ruled that the NBCC’s takeover is not contrary to the Insolvency and Bankruptcy Code (IBC). “We find that the order passed by the NCLAT on December 12, 2024, in bringing the NBCC on record for the completion of the pending housing projects is neither unfair nor contrary to the provisions of the Insolvency and Bankruptcy Code (IBC),\" the bench ordered while taking recourse of Article 142, which grants the top court plenary power to pass any decree or order necessary for doing “complete justice\" in any case. The NBCC will now undertake the projects – previously estimated to cost approximately Rs 9,500 crore – with the support of an expert committee. While disposing of the pleas, the bench noted that parties may still approach the court should any new developments obstruct the ongoing construction. On February 21, 2025, the court had stayed an order appointing the NBCC as the project management consultant to complete the 16 housing projects of Supertech at a cost of nearly Rs 9,500 crore.",
        "link": "https://www.news18.com/india/to-protect-buyers-deliver-their-dream-homes-sc-asks-nbcc-to-take-over-stalled-supertech-projects-ws-l-9881884.html",
        "date": "Thu, 5 Feb 2026 20:05:13 +0530",
        "fetched_at": "2026-02-06 03:55:04.472531"
    },
    {
        "title": "Poll Body's Big Attack On TMC Govt, Cites 'Systematic Pattern Of Violence' Against Officials",
        "content": "The Election Commission of India (ECI) has accused the Trinamool Congress (TMC) government in West Bengal of “systematic pattern of violence and threats\" against election officials, while also alleging police of unwillingness to act against such incidents. After West Bengal Chief Minister Mamata Banerjee appeared in the Supreme Court and spoke against the Special Intensive Revision (SIR) of electoral rolls, the poll body filed a counter in the apex court, alleging numerous instances of violence, intimidation and obstruction against election officials engaged in the SIR process. Sujeet Kumar Mishra, Secretary, ECI, alleged a “pervasive reluctance\" among local police authorities to register FIRs in response to grievances articulated by BLOs, and many of them were only filed after the direct intervention of the DEO (District Election Officer). While other states promptly adhered to ECI directives regarding SIR, West Bengal willfully neglected to do so. In its response, the ECI claimed that protesters claiming to be BLOs attempted forceful entry into the office of Bengal’s Chief Electoral Officer (CEO), broke the police blockade and vandalised the office. It said officers were prevented from entering and leaving the office complex as the office was also gheraoed, resulting in significant impediments to the execution of duties by officers. The ECI said it directed the Kolkata Police Commissioner to ensure that no untoward incident occurs again. Despite explicit directives to the police, the protesters were not removed and remained in the office premises for 28 hours. It further said that the CEO was the sole electoral official in the country who had been accorded ‘Y+’ category security. It also detailed a disturbing pattern of conduct “previously unseen during electoral roll revision exercises\" in Bengal, including a statement by a cabinet minister that he will “break the legs of Election Commission\". The poll agency observed that groups of women, allegedly mobilised by political operatives, obstructed the activities of BLOs and EROs. The Election Commission also observed that Chief Minister Mamata Banerjee “persistently delivered a series of public addresses that are inherently provocative, thereby engendering an atmosphere of intimidation among the election officials tasked with the separation and revision of the electoral roll.\" It also accused the CM of engaging in fear-mongering, disseminating misleading and erroneous information about the SIR process and threatening election officials, which prompted several observers to withdraw from their SIR responsibilities due to fear of violent assaults. It also said BLOs are facing overwhelming stress due to systematic police indifference and the failure to register FIRs, interference by Booth Level Agents of political factions. A roll observer reported that women’s mob in Debipur shouting “BJP dalal\" slogans, chasing team with broomsticks after the CM’s “kitchen tools\" call. The affidavit blamed “inadequacies of state machinery\" and “prevailing climate of political interference\" for a “singular and alarming breakdown\" in West Bengal SIR. The Commission warned that political rhetoric from TMC leaders vitiates conditions for a “free, fair and fearless\" revision process in West Bengal. Mamata Banerjee has previously characterised the exercise as a vehicle for “unspeakable harassment\", alleging it has resulted in “as many as 140 deaths\" and violates the Representation of the People Act. In a series of letters addressed to the CEC, she has sounded an alarm on what she describes as “institutional overreach\" and a “dangerous erosion of trust\" in democratic processes.",
        "link": "https://www.news18.com/india/ecis-big-attack-on-tmc-govt-claims-systematic-pattern-of-violence-against-poll-officials-ws-kl-9882552.html",
        "date": "Thu, 5 Feb 2026 20:14:32 +0530",
        "fetched_at": "2026-02-06 03:55:05.132491"
    },
    {
        "title": "News18 Evening Digest: PM Modi Slams Congress, Hails Govt's Big Trade Deals & Other Top News",
        "content": "In today’s evening digest, News18 brings you the latest updates on PM Modi’s address during Rajya Sabha as he hailed India’s trade deals with the United States and the European Union; Amit Shah launched Bharat Taxi, a cooperative-owned platform that enables drivers to operate as owners, and other top news. ‘No Vision, No Willpower’: PM Modi Slams Congress, Touts Govt’s Big Trade Deals With US, EU Prime Minister Narendra Modi said India’s trade deals with the United States and the European Union have generated a sense of economic stability and forward momentum, while opening up wide-ranging opportunities for the country’s youth. Speaking in the Rajya Sabha during the Motion of Thanks to the President’s Address, PM Modi said, “After the trade deal with the US, there is a feeling of stability, there is also a feeling of movement of going forward.\" Read more ‘Sahkar, Not Sarkar’: Amit Shah Launches Bharat Taxi Service, Promises Big Benefits For Drivers Union Home Minister Amit Shah on Thursday launched Bharat Taxi, a cooperative-owned platform that enables drivers to operate as owners, ensuring zero commission and eliminating surge pricing. The service aims to compete with apps like Uber and Ola. Read more ‘You Appear In Court To Defend Illegals’: PM Modi’s Jibe At Mamata Banerjee’s SIR Plea Prime Minister Narendra Modi on Thursday launched a scathing attack on the ruling Trinamool Congress in West Bengal, alleging that it is compromising the youth of the state by “inviting\" illegal immigrants. Without naming her, Modi took a jibe at Chief Minister Mamata Banerjee’s petition against the ongoing special intensive revision (SIR) of electoral rolls in her state. Read more 16 Labourers Killed, Several Trapped After Explosion Rocks Meghalaya Coal Mine At least 16 labourers were killed, and several others are feared trapped after an explosion at an “illegal\" coal mine in Meghalaya’s East Jaintia Hills district on Thursday, Director General of Police I Nongrang said. She said rescue teams are conducting search operations and added that the incident took place in the Thangsku area in the morning. Read more ‘Korean Was Our Life’: Ghaziabad Sisters’ Diary Flags Distress, Isolation Before Deaths Fresh details have emerged after a pocket diary was recovered from the room of the three minor sisters who jumped to death from the ninth floor of a high-rise in Ghaziabad. The nine-page diary, believed to have been written by the eldest of the three siblings, has been taken into custody as part of the ongoing probe. Read more Honeymoon Murder 2.0: Man Dies In Hit-And-Run Planned By Wife, Her Boyfriend On a breezy Friday evening, a newlywed couple from Rajasthan – Ashish and Anju – went out for a walk, just when a vehicle hit them. While Ashish died on the spot, Anju was robbed of her gold jewellery and left unconscious on the road. Pakistan’s ‘Brotherhood With Muslim Cousins’ Termed ‘Disaster’ For India: ‘We’re Not Going…’ Pakistan’s show of solidarity with the Bangladesh cricket team could spell ‘disaster’ for India and the ICC, feels former England cricketer Mark Butcher, who says the raging controversy has its roots in the past when BCCI refused to send their team across the border for the Champions Trophy in 2025. Read more Ranbir Kapoor Drops BIG Hint About Sandeep Reddy Vanga’s Animal Park: ‘There’s Another Character…’ The journey of Animal is far from over. Months after the film’s explosive run at the box office, Ranbir Kapoor and director Sandeep Reddy Vanga have begun openly speaking about its sequel, Animal Park, offering fans fresh insight into what lies ahead.",
        "link": "https://www.news18.com/india/news18-evening-digest-pm-modi-slams-congress-hails-govts-big-trade-deals-other-top-news-ws-l-9882308.html",
        "date": "Thu, 5 Feb 2026 18:47:19 +0530",
        "fetched_at": "2026-02-06 03:55:05.836229"
    },
    {
        "title": "PM Modi Quotes Indira Gandhi To Criticise Congress Govt's Functioning: ‘Knew Shortcomings But...'",
        "content": "Prime Minister Narendra Modi launched a sharp attack on former Prime Minister Indira Gandhi’s development record, citing what he called systemic rigidity in India’s planning apparatus that hampered infrastructure projects for generations. Addressing Parliament during the Motion of Thanks to the President’s Address, PM Modi invoked Indira Gandhi’s own acknowledgment of the disconnect between policymakers and ground realities, using it to criticize the Planning Commission she once chaired. “I had gone to Himachal Pradesh. When I returned, I told the Planning Commission that our workers need mules, not jeeps. But we were told that the funds are only available for jeeps; there is no policy to fund mules. They said, if there are no proper roads, then what use is a jeep,\" PM Modi said, quoting Indira Gandhi’s remarks. PM Modi said this reflected “a system that knew its shortcomings but did not reform itself.\" The Planning Commission, established in 1950 with Jawaharlal Nehru- Indira Gandhi’s father- as its first chairman, was responsible for drafting and implementing India’s Five-Year Plans. The Planning Commission was dissolved in 2014 under PM Modi’s government and replaced with NITI Aayog. PM Modi highlighted the Congress party’s historical failure to deliver timely and efficient development, asserting, “A significant part of our energy is being spent on correcting the mistakes of the past. It takes great effort to erase the image that was created in the minds of the world during that period.\" The Prime Minister also cited the Sardar Sarovar Dam on the Narmada River as a case study of delayed execution and policy inertia under previous administrations. The multipurpose dam’s foundation stone was laid in 1961 but it officially became operational only in 2017- more than five decades later and roughly 30 years after construction began in earnest. The Sardar Sarovar Dam, part of the broader Narmada Valley development initiative, faced numerous obstacles over its decades-long journey. Construction was stalled in the 1990s by court orders related to rehabilitation and resettlement conditions for displaced communities. Procedural and clearance issues further bogged down progress, keeping it mired in administrative hurdles. PM Modi contrasted the delays and inefficiencies of past governments with his administration’s emphasis on future-ready policies, strategic governance and faster project execution, arguing that India is now on a more decisive development path. “That is why we have placed strong emphasis on future-ready policies. Today, the country is being governed on the basis of policy and strategy,\" PM Modi said.",
        "link": "https://www.news18.com/india/pm-modi-quotes-indira-gandhi-to-criticise-congress-govts-functioning-knew-shortcomings-but-ws-l-9882188.html",
        "date": "Thu, 5 Feb 2026 18:26:59 +0530",
        "fetched_at": "2026-02-06 03:55:06.578216"
    },
    {
        "title": "Playing Obscene Songs In Public? Jail And Fines Await, Warns Bihar Govt",
        "content": "The Bihar government has announced a strict crackdown on the playing of obscene and double-meaning songs in public places and vehicles, warning of legal action, including fines and imprisonment, for violators. Deputy Chief Minister and Home Minister Samrat Choudhary has issued firm directions to the police headquarters, instructing officers across all districts to immediately stop the playing of vulgar songs, whether in Bhojpuri, Magahi, Maithili or any other language. He has asked the police to launch special drives to identify offenders and initiate strict legal action against them. Mr Choudhary said the decision was taken in the interest of social decency and public safety, noting that obscene songs played in public spaces have a deeply negative impact on society, particularly on children. He added that such content not only promotes vulgarity but also undermines women’s safety and dignity. Banning obscene songs, he said, is essential to creating a secure and respectful environment for women. As part of the move, obscene songs will no longer be permitted in buses, auto-rickshaws, taxis, trains or any other public place. Following the government’s directive, Bihar Police has launched a statewide campaign along with a public appeal under the slogan “No obscene songs, build a civilised society\". The police have clarified that playing obscene or double-meaning songs in public will now be treated as a serious punishable offence. Drivers and vehicle owners found violating the order will face heavy fines and may also be sent to jail. Under the new enforcement measures, police will register cases under Sections 296 and 79 of the Bharatiya Nyaya Sanhita (BNS), 2023, along with other applicable provisions. Citizens have been urged to oppose such acts and report violations to the nearest police station. The state government has emphasised that public participation is crucial to eliminating obscenity from public life. Bihar Police, appealing to citizens, said a civilised and safe society can be achieved not only through strict laws but also through collective responsibility and cooperation.",
        "link": "https://www.news18.com/india/playing-obscene-songs-in-public-jail-and-fines-await-warns-bihar-govt-ws-kl-9881890.html",
        "date": "Thu, 5 Feb 2026 18:04:18 +0530",
        "fetched_at": "2026-02-06 03:55:07.204977"
    },
    {
        "title": "'No Vision, No Willpower': PM Modi Slams Congress, Touts Govt's Big Trade Deals With US, EU",
        "content": "Prime Minister Narendra Modi said India’s recent trade agreements with the United States and the European Union have generated a sense of economic stability and forward momentum, while creating wide-ranging opportunities for the country’s youth. Addressing the Rajya Sabha during the Motion of Thanks to the President’s Address, PM Modi described the agreements as “future‑ready\" pacts that are strengthening India’s position in the global economy. “After the trade deal with the US, there is a feeling of stability and a sense of forward movement,\" he said. The Prime Minister said India is increasingly signing major trade deals with key global partners. “In the past few days, we have signed agreements with nine significant nations. The most comprehensive of these is with a bloc of 27 countries, including the European Union,\" he added. PM Modi highlighted that major economies are keen to strengthen trade ties with India. “Countries around the world are eager to expand trade relations with India. Whether it is the EU deal or the recent pact with the US, these agreements are receiving broad international praise,\" he said. He also stressed the global significance of these agreements. “When we signed the trade deal with the EU, the world became more confident about the greater likelihood of global stability. After the trade deal with the US, the world became even more confident that with stability, they can sense a speed too. This is a positive sign for the world,\" the Prime Minister said. Highlighting the domestic impact, PM Modi said the agreements would directly benefit India’s youth across regions and social groups. “The US trade deal will be most beneficial to the youth, including those from urban areas and rural, as well as for girls and boys. The demand for young professionals is growing around the world, and since so many foreign companies are setting up here, the opportunities are abundant for Indian young professionals as well,\" he said. Placing India’s economic trajectory in a broader geopolitical context, the Prime Minister said the world is witnessing a major transition. “There was a new world order after the Second World War, and now the world is moving towards a new world order. The bent is towards India, which is a vishvabandhu,\" he said. Launching a sharp attack on the Congress, PM Modi said past governments had left behind a damaged global image. “A significant part of our energy is being spent on correcting the mistakes of the past. It takes great effort to erase the image that was created in the minds of the world during that period. They left things in such a damaged state,\" he said. He said this is why the NDA government has prioritised long-term policy planning. “That is why we have placed strong emphasis on future-ready policies. Today, the country is being governed on the basis of policy and strategy,\" PM Modi said, taking a swipe at past controversies. “Even now, when people speak about them, they don’t talk about trade deals. They talk about deals like Bofors,\" he said. Asserting that global confidence in India is steadily rising, the Prime Minister said, “Global trust in India is growing. Guided by the mantra of ‘reform, perform, transform,’ we have moved forward, and the reality today is that the nation has boarded the Reform Express.\" Describing the current decade as a defining phase for India, he added, “The first quarter of the 21st century has completed. But this second quarter is decisive, just like the second quarter of India’s freedom struggle in the last century was. I can clearly see that in the direction of building Viksit Bharat, this second quarter is going to be equally capable.\"",
        "link": "https://www.news18.com/india/no-vision-no-willpower-pm-modi-slams-congress-touts-ndas-big-trade-deals-ws-l-9882048.html",
        "date": "Thu, 5 Feb 2026 18:12:47 +0530",
        "fetched_at": "2026-02-06 03:55:07.859640"
    },
    {
        "title": "Asaram's Ashram To Be Demolished? Gujarat HC Allows Govt To Take Over Rs 500-Crore Land",
        "content": "The long-running dispute over nearly 45,000 square metres of land at Asaram’s ashram in Motera, Ahmedabad, has reached a decisive end, with the Gujarat High Court allowing the state government to reclaim the land, paving the way for the removal of illegal constructions and future development. Following the ruling, authorities have accelerated preparations to clear unauthorised structures from the ashram complex. The land has been earmarked for expansion of the Sardar Patel Sports Enclave, a key project linked to the state’s preparations for the Commonwealth Games 2030. According to official records, the premises contained at least 32 illegal structures, valued at around Rs 500 crore. Investigations found that these structures were not only illegal but were also being used for commercial purposes. Citing violations of building rules and encroachment on government land, the collector’s office had earlier issued notices to the ashram trust. The trust subsequently sought to regularise the constructions by paying an “impact fee\", but the request was rejected by the authorities, leading to the legal battle. Delivering the verdict, Justice Vaibhavi Nanavati ruled in favour of the state, observing that the government’s action was justified in view of serious rule violations and the larger public interest involved in development projects. With the court’s clearance, the Ahmedabad Municipal Corporation is now authorised to remove the illegal structures at any time after completing security and procedural formalities. Officials said the land would be utilised for a modern sports complex, training facilities and a proposed Olympic village as part of the Sports Enclave project. The verdict is being seen as a significant boost to Gujarat’s infrastructure plans, particularly its ambition to host the Commonwealth Games 2030. State officials have maintained that world-class sports facilities are essential for the event and that the Motera land is strategically critical to these preparations. Asaram, who is serving a life sentence in a rape case and was recently granted conditional bail on medical grounds, visited the Surat ashram on January 2 after nearly 13 years. Videos showing followers welcoming him with music and celebrations had drawn public attention.",
        "link": "https://www.news18.com/india/asarams-ashram-to-be-demolished-gujarat-hc-allows-govt-to-take-over-rs-500-crore-land-ws-kl-9881465.html",
        "date": "Thu, 5 Feb 2026 15:43:06 +0530",
        "fetched_at": "2026-02-06 03:55:08.490597"
    },
    {
        "title": "'Sahkar, Not Sarkar': Amit Shah Launches Bharat Taxi Service, Promises Big Benefits For Drivers",
        "content": "Union Home Minister Amit Shah on Thursday launched Bharat Taxi, a cooperative-owned platform that enables drivers to operate as owners, ensuring zero commission and eliminating surge pricing. The service aims to compete with apps like Uber and Ola. The Cooperation Ministry described Bharat Taxi as a transformative initiative in the mobility sector, placing drivers —referred to as sarathis (charioteers) — at the centre of ownership, operations, and value creation, thereby freeing them from exploitative aggregator-based models. Speaking at the launch event, Amit Shah said the Bharat Taxi service will provide major convenience for taxi drivers, saying that “sahkar (helper), not Sarkar (government)\" is formally entering the taxi sector. “In this system, every driver (Sarathi) is the owner of the taxi, and this structure will bring a revolutionary economic transformation. Like Amul in Gujarat, this is a unique cooperative model of its kind in the world. The wheels of your taxi will run for the benefit of the Sarathi community—this is the spirit of cooperation,\" he said. Shah further revealed that Bharat Taxi was envisioned as a unified mobility platform that offered two-wheelers, three-wheelers and four-wheelers. “Bharat Taxi “Sarathi Didi\" will play a key role in ensuring the safety, dignity, and empowerment of women riders and drivers,\" he added. The Home Minister said the taxi service will be rolled out in three years, and the government will charge 20% of the revenue earned by the platform, while the rest will be transferred into the accounts of each Sarathi. “Until now, fares were first credited to the company’s account and a commission was deducted. That system ends here. Bharat Taxi will charge zero commission. Not even one percent,\" he added. “All payments will be transferred directly from the customer to the Sarathi’s account — no middleman, no delays.\" Furthermore, the platform will also exclude booking fees, heavy platform charges, and hidden commissions from the Sarathi app, making it more convenient for drivers and travellers. All the profits earned will be directly transferred into accounts of the drivers associated with the Bharat Taxi service. However, Amit Shah also cautioned drivers to maintain professional standards and behaviour with travellers. The event was also graced by Union Minister of State for Cooperation Krishan Pal Gurjar; Union Minister of State for Cooperation Murlidhar Mohol; Dr. Ashish Kumar Bhutani, Secretary, Ministry of Cooperation and other senior dignitaries. The Cooperation Ministry said Amit Shah will distribute share certificates to the top six performing Sarathis, further reinforcing the core principle of ‘Sarathi Hi Malik’. Each honoured Sarathi will be provided with a personal accident insurance cover of Rs 5 lakh and a family health insurance cover of Rs 5 lakh, reflecting Bharat Taxi’s commitment to driver welfare and long-term social security. Bharat Taxi prioritises social security for Sarathis through health insurance, accident insurance, retirement savings, and a dedicated driver support system. Support centres are being operated at seven key locations in Delhi. The platform provides rapid emergency assistance, verified ride data, and allows drivers the freedom to work on other platforms without any exclusivity clauses. To promote women’s empowerment, initiatives such as “Bike Didi\" are being implemented, under which more than 150 women drivers have joined Bharat Taxi so far.",
        "link": "https://www.news18.com/india/sahkar-not-sarkar-amit-shah-launches-bharat-taxi-service-promises-big-benefits-for-drivers-9881648.html",
        "date": "Thu, 5 Feb 2026 15:59:27 +0530",
        "fetched_at": "2026-02-06 03:55:09.152054"
    },
    {
        "title": "SC Directs West Bengal Govt To Recalculate DA, Pay Pending Arrears, 1st Installment By March 31",
        "content": "In a major relief for West Bengal Government employees, the Supreme Court on Thursday directed the Mamata Banerjee-government to refix Dearness Allowance (DA) for its employees for the period 2008 to 2019, holding that DA must be calculated as per the formula laid down in the ROPA Rules. The court said DA is a statutory right as it forms part of the calculation of total emoluments under these rules. SC ordered that arrears of DA from 2009 to 2019 be released to the employees. Considering the financial implications, the Supreme Court set up a committee headed by former Supreme Court judge Justice Indu Malhotra. The panel will also include two retired High Court Chief Justices and the Comptroller and Auditor General (CAG) or a senior officer deputed by the CAG to determine the payment of DA to Bengal state employees. The bench comprised Justice Sanjay Karol and Justice P K Mishra. The committee will calculate the total dearness allowance due and set a payment schedule in consultation with state authorities. The Supreme Court directed completion of this exercise before March 6, 2026. It also ordered the first installment to be paid by March 31, 2026, extending benefits to retired employees. The appeals were filed by the state of West Bengal after it faced adverse orders in earlier litigation. The court framed and examined 13 questions, including the scope of powers under Article 309 of the Constitution, the scope of the ROPA Rules, whether state rules on DA align with ROPA, whether DA is static or dynamic, and whether employees’ legitimate expectations were violated. It also examined the impact of directions of the Central Administrative Tribunal to follow AICPI rules, whether financial capacity can be grounds to deny DA, and whether DA is a fundamental right. The court held that DA is not static and is subject to change under the rules. It said DA is necessary for computing total emoluments. The Supreme Court said the West Bengal government’s decision to change DA rules was a deviation without underlying reasons or principles and described the decision as “capricious\". The court observed that employees had legitimate expectations due to changes in the ROPA and AICPI rules. It rejected the state’s argument that the Centre was imposing its power, calling it a “figment of imagination\". On judicial review, the court said that once a right is conferred on employees, fiscal policy cannot stand in the way of granting it. The court, however, left the question of whether DA is a fundamental right to be decided in an appropriate forum.",
        "link": "https://www.news18.com/india/sc-directs-west-bengal-govt-to-recalculate-da-pay-pending-arrears-1st-installment-by-march-31-9881147.html",
        "date": "Thu, 5 Feb 2026 14:03:44 +0530",
        "fetched_at": "2026-02-06 03:55:09.791565"
    },
    {
        "title": "You Cancelled Your Train Ticket, Railways Made Rs 90 Crore From It",
        "content": "Railway ticket cancellations are often seen as a minor inconvenience for passengers, but over time, they add up to significant numbers for the system. Recent data from South Western Railway shows how routine changes in travel plans have translated into substantial revenue, offering a glimpse into shifting post-pandemic travel behaviour and the growing flexibility passengers expect from train journeys. Data from South Western Railway shows that cancellation charges, also known as clerkage fees, brought in about Rs 90.4 crore between 2021 and 2025 across its Bengaluru, Mysuru, and Mangaluru divisions. In 2021, when train services were still restricted due to Covid-19 protocols, revenue from ticket cancellations was negligible, amounting to just a few lakh rupees. However, as services resumed and passenger confidence returned, cancellation collections rose sharply. In 2022, South Western Railway earned around Rs 28 lakh through cancellations. The number surged in the following years, reaching about Rs 27 crore in 2023, Rs 30.3 crore in 2024, and approximately Rs 32.9 crore in 2025. Officials say the steady increase mirrors the return of regular travel and greater flexibility in how passengers plan their journeys. Railway officials say most cancellations occur due to changes in travel plans, waiting-list tickets failing to get confirmed, or passengers opting for alternative modes of transport. They clarified that the rise in cancellation revenue is not linked to ticket hoarding or misuse but reflects more dynamic travel decisions. As train connectivity stabilised after the pandemic, more passengers booked tickets early, confident that services would operate as scheduled. At the same time, the option to cancel when plans changed meant a higher number of tickets were refunded with applicable deductions. Under Indian Railways rules, cancellation charges vary based on the time of cancellation and the class of travel. When a ticket is cancelled more than 48 hours before departure, a fixed clerkage fee is deducted. This ranges from Rs 240 for AC First Class to Rs 60 for Second Sitting, with different slabs for other classes. If a ticket is cancelled between 48 hours and 12 hours before departure, 25 percent of the fare is deducted, subject to the minimum clerkage applicable to that class. Closer to departure, higher deductions apply. South Western Railway has collected more than Rs 90 crore from ticket cancellation charges over the last five years, turning last-minute changes in passenger travel plans into a steady revenue stream. The figures highlight how rail travel has rebounded after the pandemic, with more passengers booking reserved tickets and cancelling them when plans change. Despite the sharp rise in cancellation revenue, railway officials said there has been no significant increase in passenger complaints related to cancellation charges in the South Western Railway zone. This suggests that most travellers are aware of the rules and accept the deductions as part of the booking process. For frequent rail travellers in Karnataka and neighbouring regions, the data underlines the importance of planning cancellations carefully to minimise deductions. While cancellation charges help railways offset administrative and operational costs, passengers can avoid higher losses by cancelling tickets well in advance. Officials expect cancellation revenue to remain stable as travel demand normalises, reflecting both the growing use of reserved tickets and the flexibility passengers now expect from rail travel. In 2021, when train services were still restricted due to Covid-19 protocols, revenue from ticket cancellations was negligible, amounting to just a few lakh rupees. However, as services resumed and passenger confidence returned, cancellation collections rose sharply. In 2022, South Western Railway earned around Rs 28 lakh through cancellations. The number surged in the following years, reaching about Rs 27 crore in 2023, Rs 30.3 crore in 2024, and approximately Rs 32.9 crore in 2025. Officials say the steady increase mirrors the return of regular travel and greater flexibility in how passengers plan their journeys. Railway officials say most cancellations occur due to changes in travel plans, waiting-list tickets failing to get confirmed, or passengers opting for alternative modes of transport. They clarified that the rise in cancellation revenue is not linked to ticket hoarding or misuse but reflects more dynamic travel decisions. As train connectivity stabilised after the pandemic, more passengers booked tickets early, confident that services would operate as scheduled. At the same time, the option to cancel when plans changed meant a higher number of tickets were refunded with applicable deductions. Under Indian Railways rules, cancellation charges vary based on the time of cancellation and the class of travel. When a ticket is cancelled more than 48 hours before departure, a fixed clerkage fee is deducted. This ranges from Rs 240 for AC First Class to Rs 60 for Second Sitting, with different slabs for other classes. If a ticket is cancelled between 48 hours and 12 hours before departure, 25 percent of the fare is deducted, subject to the minimum clerkage applicable to that class. Closer to departure, higher deductions apply. South Western Railway has collected more than Rs 90 crore from ticket cancellation charges over the last five years, turning last-minute changes in passenger travel plans into a steady revenue stream. The figures highlight how rail travel has rebounded after the pandemic, with more passengers booking reserved tickets and cancelling them when plans change. Despite the sharp rise in cancellation revenue, railway officials said there has been no significant increase in passenger complaints related to cancellation charges in the South Western Railway zone. This suggests that most travellers are aware of the rules and accept the deductions as part of the booking process. For frequent rail travellers in Karnataka and neighbouring regions, the data underlines the importance of planning cancellations carefully to minimise deductions. While cancellation charges help railways offset administrative and operational costs, passengers can avoid higher losses by cancelling tickets well in advance. Officials expect cancellation revenue to remain stable as travel demand normalises, reflecting both the growing use of reserved tickets and the flexibility passengers now expect from rail travel. Scan the QR code to download the News18 app and enjoy a seamless news experience anytime, anywhere.",
        "link": "https://www.news18.com/india/you-cancelled-your-train-ticket-railways-made-rs-90-crore-from-it-skn-ws-l-9881097.html",
        "date": "Thu, 5 Feb 2026 13:27:18 +0530",
        "fetched_at": "2026-02-06 03:55:10.433645"
    },
    {
        "title": "Air Force To Hold Mega Firepower Exercise 'Vayu Shakti' Near Western Border On February 27",
        "content": "The Indian Air Force (IAF) will conduct its mega firepower exercise, Vayu Shakti, on February 27, defence sources have told CNN-News18. The exercise, which will feature the frontline weapon systems and platforms of the force, will be held close to the western borders in Rajasthan and preparations for the same are ongoing. The high-profile drill will feature live armament firing and real-time weapon system engagements aimed at demonstrating the IAF’s operational readiness and combat capabilities. Delegations from around 40 countries, along with some VVIPs from within the country, will be witness to the live exercise. Frontline combat platforms, including Su-30 MKI, Rafale, LCA Tejas and Mirage aircraft, will participate and put up a show with coordinated air operations, precision strikes and integrated mission execution. Several missile systems like Akash will also be featured, the sources added. The exercise will highlight the IAF’s combat experience and deterrence capability, coming a year after Operation Sindoor in which Indian air power played a decisive role in striking Pakistani bases, downing enemy fighters and forcing Islamabad to seek a ceasefire. As part of the build-up, a Full Dress Rehearsal (FDR) is scheduled for February 24. The 2025 edition of Exercise Vayu Shakti had drawn wide attention for its scale and complexity, with extensive live firing, precision bombing and network-centric warfare drills. Multiple fighter types operated in a simulated high-intensity conflict environment, demonstrating the IAF’s ability to conduct swift, coordinated and lethal air operations across the battlespace. In 2025, the exercise saw participation of 121 aircraft, including the indigenous Tejas, Prachand and Dhruv. Indigenous Surface to Air Weapon systems Akash and Samar were placed demonstrate their capability to track and shoot down an intruding aircraft. Special operations by the IAF transport and helicopter fleets, involving the Garuds and Indian Army elements were also on display.",
        "link": "https://www.news18.com/india/air-force-to-hold-mega-firepower-exercise-vayu-shakti-near-western-border-on-february-27-ws-kl-9881023.html",
        "date": "Thu, 5 Feb 2026 13:04:46 +0530",
        "fetched_at": "2026-02-06 03:55:11.074279"
    },
    {
        "title": "Karnataka Government To Launch Special Drive To Identify, Deport Bangladeshi Immigrants",
        "content": "Karnataka Home Minister G Parameshwara has ordered a special drive to identify illegal immigrants residing in the state. Authorities have also been asked to conduct a statewide verification drive. The move comes after the Karnataka High Court pulled up the Foreigners Regional Registration Office (FRRO) and the State Government for failing to effectively identify illegal immigrants, asserting the issue must be “nipped in the bud\" as it poses a threat to national security. The government has directed the police to trace illegal Bangladeshis and other undocumented immigrants across the state. On Monday, Parameshwara announced in the Karnataka State Assembly that a special drive would be initiated to track and identify Bangladeshis and other immigrants. “I have told police officers to take the drive to identify and deport the Bangladeshis. It has come to our notice that the Bangladeshis are largely concentrated in Chikkamagaluru, Hassan, Bengaluru City, Bengaluru Rural and Kodagu,\" Parameshwara told the Assembly. The Karnataka minister further questioned the centre over the presence of Bangladesh immigrants across the country. “Who looks after the Indian border? It’s our military and the Border Security Force (BSF). How do they enter the country so easily? Isn’t this the very basic question?\" he asked. Parameshwara refuted the claims that there are lakhs of illegal Bangladeshis in Karnataka, asserting that the government will not let them roam freely. “196 people were deported after our government came to power. We have identified 370 people. Since various cases are pending against them. We have initiated the process to deport them,\" the minister told the House. The issue of illegal infiltration in the country remains a concern for the government – particularly in border states such as Assam and West Bengal – as it poses security risks, impacts employment, and strains local resources.",
        "link": "https://www.news18.com/india/karnataka-government-to-launch-special-drive-to-identify-deport-bangladeshi-immigrants-ws-l-9880705.html",
        "date": "Thu, 5 Feb 2026 11:26:41 +0530",
        "fetched_at": "2026-02-06 03:55:11.848139"
    },
    {
        "title": "‘North Indians Know Only Hindi, Sell Pani Puri’: TN Minister Sparks Fresh Language Row",
        "content": "With only a few months left for the state Assembly elections, Tamil Nadu’s Agriculture Minister MRK Panneerselvam has reignited the long-running state versus centre and two-versus-three language debate after making crude remarks about migrant workers from northern states. He said people from the north, “having learnt only Hindi\", had limited job opportunities in Tamil Nadu and ended up in menial work, while Tamilians benefitted from the state’s two-language policy, learnt English and secured jobs abroad. “… those from the north are coming to Tamil Nadu to clean tables… they are coming here to work as construction labourers pani puri sellers as they have only learnt Hindi,\" he said. “But our children have gone abroad… as we follow a two-language policy and learned English well. They are going abroad and getting opportunities to earn in crores… in USA, London.\" Panneerselvam was not the only Tamil Nadu minister to speak on the issue. Earlier in an interview with a news channel, Industries Minister TRB Rajaa offered a more nuanced view. He said the government would never stop people from speaking Hindi and pointed to the presence of large German and Japanese communities in the state. “All these foreigners can find their happiness in Tamil Nadu. I wonder why my Hindi-speaking friends can’t…\" he said, adding that the state also has a duty to protect Tamil. The ruling DMK, allied with the Congress though ties are strained over seat-share talks, is seeking a second consecutive term and a fourth straight major election win over its Dravidian rival, the AIADMK, which has joined hands with the Bharatiya Janata Party. Language, an emotive issue in Tamil Nadu, is expected to be a key campaign theme, with the National Education Policy once again in focus. The NEP triggered a massive row when it was announced in 2019 and has flared up periodically. In February last year, tensions rose again after the centre pushed its three-language policy, which requires students to learn a third language in addition to English and the state language. The Tamil Nadu government described this as an attempt to impose Hindi on non-Hindi speaking states. Historically, southern states have been wary of attempts by the centre to impose Hindi over regional languages. In Tamil Nadu, this tension led to riots in the 1930s and 1960s. The state follows a two-language policy, teaching Tamil and English in state-run schools. Education Minister Anbil Mahesh Poyyamozhi told last year that this helps students connect with their linguistic heritage while learning English allows them to engage globally. Responding to the protests from Tamil Nadu, Union Education Minister Dharmendra Pradhan told there is “no question of imposing any language\" and said the NEP would only correct an “over-reliance on foreign languages, limiting students’ exposure to linguistic roots\".",
        "link": "https://www.news18.com/india/north-indians-know-only-hindi-sell-pani-puri-tn-minister-sparks-fresh-language-row-9880690.html",
        "date": "Thu, 5 Feb 2026 11:20:24 +0530",
        "fetched_at": "2026-02-06 03:55:12.525945"
    },
    {
        "title": "Bharat Taxi Set To Launch Today; To Take On Uber, Ola With Govt-Backed Model",
        "content": "The cab-hailing landscape in India is set to undergo a massive change today as Bharat Taxi gears up for an official launch in New Delhi. Backed by the Government of India, Bharat Taxi is a cab service based on a cooperative model. Union Minister of Cooperation Amit Shah will launch the app today, February 5. In a post on ‘X’, Shah announced that Bharat Taxi — the first taxi service in the cooperative sector — will be launched today. “How many people can come together through cooperation, pooling small amounts of capital to make a big beginning —‘Bharat Taxi’ is an example of this. Today is a very important day for taxi driver sisters and brothers. The launch of ‘Bharat Taxi,’ the first taxi service in the cooperative sector started by them, will take place in New Delhi\", the minister wrote. सहकारिता से बहुत सारे लोग मिलकर छोटी-छोटी पूँजी लगाकर कैसे बड़ी शुरुआत कर सकते हैं, ‘भारत टैक्सी’ इसका उदाहरण है।आज का दिन टैक्सी चालक बहनों-भाइयों के लिए बहुत ही अहम है। उनके द्वारा शुरू की गई सहकारी क्षेत्र की पहली टैक्सी सर्विस ‘भारत टैक्सी’ का नई दिल्ली में शुभारंभ होगा।… “Through ‘Bharat Taxi,’ the driver sisters and brothers will not only be able to earn more profit but will also become its owners with dignity. I am eager to participate in this program today\", he added. Based on a cooperative model, Bharat Taxi is a ride hailing app, which is backed by the Union Government. According to an official statement from the Ministry of Cooperation, the service will place drivers “at the centre of ownership, operations, and value creation\". The government argues that the arrangement will shield the drivers against exploitation by private players. However, it might be noted that the initiave is not directly by the Government of India. Rather, it is run by Sahakar Taxi Cooperative Limited, which has been backed by key people who previously worked at Amul. Each driver, or ‘Sarathi’, holds five shares in the cooperative. Unlike private aggregators, no commission will be deducted from each fare — an effort to address longstanding complaints by drivers about high commission rates. Instead, the driver will require to pay a fixed daily fee of Rs 30 to access the app. For riders, experts have been estimating that the fares will be upto 30 per cent cheaper than private players. Unlike private aggregators, Bharat Taxi’s zero-commission model passes the benefit directly to passengers, enabling access to lower-fare cab options.",
        "link": "https://www.news18.com/india/bharat-taxi-set-to-launch-today-to-take-on-uber-ola-with-govt-backed-model-ws-l-9880417.html",
        "date": "Thu, 5 Feb 2026 09:37:23 +0530",
        "fetched_at": "2026-02-06 03:55:13.899507"
    },
    {
        "title": "The Untold Story: When An Army General's Book On India-China War Rattled Nehru In 1967",
        "content": "A political storm erupted in Parliament this week after Congress leader Rahul Gandhi sought to quote from a book by former Army Chief General MM Naravane that is yet to be published, triggering protests from the Treasury benches and forcing repeated adjournments of the House. While the incident has reignited debate over propriety and privilege, it is not without precedent. Nearly 60 years ago, a similar incident took place when a book written by a retired general caused an uproar so intense that members of the ruling Congress demanded his arrest, shaking the foundations of the government led by then-Prime Minister Jawaharlal Nehru. The book in question was The Untold Story, authored by Lieutenant General BM Kaul (Retd), who had served as the General Officer Commanding of the Indian Army’s IV Corps during the 1962 India-China war. Kaul’s corps suffered a major defeat during the conflict, following which he resigned from the Army, said a News18 Hindi report. In March 1967, he published his account of the war in the book. Rajya Sabha records show that Congress MPs raised sharp questions over the publication of the book, demanding to know whether Kaul had sought prior permission from the government or submitted his manuscript for official scrutiny before publication. Then Defence Minister Swaran Singh informed the House that Kaul had neither sought permission nor shared the manuscript with the government. Several Congress MPs demanded punitive action, with some even calling for Kaul’s arrest. Members sought clarification on whether defence personnel, serving or retired, were free to use information acquired during service in their writings. Singh responded that while serving officers were required to obtain permission, retired personnel were not, though they remained bound by the Official Secrets Act. Any violation of the law, he said, would invite action. According to reports published at the time by The Indian Express, Congress MP Rajendra Pratap Sinha asked what steps the government was taking to prevent retired generals from using sensitive or secret information acquired during service in public writings. Singh replied that the government was examining the book to determine whether it contained classified material that could attract provisions of the Official Secrets Act. Congress MP Loknath Mishra went on to describe Kaul as an “enemy informant\", questioning why he had not been detained despite allegedly exposing the functioning and shortcomings of the Defence Ministry. Another MP, G Murahari, reportedly labelled Kaul a “double agent\". The Defence Minister assured Parliament that the book was under careful examination and that appropriate action would be taken if violations were established. Much like Rahul Gandhi’s attempt today to question the Modi government’s policies by citing General Naravane’s forthcoming book, Kaul’s memoir in 1967 became a prism through which opposition, and even ruling party MPs, scrutinised the roles of Jawaharlal Nehru and then Defence Minister VK Krishna Menon in the 1962 debacle. MPs at the time also demanded that the government make public the Henderson Brooks Committee Report, commissioned to examine the failures of the 1962 war, arguing that Kaul’s allegations warranted transparency. That report, notably, remains classified even today.",
        "link": "https://www.news18.com/india/the-untold-story-when-an-army-generals-book-on-india-china-war-rattled-nehru-in-1967-ws-kl-9879916.html",
        "date": "Thu, 5 Feb 2026 08:24:11 +0530",
        "fetched_at": "2026-02-06 03:55:14.531990"
    },
    {
        "title": "Parliament Budget Session 2026 Updates: PM Modi Takes Dig At Gandhis, Says They Stole 'Gandhi' Surname Of A Gujarati",
        "content": "Parliament Budget Session 2026 Live Updates: Parliament witnessed fresh disruptions today, with the Lok Sabha adjourned till 12 noon shortly after proceedings began amid protests by Opposition members. In the Rajya Sabha, a heated argument broke out between the government and the Opposition. Leader of Opposition Mallikarjun Kharge accused the ruling side of not allowing Rahul Gandhi to speak earlier in the House. Union Minister Kiren Rijiju rejected the claim and said the House functions according to rules, not anyone’s wishes, and belongs to everyone. He stated the Leader of Opposition in the Lok Sabha had been given around 40 minutes by the Speaker but repeatedly spoke beyond the rules, adding it was wrong to say Rahul Gandhi was prevented from speaking. BJP president JP Nadda also attacked the Opposition, saying the Prime Minister was ready to reply to issues raised in the Lok Sabha but the House was not allowed to function. Opposition members also staged a walkout from the Rajya Sabha, but the House continued its proceedings. Union Minister Giriraj Singh strongly defended Prime Minister Narendra Modi after a political row erupted over remarks about “digging his grave.” Reacting to the controversy, Singh said that those making such statements should remember that Modi will continue to work for the country and the poor, and it is instead those spreading negativity who will face consequences. VIDEO | Budget Session: Reacting to the PM hitting back at digging of grave threats, Union Minister Giriraj Singh (@girirajsinghbjp) says, “Those who talk about digging Modi ji’s grave, they should know that he will keep on working for the country, poor, will continue working,… pic.twitter.com/MJ5mhQfBPk Congress leader Rahul Gandhi targeted Prime Minister Narendra Modi, accusing him of being “so scared of the truth” that he “sought refuge in lies.” PM Modi said, “Stealing is in their (Congress’s) family business. They stole a Gujarati surname, Mahatma Gandhi’s surname, and the people are now teaching them a lesson… We are moving forward with the resolve of a ‘Viksit Bharat,’ but they continue to raise questions about it.” PM Modi recalled how UP CM Yogi Adityanath had once broken down in the Assembly over the deaths of children due to brain fever (encephalitis), saying the previous government had failed to act. He added that his government stepped in to provide relief to affected families and also addressed Trachoma eye disease, describing these interventions as key successes that he said are now being criticised by opponents. VIDEO | Parliament Budget Session: Speaking in Rajya Sabha, PM Modi (@narendramodi) says, “Once, Uttar Pradesh CM (Yogi Adityanath) cried in the Assembly while speaking, as many children were dying due to brain fever (encephalitis), but they (previous government) didn’t do… pic.twitter.com/HG2ICppBBK During the Parliament Budget Session 2026, PM Modi targeted the Opposition, saying those talking of ‘mohabbat ki dukan’ are raising slogans like ‘Modi teri kabr khudegi’. PM Modi said the Opposition had turned Parliament into a spectacle by throwing papers at the presiding officers, which he said insulted both the Northeast and a Dalit member from Andhra Pradesh. He added that he was also hurt by the way Bharat Ratna Bhupen Hazarika was spoken about, saying such behaviour showed a lack of respect for people’s sentiments. VIDEO | Delhi: Addressing the Rajya Sabha, Prime Minister Narendra Modi says, “… One can perhaps understand disappointment, but does that justify turning the temple of the country’s sacred democracy into such a spectacle? At that time, one of our respected members from Assam… pic.twitter.com/0OQV7EJuUm PM Modi said, “The Congress party has always considered the citizens of this country as a problem. Once, Indira Gandhi visited Iran and, during a speech, quoted a conversation with her father, Nehru ji. I am quoting what she said, ‘When someone asked my father how many problems he has, he answered 35 crore.’ At that time, the country’s population was 35 crore.” Prime Minister Modi accused the Congress of having an “anti-Sikh mindset” after Lok Sabha Leader of Opposition Rahul Gandhi called BJP MP Ravneet Singh Bittu a “traitor” outside Parliament on Wednesday. PM Modi accused the Congress of repeatedly insulting the President, calling the language used against her after the elections shameful. He said the disruption of the discussion on the President’s Address in the Lok Sabha was an insult to the office, adding that those who behave this way have no moral right to speak about the Constitution. PM Modi alleged that the Congress focused more on imagination than implementation, and cited the long delay in the Bogibeel bridge project in Assam, which he said was stalled for years before his government reviewed and completed it, turning it into a key facility for Assam and the Northeast. VIDEO | Delhi: Addressing the Rajya Sabha, Prime Minister Narendra Modi said, “I am speaking about Assam, and no one should think that I am saying this because of elections. I am compelled to speak because of their (Opposition) failures. The Congress only imagines things; it has… pic.twitter.com/qC3Bq4mcUJ He said, “We wanted to raise a few things in Lok Sabha, as well as Rajya Sabha, one is in favour of democracy, also to give people relief by saving democracy. We were pursuing as per the rules, but they are adamant to not let the opposition leaders speak in Lok Sabha, as well as Rajya Sabha.” VIDEO | Budget Session: Rajya Sabha LoP and Congress president Mallikarjun Kharge (@kharge) says both the LoPs are not being allowed to speak deliberately. He says, “Today there was PM’s reply to the motion of thanks to President’s address, we wanted to listen, but we are… pic.twitter.com/ZEZIKqQ2gH PM Modi referred to a statement made by former Prime Minister and Congress leader Indira Gandhi, saying she herself had flouted the Planning Commission. Quoting her remarks from a speech in Himachal Pradesh, he said Indira Gandhi had pointed out that workers needed mules instead of jeeps but were told funds were only available for vehicles due to policy restrictions. PM Modi said that despite being aware of the problem, she had not taken steps to reform the system, adding that the Planning Commission she criticised was set up by her own father. PM Modi said the Congress had betrayed farmers, especially small landholders, and never cared for their needs. He said his government understood their pain and launched the PM Kisan Yojana to support nearly 10 crore farmers owning less than two hectares of land. VIDEO | Parliament Budget Session: Speaking in the Rajya Sabha, PM Modi (@narendramodi) says, “This Congress party has also betrayed farmers. Our country has around 10 crore farmers who own less than two hectares of land. Congress never cared for them, but we felt their pain;… pic.twitter.com/O6velOJ2HI PM Modi said the TMC leaders spoke on several issues but should also reflect on their own failures, alleging that people in West Bengal are suffering under their government and accusing them of trying to protect infiltrators by going to court, driven only by the desire to stay in power. VIDEO | Parliament Budget Session: Speaking in the Rajya Sabha, PM Modi (@narendramodi) says, “TMC leaders spoke on many issues, but they should also look at their own shortcomings. People there (in West Bengal) are suffering because of this government. They are trying to protect… pic.twitter.com/duezFo7Vmt PM Modi said that recently all-party delegations visiting different countries had witnessed a positive change in how India is viewed globally. He said representatives from across parties shared their experiences on returning, noting that India is now being engaged with by other nations on equal terms. VIDEO | Delhi: Addressing the Rajya Sabha, Prime Minister Narendra Modi said, “…Recently, when delegations from all political parties visited different countries, they too experienced this sentiment. On their return, representatives from all parties shared how positively India… pic.twitter.com/JTMkxkMp30 PM Modi said he was grateful to the people for giving him the opportunity to serve, adding that much of the government’s energy is being spent on correcting past mistakes and rebuilding India’s global image. He said the focus is now on future-ready policies, governance based on strategy, and the mantra of “reform, perform, transform,” which has strengthened global trust in India. VIDEO | Delhi: Addressing the Rajya Sabha, Prime Minister Narendra Modi said, “I bow in gratitude to the crores of people of this country who have given me the opportunity to serve. A significant part of our energy is being spent on correcting the mistakes of the past. It takes… pic.twitter.com/Ma1FQ6vjf0 Speaking in the Rajya Sabha, PM Modi said that those engaged in vote-bank politics never focus on strengthening key areas, and accused the Congress of lacking vision, which he said caused the country to suffer. He added that the Congress had no planning or foresight, and that his government is now spending significant time correcting their mistakes. VIDEO | Parliament Budget Session: Speaking in Rajya Sabha, PM Modi says, “Those who are indulged in vote-bank politics never strengthen the important aspects. As far as the Congress party is concerned, I want to say clearly that they didn’t have any vision and as a result, the… pic.twitter.com/6migBATSkq Addressing the Rajya Sabha, PM Modi said that India is now entering into future-ready trade agreements with several countries and has recently concluded major deals with some of the world’s most advanced economies, including a landmark agreement with the 27-nation European Union. VIDEO | Delhi: Addressing the Rajya Sabha, Prime Minister Narendra Modi said, “Today, India is entering into future-ready trade deals with several countries. In recent times, we have concluded major trade agreements with some of the world’s most important and advanced economies.… pic.twitter.com/wdsed2Jhvf Targeting the Congress party, Prime Minister Modi said that those who are tired or have left will one day have to answer for why they created the present condition of the country. As Opposition MPs created a ruckus in the Rajya Sabha, PM Modi said that considering LoP Mallikarjun Kharge’s age, he urged the Chairman to allow him to sit and raise slogans so that he did not face any discomfort, adding that younger members were standing at the back. #WATCH | As Opposition MPs create ruckus in Rajya Sabha, PM Modi says, “…Looking at the age of Kharge ji, I urge you, the Chairman, to let him sit and sloganeer so that he faces no discomfort. There are young people at the back. So, please permit Kharge ji to sloganeer even… pic.twitter.com/KftNfomdyh PM Modi said that in the journey towards Viksit Bharat, the past few years have seen rapid development, marking an era of change across all walks of life, with the country moving in the right direction at a fast pace. In Rajya Sabha, PM Modi says, “In the journey of Viksit Bharat, previous years have been the years of rapid development of the country. This has been the era of change in every walk of life, in evey section of society. The country is going ahead in the right direction at a fast… pic.twitter.com/CRDQE9Vh9I Opposition MPs raised slogans such as “Tanaashahi nahi chalegi”, “LoP ko bolne do” and “Can’t crush opposition voice” during Prime Minister Narendra Modi’s speech in the Rajya Sabha. Opposition MPs raised slogans such as “Tanaashahi nahi chalegi”, “LoP ko bolne do” and “Can’t crush opposition voice” during Prime Minister Narendra Modi’s speech in the Rajya Sabha. BJP MP Ravishankar Prasad said, “The speaker has expressed his anguish. In the history of the Indian Parliament, it has never happened before that the Prime Minister was forcibly prevented from speaking, surrounded, and the Speaker had to tell him not to come. What happened in the Speaker’s chamber, what the opposition and the Congress members did, and what they want to achieve? Parliament is a place for debate; express your views within the limits of the law. What kind of coercion is this? This is the Congress party under Rahul Gandhi’s leadership.” Congress MP Priyanka Gandhi Vadra said, “The Prime Minister is hiding behind the Speaker. Yesterday, he did not have the guts to come to the House because three women were standing before the bench. What nonsense is this?..There is no discussion because the govt doesn’t want discussion to happen.” Before the House was adjourned for the day, Lok Sabha Speaker Om Birla today said, “The country saw what happened in the House yesterday. Everyone saw how the MPs approached the PM’s chair in the House. I got information that any mishap could have happened. To ensure that such a situation does not arise, I conveyed to PM Modi not to come to the House.” Lok Sabha speaker Om Birla on Thursday said that he advised PM Modi not to come to Lok Sabha today. Lok Sabha proceedings have been adjourned till 3 PM amid ruckus. Lok Sabha proceedings began at 2 PM amid ruckus in Lok Sabha. Congress MP Shashi Tharoor said the Leader of Opposition should have been permitted to speak, noting the material he intended to cite was already public. “The LoP should be allowed to speak, and what is more, is that what he is quoting is already in the public domain. All he wanted to do was make his point. By raising such a big objection and not allowing him to speak, a much larger problem has been created.” Congress MP Jairam Ramesh said the Opposition’s main concern in Parliament was that the Leader of Opposition in the Lok Sabha was not allowed to speak, leading to protests and a walkout in the Rajya Sabha. ” There is only one issue in Parliament that is agitating the opposition that the LoP in Lok Sabha has been prevented from speaking in Lok Sabha. LoP in the Rajya Sabha raised this issue. Oppisition MPs in the Rajya Sabha have also walked out of the house today on this. Let me remind the PM and BJP that on 19th June 2004, Dr Manmohan Singh, the then PM, did not reply to the Motion of Thanks because he was prevented from replying. On 19th June 2002, a debate had taken place. LoP belongs not to just one party but the whole opposition. In 2005, then PM Dr Manmohan Singh had had thanked the President twice, as he could not thank him in 2004. This is the BJP’s track record…All Opposition parties are united that if Lop is not allowed to speak, then there is very little opportunity for the House to run…” Delhi | Congress MP Jairam Ramesh says,” There is only one issue in Parliament that is agitating the opposition that the LoP in Lok Sabha has been prevented from speaking in Lok Sabha. LoP in the Rajya Sabha raised this issue. Oppisition MPs in the Rajya Sabha have also walked… pic.twitter.com/rgQ1EjeHSP Congress MP Priyanka Gandhi Vadra criticised Union Minister JP Nadda for referring to Lok Sabha Leader of Opposition Rahul Gandhi as “abodh”. She said he should be allowed to speak and questioned the intent behind the remark. “He should be allowed to speak. Is this a way to talk about anyone? What are they scared of? That he will quote from a book? Or are they scared of the Epstein files? Or that we will question them on this deal (US-India trade agreement)?” #WATCH | Delhi | On Union Minister JP Nadda using the term ‘abodh’ in reference to LoP, Lok Sabha, Rahul Gandhi, Congress MP Priyanka Gandhi Vadra says, “He should be allowed to speak. Is this a way to talk about anyone? What are they scared of? That he will quote from a book? Or… pic.twitter.com/HZkXtiLxcP The Lok Sabha has passed Motion of Thanks without Prime Minister Narendra Modi’s reply amid a ruckus by the opposition. Lok Sabha has been adjourned again till 2 PM amid the ruckus. BJP MP Nishikant Dubey said the Speaker will decide whether he violated any rules and that he would abide by the ruling. He criticised Rahul Gandhi, alleging he continued speaking even after being asked to stop and showed disrespect to the Chair. Dubey added that he had brought several books, documents and files containing information “the country does not yet know.” The Lok Sabha saw uproar on Wednesday after Opposition members protested remarks made by BJP MP Nishikant Dubey during his speech in the Lower House. Referring to three books, Dubey made statements about former prime ministers Jawaharlal Nehru and Indira Gandhi, which angered Congress leaders. Nirmala Sitharaman objected to Mallikarjun Kharge’s ‘lynching’ remark and cited the beheading of a tailor in Udaipur in 2022 during Congress’ rule. Union Minister Kiren Rijiju said the House does not function according to anyone’s wishes but by rules, and it belongs to everyone. He accused Mallikarjun Kharge of misleading the House, stating that the Leader of Opposition in the Lok Sabha was given 40 minutes by the Speaker to speak but repeatedly went beyond the rules. Rijiju said it was incorrect to claim that Rahul Gandhi was not allowed to speak. Taking a swipe at the Opposition, BJP leader JP Nadda said, “In the Lok Sabha, the Prime Minister was ready to respond to the issues raised, but you did not allow the House to function.”",
        "link": "https://www.news18.com/india/parliament-budget-session-2026-live-bjp-congress-clash-rahul-gandhi-pm-modi-rajya-sabha-lok-sabha-news-today-liveblog-ws-l-9880246.html",
        "date": "Thu, 5 Feb 2026 21:03:20 +0530",
        "fetched_at": "2026-02-06 03:55:16.328637"
    },
    {
        "title": "Invite To PM Modi, Rs 100 Crore Budget: Bengal Set For Grand Ram Mandir Bhoomi Poojan | Exclusive",
        "content": "West Bengal, which has entered election mode, is all set to get its very own Ram Mandir and an invitation for the temple’s Bhoomi Poojan will soon be extended to Prime Minister Narendra Modi. The temple will come up on a private land gifted to a trust—Shri Krittibas Ram Mandir Trust. According to the trust, unlike former Trinamool Congress (TMC) MLA Humayun Kabir’s Babri Masjid plan, their grand scheme is not based on ‘micro donations’ but a sense of public participation. Hence, in next leg, in Shantipur in Nadia district where the proposed grand Ram Temple will come up, Hindus have been encouraged to carry bricks with ‘Jai Shri Ram’ inscribed on them to the temple site. “We invited representatives from BJP and RSS on Tuesday at the temple site. We held a meeting of the trust where it has been decided the Bhoomi Poojan of Bengal’s Ram Temple will be on a date when the prime minister is available. A brick with ‘Jai Shri Ram’ inscribed on it will be placed in the ground on that day,\" Litton Bhattacharya, the secretary of the trust, told News18. While the prime minister is planned to be invited through senior BJP leadership, a board about the temple has also come up outside BJP’s national headquarters in Delhi. The over-21-acre land was under Bhattacharya’s private ownership before he handed it over to the trust. According to him, the trust has already gathered Rs 100 crore, which it estimates to be the temple’s construction cost. “We have our own funds, Rs 100 crore right now. All of our trustees are well-acclaimed personalities. We don’t need to beg unlike others,\" Bhattacharya said, taking a dig at Kabir. So, how will it differ from Ayodhya’s Ram Mandir? According to its website, it will “preserve the legacy of Krittibas Ojha\", a famous medieval Bengali poet best known for writing a Bengali version of the Hindu epic Ramayan. The Bengali version, known as “Krittivasi Ramayan\", wasn’t just a translation but helped spread devotional (Bhakti) traditions and inspired later Bengali literature and culture. Bengal’s Ram Temple will project this ‘Bengali’ side of ‘Ram’ and ‘Ramayan’ through the temple. There will also be spiritual education for children focusing on moral values and stories from Ramayan, workshops for teenagers (14-25) to develop leadership skills “rooted in Dharma\", monthly gatherings for women empowerment, spiritual discourse, and skill development, weekly satsang & kirtan, yoga & wellness, and provision of scholarships. The 600-year-old original manuscript written by Krittibas was in France, claims the trust, which has now been transported to Netherlands with the personal endeavour of the trust’s president, Arindam Bhattacharjee. “Once the temple is built, the original manuscript can be brought back here,\" says Litton Bhattacharya. While Bhattacharya may wish to delink from the supposed ‘Babri’ mosque in Murshidabad, comparisons are bound to be drawn. Kabir laid the foundation stone for the Masjid replica in Rejinagar, Murshidabad, on December 6 last year, sparking a political controversy. They are reported to have collected over Rs 1.30 crore in donations by early December 2025. Construction is scheduled to begin on February 11, 2026, amid security concerns. As the polls draw near, Bengal seems set for a Ram Mandir vs Babri Masjid debate.",
        "link": "https://www.news18.com/india/invite-to-pm-modi-rs-100-crore-budget-bengal-set-for-grand-ram-mandir-bhoomi-poojan-exclusive-ws-kl-9878728.html",
        "date": "Thu, 5 Feb 2026 07:00:14 +0530",
        "fetched_at": "2026-02-06 03:55:16.977843"
    },
    {
        "title": "Gold Loan Scam: PNB Manager Accused Of Stealing Customers' Gold Worth Rs 6.5 Crore",
        "content": "The contours of a major gold loan scam at a Punjab National Bank (PNB) branch at Nawalgarh in Rajasthan’s Jhunjhunu district are gradually emerging, with investigations pointing to the alleged misappropriation of more than 4 kgs of gold valued at around Rs 6.5 crore. According to investigators, the fraud took place at the bank’s Nansa Gate branch, where the then branch manager, in collusion with two associates, is accused of siphoning off gold pledged by customers as collateral for loans. Police say the accused allegedly used the proceeds to purchase high-value land parcels and establish a dairy plant. The scam came to light after tampering was detected in gold packets stored in the bank’s strong room, triggering panic among hundreds of customers who had deposited their jewellery for gold loans. As per the police report, 73 packets were found to contain fake jewellery instead of real gold, while three other packets were discovered to be underweight compared to official records. An initial internal audit by the bank revealed a shortage of 4,198 grams of gold, pegged at approximately Rs 6.5 crore. However, police officials cautioned that the actual quantum of stolen gold would be ascertained only after a comprehensive verification of all pledged assets. Investigators noted that the gold safe was secured with a dual-key system, operated jointly by then senior branch manager Amit Kumar Jangid and deputy manager Anant Prakash Chaudhary. The irregularities surfaced on January 28, when charge of the strong room was being transferred to deputy manager Seema Mehla. Following this, the incumbent branch manager initiated an internal probe, which flagged the role of the former branch manager as suspicious. Based on the bank’s complaint, police have registered a case against Amit Kumar Jangid, Anant Prakash Chaudhary, and bank business correspondent (BC) operator Santosh Kumar. Searches have revealed that Jangid acquired properties worth several crores in recent years, including land on which a dairy plant was established. Additional properties linked to the accused have been identified at multiple locations. His family reportedly resides in Sithal village of Gudhagaurji area in Jhunjhunu. The investigation has also uncovered evidence of fictitious gold loans issued from the branch. Several loan accounts were found to be in the names of non-existent individuals, with indications that fraudulent loans may also have been sanctioned under government schemes. Police officials said the total amount embezzled in the scam would be known only after the investigation is completed, adding that preliminary findings suggest the losses could be significantly higher than initially estimated.",
        "link": "https://www.news18.com/india/gold-loan-scam-pnb-manager-accused-of-stealing-customers-gold-worth-rs-6-5-crore-ws-kl-9879893.html",
        "date": "Wed, 4 Feb 2026 20:58:36 +0530",
        "fetched_at": "2026-02-06 03:55:17.702387"
    },
    {
        "title": "Bengaluru’s 5-Year Construction Rule May Hit 68,000 Vacant BDA Plots With New Fines",
        "content": "If you own a BDA plot in Bengaluru and have been holding on to it without building a house, you may soon have to rethink your plans. The Bangalore Development Authority is considering revising penalty charges for vacant residential sites, a move that could impact tens of thousands of plot owners across the city. With more than 68,000 sites lying unused in multiple BDA layouts, authorities are now weighing stricter slab-based fines aimed at discouraging long-term land banking and encouraging timely construction. Until now, site owners were required to pay a penalty if they failed to construct a house within the permitted timeframe. However, many allottees have reportedly not paid the existing fines. In response to public demands, BDA officials are discussing a revised penalty structure that could make payments more manageable. As per existing rules, beneficiaries must construct a house within five years of allotment. The BDA had earlier planned to revise penalties by 10%, in line with guideline rates, from September 2024. However, due to low compliance, officials are now considering a slab-based penalty system. Under the proposed revision, penalties may be imposed as follows: The proposal is still under discussion and is yet to receive final approval. The BDA acquires land from farmers by paying compensation and develops layouts before allotting plots at concessional rates. However, officials have observed that several allottees purchase plots for investment purposes and delay or avoid construction for many years. Authorities state that vacant plots often create inconvenience for neighbouring residents and affect planned urban development. The penalty system is intended to discourage long-term vacancy and encourage construction within the stipulated timeframe. Earlier, BDA required house construction within two years, which was later extended to three years and then to five years. As per current regulations, if construction is not completed within the allowed period, 12.5 per cent of the site value may be deducted, and the remaining amount refunded before the plot is withdrawn. However, officials have observed cases where allottees have not built houses even after holding plots for two to three decades. Many such owners approach BDA for sale deeds later to obtain e-accounts, which reveals that construction has not taken place. In such cases, penalty charges are collected while issuing the sale deed. The BDA retains administrative control over newly developed layouts for up to ten years after allotment. During this period, some site owners construct houses, while others leave the land vacant and apply for sale deeds later. There have also been instances where plots remain vacant for up to 20 years before owners attempt to sell them. To address such situations, BDA introduced penalties for delayed construction and is now considering revising these charges according to guideline rates. Officials said that most older BDA layouts in Bengaluru continue to have vacant sites. Except for recently developed Nadaprabhu Kempegowda Layout and Arkavathi Layout, several established neighbourhoods still report unutilised plots. Vacant sites have been identified in areas including Jayanagar, BTM Layout, Banashankari, Anjanapura, HAL Layout, HBR Layout, JP Nagar, Nagarbhavi, Koramangala, HSR Layout and Indiranagar. According to BDA data, more than 68,000 plots remain vacant across 64 layouts in Bengaluru. Among these, over 20,000 sites are currently involved in various disputes. BDA Commissioner Manivannan confirmed that the revision of penalties for vacant plots was discussed during a recent management meeting. He stated that the matter will be reviewed in further detail in the upcoming meeting, after which a final decision is expected. As per existing rules, beneficiaries must construct a house within five years of allotment. The BDA had earlier planned to revise penalties by 10%, in line with guideline rates, from September 2024. However, due to low compliance, officials are now considering a slab-based penalty system. Under the proposed revision, penalties may be imposed as follows: The proposal is still under discussion and is yet to receive final approval. The BDA acquires land from farmers by paying compensation and develops layouts before allotting plots at concessional rates. However, officials have observed that several allottees purchase plots for investment purposes and delay or avoid construction for many years. Authorities state that vacant plots often create inconvenience for neighbouring residents and affect planned urban development. The penalty system is intended to discourage long-term vacancy and encourage construction within the stipulated timeframe. Earlier, BDA required house construction within two years, which was later extended to three years and then to five years. As per current regulations, if construction is not completed within the allowed period, 12.5 per cent of the site value may be deducted, and the remaining amount refunded before the plot is withdrawn. However, officials have observed cases where allottees have not built houses even after holding plots for two to three decades. Many such owners approach BDA for sale deeds later to obtain e-accounts, which reveals that construction has not taken place. In such cases, penalty charges are collected while issuing the sale deed. The BDA retains administrative control over newly developed layouts for up to ten years after allotment. During this period, some site owners construct houses, while others leave the land vacant and apply for sale deeds later. There have also been instances where plots remain vacant for up to 20 years before owners attempt to sell them. To address such situations, BDA introduced penalties for delayed construction and is now considering revising these charges according to guideline rates. Officials said that most older BDA layouts in Bengaluru continue to have vacant sites. Except for recently developed Nadaprabhu Kempegowda Layout and Arkavathi Layout, several established neighbourhoods still report unutilised plots. Vacant sites have been identified in areas including Jayanagar, BTM Layout, Banashankari, Anjanapura, HAL Layout, HBR Layout, JP Nagar, Nagarbhavi, Koramangala, HSR Layout and Indiranagar. According to BDA data, more than 68,000 plots remain vacant across 64 layouts in Bengaluru. Among these, over 20,000 sites are currently involved in various disputes. BDA Commissioner Manivannan confirmed that the revision of penalties for vacant plots was discussed during a recent management meeting. He stated that the matter will be reviewed in further detail in the upcoming meeting, after which a final decision is expected. Scan the QR code to download the News18 app and enjoy a seamless news experience anytime, anywhere.",
        "link": "https://www.news18.com/cities/bengaluru-news/bengalurus-5-year-construction-rule-may-hit-68000-vacant-bda-plots-with-new-fines-tyd-ws-l-9879433.html",
        "date": "Wed, 4 Feb 2026 18:23:45 +0530",
        "fetched_at": "2026-02-06 03:55:18.367126"
    },
    {
        "title": "Yumnam Khemchand Singh Takes Oath As Manipur Chief Minister After President's Rule Ends",
        "content": "BJP Manipur Legislature Party leader Yumnam Khemchand Singh took oath as the Chief Minister of Manipur on Wednesday, as the President’s Rule ended after nearly a year in the ethnic strife-torn state. Manipur Governor Ajay Bhalla administered the oath to Khemchand at the Lok Bhavan in Imphal. The ceremony was attended by several BJP legislators, senior party functionaries, and top leaders of the NDA in Manipur. #WATCH | Imphal: BJP Manipur Legislature Party leader Yumnam Khemchand Singh takes oath as the Chief Minister of ManipurGovernor of Manipur Ajay Bhalla administers the oath at the Lok Bhavan. pic.twitter.com/Ri1Et4J0Oa “Manipur will play an important role in the Viksit Bharat 2047. Manipur consists of 36 communities, and we hope to bring a peaceful atmosphere in the state,\" he said after his oath-taking ceremony. On February 3, more than 45 MLAs of the Manipur legislative assembly reached a consensus on Khemchand as the next chief minister, representing the Meitei community. As part of the power-sharing deal, Nemcha Kipgen from the Kuki community has been named deputy chief minister, the first woman deputy CM of Manipur, along with Losii Dikho, while Govindas Konthoujam will take charge as home minister. Taking to X, Prime Minister Narendra Modi said, “Congratulations to Shri Yumnam Khemchand Singh Ji on taking oath as the Chief Minister of Manipur. I would like to congratulate Smt. Nemcha Kipgen Ji and Shri Losii Dikho Ji on taking oath as the Deputy Chief Ministers of the state and Shri Konthoujam Govindas Singh Ji as well as Shri Khuraijam Loken Singh Ji on being sworn in as Ministers in the Manipur Government.\" “I’m confident they will work diligently towards furthering development and prosperity for my sisters and brothers of Manipur.\" Congratulations to Shri Yumnam Khemchand Singh Ji on taking oath as the Chief Minister of Manipur.I would like to congratulate Smt. Nemcha Kipgen Ji and Shri Losii Dikho Ji on taking oath as the Deputy Chief Ministers of the state and Shri Konthoujam Govindas Singh Ji as well… The oath-taking ceremony came after the President’s Rule was lifted in Manipur after nearly a year due to ethnic clashes between Meitei and Kuki groups. The President’s rule was first imposed on February 13, 2025 and later extended on August 13 for a period of six months. Yumnam Khemchand Singh, 62, is a Bharatiya Janata Party (BJP) politician from Manipur. He was elected to the Manipur legislative assembly from the Singjamei constituency in both the 2017 and 2022 assembly elections. He served as the Speaker of the assembly from 2017 to 2022. A taekwondo black belt, Khemchand started his political career alongside former Manipur CM N Biren Singh, who resigned last year after he was unable to maintain law and order and prevent ethnic conflict, as part of the Democratic Revolutionary People’s Party. He joined the BJP in 2013 and entered the Assembly in 2017. ALSO READ: From Taekwondo Black Belt To Manipur CM: The Rise Of Yumnam Khemchand Singh He was appointed as the Speaker of the Manipur Assembly in the first Biren Singh government. In 2022, he was inducted as a cabinet minister in the second Biren Singh ministry, holding key portfolios, including the Municipal Administration and Housing Development (MAHUD) Department, Rural Development and Panchayati Raj Department, and the Education Department. As ethnic clashes grew in Manipur, anger rose over the government’s inability to address the issue and bring the situation under control, which resulted in a grenade attack on Khemchand’s house in 2023. Despite being a cabinet minister, Khemchand became an outspoken critic of the Biren Singh government and pressured the party to seek his replacement. Biren Singh resigned on February 9, 2025, amid growing dissent within the BJP-led government and the Congress’s plans to move a no-confidence motion in the Assembly. Khemchand had earlier told News18 that Biren Singh had failed to maintain law and order in Manipur for over 18 months. Biren Singh continued as caretaker Chief Minister till President’s rule was imposed. The central government engaged ethnic bodies in talks to defuse the Manipur crisis, and PM Modi’s visit to the state in September 2025 was seen as a big step to restore normalcy. Khemchand was named as the Chief Minister of the politically sensitive state as leaders from both the Meitei and Kuki communities came together to form the government, marking a significant political coordination. The move is believed to have provided a major boost to Manipur by signalling a return to normalcy, especially with elections due next year.",
        "link": "https://www.news18.com/politics/yumnam-khemchand-singh-takes-oath-as-manipur-chief-minister-as-presidents-rule-ends-9879543.html",
        "date": "Wed, 4 Feb 2026 19:50:42 +0530",
        "fetched_at": "2026-02-06 03:55:19.027543"
    },
    {
        "title": "ED Saw 94.82% Conviction Rate In Money Laundering Cases, Govt Tells Parliament",
        "content": "The Enforcement Directorate (ED) recorded a conviction rate of 94.82% in cases under the Prevention of Money Laundering Act (PMLA), the government told Parliament. Of the 58 cases in which judgment has been passed, 55 saw conviction, minister of state for finance Pankaj Chaudhary said in Rajya Sabha in response to Samajwadi Party member Ramji Lal Suman’s question. “As on 31.12.2025, the Special Courts of PMLA have delivered judgments, on merits, on the issue of Money-Laundering in 58 cases, out of which conviction orders have been passed in 55 cases convicting 123 accused. Accordingly, the conviction rate, i.e., total number of cases in which accused have been convicted as a percentage of total cases decided on merits on the issue of money laundering is 55/58*100=94.82%. (c) ED has secured conviction in 43 cases since 2020-21, wherein 104 accused have been convicted under the provisions of PMLA, 2002. ED has secured convictions in 43 cases since 2020-21, wherein 104 accused have been convicted under the provisions of PMLA,\" he said. The Directorate of Enforcement (ED) has recorded 5,158 cases for initiating investigation under the provisions of PMLA, 2002, since 2020-21. “As on 31.12.2025, ED has recorded 8391 Enforcement Case Information Report (ECIR) under the provisions of Prevention of Money-Laundering Act, 2002 (PMLA). In 1,960 cases, Prosecution Complaints (PC) have been filed before the Special Courts (PMLA) praying for conviction of accused persons for money laundering offences and confiscation of proceeds of crime involved. Further, after the amendment in PMLA by the Finance (No. 2) Act, 2019 (No. 23 of 2019) through insertion of proviso to Section 44(1)(b) w. e. f. 01.08.2019, Closure Report is required to be filed by ED before the Special Court, PMLA, in cases where no offence of money-laundering is made out. Since then, ED has filed Closure Report before the concerned Special Court in 93 cases where no offence of money-laundering is made out due to various reasons such as Closure of Schedule offence case, cases where the predicate offence Court finds no offence committed related to Schedule Offence defined under PMLA, quashing of Predicate Offence case etc,\" he said. “Prior to the aforesaid amendment (i.e. before 01.08.2019), cases where no money-laundering offence was made out were closed with the prior approval of regional Special Director of Enforcement. As such, since the inception of PMLA i.e. 01.07.2005 up to 31.07.2019, 1185 cases were closed,\" he said. The Directorate of Enforcement follows a multi-pronged approach for registering a case based on money-laundering risks and threats and by examining information received through several sources. After completion of investigation, a prosecution complaint is filed before the Special Court. Efforts have been made to fast-track investigations and conclude cases efficiently through the enhanced use of technology which includes optimum use of national and international databases, forensic tools, artificial intelligence, OSINT techniques and digital resources to strengthen evidence collection, improve analytical capabilities and expedite complex financial crime investigations.",
        "link": "https://www.news18.com/india/ed-recorded-94-82-conviction-rate-in-money-laundering-cases-govt-tells-parliament-ws-l-9878914.html",
        "date": "Wed, 4 Feb 2026 15:27:03 +0530",
        "fetched_at": "2026-02-06 03:55:19.660739"
    },
    {
        "title": "‘Happy For Sunetra’: Sharad Pawar Backs Ajit Pawar’s Wife, Slams Fadnavis On NCP Merger Talk",
        "content": "NCP leader Sharad Pawar expressed happiness over Sunetra Pawar replacing her husband Ajit Pawar as Deputy Chief Minister of Maharashtra. Sunetra Pawar, a Rajya Sabha MP from the state, was sworn in on Saturday night. Ajit Pawar died last week in a plane crash. Sharad Pawar denied any knowledge of a memorial for his nephew on the campus of Vidya Pratishtan, the educational institution founded by the Pawar family in Baramati. Speaking to reporters on Wednesday morning, Sharad Pawar criticised Chief Minister Devendra Fadnavis for speaking about a possible merger of the two NCP factions. He said merger talks were taking place between Ajit Pawar and Jayant Patil from his side and had nothing to do with Fadnavis or the BJP. “… Fadnavis was not involved in the talks. What right did he have to talk about it?\" Pawar said, adding that his focus was now on supporting his family during the tragedy. “As of now, there is no discussion about any political decisions…\" Fadnavis, however, dismissed talk of a merger, saying Ajit Pawar would have informed him and the BJP leadership if such talks had taken place. Baramati, Maharashtra | NCP-SCP chief Sharad Pawar says, \"I am happy that Sunetra Pawar is sworn in as Deputy CM....Merger discussions were held between Ajit Pawar and Jayant Patil. CM Fadnavis was not involved in the talks. What right did he have to talk about it?\" pic.twitter.com/BR7IQ9qWIg— ANI (@ANI) February 4, 2026 The NCP split in 2023 after Ajit Pawar led MLAs into an alliance with the BJP. As per reports, Sunetra Pawar’s appointment was meant to counter talk of a merger, which Fadnavis said was “manufactured\". Ajit Pawar, 66, died after his chartered Learjet crashed while trying to land at an airfield in Baramati. After his death, it emerged he had been planning a family reunion by bringing the divided NCP factions together. The two factions had joined hands for municipal elections last month, which ended unsuccessfully after the BJP swept to victory. Sources told NDTV the reunion plan was still on and could be announced in the second week of February, with Sunetra Pawar seen as playing a crucial role. Sharad Pawar also spoke about the disruption in Parliament involving Rahul Gandhi reading excerpts from an unpublished book by former Army chief General MM Naravane related to the India-China border row in Ladakh in June 2020. He said Rahul Gandhi, as Leader of the Opposition, should have been allowed to speak and that there should have been an opportunity to discuss the book, as it was written by a former Army Chief and indicated a matter of concern.",
        "link": "https://www.news18.com/india/happy-for-sunetra-sharad-pawar-backs-ajit-pawars-wife-slams-fadnavis-on-ncp-merger-talk-9878694.html",
        "date": "Wed, 4 Feb 2026 14:10:53 +0530",
        "fetched_at": "2026-02-06 03:55:20.323135"
    },
    {
        "title": "‘Energy Security Is Govt’s Top Priority’: Piyush Goyal In Parliament Amid US Trade Deal Debate",
        "content": "Union Minister Piyush Goyal on Wednesday told Lok Sabha that ensuring the energy security of India’s 140 crore people remains the government’s foremost priority, even as global energy dynamics continue to evolve. “I want to make it clear that ensuring the energy security needs of 140 crore Indians is the government’s top priority. In line with the changing international scenario, we are diversifying our energy sources with this objective in mind,\" Goyal said. Addressing concerns over trade and strategic interests, the minister said India’s sensitivities in key sectors had been safeguarded. “India’s sensitivities in the fertiliser and agriculture sectors have been fully taken into account,\" he said, adding that the government had protected the interests of farmers and dairy producers. Goyal said both India and its partners would move ahead keeping their respective economic priorities in focus. “Both sides will want to move forward while keeping their respective economies in mind and safeguarding their own interests. India has been successful in protecting the interests of its agriculture and dairy sectors,\" he said. Earlier, Goyal had said Prime Minister Narendra Modi has always championed the agriculture and dairy sectors, safeguarding their interests and noted the sensitive factors of India’s economy, particularly agriculture and dairy, have been protected in the India-US trade deal. Addressing a press conference, he said that MSMEs, the country’s engineering sector and sectors such as textiles, gems and jewellery, leather goods and marine goods will all get numerous opportunities. “PM Modi has always championed both the agriculture and dairy sectors, safeguarding their interests and working tirelessly to ensure a bright future and ample opportunities for the people in this sector. I am pleased that the entire country understands and appreciates this, and it resonates deeply with them. The sensitive factors of India’s economy, particularly agriculture and dairy, have been protected,\" he said.",
        "link": "https://www.news18.com/india/energy-security-is-govts-top-priority-piyush-goyal-in-parliament-amid-us-trade-deal-debate-ws-l-9878361.html",
        "date": "Wed, 4 Feb 2026 12:54:42 +0530",
        "fetched_at": "2026-02-06 03:55:20.956927"
    },
    {
        "title": "Once-In-A-Lifetime Case: 10kg Tumour Removed From 35-Year-Old Woman In Bihar",
        "content": "A rare and alarming medical case from Samastipur district in Bihar has stunned both the public and the medical fraternity. A 35-year-old woman had been living with a mysterious lump growing inside her abdomen for a long time, which eventually weighed nearly 10 kilograms. Initially believed to be a routine health issue, her condition steadily worsened. Doctors later revealed that had she reached the hospital any later, saving her life would have been extremely difficult. The woman was identified as Savita Devi, wife of Mukesh Paswan, a resident of Ward 9, Karimanagar Panchayat, in the Mohiuddinagar block of Samastipur. According to her family, Savita Devi began experiencing severe abdominal pain and abnormal swelling around two months ago. At first, they sought local treatment, hoping the problem would subside. When her condition showed no improvement, the family began travelling in search of medical help. She was taken to Patna, Hajipur, Patori, Samastipur, Delhi, and Kolkata for consultations and diagnostic tests. During examinations at several hospitals, doctors suspected cancer, a possibility that left the family deeply distressed and fearful. Despite visiting multiple medical centres, no definitive solution was offered. With Savita Devi’s health rapidly deteriorating, the family finally decided to admit her to Muskan Seva Sadan Hospital, where her life took a dramatic turn. Doctors described her condition as critical upon arrival. Diagnostic tests and a CT scan revealed that the massive abdominal growth was pressing against other internal organs, leading to breathing difficulties, persistent pain, extreme weakness, and severe discomfort. Dr Sunil Kumar, Director of Muskan Seva Sadan Hospital, said that given the seriousness of the case, a special medical team of five doctors was immediately assembled. The team included experienced surgeons, anaesthesia specialists, and assistant physicians. A highly sensitive and high-risk operation lasting three and a half to four hours was performed, during which the 10-kilogram mass was successfully removed from her abdomen. The surgery marked a major medical achievement for the region. Following the operation, Savita Devi’s condition improved rapidly. Dr Umesh Prasad, a retired medical officer from the Bihar government, said he had never encountered such a case in his entire career. He admitted that there was considerable fear before the surgery, given the size and complexity of the tumour. However, he added that the experience, coordination, and confidence of the medical team gave everyone the courage to proceed. Savita Devi’s family expressed complete faith in the doctors and stated that they did not wish to seek treatment anywhere else. According to the medical team, had the surgery not been performed at the right time, the woman would not have survived. Doctors explained that carrying such a large abdominal tumour causes extreme pain and suffering. Thankfully, following the operation, Savita Devi is now completely safe, and her family has finally breathed a sigh of relief.",
        "link": "https://www.news18.com/india/once-in-a-lifetime-case-10kg-tumour-removed-from-35-year-old-woman-in-bihar-ws-l-9878101.html",
        "date": "Thu, 5 Feb 2026 13:12:28 +0530",
        "fetched_at": "2026-02-06 03:55:21.624969"
    },
    {
        "title": "Yumnam Khemchand Singh Named Next Manipur Chief Minister In Power-Sharing Breakthrough",
        "content": "In November 2024, Yumnam Khemchand Singh told News18 that then chief minister N Biren Singh had failed to maintain law and order in Manipur for over 18 months and should step down. Now, in a significant political development, Singh has been declared the next chief minister of the politically sensitive state. On February 3, more than 45 MLAs of the Manipur legislative assembly reached a consensus on Singh as the next chief minister, representing the Meitei community. As part of the power-sharing arrangement, Nemcha Kipgen from the Kuki community has been named deputy chief minister, while Govindas Konthoujam will take charge as home minister. The state may get anoher deputy CM as Loss Dikho may be picked from the Naga community. Singh is likely to take the oath of office on the evening of February 4. The decision highlights a carefully worked-out political balance aimed at forming a popular and inclusive government. It marks a major breakthrough, as leaders from both the Meitei and Kuki communities have come together to form the government in an important step toward restoring political normalcy in the state. The real challenge ahead will be ensuring that both communities can jointly and effectively run the government on the ground. Singh is a Bharatiya Janata Party (BJP) politician from Manipur. He was elected to the Manipur legislative assembly from the Singjamei constituency in both the 2017 and 2022 assembly elections. He served as the Speaker of the assembly from 2017 to 2022. In 2022, he was inducted as a cabinet minister in the second Biren Singh ministry, holding key portfolios, including the Municipal Administration and Housing Development (MAHUD) Department, Rural Development and Panchayati Raj Department, and the Education Department. He served in this role until February 2025, when President’s Rule was imposed in Manipur. First, the coming together of Meitei and Kuki representatives to form the government is a significant political moment. Second, the formation of an elected government was the need of the hour, and this move provides a major boost to Manipur by signalling a return to normalcy, especially with elections due next year. Third, the choice of chief minister is politically significant, as Singh has been openly critical of N Biren Singh’s leadership. Speaking to News18 in 2024, Singh had remarked: “In politics, there is no friend or foe. Honestly speaking, it has been 18 months and there is no peace. I asked him to resign a couple of times, but he is not putting down his papers. He could not bring peace till now, so why isn’t he resigning?\" While this development represents a major breakthrough for Manipur, its true success will ultimately depend on how effectively the new government functions on the ground and maintains harmony between the communities.",
        "link": "https://www.news18.com/india/yumnam-khemchand-singh-named-next-manipur-chief-minister-in-power-sharing-breakthrough-ws-kl-9877733.html",
        "date": "Wed, 4 Feb 2026 09:07:58 +0530",
        "fetched_at": "2026-02-06 03:55:22.306169"
    },
    {
        "title": "Parliament Budget Session 2026 Updates: Lok Sabha Adjourned Till Thursday",
        "content": "Budget Session Parliament 2026: Lok Sabha proceedings were adjourned on Wednesday following repeated disruptions by Opposition members over several issues. The House was suspended shortly after it reassembled at 5 pm, amid speculation that Prime Minister Narendra Modi might respond to the debate on the Motion of Thanks to the President’s Address. Opposition MPs, including Congress members, raised slogans and displayed banners and placards in the Well and aisles, leading Chair Sandhya Rai to adjourn the House within minutes. Earlier, the House had already been adjourned till 2 pm over protests regarding the suspension of eight MPs during the ongoing Budget Session. Leader of Opposition Rahul Gandhi accused the government of avoiding scrutiny on national security after he was repeatedly stopped from quoting former Army Chief General M M Naravane’s unpublished memoir related to the 2020 China border standoff. Gandhi said he would present the book to Prime Minister Modi, claiming it highlights how political leadership left the army to act alone during the crisis. Amid indications that Prime Minister Narendra Modi may respond to the debate on Motion of Thanks on the President’s Address in the evening, the Lok Sabha was adjourned on Wednesday after women MPs from the opposition reportedly refused to budge from around his seat in the House. Prime Minister Narendra Modi will not respond to the President’s address in the Lok Sabha today, as the House was adjourned. The proceedings are scheduled to resume tomorrow, February 5, at 11 am, when the Prime Minister is expected to deliver his reply and discussions on key parliamentary business will continue. The Lok Sabha was adjourned for the day with proceedings set to resume tomorrow. The government has informed Parliament that the Unique Identification Authority of India (UIDAI) has deactivated more than 2.5 crore Aadhaar numbers belonging to deceased persons to prevent misuse. In a written reply to the Lok Sabha on Wednesday, Minister of State for Electronics and IT Jitin Prasada said the move is part of a nationwide clean-up drive to ensure the accuracy and integrity of the Aadhaar database. Prime Minister Narendra Modi arrived in Parliament on Wednesday and is set to address the Lok Sabha at 5 pm. The Lok Sabha on Wednesday witnessed a ruckus by opposition members over a controversial remark by BJP MP Nishikant Dubey inside the Lower House of Parliament during his speech. Citing some books, Dubey made some comments on former prime ministers Jawaharlal Nehru and Indira Gandhi, drawing the ire of the Congress party. READ MORE Union Finance Minister Nirmala Sitharaman on Wednesday dismissed Congress leader Rahul Gandhi’s criticism of the Union Budget, calling it “uninformed”. She challenged him to point to any part of the Budget that supports his claims that it ignores unemployment, rural distress and a slowdown in manufacturing. Congress president and Leader of Opposition in Rajya Sabha, Mallikarjun Kharge, addressed the Rajya Sabha on Wednesday. Speaking in the Rajya Sabha, Union Minister Piyush Goyal said that since Prime Minister Modi’s visit to the United States in February 2025, India and the US had been engaged in regular talks to finalise a balanced, mutually beneficial trade agreement. He added that over the past year, negotiators from both sides held intensive discussions to safeguard sensitive sectors, with India successfully protecting its key interests. After nearly a year of deliberations, the two sides have finalized the bilateral trade deal. Union Minister JP Nadda criticised the Opposition for opposing the India-US trade deal. He argued that the agreement safeguards India’s key interests, particularly in sensitive sectors like agriculture and dairy. Union Minister JP Nadda addressed the Rajya Sabha on Wednesday. The Lok Sabha proceedings have been adjourned till 5 pm on Wednesday. Speaking in Rajya Sabha, Union Minister Piyush Goyal said that India is benefiting from lower tariffs compared to competing nations following the recent trade agreement with the United States. He highlighted that the deal positions India advantageously in global trade, ensuring better market access for Indian goods while protecting national interests. Commerce Minister Piyush Goyal is speaking on the India-US Trade Pact in Rajya Sabha. Speaking in the Rajya Sabha, Union Minister Nityanand Rai said Naxalism grew in the country because earlier central governments viewed it merely as a “law-and-order problem for states.” He said the Modi government’s “zero-tolerance” approach has significantly weakened the movement and brought it to its “knees.” Minister of State for Home Affairs, Nityanand Rai, addressed the Rajya Sabha on Wednesday. “Hello, my traitor friend”—Rahul Gandhi’s remark in Parliament on Wednesday triggered a war of words between him and Union minister Ravneet Bittu, who termed him “desh ke dushman” (enemy of the country). Read more Parliamentary Affairs Minister Kiren Rijiju on Wednesday said Leader of Opposition Rahul Gandhi must follow parliamentary rules while speaking in the House. He added that he had replied to Gandhi’s letter and that no member can speak arbitrarily in Parliament, news agency ANI reported. Union Minister Piyush Goyal said India and the US held extensive negotiations over the past year on the bilateral trade agreement. He said both sides sought to protect their sensitive sectors, and India successfully safeguarded key interests, particularly in agriculture and dairy, before finalising the agreement across multiple sectors. #WATCH | India-US Trade Agreement | In Lok Sabha, Union Minister Piyush Goyal says, “…Last year, negotiators from both sides held detailed discussions on various levels. Keeping the important interests of both sides in mind, it is natural that both sides would want to safeguard… pic.twitter.com/EEmHzpmwXx Addressing Lok Sabha, Union Minister Piyush Goyal said that Prime Minister Narendra Modi and US President Donald Trump held a telephonic conversation on February 2, 2026, discussing key bilateral and global issues. Following the call, Trump announced a reduction in tariffs to 18%, Goyal said, adding that the revised rate is lower than the tariffs imposed by the US on several competing countries, underscoring India’s favourable position under the agreement. #WATCH | India-US Trade Agreement | In Lok Sabha, Union Minister Piyush Goyal says, “On 2nd February 2026, PM and US President Donald Trump held a telephonic conversation on several matters of bilateral and international importance. After this, President Trump announced the… pic.twitter.com/pCYAI0RP2j The Lok Sabha has been adjourned until 2pm amid ruckus by Opposition. Commerce Minister Piyush Goyal on Wednesday said India has safeguarded the interests of its farmers in the trade agreement with the United States, as he spoke during the Budget Session of Parliament 2026. Addressing lawmakers, Goyal stressed that the government would not compromise on agricultural livelihoods while negotiating international trade deals. Lok Sabha proceedings have resumed. Piyush Goyal will speak shortly. A verbal clash erupted between Congress leader Rahul Gandhi and Union Minister Ravneet Bittu in Parliament on Wednesday. As Gandhi arrived to show support for suspended MPs, he extended his hand to Bittu, who did not respond. In reaction, Rahul Gandhi called the minister a “traitor,” sparking a brief but tense exchange. Commerce Minister Piyush Goyal will address Parliament today. He is set to speak in Lok Sabha at around 12pm and in Rajya Sabha at around 2 pm. Union Minister JP Nadda is set to speak on the Motion of Thanks to the President’s Address in the Rajya Sabha at around 2pm on Wednesday, outlining the government’s priorities and achievements. Prime Minister Narendra Modi has arrived in the Parliament as Lok Sabha proceedings will resume shortly. Samajwadi Party chief Akhilesh Yadav on Wednesday signalled his intent to address the Lok Sabha if order is maintained. “If the House runs, I shall speak,” he said as the House prepares to resume proceedings shortly. Congress leaders will hold a meeting to finalise their strategy ahead of the resumption of Lok Sabha proceedings. The discussion will focus on the suspension of party MPs, with those barred from the House planning to stage a sit-in at the Makar Dwaar as a mark of protest. Prime Minister Narendra Modi is scheduled to reply to the motion of thanks on the President’s address in the Lok Sabha today at 5 pm, a day after eight opposition MPs were suspended amid repeated disruptions in the House, top government sources said. Read more The Lok Sabha will resume its proceedings at 11 am on the sixth day of the Budget Session on Wednesday. The Rajya Sabha will resume its proceedings at 11 am on the sixth day of the Budget Session on Wednesday. The Lok Sabha on Tuesday witnessed a massive ruckus followed by the suspension of eight opposition MPs, including seven from the Congress and one from the CPI(M), for the remainder of Parliament’s Budget session that will end on April 2. Read more The Lok Sabha on Tuesday suspended eight opposition members for “unruly behaviour” after they allegedly disrupted proceedings and threw papers in the direction of the Chair. Read more Both Houses of Parliament are scheduled to continue the discussion on the motion of ‘Thanks to the President’s address’ during the ongoing Budget Session on Wednesday. The House has allotted 18 hours for the discussion, and Prime Minister Narendra Modi is scheduled to reply today.",
        "link": "https://www.news18.com/india/parliament-budget-session-2026-live-rahul-gandhi-pm-modi-india-china-conflict-rajya-sabha-lok-sabha-bills-today-liveblog-9877731.html",
        "date": "Wed, 4 Feb 2026 21:40:09 +0530",
        "fetched_at": "2026-02-06 03:55:23.508200"
    },
    {
        "title": "India-China Trade Hits Record USD 155 Bn, Ties Enter ‘New Level Of Improvement’: Chinese Envoy",
        "content": "India–China bilateral trade reached a “record high\" of USD 155 billion in 2025, registering a year-on-year growth of over 12%, Chinese Ambassador to India Xu Feihong said on Tuesday, underlining the expanding scope of economic engagement between the two countries. Speaking at an event marking the Chinese New Year, Xu said China supports India’s BRICS presidency and is ready to strengthen multilateral coordination with New Delhi, while working together to advance the development of the Global South. He said ties between the two countries have seen steady improvement following the “successful\" meeting between Prime Minister Narendra Modi and Chinese President Xi Jinping in Tianjin last August. “Last August, President Xi Jinping and Prime Minister Narendra Modi held a successful meeting in Tianjin, which led China-India relations from ‘a reset and fresh start’ to a new level of improvement,\" the envoy said, adding that exchanges at all levels have become more frequent and economic cooperation has reached new heights. “In 2025, bilateral trade between China and India reached a record high of USD 155.6 billion, registering a year-on-year growth of over 12 per cent,\" Xu said. He added that India’s exports to China grew by 9.7%, highlighting the vast potential of trade and economic cooperation between the two countries. Xu also said China’s emphasis on self-reliance aligns with India’s Atmanirbhar Bharat strategy. “At the global level, China’s vision of a ‘world of great harmony’ echoes Indian’s pursuit of Vasudhaiva Kutumbakam (the world is one family),\" he said. “We stand ready to work with India to draw wisdom from our traditional cultures, uphold the important consensus that China and India are each other’s cooperation partners.\" The envoy stressed the need for closer alignment of development strategies to expand the “pie\" of mutual benefit and achieve win-win outcomes. In recent months, India and China have taken a series of steps to reset relations that had come under severe strain after the deadly Galwan Valley clashes in June 2020. The prolonged military standoff effectively ended in October 2024.",
        "link": "https://www.news18.com/india/india-china-trade-hits-record-usd-155-bn-ties-enter-new-level-of-improvement-chinese-envoy-ws-l-9877581.html",
        "date": "Wed, 4 Feb 2026 07:19:55 +0530",
        "fetched_at": "2026-02-06 03:55:24.180813"
    },
    {
        "title": "BJP’s Yumnam Khemchand Singh Set To Take Over As Manipur Chief Minister",
        "content": "BJP leader Yumnam Khemchand Singh has been elected as the leader of the Manipur BJP Legislature Party, paving the way for his appointment as the next Chief Minister of the state. The decision was taken at a party meeting held in Delhi, marking a significant step towards the restoration of an elected government in Manipur after nearly a year under President’s Rule. With Singh’s elevation as legislature party leader, the BJP is set to stake claim to form the government in the state. Manipur has been under central rule since February 2025, following prolonged political uncertainty and administrative challenges. Welcoming the development, BJP MLA Thokchom Radheshyam Singh said the return of an elected government was long overdue. “It is good that we are going to have a popular and elected government. We thank the central leadership for taking this step. Every problem has a solution, and under the guidance of the central leadership and the new ministry led by Yumnam Khemchand Singh, we will find a way forward,\" he said. Yumnam Khemchand Singh is a two-time MLA from the Singjamei constituency, having won the seat in the 2017 and 2022 Manipur Assembly elections on a BJP ticket. He served as the Speaker of the Manipur Legislative Assembly from 2017 to 2022 and later joined the state cabinet in the second Biren Singh government. As a Cabinet Minister, Singh handled key portfolios including Municipal Administration and Housing Development, Rural Development and Panchayati Raj, and Education. He remained in office until President’s Rule was imposed in February 2025. His selection as legislature party leader now positions him to lead the state as it transitions back to an elected government.",
        "link": "https://www.news18.com/india/bjps-yumnam-khemchand-singh-set-to-take-over-as-manipur-chief-minister-9877075.html",
        "date": "Tue, 3 Feb 2026 19:05:51 +0530",
        "fetched_at": "2026-02-06 03:55:24.813122"
    },
    {
        "title": "'Occupied By Mafias...’: UP CM Yogi Says 65,000 Acres Freed After His Warning",
        "content": "Uttar Pradesh Chief Minister Yogi Adityanath on Tuesday said that nearly 65,000 acres of land were reclaimed from land mafias after his government issued a strict warning soon after coming to power in 2017. Addressing global investors and entrepreneurs at the ‘Uttar Pradesh Pharma Conclave 1.0’ in Lucknow, the chief minister said illegal land occupation had left the state without any viable land bank for industrial development. “When we assumed office in 2017, there was no land bank available in Uttar Pradesh because large tracts of land were occupied by mafias,\" Adityanath said. मैंने कहा था- 24 घंटे का समय दे रहा हूं…उत्तर प्रदेश के अंदर जिस भी सरकारी भूमि पर किसी भू-माफिया ने कब्जा किया है, उसको तत्काल छोड़ दे… pic.twitter.com/fRPov7BrJz He added that the government responded by constituting a Bhu Mafia Task Force and issuing a 24-hour ultimatum to land grabbers. “As a result, 65,000 acres of land were vacated, which later became our land bank,\" he said. The chief minister said the task force was created to systematically identify land grabbers and mafias and free illegally occupied land. The UP government has dedicated a web portal to allow citizens to register complaints related to land grabbing. Reiterating his government’s tough stance, Adityanath recently directed officials to take swift and decisive action against illegal encroachments across the state. He warned that strongmen and land mafias would face stringent legal consequences and that no offender would be spared. Speaking during the weekly Janta Darshan at the Gorakhnath temple last week, the chief minister said the Uttar Pradesh government remains committed to ensuring justice, security and prosperity for every citizen, and asserted that action against illegal land occupation would continue without compromise.",
        "link": "https://www.news18.com/india/occupied-by-mafias-up-cm-yogi-says-65000-acres-freed-after-his-warning-9877044.html",
        "date": "Tue, 3 Feb 2026 18:51:40 +0530",
        "fetched_at": "2026-02-06 03:55:25.457011"
    },
    {
        "title": "DRDO Tests Long-Range Missile Engine Solid Fuel Ducted Ramjet Off Odisha Coast | Video",
        "content": "The Defence Research & Development Organisation (DRDO) on Tuesday successfully demonstrated Solid Fuel Ducted Ramjet (SFDR) technology from the Integrated Test Range (ITR), Chandipur, off the coast of Odisha. The successful test, carried around around 10:45 AM, places India among a select group of nations with this advanced capability, enabling the development of long-range air-to-air missiles that provide a tactical advantage over potential adversaries. #WATCH | Defence Research & Development Organisation (DRDO) has carried out a successful demonstration of Solid Fuel Ducted Ramjet (SFDR) technology from the Integrated Test Range (ITR), Chandipur off the coast of Odisha at around 1045 hrs on February 03, 2026. The successful… pic.twitter.com/vJwRATL7ec— ANI (@ANI) February 3, 2026 All subsystems of the missile, including the Nozzle-less Booster, Solid Fuel Ducted Ramjet motor, and Fuel Flow Controller, performed as expected. The missile was initially propelled by a ground booster motor to the required Mach speed before the SFDR system took over. Flight performance was confirmed through data collected by multiple tracking instruments deployed along the Bay of Bengal coastline. The launch was closely monitored by senior scientists from DRDO laboratories, including the Defence Research & Development Laboratory, High Energy Materials Research Laboratory, Research Centre Imarat, and ITR. Secretary of Defence R&D and DRDO Chairman, Dr Samir V Kamat, congratulated all teams involved in the successful flight test. Defence Minister Rajnath Singh also praised DRDO and the Indian defence industry for the achievement.",
        "link": "https://www.news18.com/india/drdo-tests-long-range-missile-engine-solid-fuel-ducted-ramjet-off-odisha-coast-video-ws-l-9876970.html",
        "date": "Tue, 3 Feb 2026 18:48:36 +0530",
        "fetched_at": "2026-02-06 03:55:26.090069"
    },
    {
        "title": "After Party, Bengaluru Teen Falls To Death From Building; Pub Booked For Serving Alcohol",
        "content": "A 15-year-old boy died after falling from the seventh floor of an apartment building in Bengaluru on Saturday night. He was reportedly under the influence of alcohol following a party with friends at a city pub, prompting police action against the bar for serving alcohol. The Legacy Brewing Company in Aditya Layout, Rajarajeshwarinagar, has been booked under the Juvenile Justice Act and the Karnataka Excise Act. The incident occurred at Mantri Alpyne Apartments on Dr Vishnuvardhan Road, where the boy lived. The Class 10 student reportedly fell from the building after attending a liquor party with friends. His parents lodged a complaint at Rajarajeshwarinagar Police Station later that evening. According to the police, investigations revealed that the minor and his friends had visited the pub earlier in the evening, where they allegedly consumed alcohol and smoked. “During the course of the investigation, the police examined the matter from various angles and found that on 31st January 2026, the deceased minor, along with his friends, had consumed alcohol and smoked at a company establishment located within the limits of Rajarajeshwarinagar Police Station,\" the police press note said. Authorities are looking into the exact circumstances that led to the fatal fall, including the role of the pub in providing alcohol to underage patrons. “A case has been registered against the owners and staff of the concerned company at Rajarajeshwarinagar Police Station under the provisions of the JJ Act and the Karnataka Excise Act. The investigation is underway,\" the police added.",
        "link": "https://www.news18.com/india/after-liquor-party-bengaluru-teen-falls-to-death-from-building-pub-booked-for-serving-alcohol-ws-l-9876573.html",
        "date": "Tue, 3 Feb 2026 17:06:15 +0530",
        "fetched_at": "2026-02-06 03:55:26.730566"
    },
    {
        "title": "Maharashtra Deputy CM Sunetra Pawar Appointed Guardian Minister Of Pune, Beed",
        "content": "Maharashtra Deputy Chief Minister Sunetra Pawar was on Tuesday appointed as the guardian minister of Beed and Pune districts, posts previously held by her late husband Ajit Pawar. On January 31, Rajya Sabha member Sunetra Pawar became Maharashtra’s first woman Deputy Chief Minister replacing her deceased husband and Nationalist Congress Party (NCP) chief Ajit Pawar in the state cabinet. The 62-year-old leader, who is not a member of either house of the Maharashtra legislature, was elected as leader of the legislature wing of the NCP. Ajit Pawar had held the portfolios of Finance, State Excise, Sports and Minority Welfare. He also served as the guardian minister of Pune and Beed. Also Read: Sunetra Pawar Becomes Maharashtra Deputy CM Without Being MLA: Law Allows It With A Six-Month Rider Sunetra had already been given the departments of excise, sports and minority welfare, while Chief Minister Devendra Fadnavis will handle the finance portfolio. Until the 2024 Lok Sabha elections, Sunetra Pawar had kept a low profile. In the Lok Sabha elections that year, she contested from Baramati as the candidate of her husband’s party, but was defeated by her sister-in-law and incumbent NCP (SP) MP Supriya Sule in the prestige battle. Sunetra Pawar was subsequently elected to the Rajya Sabha.",
        "link": "https://www.news18.com/india/maharashtra-deputy-cm-sunetra-pawar-appointed-guardian-minister-of-pune-beed-ws-l-9876490.html",
        "date": "Tue, 3 Feb 2026 16:48:37 +0530",
        "fetched_at": "2026-02-06 03:55:27.358763"
    }
]