[
    {
        "title": "Bill Gates skips keynote address at India AI summit amid Epstein files controversy",
        "content": "Bill Gates skipped his scheduled keynote address.\n*   The address was meant to be delivered at the India AI summit.\n*   His absence is linked to the ongoing controversy surrounding the Epstein files.",
        "link": "https://www.thehindu.com/sci-tech/technology/bill-gates-skips-keynote-address-at-india-ai-summit-amid-epstein-files-controversy/article70650292.ece",
        "date": "Thu, 19 Feb 2026 09:25:22 +0530"
    },
    {
        "title": "US tech giants announce India deals at AI summit",
        "content": "Here are 3 bullet points summarizing the headline:\n\n*   Major US technology companies have announced new business agreements.\n*   These deals are specifically targeted at opportunities within India.\n*   The announcements were made during an AI summit, suggesting a focus on artificial intelligence initiatives.",
        "link": "https://www.thehindu.com/sci-tech/technology/us-tech-giants-announce-india-deals-at-ai-summit/article70650213.ece",
        "date": "Thu, 19 Feb 2026 09:15:54 +0530"
    },
    {
        "title": "AI In Focus: The 2026 AI Impact Summit put in perspective",
        "content": "Artificial Intelligence (AI) is currently a central and important topic.\n*   An event called the '2026 AI Impact Summit' is scheduled to take place.\n*   The news aims to provide context or a broader understanding of this future summit's significance.",
        "link": "https://www.thehindu.com/sci-tech/technology/ai-in-focus-analysis-opinion-package-collection/article70650240.ece",
        "date": "Thu, 19 Feb 2026 08:57:49 +0530"
    },
    {
        "title": "Gujarat unveils ₹4.08 lakh crore budget for tourism, AI, sports infrastructure",
        "content": "Here's the summary in 3 bullet points:\n\n*   Gujarat has unveiled a new state budget.\n*   The budget is valued at a substantial ₹4.08 lakh crore.\n*   Key sectors targeted for development include tourism, Artificial Intelligence (AI), and sports infrastructure.",
        "link": "https://www.thehindu.com/news/national/gujarat/gujarat-unveils-408-lakh-crore-budget-for-tourism-ai-sports-infrastructure/article70648471.ece",
        "date": "Thu, 19 Feb 2026 07:59:23 +0530"
    },
    {
        "title": "T.N. Climate Summit ends with emphasis on tackling forest fire",
        "content": "The T.N. Climate Summit has concluded.\n*   The summit addressed various climate-related issues.\n*   A key emphasis at its conclusion was placed on strategies for tackling forest fires.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/tn-climate-summit-ends-with-emphasis-on-tackling-forest-fire/article70649086.ece",
        "date": "Thu, 19 Feb 2026 00:54:47 +0530"
    },
    {
        "title": "Fishermen take oath to oppose coastal projects",
        "content": "Fishermen have taken a collective oath.\n*   The purpose of this oath is to formally oppose various coastal development projects.\n*   This signifies a united and organized stand by the fishing community against these initiatives.",
        "link": "https://www.thehindu.com/news/cities/chennai/fishermen-take-oath-to-oppose-coastal-projects/article70648913.ece",
        "date": "Thu, 19 Feb 2026 02:06:26 +0530"
    },
    {
        "title": "​Troubled waters: On the Great Nicobar Project",
        "content": "The news focuses on the Great Nicobar Project.\n*   It indicates the project is currently facing significant challenges, controversies, or problems.\n*   The phrase \"troubled waters\" suggests underlying issues, likely concerning environmental impact, indigenous rights, or implementation difficulties.",
        "link": "https://www.thehindu.com/opinion/editorial/troubled-waters-on-the-great-nicobar-project/article70648264.ece",
        "date": "Thu, 19 Feb 2026 08:15:26 +0530"
    },
    {
        "title": "Govt. to further simplify process of deleting private lands from 22A list",
        "content": "The government plans to further simplify the process.\n*   This simplification relates to the deletion of private lands.\n*   The lands are being removed from the specific \"22A list.\"",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/govt-to-further-simplify-process-of-deleting-private-lands-from-22a-list/article70648247.ece",
        "date": "Wed, 18 Feb 2026 23:41:55 +0530"
    },
    {
        "title": "Kerala government moves Supreme Court after High Court stalls public survey",
        "content": "The Kerala government has moved the Supreme Court.\n*   This action challenges a decision by the High Court.\n*   The High Court had previously stalled a public survey initiated by the state government.",
        "link": "https://www.thehindu.com/news/national/kerala/kerala-government-moves-supreme-court-after-high-court-stalls-public-survey/article70648867.ece",
        "date": "Wed, 18 Feb 2026 23:03:24 +0530"
    },
    {
        "title": "India adds its name to list of countries criticising Israel’s unilateral measures on West Bank",
        "content": "India has joined a list of countries criticizing Israel.\n*   The criticism specifically targets Israel's unilateral measures regarding the West Bank.\n*   This action places India among nations expressing opposition to these Israeli policies.",
        "link": "https://www.thehindu.com/news/national/india-adds-its-name-to-list-of-countries-criticising-israels-unilateral-measures-on-west-bank/article70648900.ece",
        "date": "Thu, 19 Feb 2026 08:35:37 +0530"
    }
]