[
    {
        "title": "Japan will connect Northeast India to the Bay of Bengal: Dy Foreign Minister Horii Iwao",
        "content": "Japan intends to connect Northeast India to the Bay of Bengal.\n*   The initiative aims to provide the region with access to a vital sea route.\n*   This plan was announced by Japan's Deputy Foreign Minister, Horii Iwao.",
        "link": "https://www.thehindu.com/news/national/japan-will-connect-northeast-india-to-the-bay-of-bengal-dy-foreign-minister-horii-iwao/article70685390.ece",
        "date": "Sat, 28 Feb 2026 01:26:52 +0530"
    },
    {
        "title": "District panchayat Budget proposes jobs for 5,000 women",
        "content": "Here's the summary in 3 bullet points:\n\n*   The District panchayat's new Budget includes a proposal for job creation.\n*   It specifically aims to generate 5,000 new employment opportunities.\n*   These positions are designated for women.",
        "link": "https://www.thehindu.com/news/national/kerala/district-panchayat-budget-proposes-jobs-for-5000-women/article70684077.ece",
        "date": "Sat, 28 Feb 2026 02:32:50 +0530"
    },
    {
        "title": "Kochi Corporation Budget approved amid Opposition boycott",
        "content": "The Kochi Corporation's budget has been officially approved.\n*   This approval took place during a session that was boycotted.\n*   The boycott was carried out by the Opposition.",
        "link": "https://www.thehindu.com/news/national/kerala/kochi-corporation-budget-approved-amid-opposition-boycott/article70685549.ece",
        "date": "Sat, 28 Feb 2026 01:02:01 +0530"
    },
    {
        "title": "Tamil Nadu launches its first Dark Sky Park in Kolli Hills for stargazing",
        "content": "Here are 3 bullet points summarizing the headline:\n\n*   Tamil Nadu has launched its first Dark Sky Park in Kolli Hills.\n*   The park is specifically designed for stargazing activities.\n*   This initiative marks a new development for the state in promoting astrotourism and light pollution awareness.",
        "link": "https://www.thehindu.com/sci-tech/science/tamil-nadu-launches-its-first-dark-sky-park-in-kolli-hills-for-stargazing/article70683166.ece",
        "date": "Sat, 28 Feb 2026 02:12:41 +0530"
    },
    {
        "title": "PM Modi to launch nationwide HPV vaccination drive on February 28",
        "content": "Here are 3 bullet points summarizing the headline:\n\n*   Prime Minister Modi will launch a nationwide Human Papillomavirus (HPV) vaccination drive.\n*   The initiative aims to provide HPV vaccination across the entire country.\n*   The official launch of the drive is scheduled for February 28.",
        "link": "https://www.thehindu.com/news/national/pm-modi-to-launch-nationwide-hvp-vaccination-drive-on-february-28/article70685472.ece",
        "date": "Sat, 28 Feb 2026 06:11:11 +0530"
    },
    {
        "title": "Arvind Kejriwal’s court discharge a blow to Union government: Kerala Chief Minister",
        "content": "Here's the summary in 3 bullet points:\n\n*   Delhi Chief Minister Arvind Kejriwal has received a court discharge.\n*   Kerala's Chief Minister stated that this development is a \"blow\" to the Union government.\n*   The remark highlights political criticism and tension surrounding the central government's actions.",
        "link": "https://www.thehindu.com/news/national/kerala/arvind-kejriwals-court-discharge-a-blow-to-union-government-kerala-chief-minister/article70685502.ece",
        "date": "Fri, 27 Feb 2026 22:48:13 +0530"
    },
    {
        "title": "Didn’t pay influencers to oppose AI Summit, says Congress",
        "content": "Congress has denied allegations that it paid influencers.\n*   These payments were supposedly made to mobilize opposition against an AI Summit.\n*   The statement clarifies Congress's position amidst speculation regarding their involvement in public dissent against the event.",
        "link": "https://www.thehindu.com/news/national/didnt-pay-influencers-to-oppose-ai-summit-says-congress/article70685434.ece",
        "date": "Fri, 27 Feb 2026 22:24:52 +0530"
    },
    {
        "title": "Karnataka launches action plan on snakebite and rabies; aims to cut snakebite deaths by half, end dog-related rabies deaths by 2030",
        "content": "Karnataka has launched a new action plan to combat snakebite and rabies.\n*   The initiative aims to reduce snakebite deaths by 50%.\n*   It also targets eliminating all dog-related rabies deaths by the year 2030.",
        "link": "https://www.thehindu.com/news/national/karnataka/karnataka-launches-action-plan-on-snakebite-and-rabies-aims-to-cut-snakebite-deaths-by-half-end-dog-related-rabies-deaths-by-2030/article70684393.ece",
        "date": "Fri, 27 Feb 2026 22:13:52 +0530"
    },
    {
        "title": "Bicycle literacy campaign launched in women’s college",
        "content": "A bicycle literacy campaign has been launched.\n*   The initiative is specifically targeting students at a women's college.\n*   It aims to educate women on various aspects of cycling.",
        "link": "https://www.thehindu.com/news/national/kerala/bicycle-literacy-campaign-launched-in-womens-college/article70685289.ece",
        "date": "Fri, 27 Feb 2026 23:15:00 +0530"
    },
    {
        "title": "Police book unknown motorcyclist for transporting explosives",
        "content": "Police have booked an unknown individual.\n*   The person was identified as a motorcyclist.\n*   The booking is for transporting explosives.",
        "link": "https://www.thehindu.com/news/national/karnataka/police-book-unknown-motorcyclist-for-transporting-explosives/article70685419.ece",
        "date": "Fri, 27 Feb 2026 22:04:16 +0530"
    }
]