[
    {
        "title": "18,791 government schools in Karnataka have no land records",
        "content": "**18,791 government schools in Karnataka lack official land records.** This indicates a vast number of state-run educational institutions operate without proper legal documentation of their property.\n*   The absence of these records means **their land ownership is not formally registered or documented**, which can lead to legal ambiguities.\n*   This situation poses **significant challenges for legal clarity, potential future development, and the overall security** of these school properties.",
        "link": "https://www.thehindu.com/news/national/karnataka/18791-government-schools-in-karnataka-have-no-land-records/article70610529.ece",
        "date": "Mon, 09 Feb 2026 20:09:44 +0530"
    },
    {
        "title": "Three-language panel submits report to Maharashtra government",
        "content": "A three-language panel has submitted its report.\n*   The report was presented to the Maharashtra government.\n*   It likely contains recommendations or findings regarding a three-language policy or framework for the state.",
        "link": "https://www.thehindu.com/news/national/maharashtra/three-language-panel-submits-report-to-maharashtra-government/article70613605.ece",
        "date": "Tue, 10 Feb 2026 06:45:51 +0530"
    },
    {
        "title": "Naveen Patnaik attacks Mohan Majhi government over paddy procurement",
        "content": "Naveen Patnaik has launched a criticism against the current Mohan Majhi government.\n*   The core issue of his 'attack' is the government's handling of paddy procurement.\n*   This signifies a political confrontation over a crucial agricultural policy.",
        "link": "https://www.thehindu.com/news/national/odisha/naveen-patnaik-attacks-mohan-majhi-government-over-paddy-procurement/article70611619.ece",
        "date": "Tue, 10 Feb 2026 04:05:49 +0530"
    },
    {
        "title": "‘BJP leader’ booked for beating woman in M.P.; video goes viral",
        "content": "A BJP leader has been booked by authorities.\n*   The booking is for allegedly beating a woman in Madhya Pradesh (M.P.).\n*   A video clip of the alleged incident has widely circulated online.",
        "link": "https://www.thehindu.com/news/national/madhya-pradesh/bjp-leader-booked-for-beating-woman-in-mp-video-goes-viral/article70612260.ece",
        "date": "Tue, 10 Feb 2026 02:03:58 +0530"
    },
    {
        "title": "U.P. Budget Session: Opposition disrupts Governor’s address",
        "content": "Here's the summary in 3 bullet points:\n\n*   The Governor was delivering an address during the ongoing Budget Session in Uttar Pradesh (U.P.).\n*   Opposition parties caused a disruption during the Governor's address.\n*   This disruption interrupted the proceedings of the U.P. Budget Session.",
        "link": "https://www.thehindu.com/news/national/uttar-pradesh/up-budget-session-opposition-disrupts-governors-address/article70611788.ece",
        "date": "Tue, 10 Feb 2026 01:30:06 +0530"
    },
    {
        "title": "Haryana Oppn. alleges cut in no. of old age pension scheme beneficiaries",
        "content": "Here's the summary in 3 bullet points:\n\n*   The Haryana Opposition alleges a reduction in the number of beneficiaries for the state's old age pension scheme.\n*   They claim there has been a \"cut\" in the total number of individuals receiving these pensions.\n*   This represents a political criticism directed at the current state government's management of social welfare programs.",
        "link": "https://www.thehindu.com/news/national/haryana/haryana-oppn-alleges-cut-in-no-of-old-age-pension-scheme-beneficiaries/article70611665.ece",
        "date": "Tue, 10 Feb 2026 00:43:42 +0530"
    },
    {
        "title": "Hosur airport not recommended to prioritise defence projects of national importance, says Civil Aviation Minister",
        "content": "The Civil Aviation Minister has advised against prioritizing defence projects at Hosur airport.\n*   This recommendation specifically concerns defence initiatives deemed to be of national importance.\n*   The Minister's statement suggests Hosur airport should not be primarily designated for strategic military purposes.",
        "link": "https://www.thehindu.com/news/cities/chennai/hosur-airport-not-recommended-to-prioritise-defence-projects-of-national-importance-says-civil-aviation-minister/article70611947.ece",
        "date": "Tue, 10 Feb 2026 00:31:45 +0530"
    },
    {
        "title": "Hyderabad and Cyberabad traffic police book over 900 drunk driving cases in special drives",
        "content": "Here's the summary in 3 bullet points:\n\n*   Traffic police in Hyderabad and Cyberabad conducted special enforcement drives.\n*   These operations resulted in over 900 drunk driving cases being booked.\n*   The cases specifically targeted individuals driving under the influence of alcohol.",
        "link": "https://www.thehindu.com/news/national/telangana/hyderabad-and-cyberabad-traffic-police-book-over-900-drunk-driving-cases-in-special-drives/article70607790.ece",
        "date": "Tue, 10 Feb 2026 00:24:06 +0530"
    },
    {
        "title": "TMC welcomes Supreme Court intervention in SIR exercise, calls it big victory for West Bengal",
        "content": "The Trinamool Congress (TMC) has welcomed the Supreme Court's intervention concerning the 'SIR exercise'.\n*   The party views this intervention as a \"big victory.\"\n*   They assert that this outcome is highly beneficial for West Bengal.",
        "link": "https://www.thehindu.com/news/national/west-bengal/tmc-welcomes-supreme-court-intervention-in-sir-exercise-calls-it-big-victory-for-west-bengal/article70612379.ece",
        "date": "Tue, 10 Feb 2026 00:06:46 +0530"
    },
    {
        "title": "Workers, employers found Labour Codes credible, forward-looking: government report",
        "content": "A government report indicates a positive reception to the Labour Codes.\n*   Both workers and employers view the Labour Codes as credible.\n*   These groups also consider the Labour Codes to be forward-looking.",
        "link": "https://www.thehindu.com/news/national/workers-employers-found-labour-codes-credible-forward-looking-government-report/article70612036.ece",
        "date": "Mon, 09 Feb 2026 23:13:13 +0530"
    }
]