[
    {
        "title": "VB-G RAM G: when a policy shift meets rural realities",
        "content": "The headline introduces a specific policy or program, identified as 'VB-G RAM G,' which represents a significant shift in existing policy.\n*   It highlights the complexities and challenges encountered as this new policy is implemented in rural settings.\n*   The core theme explores the potential disconnect or impact when a theoretical policy change confronts the practical, often unique, conditions of rural life.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/vb-g-ram-g-when-a-policy-shift-meets-rural-realities/article70624961.ece",
        "date": "Fri, 13 Feb 2026 06:38:20 +0530"
    },
    {
        "title": "Southern Railway installs digital display boards but without real time data of arrival of suburban trains",
        "content": "Southern Railway has installed new digital display boards.\n*   These boards are intended to provide information for suburban trains.\n*   Crucially, they do not display real-time data regarding train arrivals.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/southern-railway-installs-digital-display-boards-but-without-real-time-data-of-arrival-of-suburban-trains/article70595933.ece",
        "date": "Fri, 13 Feb 2026 04:23:36 +0530"
    },
    {
        "title": "TVK functionary among 52 persons booked in Vandavasi for obstruction of traffic movement",
        "content": "Here are 3 bullet points summarizing the headline:\n\n*   52 people were booked in Vandavasi for obstructing traffic movement.\n*   Among those charged was a functionary from the TVK organization.\n*   The booking was a result of their involvement in hindering vehicle flow.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/tvk-functionary-among-52-persons-booked-in-vandavasi-for-obstruction-of-traffic-movement/article70624615.ece",
        "date": "Fri, 13 Feb 2026 07:36:47 +0530"
    },
    {
        "title": "Politicians misuse of social media, need to act in such cases: J&K Minister Sakina Itoo",
        "content": "Here's the summary in 3 bullet points:\n\n*   J&K Minister Sakina Itoo has highlighted the misuse of social media platforms by politicians.\n*   She emphasized the need for action to be taken in response to such cases.\n*   Her statement calls for greater accountability and intervention regarding politicians' online conduct.",
        "link": "https://www.thehindu.com/news/national/jammu-and-kashmir/politicians-misuse-of-social-media-needto-act-in-such-cases-jk-minister-sakina-itoo/article70625089.ece",
        "date": "Fri, 13 Feb 2026 04:16:15 +0530"
    },
    {
        "title": "Minister’s adverse remarks in Rajasthan Assembly on right to health spark controversy",
        "content": "Here's the summary in 3 bullet points:\n\n*   A Minister in the Rajasthan Assembly made \"adverse remarks\" during a session.\n*   These remarks specifically concerned the **'right to health'** of citizens.\n*   The Minister's statements have subsequently sparked a significant **controversy** in the state.",
        "link": "https://www.thehindu.com/news/national/rajasthan/ministers-adverse-remarks-in-rajasthan-assembly-on-right-to-health-spark-controversy/article70624788.ece",
        "date": "Fri, 13 Feb 2026 07:59:13 +0530"
    },
    {
        "title": "Orissa High Court directs State Government to tally Puri Jagannath temple’s jewellery inventoried in 1978",
        "content": "The Orissa High Court has issued a directive to the State Government.\n*   The government is instructed to tally the current jewellery of the Puri Jagannath temple.\n*   This tally must be compared against the temple's jewellery inventory recorded in 1978.",
        "link": "https://www.thehindu.com/news/national/odisha/orissa-high-court-directs-state-government-to-tally-puri-jagannath-temples-jewellery-inventoried-in-1978/article70624993.ece",
        "date": "Fri, 13 Feb 2026 07:48:58 +0530"
    },
    {
        "title": "Over 73% of MoUs converted into investments in T.N., says Stalin",
        "content": "Over 73% of Memorandums of Understanding (MoUs) signed in Tamil Nadu have successfully transitioned into actual investments.\n*   This high conversion rate was announced by Chief Minister Stalin.\n*   The statistic indicates the state's effectiveness in materializing investment pledges into on-ground projects.",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/over-73-of-mous-converted-into-investments-in-tn-says-stalin/article70624492.ece",
        "date": "Fri, 13 Feb 2026 02:39:15 +0530"
    },
    {
        "title": "Ophthalmologist gets award for community eye care",
        "content": "An ophthalmologist has been honored with an award.\n*   The recognition is for their significant contributions to community eye care.\n*   This highlights their dedication to providing vision services to the public.",
        "link": "https://www.thehindu.com/news/cities/chennai/ophthalmologist-gets-award-for-community-eye-care/article70625529.ece",
        "date": "Fri, 13 Feb 2026 01:03:07 +0530"
    },
    {
        "title": "Giving 2.20 lakh digital title deeds in unrecognised habitations in two years is a record for Karnataka, says Revenue Minister",
        "content": "Karnataka has issued 2.20 lakh digital title deeds.\n*   These deeds were specifically distributed in unrecognised habitations over a two-year period.\n*   The Revenue Minister has declared this achievement a new record for the state.",
        "link": "https://www.thehindu.com/news/national/karnataka/giving-220-lakh-digital-title-deeds-in-unrecognised-habitations-in-two-years-is-a-record-for-karnataka-says-revenue-minister/article70624903.ece",
        "date": "Fri, 13 Feb 2026 00:47:35 +0530"
    },
    {
        "title": "Karnataka High Court directs State government to set up Municipal Trust Property Management System to protect public properties",
        "content": "The Karnataka High Court has issued a directive to the State government.\n*   The government is mandated to establish a Municipal Trust Property Management System.\n*   The primary purpose of this system is to safeguard public properties.",
        "link": "https://www.thehindu.com/news/national/karnataka/karnataka-high-court-directs-state-government-to-set-up-municipal-trust-property-management-system-to-protect-public-properties/article70624402.ece",
        "date": "Fri, 13 Feb 2026 00:46:16 +0530"
    }
]