[
    {
        "title": "Kerala veers from impressive social gains to mounting fiscal strain",
        "content": "Kerala has a history of achieving impressive social gains.\n*   The state is now experiencing mounting fiscal (financial) strain.\n*   This marks a significant shift from its previous positive social trajectory towards financial challenges.",
        "link": "https://www.thehindu.com/news/national/kerala/kerala-veers-from-impressive-social-gains-to-mounting-fiscal-strain/article70483377.ece",
        "date": "Wed, 25 Feb 2026 15:54:38 +0530"
    },
    {
        "title": "Odisha govt. clears investment proposals for 10 projects worth ₹44,241 crore",
        "content": "The Odisha government has approved new investment proposals.\n*   These approvals cover a total of 10 projects.\n*   The combined value of these projects amounts to ₹44,241 crore.",
        "link": "https://www.thehindu.com/news/national/odisha/odisha-govt-clears-investment-proposals-for-10-projects-worth-44241-crore/article70677093.ece",
        "date": "Thu, 26 Feb 2026 08:50:56 +0530"
    },
    {
        "title": "AI Summit protest: Delhi court extends police custody of five Youth Congress members by four days",
        "content": "Police custody for five Youth Congress members has been extended.\n*   A Delhi court ordered this extension for an additional four days.\n*   The members were initially taken into custody following a protest at an AI Summit.",
        "link": "https://www.thehindu.com/news/cities/Delhi/ai-summit-protest-delhi-court-extends-police-custody-of-five-youth-congress-members-by-four-days/article70676097.ece",
        "date": "Thu, 26 Feb 2026 08:07:27 +0530"
    },
    {
        "title": "Dream of Karnataka govt. jobs brings youth in droves to Dharwad’s coaching centres and study halls",
        "content": "The dream of securing government jobs in Karnataka is a major draw for youth.\n*   This aspiration is leading a large influx of young people to Dharwad.\n*   They are congregating there to enroll in coaching centres and utilize study halls for job preparation.",
        "link": "https://www.thehindu.com/news/national/karnataka/dream-of-karnataka-govt-jobs-brings-youth-in-droves-to-dharwads-coaching-centres-and-study-halls/article70676230.ece",
        "date": "Wed, 25 Feb 2026 23:09:59 +0530"
    },
    {
        "title": "Govt. mandates sale of 20% ethanol-blended petrol with minimum RON 95 nationwide from April 1",
        "content": "The government has mandated the sale of petrol blended with 20% ethanol (E20).\n*   This specific petrol blend must have a minimum Research Octane Number (RON) of 95.\n*   The directive for nationwide implementation will come into effect from April 1.",
        "link": "https://www.thehindu.com/news/national/govt-mandates-sale-of-20-ethanol-blended-petrol-april-1-2026/article70678079.ece",
        "date": "Thu, 26 Feb 2026 07:26:39 +0530"
    },
    {
        "title": "AI Summit protest: Dramatic standoff between Delhi and Shimla police ends after 24 hours",
        "content": "An AI Summit protest sparked an incident involving police.\n*   A dramatic standoff occurred between Delhi and Shimla police forces.\n*   The 24-hour confrontation between the two police departments has now ended.",
        "link": "https://www.thehindu.com/news/national/ai-summit-protest-delhi-shimla-police-drama-enters-wee-hours-after-youth-cong-activists-arrest/article70678063.ece",
        "date": "Thu, 26 Feb 2026 07:40:34 +0530"
    },
    {
        "title": "Income Tax department conducts searches at lone BSP MLA house, U.P. Minister questions move",
        "content": "Here's the summary in 3 bullet points:\n\n*   The Income Tax department conducted searches at the residence of Uttar Pradesh's lone Bahujan Samaj Party (BSP) MLA.\n*   The MLA is notably the sole representative of the BSP in the Uttar Pradesh assembly, making the targeting significant.\n*   An Uttar Pradesh Minister publicly questioned the move, implying potential political motivations behind the search.",
        "link": "https://www.thehindu.com/news/national/uttar-pradesh/income-tax-department-conducts-searches-at-lone-bsp-mla-house-up-minister-questions-move/article70676412.ece",
        "date": "Thu, 26 Feb 2026 01:54:09 +0530"
    },
    {
        "title": "Two-child norm for panchayat, local body elections scrapped in Rajasthan after three decades",
        "content": "Rajasthan has scrapped the two-child norm for candidates contesting panchayat and local body elections.\n*   This particular norm had been in place in the state for three decades.\n*   Its removal means individuals with more than two children are now eligible to contest these local elections.",
        "link": "https://www.thehindu.com/news/national/rajasthan/two-child-norm-for-panchayat-local-body-elections-scrapped-in-rajasthan-after-three-decades/article70676063.ece",
        "date": "Thu, 26 Feb 2026 00:26:11 +0530"
    },
    {
        "title": "NCERT apologises, says distribution of book with section on ‘corruption’ in judiciary stopped",
        "content": "NCERT has issued an apology regarding one of its books.\n*   The organization has stopped the distribution of this particular book.\n*   The book included a controversial section that discussed 'corruption' in the judiciary.",
        "link": "https://www.thehindu.com/news/national/ncert-apologises-says-distribution-of-book-with-section-on-corruption-in-judiciary-stopped/article70677099.ece",
        "date": "Thu, 26 Feb 2026 00:52:04 +0530"
    },
    {
        "title": "A.P. shines with 23 medals at India Skills South Regionals",
        "content": "Andhra Pradesh (A.P.) demonstrated a strong performance.\n*   The state secured an impressive total of 23 medals.\n*   This achievement took place at the India Skills South Regionals competition.",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/ap-shines-with-23-medals-at-india-skills-south-regionals/article70676148.ece",
        "date": "Thu, 26 Feb 2026 00:45:08 +0530"
    }
]